{
    "sites": [
      {
        "name": "Place de la Bourse",
        "type": "Square",
        "description": "One of Bordeaux's most iconic landmarks, this elegant 18th-century square represents the city's prosperity during the Age of Enlightenment. Its masterpiece is the Miroir d'Eau (Water Mirror), the world's largest reflecting pool that creates stunning mirror images of the surrounding architecture.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "The Water Mirror is most spectacular at sunset. In summer, children play in the mist cycles. Winter evenings offer beautiful reflections with fewer crowds.",
        "booking_tips": "No booking required. Visit during the misting cycles (every 15 minutes) for the best experience.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 44.8418,
        "longitude": -0.5695
      },
      {
        "name": "La Cité du Vin",
        "type": "Museum",
        "description": "This modern, iconic museum is dedicated to the universal culture of wine. Its striking architecture resembles wine swirling in a glass. Inside, interactive exhibits explore the history and culture of wine throughout civilizations. The experience concludes with a wine tasting on the panoramic 8th-floor Belvedere.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Expensive",
        "seasonal_notes": "Less crowded on weekdays. Special exhibitions change seasonally. Summer brings more tourists.",
        "booking_tips": "Book tickets online to avoid queues. The admission includes one glass of wine at the Belvedere with stunning city views.",
        "ratings": {
          "cost_estimate": 22,
          "suggested_duration_hours": 3,
          "cultural_significance": 5
        },
        "latitude": 44.8597,
        "longitude": -0.5526
      },
      {
        "name": "Bordeaux Cathedral",
        "type": "Cathedral",
        "description": "Officially known as Cathédrale Saint-André de Bordeaux, this Gothic cathedral dates back to the 11th century. It features impressive flying buttresses and the 15th-century Tour Pey-Berland bell tower. The cathedral was a stop on the pilgrimage route to Santiago de Compostela and hosted royal weddings.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "The cathedral is less crowded in the early morning. The adjacent Pey-Berland Tower can be climbed for panoramic views (paid separately).",
        "booking_tips": "No booking required for the cathedral. For the tower, tickets can be purchased on-site.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 44.8377,
        "longitude": -0.5771
      },
      {
        "name": "Rue Sainte-Catherine",
        "type": "Street",
        "description": "Europe's longest pedestrian shopping street stretches for 1.2 kilometers through the heart of Bordeaux. Lined with both international brands and local boutiques, cafés, and pastry shops, it connects Place de la Comédie to Place de la Victoire.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Extremely busy during summer and holiday seasons. Winter brings beautiful Christmas decorations and markets.",
        "booking_tips": "No booking required. The side streets offer charming cafés with less tourist traffic.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 3
        },
        "latitude": 44.8412,
        "longitude": -0.5734
      },
      {
        "name": "Grand Théâtre de Bordeaux",
        "type": "Opera House",
        "description": "This magnificent neoclassical opera house, built in 1780, features a stunning colonnade of Corinthian columns and statues representing the nine Muses and three Greek goddesses. Its opulent interior with a blue and gold auditorium is considered one of the most beautiful in Europe.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Guided tours available most days. Check the performance schedule if you wish to attend a show.",
        "booking_tips": "Book guided tours in advance. For performances, reserve weeks ahead, especially for popular operas and ballets.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 44.8433,
        "longitude": -0.5738
      },
      {
        "name": "La Grosse Cloche",
        "type": "Historical Monument",
        "description": "This medieval bell tower and gateway is one of the oldest belfries in France and a symbol of Bordeaux. Built in the 15th century as part of the old city hall, it features a large bell weighing 7,800 kg and an astronomical clock from 1759.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "The interior can be visited on specific days with guided tours. Good lighting for photos in the morning.",
        "booking_tips": "The exterior can be viewed anytime. Check the Bordeaux tourism office for interior tour schedules.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4
        },
        "latitude": 44.8366,
        "longitude": -0.5714
      },
      {
        "name": "Musée d'Aquitaine",
        "type": "Museum",
        "description": "This comprehensive museum traces the history of Bordeaux and the Aquitaine region from prehistoric times to the present day. Highlights include Gallo-Roman artifacts, medieval sculptures, 18th-century maritime trade exhibits, and displays on the city's controversial involvement in the slave trade.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Temporary exhibitions change seasonally. Less crowded on weekday afternoons.",
        "booking_tips": "No advance booking required. Free on the first Sunday of each month.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 44.8366,
        "longitude": -0.5753
      },
      {
        "name": "Darwin Ecosystem",
        "type": "Cultural Space",
        "description": "This former military barracks has been transformed into an eco-friendly urban space dedicated to sustainable entrepreneurship, alternative culture, and organic living. It houses a coworking space, skate park, urban farm, restaurants, and France's largest organic grocery store.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Busiest on weekends when the food market and special events take place. The outdoor areas are weather-dependent.",
        "booking_tips": "No booking required to visit. Restaurant reservations recommended for weekend dining.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 3
        },
        "latitude": 44.8492,
        "longitude": -0.5604
      },
      {
        "name": "Pont de Pierre",
        "type": "Bridge",
        "description": "Bordeaux's oldest bridge, built under Napoleon's orders between 1810 and 1822, spans the Garonne River with 17 arches (reportedly corresponding to the number of letters in 'Napoleon Bonaparte'). It offers beautiful views of the riverfront and the Place de la Bourse.",
        "indoor": false,
        "best_time": "Sunset",
        "price_range": "Free",
        "seasonal_notes": "Beautiful at sunset when the stone takes on a golden hue. Currently pedestrian and bicycle access only.",
        "booking_tips": "No booking required. Great photo opportunities of the city skyline from the middle of the bridge.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4
        },
        "latitude": 44.8387,
        "longitude": -0.5659
      },
      {
        "name": "Jardin Public",
        "type": "Park",
        "description": "This 18th-century English-style garden offers a peaceful retreat in the heart of the city. With its ornamental lake, centuries-old trees, children's playground, and botanical garden, it's a favorite relaxation spot for locals and visitors alike.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Especially beautiful in spring when flowers bloom and in autumn for fall colors. The Natural History Museum is located at the park's edge.",
        "booking_tips": "No booking required. Bring a picnic to enjoy on the lawns.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3
        },
        "latitude": 44.8477,
        "longitude": -0.5786
      },
      {
        "name": "CAPC Musée d'Art Contemporain",
        "type": "Museum",
        "description": "Housed in a former colonial warehouse, this contemporary art museum features rotating exhibitions by international artists as well as a permanent collection of over 1,300 works from the 1960s to the present day. The massive central space with its vaulted ceilings hosts large-scale installations.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Exhibitions change regularly. The rooftop offers views of the port area.",
        "booking_tips": "No advance booking required. Free on the first Sunday of each month.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 44.8497,
        "longitude": -0.5719
      },
      {
        "name": "Basilique Saint-Michel",
        "type": "Basilica",
        "description": "This Gothic basilica with its separate 114-meter bell tower is a UNESCO World Heritage site. Built between the 14th and 16th centuries, it features stunning stained glass windows and a rich interior. The surrounding square hosts a popular market several days a week.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Visit on market days (Monday, Thursday, Saturday) to experience the vibrant local atmosphere. The bell tower can be climbed for panoramic views (paid separately).",
        "booking_tips": "No booking required for the basilica. The bell tower requires tickets purchased on-site.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 44.8327,
        "longitude": -0.5662
      },
      {
        "name": "Bordeaux Wine School",
        "type": "Education",
        "description": "Located in the heart of Bordeaux, this institution offers wine workshops and tasting courses for everyone from casual enthusiasts to professionals. Learn about wine classification, regional terroirs, and proper tasting techniques from expert instructors.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Expensive",
        "seasonal_notes": "Classes available year-round with special harvest-related sessions in autumn. Book well in advance in summer.",
        "booking_tips": "Reserve classes online weeks in advance. Sessions available in multiple languages.",
        "ratings": {
          "cost_estimate": 45,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 44.8411,
        "longitude": -0.5739
      },
      {
        "name": "Les Quais",
        "type": "Riverfront",
        "description": "Bordeaux's revitalized riverfront stretches for 4.5 km along the Garonne, offering walking and cycling paths, gardens, playgrounds, and cafés. Once an industrial port area, it's now the city's favorite promenade and gathering place for locals and visitors.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Popular for evening strolls year-round. Summer brings outdoor activities and pop-up bars. Sunday afternoons are especially lively.",
        "booking_tips": "No booking required. Bike rentals available at various points along the quays.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 44.8378,
        "longitude": -0.5683
      },
      {
        "name": "Marché des Capucins",
        "type": "Market",
        "description": "Known as 'the belly of Bordeaux,' this covered market is the city's gastronomic heart. Local vendors sell fresh produce, meats, cheeses, and seafood, while small eateries offer oysters, wine, and regional specialties in a bustling atmosphere.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Open Tuesday to Sunday mornings, with Sunday being the busiest and most atmospheric day. Closed Mondays.",
        "booking_tips": "No booking required. Arrive before noon for the best selection and to secure a table at the popular food stalls.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 44.8312,
        "longitude": -0.5701
      },
      {
        "name": "Base Sous-Marine",
        "type": "Cultural Space",
        "description": "This massive concrete submarine base, built by the Germans during World War II, has been transformed into a unique cultural venue. The brutalist structure now hosts contemporary art exhibitions, digital installations, and performances in its cavernous spaces.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "The constant temperature makes it a good indoor option in extreme weather. Special sound and light installations often held in evening hours.",
        "booking_tips": "Check the current exhibition schedule online. Some special events require advance booking.",
        "ratings": {
          "cost_estimate": 10,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 44.8653,
        "longitude": -0.5508
      },
      {
        "name": "Bordeaux Wine Museum (Musée du Vin et du Négoce)",
        "type": "Museum",
        "description": "Located in the historic wine merchants' district, this small museum explores the history of Bordeaux's wine trade from the Middle Ages to the present. Housed in the ancient cellars of a wine merchant's house, it features historical artifacts, interactive displays, and concludes with a wine tasting.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round. Less crowded than La Cité du Vin and offers a more historical perspective.",
        "booking_tips": "No advance booking required. The entrance fee includes a tasting of two wines.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 44.8451,
        "longitude": -0.5714
      },
      {
        "name": "Place des Quinconces",
        "type": "Square",
        "description": "One of Europe's largest city squares, featuring the impressive Monument aux Girondins with its towering column and dramatic fountains. The square hosts festivals, markets, and fairs throughout the year, including a large fun fair twice annually.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Check the event calendar for special activities. The fun fair typically runs in October-November and March-April.",
        "booking_tips": "No booking required. Tram lines B and C stop at Quinconces for easy access.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 44.8458,
        "longitude": -0.5746
      },
      {
        "name": "Porte Cailhau",
        "type": "Historical Monument",
        "description": "This ornate 15th-century city gate was built to commemorate King Charles VIII's victory at Fornovo. Standing 35 meters high, it once served as the main entrance to the city from the river port. Today, visitors can climb its tower for views of the old town and river.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "The interior museum has limited hours. The exterior is well-lit in the evening for photographs.",
        "booking_tips": "No advance booking required. Small museum inside explains medieval defensive architecture.",
        "ratings": {
          "cost_estimate": 5,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4
        },
        "latitude": 44.8384,
        "longitude": -0.5695
      },
      {
        "name": "Chartrons District",
        "type": "District",
        "description": "Historically home to wine merchants and foreign traders, this elegant neighborhood now combines antique shops, art galleries, trendy boutiques, and excellent dining options. Its charming streets and riverside promenade offer a glimpse into Bordeaux's commercial past.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "The antique shops along Rue Notre-Dame are closed on Mondays. Sunday morning brings a popular market to the riverfront.",
        "booking_tips": "No booking required. The district is perfect for a self-guided walking tour.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 44.8510,
        "longitude": -0.5699
      },
      {
        "name": "Pey-Berland Tower",
        "type": "Monument",
        "description": "This Gothic bell tower, separate from Bordeaux Cathedral, offers panoramic views of the city from its 229-step climb. Built in the 15th century, it houses the 19th-century bell 'La Cloche Pey-Berland' which weighs over 11 tons.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Climb early to avoid both heat and crowds. Closed in strong winds or bad weather.",
        "booking_tips": "Tickets purchased on-site. Combined tickets with other monuments available.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 1,
          "cultural_significance": 3
        },
        "latitude": 44.8377,
        "longitude": -0.5766
      },
      {
        "name": "Musée des Beaux-Arts de Bordeaux",
        "type": "Museum",
        "description": "Housed in a stunning neoclassical building, this museum features an extensive collection of paintings, sculptures, and decorative arts spanning from the Renaissance to the modern era. It also hosts temporary exhibitions showcasing both local and international artists.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Weekday afternoons are ideal for a quieter visit. Special exhibitions often draw art enthusiasts during the summer.",
        "booking_tips": "Tickets can be purchased online or at the museum's entrance. Check for combined ticket offers with other Bordeaux attractions.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 44.8380,
        "longitude": -0.5765
      },
      {
        "name": "Cap Sciences Bordeaux",
        "type": "Museum",
        "description": "An interactive science museum dedicated to engaging visitors with hands-on exhibits and multimedia presentations that explore scientific and technological advancements. Located in the Bassins à Flot district, it offers a unique look at contemporary science.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Less crowded during weekdays. Special workshops and temporary exhibitions are frequently held.",
        "booking_tips": "Tickets are available online. Group discounts and family packages may be offered.",
        "ratings": {
          "cost_estimate": 10,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 44.8400,
        "longitude": -0.5740
      }
    ]
  }
  