{
    "Spring": {
        "activities": [
            {
                "name": "Magnolia Blooms at Jardin Public",
                "type": "Park",
                "description": "Experience the stunning magnolia trees in full bloom at Jardin Public, Bordeaux's historic central park. The garden features beautiful springtime displays, charming walking paths, and a serene lake.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is perfect for enjoying the magnolias and camellias, which typically bloom from March to April.",
                "booking_tips": "No booking required. Visit early morning for peaceful walks and great photography opportunities."
            },
            {
                "name": "Visit to CAPC Museum of Contemporary Art",
                "type": "Museum",
                "description": "Explore contemporary art exhibitions housed in a former colonial warehouse at the CAPC Museum, one of France's most important contemporary art venues.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring showers make indoor cultural activities a good option, and the museum often features new exhibitions in spring.",
                "booking_tips": "Purchase tickets online to avoid lines and check their website for special exhibitions."
            },
            {
                "name": "Bordeaux Wine Festival",
                "type": "Cultural Event",
                "description": "Participate in the Bordeaux Wine Festival, a biennial celebration featuring wine tastings, vineyard tours, and cultural exhibitions along the riverfront.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "This major event happens in even-numbered years and celebrates the region's prestigious wine heritage.",
                "booking_tips": "Buy a tasting pass in advance and plan your route among the pavilions to maximize your experience."
            },
            {
                "name": "Picnic at Parc Bordelais",
                "type": "Park",
                "description": "Enjoy a leisurely picnic in Parc Bordelais, the city's largest park, featuring beautiful gardens, a duck pond, and plenty of green space.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The park comes alive in spring with blooming flowers and pleasant temperatures perfect for outdoor dining.",
                "booking_tips": "Visit local markets like Marché des Capucins beforehand to gather fresh local ingredients for your picnic."
            },
            {
                "name": "Rooftop Wine Tasting at Le Coq d'Argent",
                "type": "Bar",
                "description": "Sip local wines while enjoying panoramic views of Bordeaux at Le Coq d'Argent, a stylish rooftop bar that offers an excellent selection of regional vintages.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Spring evenings offer comfortable temperatures and beautiful sunsets over the city.",
                "booking_tips": "Make reservations in advance, especially for weekend evenings."
            },
            {
                "name": "Printemps des Vins de Blaye",
                "type": "Festival",
                "description": "Visit the Spring Wine Festival in Blaye, featuring tastings from over 80 winemakers inside the historic UNESCO-listed citadel.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "This April festival celebrates the new vintage releases with a festive atmosphere.",
                "booking_tips": "Purchase your tasting pass online before the event to skip entrance queues."
            },
            {
                "name": "Explore Saint-Émilion",
                "type": "Excursion",
                "description": "Stroll through the charming medieval village of Saint-Émilion, a UNESCO World Heritage site known for its historic monuments and renowned vineyards.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring weather is ideal for exploring the cobblestone streets and surrounding vineyards as they turn green.",
                "booking_tips": "Wear comfortable shoes for walking on cobblestones and book a guided tour to access underground monuments."
            },
            {
                "name": "Garonne River Cruise",
                "type": "Boat Tour",
                "description": "Enjoy a scenic cruise along the Garonne River, taking in Bordeaux's UNESCO-listed waterfront and historic bridges.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Springtime offers pleasant weather and beautiful light for river cruises with less tourism than summer months.",
                "booking_tips": "Book tickets a day or two in advance and consider sunset cruises for spectacular views."
            },
            {
                "name": "Spring Markets at Quai des Chartrons",
                "type": "Market",
                "description": "Explore the Sunday market along Quai des Chartrons, offering fresh produce, artisanal goods, and seasonal specialties while enjoying river views.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature seasonal specialties like asparagus, strawberries, and early cherries from the region.",
                "booking_tips": "Arrive before 10am for the best selection and a more relaxed shopping experience."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Darwin Ecosystem Beach",
                "type": "Urban Beach",
                "description": "Enjoy the urban beach at Darwin Ecosystem, a creative hub in a former military barracks, featuring sandy areas, refreshments, and a relaxed atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This unique summer spot provides a beach experience without leaving the city, perfect for hot days.",
                "booking_tips": "Arrive early on weekends to secure a good spot, and explore the street art while there."
            },
            {
                "name": "Bastille Day Celebrations",
                "type": "Festival",
                "description": "Celebrate France's National Day on July 14th with fireworks over the Garonne River, concerts, and festivities throughout Bordeaux.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Bastille Day is a highlight of the summer, with patriotic celebrations and spectacular fireworks over the riverfront.",
                "booking_tips": "Find a spot along the riverbanks early in the evening and bring a picnic to enjoy while waiting for the fireworks."
            },
            {
                "name": "Open-Air Cinema at Parc de Peixotto",
                "type": "Cinema",
                "description": "Enjoy films under the stars in Talence's Parc de Peixotto during summer evenings, featuring a mix of classics and new releases.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Warm summer evenings are perfect for outdoor cinema in the park's beautiful setting.",
                "booking_tips": "Bring a blanket or portable chair and arrive at least 30 minutes before showtime to secure a good viewing spot."
            },
            {
                "name": "Visit to Château de La Brède",
                "type": "Historical Site",
                "description": "Explore the beautiful château and gardens of La Brède, the birthplace of philosopher Montesquieu, located just outside Bordeaux.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is the best time to see the château's gardens in full bloom, with guided tours available of both the grounds and interior.",
                "booking_tips": "Check their website for opening hours as they vary seasonally, and consider booking a guided tour in advance."
            },
            {
                "name": "Arcachon Bay Day Trip",
                "type": "Beach Excursion",
                "description": "Escape to Arcachon Bay for swimming, oyster tasting, and climbing Europe's largest sand dune, Dune du Pilat.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is ideal for enjoying the Atlantic beaches and seafood, with water warm enough for swimming.",
                "booking_tips": "Take an early train to maximize your day and bring comfortable shoes for climbing the dune."
            },
            {
                "name": "Cycling Through Vineyards",
                "type": "Outdoor Activity",
                "description": "Rent a bike and cycle through the vineyards of Médoc or Entre-Deux-Mers, stopping at châteaux for wine tastings along the way.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer mornings offer pleasant temperatures for cycling before the afternoon heat, with vineyards in full green foliage.",
                "booking_tips": "Rent bikes in Bordeaux city center or join an organized tour that includes château visits and tastings."
            },
            {
                "name": "Dîner en Blanc",
                "type": "Social Event",
                "description": "Participate in the famous all-white dinner party, a flash mob event where participants dress in white and dine in a surprise public location.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This elegant summer tradition happens in many cities including Bordeaux, usually in June or July.",
                "booking_tips": "Registration is required well in advance through local organizers or by invitation from previous attendees."
            },
            {
                "name": "Bordeaux Underwater Archaeology Museum",
                "type": "Museum",
                "description": "Discover the fascinating Underwater Archaeology Museum (DRASSM), showcasing artifacts recovered from shipwrecks in the region.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "This cool indoor venue offers a refreshing break from summer heat while providing a unique cultural experience.",
                "booking_tips": "Check opening hours before visiting as they can vary seasonally."
            },
            {
                "name": "Sunset Dinner Cruise on the Garonne",
                "type": "Boat Tour",
                "description": "Enjoy a gourmet dinner aboard a Garonne River cruise, with stunning views of Bordeaux's 18th-century façades illuminated at sunset.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the best weather for evening cruises, with long daylight hours and warm temperatures.",
                "booking_tips": "Book well in advance and request a window table for optimal views."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Explore the Cité du Vin",
                "type": "Museum",
                "description": "Visit Bordeaux's iconic wine museum, Cité du Vin, an immersive experience featuring exhibitions on wine culture from around the world.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, making it a perfect time to learn about winemaking as the actual process happens in surrounding vineyards.",
                "booking_tips": "Purchase tickets online to avoid lines and include the rooftop wine tasting with your admission."
            },
            {
                "name": "Harvest Festival at Château Lanessan",
                "type": "Cultural Event",
                "description": "Experience a traditional grape harvest celebration at Château Lanessan, featuring vineyard tours, grape stomping, and tastings of new vintages.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is grape harvest season (vendange), offering a unique opportunity to see wine production firsthand.",
                "booking_tips": "Book your spot in advance as harvest festivals are popular and have limited capacity."
            },
            {
                "name": "Truffle Hunting in Périgord",
                "type": "Food & Drink",
                "description": "Join a guided truffle hunting expedition in nearby Périgord, followed by a truffle-focused meal showcasing this autumn delicacy.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn marks the beginning of black truffle season in the region, a culinary highlight.",
                "booking_tips": "Reserve your truffle hunting experience at least a month in advance as spots fill quickly during peak season."
            },
            {
                "name": "Visit the Grand Théâtre de Bordeaux",
                "type": "Theater",
                "description": "Tour the magnificent Grand Théâtre, an 18th-century neoclassical masterpiece, and perhaps attend an opera or ballet performance.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn marks the beginning of the new cultural season with premieres and special performances.",
                "booking_tips": "Book a guided tour in the morning or secure tickets for an evening performance well in advance."
            },
            {
                "name": "Autumn Walk in Jardin Botanique",
                "type": "Park",
                "description": "Take a leisurely stroll through the Botanical Gardens of Bordeaux, enjoying the fall foliage and diverse plant collections.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The gardens are particularly beautiful in autumn with vibrant fall colors and fewer crowds.",
                "booking_tips": "Visit in the golden hour before sunset for the most beautiful light for photography."
            },
            {
                "name": "Visit to the Museum of Bordeaux Wine and Trade",
                "type": "Museum",
                "description": "Explore the history of Bordeaux's wine trade in this specialized museum housed in a historic merchant's home near the riverfront.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler days make it perfect for learning about the wine heritage that shaped the region.",
                "booking_tips": "Consider the combined ticket with other city museums for better value."
            },
            {
                "name": "Mushroom Foraging in Médoc Forests",
                "type": "Outdoor Activity",
                "description": "Join expert guides for a mushroom foraging expedition in the forests of Médoc, learning to identify edible varieties like cèpes and chanterelles.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn rains create perfect conditions for wild mushrooms, a seasonal delicacy in the region.",
                "booking_tips": "Book with reputable guides who know safe foraging spots and can identify edible species."
            },
            {
                "name": "Explore the Covered Market of Les Chartrons",
                "type": "Shopping",
                "description": "Wander through this renovated market hall in the historic Chartrons district, featuring artisanal food shops, wine merchants, and cafés.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The covered market offers a cozy retreat during autumn's cooler days, with seasonal products like game, mushrooms, and new wines.",
                "booking_tips": "Visit on weekday afternoons for a more relaxed experience with fewer crowds."
            },
            {
                "name": "Canelé Making Workshop",
                "type": "Workshop",
                "description": "Learn to make Bordeaux's signature pastry, the canelé, in a hands-on cooking class, mastering the techniques behind this rum and vanilla delicacy.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's cooler weather is perfect for baking, and you'll take home skills to recreate these treats.",
                "booking_tips": "Book early as cooking classes are popular, and bring a container to take home your creations."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Ice Skating at Place Pey-Berland",
                "type": "Sport",
                "description": "Enjoy ice skating at the outdoor rink set up in Place Pey-Berland, with views of Bordeaux Cathedral as a majestic backdrop.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is the only time to enjoy this seasonal activity, typically running from December through January.",
                "booking_tips": "Skate rentals are available on-site; weekday afternoons are less crowded than weekends."
            },
            {
                "name": "Visit to the Christmas Markets",
                "type": "Market",
                "description": "Explore Bordeaux's charming Christmas market along Allées de Tourny, offering festive decorations, regional crafts, and seasonal treats like mulled wine and roasted chestnuts.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "The market creates a magical winter atmosphere with twinkling lights and festive music throughout December.",
                "booking_tips": "Visit in the evening when the light displays are most impressive, and try the hot spiced wine (vin chaud)."
            },
            {
                "name": "Chamber Music at Grand Théâtre",
                "type": "Concert",
                "description": "Experience a classical music concert in the stunning setting of Bordeaux's Grand Théâtre, one of France's most beautiful theaters.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter's cultural calendar features excellent concerts and performances in this historic venue.",
                "booking_tips": "Purchase tickets well in advance, especially for holiday-themed concerts in December."
            },
            {
                "name": "Visit the Museum of Fine Arts",
                "type": "Museum",
                "description": "Explore Bordeaux's Museum of Fine Arts, housing an impressive collection spanning from Renaissance to 20th century works.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for indoor art appreciation when outdoor activities are limited by weather.",
                "booking_tips": "Free on the first Sunday of each month; otherwise purchase tickets online to skip the queue."
            },
            {
                "name": "Hot Chocolate at Dunes Blanches",
                "type": "Café",
                "description": "Warm up with rich hot chocolate paired with Bordeaux's famous cream puffs at Dunes Blanches, a beloved local patisserie.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Their special winter hot chocolate menu features different flavor combinations throughout the season.",
                "booking_tips": "Expect a wait on weekends; weekday afternoons are more relaxed."
            },
            {
                "name": "Wine Tasting Course at L'École du Vin",
                "type": "Workshop",
                "description": "Participate in a structured wine tasting course at Bordeaux's School of Wine, learning about regional varieties and proper tasting techniques.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is a great time to deepen your wine knowledge while staying warm indoors.",
                "booking_tips": "Book at least a week in advance and specify your experience level when registering."
            },
            {
                "name": "Ballet Performance at Opéra National de Bordeaux",
                "type": "Theater",
                "description": "Enjoy a ballet performance at the Opéra National de Bordeaux, featuring both classic works and contemporary pieces.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "The winter season often includes The Nutcracker and other seasonal favorites.",
                "booking_tips": "Book tickets several weeks in advance, especially for performances during the holiday season."
            },
            {
                "name": "Visit to Basilica of Saint Michael",
                "type": "Historical Site",
                "description": "Explore the Gothic Basilica of Saint Michael with its separate bell tower, enjoying the peaceful winter atmosphere and beautiful stained glass.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter light through the stained glass windows creates a magical atmosphere, especially on sunny afternoons.",
                "booking_tips": "Check opening hours which may be reduced in winter, and time your visit to catch the afternoon light."
            },
            {
                "name": "Garonne River Winter Cruise",
                "type": "Boat Tour",
                "description": "Experience a heated river cruise along the Garonne, offering panoramic views of Bordeaux's UNESCO-listed waterfront illuminated for winter.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter cruises feature special holiday decorations and illuminations throughout December.",
                "booking_tips": "Choose a heated boat option and book in advance, especially during the Christmas season."
            }
        ]
    }
}