{
    "Spring": {
        "activities": [
            {
                "name": "Magnolia Blooms at Jardin Public",
                "type": "Park and Garden Experience",
                "description": "Experience the stunning magnolia trees in full bloom at Jardin Public, Bordeaux's historic central park. The garden features beautiful springtime displays, charming walking paths, and a serene lake. The magnolias typically bloom from March to April, creating a spectacular display of pink and white flowers against the historic backdrop of the 18th-century English-style garden.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is perfect for enjoying the magnolias and camellias, which typically bloom from March to April. The garden also features cherry blossoms and early spring flowers.",
                "booking_tips": "No booking required. Visit early morning for peaceful walks and great photography opportunities. The garden is less crowded on weekday mornings.",
                "location": "Jardin Public, Place du Champ de Mars, 33000 Bordeaux",
                "duration": "1-2 hours",
                "highlights": [
                    "Magnolia and camellia blooms",
                    "Historic 18th-century garden design",
                    "Peaceful walking paths",
                    "Beautiful lake and water features",
                    "Natural History Museum on site"
                ],
                "photography_tips": "Best photography during golden hour (early morning or late afternoon). The magnolias are particularly photogenic against the historic architecture."
            },
            {
                "name": "Visit to CAPC Museum of Contemporary Art",
                "type": "Cultural Museum Experience",
                "description": "Explore contemporary art exhibitions housed in a former colonial warehouse at the CAPC Museum, one of France's most important contemporary art venues. The museum features rotating exhibitions by international artists and a permanent collection of over 1,300 works from the 1960s to the present day. The massive central space with its vaulted ceilings hosts large-scale installations.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "€8",
                "seasonal_notes": "Spring showers make indoor cultural activities a good option, and the museum often features new exhibitions in spring. The museum is particularly interesting during the Bordeaux contemporary art biennial.",
                "booking_tips": "Purchase tickets online to avoid lines and check their website for special exhibitions. Free on the first Sunday of each month.",
                "location": "7 Rue Ferrère, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Contemporary art exhibitions",
                    "Historic warehouse architecture",
                    "Large-scale installations",
                    "Rooftop views of the port area",
                    "International artist showcases"
                ],
                "accessibility": "Fully accessible with elevators and adapted facilities"
            },
            {
                "name": "Bordeaux Wine Festival",
                "type": "Cultural Event and Wine Celebration",
                "description": "Participate in the Bordeaux Wine Festival, a biennial celebration featuring wine tastings, vineyard tours, and cultural exhibitions along the riverfront. This major event celebrates the region's prestigious wine heritage with pavilions representing different wine regions, educational exhibits, and tastings from hundreds of producers.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "€25-50",
                "seasonal_notes": "This major event happens in even-numbered years and celebrates the region's prestigious wine heritage. The festival typically takes place in June.",
                "booking_tips": "Buy a tasting pass in advance and plan your route among the pavilions to maximize your experience. Book accommodation early as the city fills up during the festival.",
                "location": "Quai des Chartrons and Place des Quinconces, 33000 Bordeaux",
                "duration": "Full day",
                "highlights": [
                    "Wine tastings from hundreds of producers",
                    "Educational exhibits on winemaking",
                    "Cultural performances and entertainment",
                    "Riverfront celebrations",
                    "Vineyard tours and workshops"
                ],
                "special_events": "Evening concerts, fireworks, and special wine-pairing dinners"
            },
            {
                "name": "Picnic at Parc Bordelais",
                "type": "Outdoor Recreation and Dining",
                "description": "Enjoy a leisurely picnic in Parc Bordelais, the city's largest park, featuring beautiful gardens, a duck pond, and plenty of green space. The park offers a perfect escape from the city with its extensive lawns, walking paths, and children's playground. Spring brings blooming flowers and pleasant temperatures perfect for outdoor dining.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The park comes alive in spring with blooming flowers and pleasant temperatures perfect for outdoor dining. The park is particularly beautiful during cherry blossom season.",
                "booking_tips": "Visit local markets like Marché des Capucins beforehand to gather fresh local ingredients for your picnic. Bring a blanket and arrive early to secure a good spot.",
                "location": "Rue du Parc, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Extensive lawns and gardens",
                    "Duck pond and water features",
                    "Children's playground",
                    "Walking and cycling paths",
                    "Beautiful spring flowers"
                ],
                "picnic_suggestions": "Local cheeses, fresh bread, seasonal fruits, and a bottle of Bordeaux wine"
            },
            {
                "name": "Rooftop Wine Tasting at Le Coq d'Argent",
                "type": "Wine Experience with City Views",
                "description": "Sip local wines while enjoying panoramic views of Bordeaux at Le Coq d'Argent, a stylish rooftop bar that offers an excellent selection of regional vintages. The venue provides a sophisticated atmosphere for wine tasting with expert sommeliers and stunning city views.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Spring evenings offer comfortable temperatures and beautiful sunsets over the city. The rooftop is particularly pleasant during the golden hour.",
                "booking_tips": "Make reservations in advance, especially for weekend evenings. Request a table with the best city views.",
                "location": "10 Place de la Bourse, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Panoramic city views",
                    "Expert wine tastings",
                    "Regional wine selections",
                    "Sophisticated atmosphere",
                    "Sunset views over Bordeaux"
                ],
                "wine_focus": "Bordeaux reds, whites, and rosés with expert guidance"
            },
            {
                "name": "Printemps des Vins de Blaye",
                "type": "Wine Festival and Cultural Event",
                "description": "Visit the Spring Wine Festival in Blaye, featuring tastings from over 80 winemakers inside the historic UNESCO-listed citadel. This festival celebrates the new vintage releases with a festive atmosphere and offers a unique opportunity to taste wines from the Blaye-Côtes de Bordeaux appellation.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "€15-30",
                "seasonal_notes": "This April festival celebrates the new vintage releases with a festive atmosphere. The citadel provides a stunning historic backdrop for the event.",
                "booking_tips": "Purchase your tasting pass online before the event to skip entrance queues. Consider booking a guided tour of the citadel as well.",
                "location": "Citadelle de Blaye, 33390 Blaye",
                "duration": "Full day",
                "highlights": [
                    "Wine tastings from 80+ producers",
                    "Historic citadel setting",
                    "New vintage releases",
                    "Local food specialties",
                    "Cultural performances"
                ],
                "transportation": "Train from Bordeaux to Blaye (45 minutes)"
            },
            {
                "name": "Explore Saint-Émilion",
                "type": "UNESCO Heritage Site and Wine Village",
                "description": "Stroll through the charming medieval village of Saint-Émilion, a UNESCO World Heritage site known for its historic monuments and renowned vineyards. The village features cobblestone streets, historic churches, and world-famous wine cellars. Spring weather is ideal for exploring the surrounding vineyards as they turn green.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (guided tours extra)",
                "seasonal_notes": "Spring weather is ideal for exploring the cobblestone streets and surrounding vineyards as they turn green. The village is less crowded than in summer.",
                "booking_tips": "Wear comfortable shoes for walking on cobblestones and book a guided tour to access underground monuments. Consider a wine tasting experience.",
                "location": "Saint-Émilion, 33330 Saint-Émilion",
                "duration": "Half day to full day",
                "highlights": [
                    "Medieval village architecture",
                    "Underground monuments and churches",
                    "Wine cellar visits",
                    "Vineyard walks",
                    "Historic monuments"
                ],
                "transportation": "Train from Bordeaux (35 minutes) or guided tour from Bordeaux"
            },
            {
                "name": "Garonne River Cruise",
                "type": "Scenic Boat Tour",
                "description": "Enjoy a scenic cruise along the Garonne River, taking in Bordeaux's UNESCO-listed waterfront and historic bridges. The cruise offers unique perspectives of the city's 18th-century architecture and provides historical commentary about Bordeaux's maritime heritage.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "€15-25",
                "seasonal_notes": "Springtime offers pleasant weather and beautiful light for river cruises with less tourism than summer months. The river is particularly beautiful during spring blooms.",
                "booking_tips": "Book tickets a day or two in advance and consider sunset cruises for spectacular views. Choose a boat with outdoor seating for the best experience.",
                "location": "Various departure points along the Garonne",
                "duration": "1-2 hours",
                "highlights": [
                    "UNESCO-listed waterfront views",
                    "Historic bridge perspectives",
                    "18th-century architecture",
                    "Historical commentary",
                    "Unique city perspectives"
                ],
                "photography_tips": "Best photography from the outdoor deck, especially during golden hour"
            },
            {
                "name": "Spring Markets at Quai des Chartrons",
                "type": "Outdoor Market and Local Experience",
                "description": "Explore the Sunday market along Quai des Chartrons, offering fresh produce, artisanal goods, and seasonal specialties while enjoying river views. The market features local producers, organic products, and a relaxed atmosphere perfect for spring shopping.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature seasonal specialties like asparagus, strawberries, and early cherries from the region. The market is particularly vibrant during spring harvest.",
                "booking_tips": "Arrive before 10am for the best selection and a more relaxed shopping experience. Bring cash and reusable bags.",
                "location": "Quai des Chartrons, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Fresh seasonal produce",
                    "Local artisanal products",
                    "River views and atmosphere",
                    "Organic and specialty foods",
                    "Community atmosphere"
                ],
                "seasonal_products": "Spring asparagus, strawberries, early cherries, and fresh herbs"
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Darwin Ecosystem Beach",
                "type": "Urban Beach and Cultural Experience",
                "description": "Enjoy the urban beach at Darwin Ecosystem, a creative hub in a former military barracks, featuring sandy areas, refreshments, and a relaxed atmosphere. This unique summer spot provides a beach experience without leaving the city, perfect for hot days and creative community gatherings.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This unique summer spot provides a beach experience without leaving the city, perfect for hot days. The venue hosts regular cultural events and markets.",
                "booking_tips": "Arrive early on weekends to secure a good spot, and explore the street art while there. Check their website for special events and markets.",
                "location": "87 Quai des Queyries, 33100 Bordeaux",
                "duration": "3-4 hours",
                "highlights": [
                    "Urban beach atmosphere",
                    "Street art and installations",
                    "Local food and drinks",
                    "Community events",
                    "Creative workshops"
                ],
                "special_events": "Sunday markets, live music, and cultural workshops"
            },
            {
                "name": "Bastille Day Celebrations",
                "type": "National Holiday and Cultural Festival",
                "description": "Celebrate France's National Day on July 14th with fireworks over the Garonne River, concerts, and festivities throughout Bordeaux. The city comes alive with patriotic celebrations, street parties, and spectacular fireworks displays over the riverfront.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Bastille Day is a highlight of the summer, with patriotic celebrations and spectacular fireworks over the riverfront. The city is particularly festive and crowded.",
                "booking_tips": "Find a spot along the riverbanks early in the evening and bring a picnic to enjoy while waiting for the fireworks. Book accommodation well in advance.",
                "location": "Throughout Bordeaux, especially along the Garonne",
                "duration": "Full day and evening",
                "highlights": [
                    "Fireworks over the Garonne",
                    "Street parties and celebrations",
                    "Live music and entertainment",
                    "Patriotic atmosphere",
                    "Community gatherings"
                ],
                "best_viewing_spots": "Place de la Bourse, Quai des Chartrons, and Pont de Pierre"
            },
            {
                "name": "Open-Air Cinema at Parc de Peixotto",
                "type": "Outdoor Cinema and Cultural Experience",
                "description": "Enjoy films under the stars in Talence's Parc de Peixotto during summer evenings, featuring a mix of classics and new releases. The outdoor cinema offers a magical summer experience with films projected on a large screen in the beautiful park setting.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Warm summer evenings are perfect for outdoor cinema in the park's beautiful setting. Films are shown in French with some international selections.",
                "booking_tips": "Bring a blanket or portable chair and arrive at least 30 minutes before showtime to secure a good viewing spot. Check the schedule online.",
                "location": "Parc de Peixotto, Talence",
                "duration": "3-4 hours",
                "highlights": [
                    "Outdoor cinema experience",
                    "Beautiful park setting",
                    "Mix of classic and contemporary films",
                    "Community atmosphere",
                    "Summer evening ambiance"
                ],
                "transportation": "Tram B to Talence or bus from Bordeaux center"
            },
            {
                "name": "Visit to Château de La Brède",
                "type": "Historic Castle and Garden Tour",
                "description": "Explore the beautiful château and gardens of La Brède, the birthplace of philosopher Montesquieu, located just outside Bordeaux. The château features stunning architecture, beautiful gardens, and rich historical significance.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "€8-12",
                "seasonal_notes": "Summer is the best time to see the château's gardens in full bloom, with guided tours available of both the grounds and interior. The gardens are particularly beautiful during summer.",
                "booking_tips": "Check their website for opening hours as they vary seasonally, and consider booking a guided tour in advance.",
                "location": "Château de La Brède, 33650 La Brède",
                "duration": "3-4 hours",
                "highlights": [
                    "Historic castle architecture",
                    "Beautiful formal gardens",
                    "Montesquieu's birthplace",
                    "Guided tours available",
                    "Peaceful countryside setting"
                ],
                "transportation": "Car or organized tour from Bordeaux (30 minutes)"
            },
            {
                "name": "Arcachon Bay Day Trip",
                "type": "Beach Excursion and Nature Experience",
                "description": "Escape to Arcachon Bay for swimming, oyster tasting, and climbing Europe's largest sand dune, Dune du Pilat. The bay offers beautiful Atlantic beaches, fresh seafood, and unique natural landscapes perfect for a summer day trip.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is ideal for enjoying the Atlantic beaches and seafood, with water warm enough for swimming. The area can be busy during peak season.",
                "booking_tips": "Take an early train to maximize your day and bring comfortable shoes for climbing the dune. Book oyster tastings in advance.",
                "location": "Arcachon Bay, various locations",
                "duration": "Full day",
                "highlights": [
                    "Dune du Pilat (Europe's tallest sand dune)",
                    "Atlantic beaches and swimming",
                    "Oyster tasting and fresh seafood",
                    "Boat tours of the bay",
                    "Natural landscapes"
                ],
                "transportation": "Train from Bordeaux (45 minutes) or organized tour"
            },
            {
                "name": "Cycling Through Vineyards",
                "type": "Outdoor Activity and Wine Experience",
                "description": "Rent a bike and cycle through the vineyards of Médoc or Entre-Deux-Mers, stopping at châteaux for wine tastings along the way. This active experience combines outdoor recreation with wine culture in the beautiful countryside.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer mornings offer pleasant temperatures for cycling before the afternoon heat, with vineyards in full green foliage. The countryside is particularly beautiful during summer.",
                "booking_tips": "Rent bikes in Bordeaux city center or join an organized tour that includes château visits and tastings. Book wine tastings in advance.",
                "location": "Médoc and Entre-Deux-Mers regions",
                "duration": "Full day",
                "highlights": [
                    "Vineyard cycling routes",
                    "Château visits and tastings",
                    "Countryside landscapes",
                    "Wine education",
                    "Active outdoor experience"
                ],
                "equipment": "Bike rental available in Bordeaux, helmets and maps provided"
            },
            {
                "name": "Dîner en Blanc",
                "type": "Social Event and Cultural Experience",
                "description": "Participate in the famous all-white dinner party, a flash mob event where participants dress in white and dine in a surprise public location. This elegant summer tradition creates a magical atmosphere with thousands of people dining together in white attire.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This elegant summer tradition happens in many cities including Bordeaux, usually in June or July. The event creates a spectacular white spectacle.",
                "booking_tips": "Registration is required well in advance through local organizers or by invitation from previous attendees. Bring your own table, chairs, and white décor.",
                "location": "Surprise location announced day of event",
                "duration": "4-5 hours",
                "highlights": [
                    "All-white dress code",
                    "Surprise location reveal",
                    "Elegant dining atmosphere",
                    "Community celebration",
                    "Photographic spectacle"
                ],
                "requirements": "White clothing, table, chairs, and elegant dining setup"
            },
            {
                "name": "Bordeaux Underwater Archaeology Museum",
                "type": "Indoor Museum and Cultural Experience",
                "description": "Discover the fascinating Underwater Archaeology Museum (DRASSM), showcasing artifacts recovered from shipwrecks in the region. This cool indoor venue offers a refreshing break from summer heat while providing a unique cultural experience.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "€6-10",
                "seasonal_notes": "This cool indoor venue offers a refreshing break from summer heat while providing a unique cultural experience. The museum is particularly interesting for maritime history enthusiasts.",
                "booking_tips": "Check opening hours before visiting as they can vary seasonally. The museum is less crowded during summer afternoons.",
                "location": "DRASSM, Bassins à Flot, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Underwater archaeology exhibits",
                    "Shipwreck artifacts",
                    "Maritime history",
                    "Interactive displays",
                    "Cool indoor environment"
                ],
                "accessibility": "Fully accessible with modern facilities"
            },
            {
                "name": "Sunset Dinner Cruise on the Garonne",
                "type": "Dining Experience and River Tour",
                "description": "Enjoy a gourmet dinner aboard a Garonne River cruise, with stunning views of Bordeaux's 18th-century façades illuminated at sunset. This luxurious experience combines fine dining with spectacular city views.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the best weather for evening cruises, with long daylight hours and warm temperatures. The sunset views are particularly spectacular.",
                "booking_tips": "Book well in advance and request a window table for optimal views. Consider the wine pairing option for the full experience.",
                "location": "Various departure points along the Garonne",
                "duration": "3-4 hours",
                "highlights": [
                    "Gourmet dinner experience",
                    "Sunset city views",
                    "18th-century architecture",
                    "Wine pairing options",
                    "Romantic atmosphere"
                ],
                "dress_code": "Smart casual to formal, depending on the cruise"
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Explore the Cité du Vin",
                "type": "Interactive Museum and Wine Education",
                "description": "Visit Bordeaux's iconic wine museum, Cité du Vin, an immersive experience featuring exhibitions on wine culture from around the world. The museum offers interactive displays, wine tastings, and panoramic views from its rooftop terrace.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "€22",
                "seasonal_notes": "Autumn is harvest season, making it a perfect time to learn about winemaking as the actual process happens in surrounding vineyards. The museum is less crowded than in summer.",
                "booking_tips": "Purchase tickets online to avoid lines and include the rooftop wine tasting with your admission. Audio guides available in multiple languages.",
                "location": "1 Esplanade de Pontac, 33300 Bordeaux",
                "duration": "3-4 hours",
                "highlights": [
                    "Interactive wine exhibitions",
                    "Rooftop wine tasting",
                    "Panoramic city views",
                    "Wine education programs",
                    "International wine culture"
                ],
                "special_exhibitions": "Rotating exhibitions on wine history and culture"
            },
            {
                "name": "Harvest Festival at Château Lanessan",
                "type": "Cultural Event and Wine Experience",
                "description": "Experience a traditional grape harvest celebration at Château Lanessan, featuring vineyard tours, grape stomping, and tastings of new vintages. This authentic experience offers insight into traditional winemaking methods.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "€30-50",
                "seasonal_notes": "Autumn is grape harvest season (vendange), offering a unique opportunity to see wine production firsthand. The festival celebrates the harvest with traditional activities.",
                "booking_tips": "Book your spot in advance as harvest festivals are popular and have limited capacity. Wear comfortable clothes suitable for vineyard work.",
                "location": "Château Lanessan, 33460 Cussac-Fort-Médoc",
                "duration": "Full day",
                "highlights": [
                    "Traditional grape harvesting",
                    "Grape stomping experience",
                    "Vineyard tours",
                    "New vintage tastings",
                    "Traditional harvest lunch"
                ],
                "transportation": "Organized tour from Bordeaux or car rental"
            },
            {
                "name": "Truffle Hunting in Périgord",
                "type": "Food & Drink Experience and Nature Tour",
                "description": "Join a guided truffle hunting expedition in nearby Périgord, followed by a truffle-focused meal showcasing this autumn delicacy. This unique experience combines outdoor adventure with gourmet dining.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn marks the beginning of black truffle season in the region, a culinary highlight. The experience is particularly special during peak truffle season.",
                "booking_tips": "Reserve your truffle hunting experience at least a month in advance as spots fill quickly during peak season. Wear appropriate outdoor clothing.",
                "location": "Périgord region, various locations",
                "duration": "Full day",
                "highlights": [
                    "Guided truffle hunting",
                    "Truffle dog demonstrations",
                    "Truffle-focused gourmet meal",
                    "Forest exploration",
                    "Culinary education"
                ],
                "transportation": "Organized tour from Bordeaux or car rental (2 hours)"
            },
            {
                "name": "Visit the Grand Théâtre de Bordeaux",
                "type": "Cultural Tour and Performance Venue",
                "description": "Tour the magnificent Grand Théâtre, an 18th-century neoclassical masterpiece, and perhaps attend an opera or ballet performance. The theater is considered one of the most beautiful in Europe with its stunning architecture and acoustics.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "€12-50",
                "seasonal_notes": "Autumn marks the beginning of the new cultural season with premieres and special performances. The theater is particularly beautiful during the cultural season.",
                "booking_tips": "Book a guided tour in the morning or secure tickets for an evening performance well in advance. The theater offers backstage tours on certain days.",
                "location": "Place de la Comédie, 33000 Bordeaux",
                "duration": "1-2 hours (tour), 3-4 hours (performance)",
                "highlights": [
                    "Neoclassical architecture",
                    "Stunning auditorium",
                    "Cultural performances",
                    "Historical significance",
                    "Acoustic excellence"
                ],
                "performance_types": "Opera, ballet, classical music, and theatrical productions"
            },
            {
                "name": "Autumn Walk in Jardin Botanique",
                "type": "Nature Experience and Botanical Garden",
                "description": "Take a leisurely stroll through the Botanical Gardens of Bordeaux, enjoying the fall foliage and diverse plant collections. The gardens offer a peaceful escape with beautiful autumn colors and educational plant displays.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The gardens are particularly beautiful in autumn with vibrant fall colors and fewer crowds. The autumn light creates beautiful photography opportunities.",
                "booking_tips": "Visit in the golden hour before sunset for the most beautiful light for photography. The gardens are open year-round.",
                "location": "Jardin Botanique, Rue d'Aviau, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Fall foliage displays",
                    "Diverse plant collections",
                    "Peaceful walking paths",
                    "Educational exhibits",
                    "Beautiful autumn light"
                ],
                "photography_tips": "Best photography during golden hour with autumn colors"
            },
            {
                "name": "Visit to the Museum of Bordeaux Wine and Trade",
                "type": "Cultural Museum and Wine History",
                "description": "Explore the history of Bordeaux's wine trade in this specialized museum housed in a historic merchant's home near the riverfront. The museum showcases the development of Bordeaux's wine industry and trading heritage.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "€12",
                "seasonal_notes": "Autumn's cooler days make it perfect for learning about the wine heritage that shaped the region. The museum is particularly interesting during harvest season.",
                "booking_tips": "Consider the combined ticket with other city museums for better value. Guided tours available in multiple languages.",
                "location": "41 Rue Borie, 33000 Bordeaux",
                "duration": "1-2 hours",
                "highlights": [
                    "Wine trade history",
                    "Historic merchant's home",
                    "Wine tasting included",
                    "Trading artifacts",
                    "Educational exhibits"
                ],
                "special_feature": "Wine tasting included with admission"
            },
            {
                "name": "Mushroom Foraging in Médoc Forests",
                "type": "Outdoor Activity and Nature Experience",
                "description": "Join expert guides for a mushroom foraging expedition in the forests of Médoc, learning to identify edible varieties like cèpes and chanterelles. This seasonal activity combines outdoor adventure with culinary education.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "€40-60",
                "seasonal_notes": "Autumn rains create perfect conditions for wild mushrooms, a seasonal delicacy in the region. The experience is particularly rewarding during peak mushroom season.",
                "booking_tips": "Book with reputable guides who know safe foraging spots and can identify edible species. Wear appropriate outdoor clothing and bring a basket.",
                "location": "Médoc forests, various locations",
                "duration": "Half day",
                "highlights": [
                    "Expert-guided foraging",
                    "Mushroom identification",
                    "Forest exploration",
                    "Culinary education",
                    "Seasonal delicacies"
                ],
                "safety_note": "Only forage with expert guides who can identify safe, edible mushrooms"
            },
            {
                "name": "Explore the Covered Market of Les Chartrons",
                "type": "Shopping Experience and Local Culture",
                "description": "Wander through this renovated market hall in the historic Chartrons district, featuring artisanal food shops, wine merchants, and cafés. The covered market offers a cozy retreat during autumn's cooler days.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The covered market offers a cozy retreat during autumn's cooler days, with seasonal products like game, mushrooms, and new wines.",
                "booking_tips": "Visit on weekday afternoons for a more relaxed experience with fewer crowds. Bring cash for market purchases.",
                "location": "Les Chartrons Market, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Artisanal food shops",
                    "Wine merchants",
                    "Local cafés",
                    "Seasonal products",
                    "Historic market atmosphere"
                ],
                "seasonal_products": "Game meats, wild mushrooms, new vintage wines, and autumn produce"
            },
            {
                "name": "Canelé Making Workshop",
                "type": "Cooking Workshop and Cultural Experience",
                "description": "Learn to make Bordeaux's signature pastry, the canelé, in a hands-on cooking class, mastering the techniques behind this rum and vanilla delicacy. This workshop offers insight into local culinary traditions.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "€50-80",
                "seasonal_notes": "Autumn's cooler weather is perfect for baking, and you'll take home skills to recreate these treats. The workshop is particularly popular during the holiday season.",
                "booking_tips": "Book early as cooking classes are popular, and bring a container to take home your creations. The workshop includes all ingredients and equipment.",
                "location": "Various cooking schools in Bordeaux",
                "duration": "3-4 hours",
                "highlights": [
                    "Hands-on baking experience",
                    "Traditional recipe instruction",
                    "Take-home creations",
                    "Cultural education",
                    "Professional guidance"
                ],
                "take_home": "Canelés, recipe, and baking techniques"
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Ice Skating at Place Pey-Berland",
                "type": "Winter Sport and Outdoor Activity",
                "description": "Enjoy ice skating at the outdoor rink set up in Place Pey-Berland, with views of Bordeaux Cathedral as a majestic backdrop. This seasonal activity offers a magical winter experience in the heart of the city.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "€8-12",
                "seasonal_notes": "Winter is the only time to enjoy this seasonal activity, typically running from December through January. The rink is particularly magical during evening hours with cathedral lighting.",
                "booking_tips": "Skate rentals are available on-site; weekday afternoons are less crowded than weekends. Book online to avoid queues.",
                "location": "Place Pey-Berland, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Outdoor ice skating",
                    "Cathedral backdrop",
                    "Winter atmosphere",
                    "Family-friendly activity",
                    "Seasonal entertainment"
                ],
                "equipment": "Skate rental available on-site, warm clothing recommended"
            },
            {
                "name": "Visit to the Christmas Markets",
                "type": "Holiday Market and Cultural Experience",
                "description": "Explore Bordeaux's charming Christmas market along Allées de Tourny, offering festive decorations, regional crafts, and seasonal treats like mulled wine and roasted chestnuts. The market creates a magical winter atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "The market creates a magical winter atmosphere with twinkling lights and festive music throughout December. The market is particularly beautiful during evening hours.",
                "booking_tips": "Visit in the evening when the light displays are most impressive, and try the hot spiced wine (vin chaud). Bring cash for market purchases.",
                "location": "Allées de Tourny, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Festive decorations",
                    "Regional crafts",
                    "Seasonal treats",
                    "Mulled wine",
                    "Holiday atmosphere"
                ],
                "seasonal_specialties": "Mulled wine, roasted chestnuts, gingerbread, and regional crafts"
            },
            {
                "name": "Chamber Music at Grand Théâtre",
                "type": "Classical Music and Cultural Performance",
                "description": "Experience a classical music concert in the stunning setting of Bordeaux's Grand Théâtre, one of France's most beautiful theaters. The winter season offers excellent concerts and performances in this historic venue.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "€25-80",
                "seasonal_notes": "Winter's cultural calendar features excellent concerts and performances in this historic venue. The theater is particularly beautiful during the holiday season.",
                "booking_tips": "Purchase tickets well in advance, especially for holiday-themed concerts in December. Dress appropriately for the elegant venue.",
                "location": "Place de la Comédie, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Classical music performances",
                    "Historic theater setting",
                    "Excellent acoustics",
                    "Cultural sophistication",
                    "Elegant atmosphere"
                ],
                "dress_code": "Smart casual to formal, depending on the performance"
            },
            {
                "name": "Visit the Museum of Fine Arts",
                "type": "Art Museum and Cultural Experience",
                "description": "Explore Bordeaux's Museum of Fine Arts, housing an impressive collection spanning from Renaissance to 20th century works. The museum offers a perfect indoor activity during winter weather.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "€12",
                "seasonal_notes": "Winter is perfect for indoor art appreciation when outdoor activities are limited by weather. The museum is less crowded during winter months.",
                "booking_tips": "Free on the first Sunday of each month; otherwise purchase tickets online to skip the queue. Audio guides available in multiple languages.",
                "location": "20 Cours d'Albret, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Renaissance to modern art",
                    "Impressive collection",
                    "Temporary exhibitions",
                    "Educational programs",
                    "Indoor comfort"
                ],
                "special_exhibitions": "Rotating temporary exhibitions throughout the year"
            },
            {
                "name": "Hot Chocolate at Dunes Blanches",
                "type": "Café Experience and Culinary Treat",
                "description": "Warm up with rich hot chocolate paired with Bordeaux's famous cream puffs at Dunes Blanches, a beloved local patisserie. This cozy winter experience offers comfort food and warm beverages.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "€8-15",
                "seasonal_notes": "Their special winter hot chocolate menu features different flavor combinations throughout the season. The café is particularly cozy during winter months.",
                "booking_tips": "Expect a wait on weekends; weekday afternoons are more relaxed. The café is popular for its pastries and hot beverages.",
                "location": "Various locations in Bordeaux",
                "duration": "1-2 hours",
                "highlights": [
                    "Rich hot chocolate",
                    "Cream puffs (chouquettes)",
                    "Cozy atmosphere",
                    "Winter comfort food",
                    "Local patisserie"
                ],
                "specialty_drinks": "Hot chocolate with various flavors, seasonal specialties"
            },
            {
                "name": "Wine Tasting Course at L'École du Vin",
                "type": "Educational Experience and Wine Culture",
                "description": "Participate in a structured wine tasting course at Bordeaux's School of Wine, learning about regional varieties and proper tasting techniques. This indoor activity offers wine education in a comfortable setting.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "€45-80",
                "seasonal_notes": "Winter is a great time to deepen your wine knowledge while staying warm indoors. The school offers various levels of courses.",
                "booking_tips": "Book at least a week in advance and specify your experience level when registering. Courses are available in multiple languages.",
                "location": "3 Cours du 30 Juillet, 33000 Bordeaux",
                "duration": "2-3 hours",
                "highlights": [
                    "Wine education",
                    "Tasting techniques",
                    "Regional varieties",
                    "Expert instruction",
                    "Indoor comfort"
                ],
                "course_levels": "Beginner, intermediate, and advanced courses available"
            },
            {
                "name": "Ballet Performance at Opéra National de Bordeaux",
                "type": "Cultural Performance and Artistic Experience",
                "description": "Enjoy a ballet performance at the Opéra National de Bordeaux, featuring both classic works and contemporary pieces. The winter season often includes The Nutcracker and other seasonal favorites.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "€30-120",
                "seasonal_notes": "The winter season often includes The Nutcracker and other seasonal favorites. The opera house offers a sophisticated cultural experience.",
                "booking_tips": "Book tickets several weeks in advance, especially for performances during the holiday season. Dress appropriately for the elegant venue.",
                "location": "Place de la Comédie, 33000 Bordeaux",
                "duration": "3-4 hours",
                "highlights": [
                    "Ballet performances",
                    "Classic and contemporary works",
                    "Elegant venue",
                    "Cultural sophistication",
                    "Artistic excellence"
                ],
                "seasonal_performances": "The Nutcracker, Swan Lake, and contemporary ballet works"
            },
            {
                "name": "Visit to Basilica of Saint Michael",
                "type": "Historical Site and Cultural Experience",
                "description": "Explore the Gothic Basilica of Saint Michael with its separate bell tower, enjoying the peaceful winter atmosphere and beautiful stained glass. The basilica offers a spiritual and cultural experience.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter light through the stained glass windows creates a magical atmosphere, especially on sunny afternoons. The basilica is less crowded during winter months.",
                "booking_tips": "Check opening hours which may be reduced in winter, and time your visit to catch the afternoon light. Guided tours available.",
                "location": "Place Meynard, 33000 Bordeaux",
                "duration": "1-2 hours",
                "highlights": [
                    "Gothic architecture",
                    "Stained glass windows",
                    "Separate bell tower",
                    "Peaceful atmosphere",
                    "Historical significance"
                ],
                "special_feature": "Separate bell tower can be climbed for panoramic views (€6)"
            },
            {
                "name": "Garonne River Winter Cruise",
                "type": "Boat Tour and Scenic Experience",
                "description": "Experience a heated river cruise along the Garonne, offering panoramic views of Bordeaux's UNESCO-listed waterfront illuminated for winter. This comfortable indoor experience provides beautiful city views regardless of weather.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "€20-35",
                "seasonal_notes": "Winter cruises feature special holiday decorations and illuminations throughout December. The heated boats provide comfort during cold weather.",
                "booking_tips": "Choose a heated boat option and book in advance, especially during the Christmas season. Evening cruises offer the best lighting.",
                "location": "Various departure points along the Garonne",
                "duration": "1-2 hours",
                "highlights": [
                    "Heated indoor comfort",
                    "Panoramic city views",
                    "Holiday illuminations",
                    "UNESCO waterfront",
                    "Winter atmosphere"
                ],
                "special_feature": "Holiday decorations and illuminations during December"
            }
        ]
    }
}