{
    "sites": [
        {
            "name": "Pilsner Urquell Brewery",
            "type": "Brewery",
            "description": "The birthplace of Pilsner beer, this historic brewery offers guided tours through the brewing process, underground cellars, and the chance to taste unfiltered beer straight from the barrel. The brewery complex showcases the traditional brewing methods that revolutionized beer production worldwide.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round tours available. Summer offers outdoor beer garden experience. Winter tours focus on indoor brewing process.",
            "booking_tips": "Book tours online in advance, especially during peak season. Tours are available in multiple languages including English.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "St. Bartholomew's Cathedral",
            "type": "Cathedral",
            "description": "A Gothic cathedral with the highest church tower in the Czech Republic, offering panoramic views of Plzen and the surrounding countryside. The cathedral features beautiful stained glass windows and impressive Gothic architecture dating back to the 13th century.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Tower climb offers best views on clear days. Christmas services are particularly atmospheric.",
            "booking_tips": "Free entry to cathedral. Small fee for tower climb. Check opening hours as they vary by season.",
            "ratings": {
                "cost_estimate": 3,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Historical Underground",
            "type": "Historical Site",
            "description": "Explore the extensive network of medieval cellars and tunnels beneath the city center. This unique attraction showcases Plzen's medieval history and includes exhibits on the city's development, brewing traditions, and underground architecture.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Constant cool temperature year-round. Perfect for hot summer days or rainy weather.",
            "booking_tips": "Guided tours required. Book in advance, especially during peak tourist season. Wear comfortable shoes.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Republic Square (Náměstí Republiky)",
            "type": "Square",
            "description": "The heart of Plzen's historic center, featuring the Renaissance Town Hall, St. Bartholomew's Cathedral, and beautiful baroque and renaissance architecture. The square is a perfect starting point for exploring the city.",
            "indoor": false,
            "best_time": "Any time",
            "price_range": "Free",
            "seasonal_notes": "Christmas markets in winter. Outdoor cafes and events in summer. Beautiful architecture year-round.",
            "booking_tips": "Free to visit. Consider timing with the hourly clock show at the Town Hall.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Zoo",
            "type": "Zoo",
            "description": "One of the largest zoos in the Czech Republic, featuring over 1,200 animals from around the world. The zoo is known for its breeding programs and naturalistic habitats, making it a great family destination.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Best visited in spring and summer when animals are most active. Some indoor exhibits available year-round.",
            "booking_tips": "Purchase tickets online to avoid queues. Allow 3-4 hours for a complete visit.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 3,
                "cultural_significance": 3
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "West Bohemian Museum",
            "type": "Museum",
            "description": "A comprehensive museum showcasing the history, culture, and natural heritage of the Pilsen region. The museum features archaeological finds, historical artifacts, and exhibits on local traditions and industry.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Special exhibitions change regularly. Perfect for rainy days.",
            "booking_tips": "Check for special exhibitions and guided tours. Audio guides available in multiple languages.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Great Synagogue",
            "type": "Synagogue",
            "description": "The second-largest synagogue in Europe, featuring stunning Moorish architecture and beautiful interior decorations. The synagogue serves as both a place of worship and a cultural center with regular exhibitions and events.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Special events and exhibitions throughout the year.",
            "booking_tips": "Check opening hours as they vary. Guided tours available for groups.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen City Hall",
            "type": "Historical Building",
            "description": "A beautiful Renaissance building in the heart of Republic Square, featuring ornate architecture and the famous Plzen astronomical clock. The building houses the city's administrative offices and is a symbol of Plzen's civic pride.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Clock shows are popular with visitors. Limited interior access.",
            "booking_tips": "Exterior viewing is free. Interior access may be limited to special events.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Brewery Museum",
            "type": "Museum",
            "description": "Located in a historic house that was part of the original Pilsner Urquell brewery, this museum showcases the history of brewing in Plzen and the development of Pilsner beer. Features original brewing equipment and historical exhibits.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Perfect complement to Pilsner Urquell brewery tour.",
            "booking_tips": "Combine with Pilsner Urquell tour for complete brewing experience. Audio guides available.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Techmania Science Center",
            "type": "Science Center",
            "description": "An interactive science museum housed in a former industrial building, featuring hands-on exhibits, a planetarium, and educational programs. Perfect for families and science enthusiasts.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Popular with families and school groups.",
            "booking_tips": "Book tickets online for popular exhibits. Allow 2-3 hours for full experience.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 3
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen City Walls",
            "type": "Historical Site",
            "description": "Remnants of the medieval city fortifications, including preserved towers and sections of the original walls. The walls offer insights into Plzen's medieval history and provide scenic walking routes.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Spring and autumn offer pleasant walking conditions.",
            "booking_tips": "Free to explore. Wear comfortable walking shoes. Some sections may be closed for restoration.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Art Gallery",
            "type": "Museum",
            "description": "A modern art gallery showcasing contemporary Czech and international art, housed in a beautiful historic building. Features rotating exhibitions and permanent collections.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Special exhibitions change regularly.",
            "booking_tips": "Check exhibition schedule online. Guided tours available for groups.",
            "ratings": {
                "cost_estimate": 7,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Beer Spa",
            "type": "Wellness",
            "description": "A unique spa experience using beer ingredients for therapeutic treatments. Features beer baths, beer-based cosmetics, and relaxation areas. A perfect way to unwind after exploring the city.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Expensive",
            "seasonal_notes": "Year-round attraction. Popular year-round for relaxation and unique experience.",
            "booking_tips": "Book treatments in advance. Packages available with beer tasting included.",
            "ratings": {
                "cost_estimate": 50,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Main Railway Station",
            "type": "Architecture",
            "description": "A beautiful Art Nouveau railway station featuring ornate architecture and historical significance. The station is a gateway to the city and showcases Plzen's industrial heritage.",
            "indoor": true,
            "best_time": "Any time",
            "price_range": "Free",
            "seasonal_notes": "Year-round attraction. Beautiful architecture in all seasons.",
            "booking_tips": "Free to visit. Combine with arrival or departure from the city.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Beer Festival",
            "type": "Festival",
            "description": "An annual celebration of beer culture featuring local and international breweries, traditional Czech food, and live entertainment. The festival showcases Plzen's brewing heritage and attracts visitors from around the world.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Held annually in summer. Check dates for specific year.",
            "booking_tips": "Book accommodation early during festival dates. Festival tickets available online.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 4,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen City Park",
            "type": "Park",
            "description": "A beautiful urban park featuring walking paths, gardens, and recreational areas. The park offers a peaceful escape from the city center and is perfect for picnics and leisurely strolls.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful in spring and summer with blooming flowers. Autumn offers colorful foliage.",
            "booking_tips": "Free to visit. Perfect for picnics and family outings.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Christmas Markets",
            "type": "Market",
            "description": "Traditional Christmas markets held in Republic Square, featuring local crafts, traditional Czech food, and festive decorations. The markets create a magical atmosphere during the holiday season.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Held during December. Beautiful with Christmas lights and decorations.",
            "booking_tips": "Free to visit. Try traditional Czech Christmas treats and mulled wine.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Beer Tasting Tour",
            "type": "Culinary Experience",
            "description": "Guided tours of local breweries and beer halls, featuring tastings of various Czech beers and traditional pub food. Learn about Czech beer culture and brewing traditions.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round activity. Popular with beer enthusiasts and groups.",
            "booking_tips": "Book tours in advance. Tours available in multiple languages.",
            "ratings": {
                "cost_estimate": 25,
                "suggested_duration_hours": 3,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Architecture Walk",
            "type": "Walking Tour",
            "description": "Self-guided or guided walking tours exploring Plzen's diverse architecture, from medieval buildings to Art Nouveau masterpieces. Discover the city's architectural heritage and hidden gems.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Spring and autumn offer pleasant walking conditions.",
            "booking_tips": "Free self-guided tours available. Guided tours can be booked in advance.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        },
        {
            "name": "Plzen Traditional Czech Restaurant",
            "type": "Culinary Experience",
            "description": "Experience authentic Czech cuisine in traditional restaurants throughout the city. Sample local specialties like goulash, dumplings, and traditional Czech desserts.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round dining experience. Seasonal specialties available.",
            "booking_tips": "Reservations recommended for popular restaurants. Try local beer pairings.",
            "ratings": {
                "cost_estimate": 20,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 49.7475,
            "longitude": 13.3776
        }
    ]
}