{
    "Spring": {
        "activities": [
            {
                "name": "Easter Markets at Republic Square",
                "type": "Market",
                "description": "Traditional Easter markets in Republic Square featuring local crafts, painted eggs, traditional Czech Easter decorations, and seasonal treats like mazanec (Easter bread).",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the traditional Czech Easter celebrations with markets showcasing local crafts and seasonal foods.",
                "booking_tips": "Visit early morning for the best selection of handcrafted Easter decorations and traditional foods."
            },
            {
                "name": "Cathedral Tower Climb",
                "type": "Sightseeing",
                "description": "Climb the 102.6-meter tower of St. Bartholomew's Cathedral for panoramic views of Plzen and the surrounding countryside in spring bloom.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers the best weather for climbing the tower with comfortable temperatures and clear views.",
                "booking_tips": "Arrive early to avoid crowds and bring a camera for stunning spring landscape photos."
            },
            {
                "name": "Brewery Spring Tour",
                "type": "Brewery Tour",
                "description": "Special spring brewery tours at Pilsner Urquell featuring seasonal beer varieties and the brewing process in full swing.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is when the brewery ramps up production, making it an ideal time to see the brewing process in action.",
                "booking_tips": "Book tours in advance, especially during peak spring tourist season."
            },
            {
                "name": "Spring Beer Garden Opening",
                "type": "Outdoor Dining",
                "description": "Celebrate the opening of outdoor beer gardens throughout Plzen, featuring fresh Pilsner Urquell and traditional Czech pub food.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring marks the return of outdoor dining with pleasant temperatures perfect for beer garden enjoyment.",
                "booking_tips": "Visit popular beer gardens like Republic Square Beer Garden early to secure a good spot."
            },
            {
                "name": "Historic Walking Tour",
                "type": "Walking Tour",
                "description": "Explore Plzen's medieval Old Town and historic architecture with guided walking tours highlighting the city's 13th-century foundation.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring weather is ideal for walking tours with comfortable temperatures and blooming flowers.",
                "booking_tips": "Wear comfortable shoes and bring water for the walking tour through historic streets."
            },
            {
                "name": "Spring Market at Republic Square",
                "type": "Market",
                "description": "Visit the traditional spring market offering fresh local produce, seasonal flowers, and traditional Czech crafts.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature fresh seasonal produce and traditional Czech Easter decorations.",
                "booking_tips": "Arrive early for the best selection of fresh produce and handcrafted items."
            },
            {
                "name": "Café Louvre Spring Experience",
                "type": "Café",
                "description": "Enjoy traditional Czech coffee and pastries at the historic Café Louvre, where Einstein and Kafka once met, in the pleasant spring atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is perfect for enjoying the historic café's terrace and traditional Czech coffee culture.",
                "booking_tips": "Try the traditional Czech coffee preparation and seasonal pastries."
            },
            {
                "name": "Underground Beer Tunnels Tour",
                "type": "Historic Tour",
                "description": "Explore the 9-kilometer network of historic underground beer tunnels used for beer storage and maturation beneath Plzen.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring tours offer comfortable underground temperatures and fewer crowds than peak summer season.",
                "booking_tips": "Book guided tours in advance and wear comfortable walking shoes for the underground exploration."
            },
            {
                "name": "Traditional Czech Cooking Workshop",
                "type": "Workshop",
                "description": "Learn to cook traditional Czech spring dishes like Easter bread (mazanec) and seasonal Czech specialties with local ingredients.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring provides fresh seasonal ingredients perfect for learning traditional Czech cooking techniques.",
                "booking_tips": "Reserve your spot at least two weeks in advance for popular cooking workshops."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Pilsner Urquell Brewery Summer Festival",
                "type": "Festival",
                "description": "Annual summer beer festival celebrating Pilsner Urquell with live music, beer tastings, traditional Czech food, and brewery tours.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is peak beer festival season with perfect weather for outdoor celebrations and beer tasting.",
                "booking_tips": "Purchase festival tickets in advance and arrive early to enjoy all activities."
            },
            {
                "name": "Republic Square Beer Garden",
                "type": "Outdoor Dining",
                "description": "Enjoy Pilsner Urquell and local craft beers in the outdoor beer garden at Republic Square with live music and traditional Czech pub food.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings are perfect for outdoor beer garden enjoyment with pleasant temperatures and lively atmosphere.",
                "booking_tips": "Arrive early to secure a good table, especially on weekends and during live music events."
            },
            {
                "name": "Plzen Historical Center Night Tour",
                "type": "Walking Tour",
                "description": "Explore Plzen's historic center by night with guided tours highlighting the medieval architecture and illuminated landmarks.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer nights offer pleasant temperatures for evening walking tours with beautiful illuminated architecture.",
                "booking_tips": "Book evening tours in advance and bring a camera for stunning night photography."
            },
            {
                "name": "Outdoor Cinema at Republic Square",
                "type": "Cinema",
                "description": "Enjoy classic Czech films and international movies under the stars at Republic Square's outdoor cinema during summer evenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings are ideal for outdoor cinema with warm temperatures and late sunsets.",
                "booking_tips": "Bring a blanket or portable chair and arrive early to secure a good viewing spot."
            },
            {
                "name": "Plzen Food and Beer Tour",
                "type": "Food Tour",
                "description": "Comprehensive food and beer tour visiting traditional Czech restaurants, breweries, and local markets with beer pairings.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer offers the best weather for food tours with outdoor dining options and fresh seasonal ingredients.",
                "booking_tips": "Book tours in advance, especially for weekend slots, and come hungry for the full experience."
            },
            {
                "name": "Cycling Around Plzen",
                "type": "Outdoor Activity",
                "description": "Rent a bike and explore Plzen's historic center and surrounding areas, including routes to nearby parks and the brewery district.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer provides ideal cycling weather with long daylight hours and pleasant temperatures.",
                "booking_tips": "Use local bike rental services and follow designated cycling routes for the best experience."
            },
            {
                "name": "Traditional Czech Pub Crawl",
                "type": "Nightlife",
                "description": "Experience Plzen's traditional pub culture with a guided pub crawl visiting historic pubs and tasting different Czech beers.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for pub crawls with a lively atmosphere and comfortable temperatures.",
                "booking_tips": "Join organized pub crawls for the best experience and to learn about Czech beer culture."
            },
            {
                "name": "Plzen Market Shopping",
                "type": "Market",
                "description": "Explore the traditional Plzen market for fresh summer produce, local crafts, and traditional Czech foods in the bustling market atmosphere.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer markets feature fresh seasonal produce and local specialties perfect for picnics and cooking.",
                "booking_tips": "Visit early morning for the freshest produce and to avoid crowds."
            },
            {
                "name": "Brewery Restaurant Dining",
                "type": "Dining",
                "description": "Dine at Na Spilce restaurant in the Pilsner Urquell Brewery with beer-braised dishes and fresh Pilsner Urquell in the historic brewery setting.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the opportunity to enjoy brewery dining with seasonal beer varieties and outdoor seating options.",
                "booking_tips": "Reserve a table in advance, especially for dinner, and try the brewery's seasonal beer offerings."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Plzen Beer Festival",
                "type": "Festival",
                "description": "Annual autumn beer festival celebrating Czech beer culture with tastings, traditional music, and local food specialties.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, making it the perfect time for beer festivals celebrating Czech brewing traditions.",
                "booking_tips": "Purchase festival tickets in advance and plan to spend the full day enjoying the festivities."
            },
            {
                "name": "Historic Architecture Photography",
                "type": "Photography",
                "description": "Capture Plzen's medieval and Renaissance architecture in beautiful autumn light, including the Gothic cathedral and historic town hall.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn provides the best lighting for architectural photography with golden hour and dramatic skies.",
                "booking_tips": "Bring a tripod for architectural photography and visit during golden hour for the best lighting."
            },
            {
                "name": "Traditional Czech Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Czech autumn dishes like goulash, svíčková, and seasonal specialties using local ingredients.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides abundant ingredients for learning traditional Czech cooking techniques.",
                "booking_tips": "Book classes in advance, especially for popular autumn cooking workshops focusing on seasonal dishes."
            },
            {
                "name": "Brewery Museum Visit",
                "type": "Museum",
                "description": "Explore the comprehensive brewery museum showcasing the history of beer brewing in Plzen and the revolutionary Pilsner lager.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler weather makes museums an ideal choice for cultural enrichment and learning about beer history.",
                "booking_tips": "Purchase tickets online to avoid queues and consider a guided tour for deeper insights into brewing history."
            },
            {
                "name": "Autumn Market at Republic Square",
                "type": "Market",
                "description": "Visit the autumn market featuring seasonal produce, traditional Czech crafts, and harvest specialties in the historic square.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn markets showcase harvest produce and traditional Czech seasonal foods and crafts.",
                "booking_tips": "Visit early for the best selection of fresh autumn produce and traditional crafts."
            },
            {
                "name": "Wine Tasting in Plzen",
                "type": "Food & Drink",
                "description": "Discover Czech wines with tastings at local wine bars and restaurants, featuring wines from the nearby Moravia region.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season in Czech wine regions, making it an ideal time for wine tasting and appreciation.",
                "booking_tips": "Reserve spots at popular wine bars and ask for recommendations of local Czech wines."
            },
            {
                "name": "Historic Walking Tour",
                "type": "Walking Tour",
                "description": "Explore Plzen's medieval streets and historic sites with guided tours highlighting the city's rich history and architecture.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn offers comfortable temperatures for walking tours with beautiful fall colors enhancing the historic atmosphere.",
                "booking_tips": "Book guided tours in advance and wear comfortable walking shoes for exploring the medieval streets."
            },
            {
                "name": "Traditional Czech Pub Experience",
                "type": "Dining",
                "description": "Experience authentic Czech pub culture at traditional establishments like U Mansfelda and U Salzmannů with local beer and traditional dishes.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn evenings are perfect for cozy pub experiences with traditional Czech comfort food and beer.",
                "booking_tips": "Visit during off-peak hours for a more authentic experience and try traditional Czech pub dishes."
            },
            {
                "name": "Plzen Cultural Events",
                "type": "Cultural Event",
                "description": "Attend autumn cultural events including classical concerts, theater performances, and art exhibitions throughout Plzen.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is a rich cultural season with various performances and exhibitions celebrating Czech arts and culture.",
                "booking_tips": "Check local event calendars and book tickets in advance for popular cultural events."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets at Republic Square",
                "type": "Market",
                "description": "Magical Christmas markets featuring traditional Czech crafts, mulled wine, trdelník pastries, and festive decorations in the historic square.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter Christmas markets are a quintessential Czech holiday experience with traditional crafts and seasonal treats.",
                "booking_tips": "Visit in the evening for the best atmosphere with festive lights and fewer crowds."
            },
            {
                "name": "Cathedral Christmas Concerts",
                "type": "Concert",
                "description": "Experience classical music concerts in the stunning St. Bartholomew's Cathedral featuring traditional Christmas carols and classical performances.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter evenings are perfect for indoor concerts in the historic cathedral setting with beautiful acoustics.",
                "booking_tips": "Book tickets well in advance as Christmas concerts often sell out quickly."
            },
            {
                "name": "Traditional Czech Christmas Dinner",
                "type": "Dining",
                "description": "Enjoy traditional Czech Christmas dinner featuring carp, potato salad, and Christmas cookies at local restaurants and pubs.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the season for traditional Czech Christmas cuisine with hearty dishes and festive atmosphere.",
                "booking_tips": "Reserve tables in advance for Christmas dinner, especially at popular traditional restaurants."
            },
            {
                "name": "Brewery Winter Tour",
                "type": "Brewery Tour",
                "description": "Special winter brewery tours at Pilsner Urquell featuring the brewing process and warm beer tastings in the historic brewery setting.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers a cozy atmosphere for brewery tours with warm indoor tastings and fewer crowds.",
                "booking_tips": "Book winter tours in advance and dress warmly for the outdoor portions of the tour."
            },
            {
                "name": "Hot Chocolate at Café Louvre",
                "type": "Café",
                "description": "Warm up with traditional Czech hot chocolate and pastries at the historic Café Louvre in the cozy winter atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for enjoying warm beverages and traditional Czech café culture in historic settings.",
                "booking_tips": "Visit during off-peak times to avoid crowds and try the traditional Czech hot chocolate preparation."
            },
            {
                "name": "Plzen Historical Museum Visit",
                "type": "Museum",
                "description": "Explore the Plzen Historical Museum showcasing the city's rich history, medieval artifacts, and cultural heritage in a warm indoor setting.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter's cold makes museums an ideal choice for cultural enrichment and learning about Plzen's history.",
                "booking_tips": "Purchase tickets online to avoid queues and consider a guided tour for deeper historical insights."
            },
            {
                "name": "Traditional Czech Pub Winter Experience",
                "type": "Dining",
                "description": "Experience cozy Czech pub atmosphere with traditional winter dishes like goulash, roasted pork knee, and warm Czech beer.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter evenings are perfect for cozy pub experiences with hearty Czech comfort food and warm beer.",
                "booking_tips": "Visit traditional pubs like U Mansfelda for authentic Czech winter dining experience."
            },
            {
                "name": "New Year's Eve Celebrations",
                "type": "Festival",
                "description": "Celebrate New Year's Eve at Republic Square with fireworks, live music, and festive atmosphere in the heart of Plzen.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter New Year's celebrations offer a magical atmosphere with fireworks and festive gatherings.",
                "booking_tips": "Arrive early to secure a good viewing spot for the fireworks and dress warmly for outdoor celebrations."
            },
            {
                "name": "Winter Beer Tasting",
                "type": "Food & Drink",
                "description": "Sample seasonal winter beers and traditional Czech spirits like Becherovka at local pubs and breweries.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is ideal for beer tasting with seasonal varieties and warm indoor pub atmosphere.",
                "booking_tips": "Visit popular beer bars and ask for seasonal winter beer recommendations from local bartenders."
            }
        ]
    }
}