{
    "sites": [
        {
            "name": "Place Bellecour",
            "type": "Square",
            "description": "This vast open square is one of the largest pedestrian squares in Europe and serves as the central hub of Lyon. Notable for its statue of Louis XIV on horseback and the iconic Ferris wheel in winter, Place Bellecour offers views of Fourvière Hill and connects the Presqu'île district's main shopping streets.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful in spring with blooming flowers. Winter features a Christmas market and Ferris wheel. Summer evenings are lively with locals and tourists.",
            "booking_tips": "No booking required. Free public space accessible at all times.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 45.7580,
            "longitude": 4.8320
        },
        {
            "name": "Basilique Notre-Dame de Fourvière",
            "type": "Basilica",
            "description": "Perched dramatically on Fourvière Hill overlooking the city, this stunning 19th-century basilica combines Byzantine and Romanesque styles. Its opulent interior features beautiful mosaics, stained glass, and marble work. The terrace provides one of the most spectacular panoramic views of Lyon.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Less crowded on weekday mornings. The basilica is beautifully lit at night. December 8th features the spectacular Festival of Lights (Fête des Lumières).",
            "booking_tips": "No booking required for the basilica. The adjacent museum has a small entrance fee.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 45.7623,
            "longitude": 4.8225
        },
        {
            "name": "Vieux Lyon (Old Town)",
            "type": "District",
            "description": "One of Europe's largest Renaissance districts, Vieux Lyon is characterized by its narrow cobblestone streets, hidden traboules (passageways), Gothic and Renaissance architecture, and vibrant atmosphere. Split into three areas (Saint-Jean, Saint-Paul, and Saint-Georges), it's filled with restaurants, shops, and historical buildings.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Early mornings offer quiet exploration opportunities. Extremely busy during summer and weekends. Restaurants are lively in evenings.",
            "booking_tips": "No booking required for exploring. Guided tours available for discovering hidden traboules and history.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 45.7620,
            "longitude": 4.8273
        },
        {
            "name": "Musée des Beaux-Arts",
            "type": "Museum",
            "description": "Housed in a former 17th-century Benedictine convent, Lyon's Fine Arts Museum is considered the next most important in France after the Louvre. The collection spans antiquity to modern art, featuring works by Monet, Picasso, Rembrandt, Rubens, and ancient Egyptian artifacts.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Less crowded on weekdays. Special exhibitions rotate throughout the year. The museum is air-conditioned, making it a perfect refuge on hot summer days.",
            "booking_tips": "No advance booking required for general admission. Guided tours available with museum entry.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 45.7670,
            "longitude": 4.8335
        },
        {
            "name": "Parc de la Tête d'Or",
            "type": "Park",
            "description": "Lyon's largest urban park covers 117 hectares and features a large lake, botanical garden, rose garden, and a free zoo. Popular with joggers, families, and picnickers, the park offers rowing boats, a miniature train, and beautiful landscaped spaces for relaxation.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Spectacular in spring when flowers bloom and in autumn for colorful foliage. The greenhouse tropical collections are perfect for winter visits.",
            "booking_tips": "No booking required. Free entry to the park, botanical gardens, and zoo.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 4
            },
            "latitude": 45.7741,
            "longitude": 4.8550
        },
        {
            "name": "Les Halles de Lyon Paul Bocuse",
            "type": "Market",
            "description": "This prestigious indoor food market named after Lyon's most famous chef features around 50 vendors selling gourmet products. From cheese and charcuterie to chocolates, seafood, and wines, the market showcases the finest regional produce that makes Lyon the gastronomic capital of France.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round with seasonal specialties. Busier on weekends. Many stalls close on Mondays and some close for lunch between 2-5 PM.",
            "booking_tips": "No booking required for browsing. Come hungry to sample products. Several small restaurants within the market require reservations on weekends.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 45.7630,
            "longitude": 4.8530
        },
        {
            "name": "Musée des Confluences",
            "type": "Museum",
            "description": "Located at the confluence of the Rhône and Saône rivers, this striking deconstructivist building houses a science and anthropology museum. Its innovative exhibitions explore big questions about humanity, civilization, and natural history through diverse artifacts ranging from dinosaur fossils to contemporary art.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. The museum terrace offers excellent views of the confluence and is particularly pleasant in summer evenings.",
            "booking_tips": "Online booking recommended for weekends and holidays. Free entry first Sunday of each month.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 45.7324,
            "longitude": 4.8188
        },
        {
            "name": "Amphithéâtre des Trois Gaules",
            "type": "Archaeological Site",
            "description": "This ancient Roman amphitheater on the slopes of La Croix-Rousse dates from 19 AD and once seated 20,000 spectators. It was where the first Christian martyrs of Gaul were executed in 177 AD, making it an important historical and religious site.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. The site offers little shade, so morning visits are best in summer. Information panels provide historical context.",
            "booking_tips": "No booking required. The site is freely accessible.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 45.7699,
            "longitude": 4.8300
        },
        {
            "name": "Théâtres Romains de Fourvière",
            "type": "Archaeological Site",
            "description": "Adjacent to the Fourvière Basilica, these well-preserved Roman theaters date from the 1st century BC. The Grand Theater could seat 10,000 people, while the smaller Odeon was used for musical performances. Today, the site hosts the popular Nuits de Fourvière festival in summer.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Best visited in the morning before heat builds up. The annual Nuits de Fourvière festival runs from June to July with performances in the ancient theater.",
            "booking_tips": "No booking required for general access. Festival performances require advance tickets.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 45.7608,
            "longitude": 4.8197
        },
        {
            "name": "La Croix-Rousse",
            "type": "District",
            "description": "Known as 'the hill that works' (in contrast to Fourvière, 'the hill that prays'), this historic silk workers' district retains its bohemian, village-like atmosphere. Once the center of Lyon's silk industry, its traboules, workshops, and distinctive architecture tell the story of the canuts (silk workers).",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "The Croix-Rousse market on Boulevard de la Croix-Rousse is one of Lyon's best (Tuesday-Sunday mornings). The neighborhood hosts various festivals throughout the year.",
            "booking_tips": "No booking required for exploring. Guided tours available focusing on silk-working history and traboules.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 45.7745,
            "longitude": 4.8289
        },
        {
            "name": "Musée Lumière",
            "type": "Museum",
            "description": "Housed in the Art Nouveau villa of the Lumière family, this museum is dedicated to Antoine, Louis, and Auguste Lumière, who invented the cinematograph and created the world's first motion picture in 1895. The museum displays early filming equipment, photographs, and screens historic films.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. The annual Lumière Film Festival in October celebrates heritage cinema and attracts international stars.",
            "booking_tips": "No advance booking required. Guided tours available in multiple languages.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 45.7464,
            "longitude": 4.8708
        },
        {
            "name": "Institut & Musée Lumière",
            "type": "Museum",
            "description": "Located in the historic Lumière factory, this museum celebrates the Lumière brothers who invented cinema. The exhibits showcase their technical innovations through original equipment, films, and personal effects, telling the story of early cinematography in the very place where the first film was shot.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. The museum hosts the annual Lumière Festival in October, a major event in heritage cinema.",
            "booking_tips": "No advance booking required. Guided tours available with additional insights.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 45.7464,
            "longitude": 4.8708
        },
        {
            "name": "Murs des Canuts",
            "type": "Mural",
            "description": "Located in the Croix-Rousse district, this is the largest trompe-l'œil fresco in Europe at 1,200 square meters. It depicts the history and daily life of Lyon's silk workers (canuts) with remarkable realism, creating an optical illusion that blends into the neighborhood.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Best viewed in morning light. The mural has been updated several times, with changes reflecting the evolution of the neighborhood.",
            "booking_tips": "No booking required. Free to view at any time.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 45.7781,
            "longitude": 4.8286
        },
        {
            "name": "Cathédrale Saint-Jean-Baptiste",
            "type": "Cathedral",
            "description": "This magnificent Gothic cathedral in the heart of Vieux Lyon was built between the 12th and 15th centuries. Known for its 14th-century astronomical clock, beautiful stained glass, and blend of Romanesque and Gothic architecture, it serves as the primary cathedral of Lyon.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "The astronomical clock performs daily at 12, 2, 3, and 4 PM. The cathedral hosts special services during Easter and Christmas.",
            "booking_tips": "No booking required. Respect quiet during services. Small donation for viewing the astronomical clock.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 45.7609,
            "longitude": 4.8272
        },
        {
            "name": "Musée Gadagne",
            "type": "Museum",
            "description": "Housed in a Renaissance mansion in the heart of Vieux Lyon, this complex contains two museums: the Lyon History Museum and the International Puppet Museum. Its rooftop garden café offers charming views over the old town's rooftops.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. The courtyard and gardens are particularly pleasant in spring and summer.",
            "booking_tips": "No advance booking required. Combined ticket for both museums offers best value.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 45.7635,
            "longitude": 4.8277
        },
        {
            "name": "Musée d'Art Contemporain",
            "type": "Museum",
            "description": "Located in the Cité Internationale complex designed by Renzo Piano, this contemporary art museum features temporary exhibitions of current trends in modern art. The museum is known for its innovative programming and commitment to emerging artists.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "The museum sometimes closes between exhibitions. Check the schedule before visiting. The surrounding park is pleasant for walks in good weather.",
            "booking_tips": "No advance booking required. Check the website for current exhibitions as the museum focuses on temporary shows.",
            "ratings": {
                "cost_estimate": 9,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 45.7847,
            "longitude": 4.8553
        },
        {
            "name": "Berges du Rhône",
            "type": "Riverbank",
            "description": "This 5km landscaped promenade along the eastern bank of the Rhône River has transformed former parking lots into a vibrant public space. Popular for jogging, cycling, and relaxing, it features floating restaurants (péniches), gardens, playgrounds, and sports facilities.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Extremely popular in summer when locals gather to picnic and socialize. Many outdoor events and pop-up activities during warm months.",
            "booking_tips": "No booking required. Bike rentals available nearby with city bike scheme.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 45.7560,
            "longitude": 4.8430
        },
        {
            "name": "Musée Miniature et Cinéma",
            "type": "Museum",
            "description": "Located in a 16th-century building in Vieux Lyon, this unique museum combines incredible miniature scenes created with painstaking detail by artist Dan Ohlmann with an exhibition of original movie props, costumes, and special effects elements from major films.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. A good rainy day activity. Can be busy during school holidays.",
            "booking_tips": "No advance booking required. Allow plenty of time to appreciate the incredible detail in the miniatures.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 45.7631,
            "longitude": 4.8274
        },
        {
            "name": "Place des Terreaux",
            "type": "Square",
            "description": "This historic square is bordered by the Lyon City Hall and the Museum of Fine Arts. Its centerpiece is the famous Bartholdi fountain, originally designed for the city of Bordeaux. The square hosts cafés with outdoor seating and is beautifully illuminated at night.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Lively throughout the year. Spectacular during the Festival of Lights in December. Summer evenings feature outdoor dining.",
            "booking_tips": "No booking required. The square is always accessible.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.7675,
            "longitude": 4.8340
        },
        {
            "name": "Fresque des Lyonnais",
            "type": "Mural",
            "description": "This remarkable trompe-l'œil mural covers 800 square meters and depicts 30 famous historical and contemporary figures from Lyon, including the Lumière brothers, Antoine de Saint-Exupéry, and Paul Bocuse. The hyper-realistic style creates a striking optical illusion.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Best photographed in morning light. The mural can be viewed year-round.",
            "booking_tips": "No booking required. Free to view at any time.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 45.7690,
            "longitude": 4.8303
        },
        {
            "name": "Bouchons Lyonnais",
            "type": "Cultural Experience",
            "description": "These traditional Lyon restaurants serve authentic local cuisine in a warm, convivial atmosphere. Dishes typically include quenelles (pike dumplings), andouillette (tripe sausage), and various pork specialties. The name 'bouchon' comes from the small twisted straw brushes used to clean horses outside these establishments.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Many traditional dishes are hearty and best enjoyed in cooler months. Authentic bouchons display the official certification label.",
            "booking_tips": "Advance booking recommended, especially for dinner and weekends. Look for the official 'Authentique Bouchon Lyonnais' certification.",
            "ratings": {
                "cost_estimate": 30,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 45.7620,
            "longitude": 4.8290
        }
    ]
}