{
    "Spring": {
        "activities": [
            {
                "name": "Festival Nuits Sonores",
                "type": "Cultural Event",
                "description": "Experience one of Europe's leading electronic music festivals, as Lyon transforms with cutting-edge performances, art installations, and events across historic and industrial venues.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "The festival typically runs for five days in May, attracting international artists and music enthusiasts to Lyon.",
                "booking_tips": "Purchase passes well in advance as they sell out quickly. Consider day passes if you can't attend the full festival, and check the program for free city events."
            },
            {
                "name": "Croix-Rousse Market",
                "type": "Market",
                "description": "Visit the vibrant Marché de la Croix-Rousse in spring when the stalls overflow with fresh produce, spring flowers, and local specialties from the region.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings an abundance of local asparagus, strawberries, and early cherries to this authentic Lyonnais market.",
                "booking_tips": "Visit Tuesday through Sunday mornings before 11am for the best selection. The boulevard location offers more food options than other city markets."
            },
            {
                "name": "Parc de la Tête d'Or in Bloom",
                "type": "Outdoor Activity",
                "description": "Explore Lyon's magnificent urban park when its famous rose garden, botanical collections, and flowering trees burst into spectacular spring color.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is the optimal time to visit, especially May and June when the International Rose Garden showcases over 16,000 roses in full bloom.",
                "booking_tips": "No booking required. Enter through the golden gates for the most impressive first impression and rent a rowboat on the lake for a unique perspective."
            },
            {
                "name": "Cooking Workshop at Institut Paul Bocuse",
                "type": "Workshop",
                "description": "Learn spring cuisine techniques at a cooking workshop in the world-renowned culinary school founded by Lyon's legendary chef Paul Bocuse.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring workshops focus on fresh seasonal ingredients like spring vegetables, herbs, and traditional Lyonnaise spring dishes.",
                "booking_tips": "Book at least one month in advance as classes fill quickly. Weekend workshops are particularly popular and often include market visits."
            },
            {
                "name": "Cycling Along Berges du Rhône",
                "type": "Outdoor Activity",
                "description": "Rent a bicycle and explore Lyon's transformed riverbanks along the Rhône, enjoying the spring sunshine, outdoor cafés, and urban beaches.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers perfect temperatures for cycling with blooming trees and plants along the 5km promenade.",
                "booking_tips": "Use Vélo'v, Lyon's bike-sharing system, with stations throughout the city. Download the app for real-time availability and return locations."
            },
            {
                "name": "Les Nuits de Fourvière Preview Events",
                "type": "Cultural Event",
                "description": "Catch early season performances at the Roman theaters as the famous summer festival hosts preview events in the ancient amphitheaters overlooking Lyon.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Late spring brings the first performances before the main festival begins, with pleasant evening temperatures and fewer crowds.",
                "booking_tips": "Book tickets online as soon as they're released, as even preview events sell out quickly. Bring layers as evenings can turn cool in the open-air venue."
            },
            {
                "name": "Beaujolais Vineyard Tours",
                "type": "Food & Drink",
                "description": "Visit the nearby Beaujolais wine region when the vineyards are lush with new growth and the countryside is painted with spring wildflowers.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers stunning vineyard landscapes with fewer tourists than harvest season, plus the opportunity to taste newly bottled vintages.",
                "booking_tips": "Book a small-group tour with transportation from Lyon or take the regional train to Villefranche-sur-Saône and arrange vineyard visits from there."
            },
            {
                "name": "Printemps des Docks Design Fair",
                "type": "Exhibition",
                "description": "Explore this spring design festival showcasing contemporary creators, artisans, and designers in the converted La Sucrière warehouse space in Confluence.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "This March/April event highlights home decor, fashion, gastronomy, and lifestyle trends in a stylish industrial setting.",
                "booking_tips": "Purchase tickets online for a small discount and to avoid lines. The venue is easily accessible via tram from central Lyon."
            },
            {
                "name": "Urban Hike Through Traboules",
                "type": "Walking Tour",
                "description": "Discover Lyon's unique covered passageways (traboules) on a guided urban hike through Vieux Lyon and Croix-Rousse, learning about the city's silk-working history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers pleasant temperatures for walking tours with fewer tourists than summer months.",
                "booking_tips": "Book through the Tourist Office for the most comprehensive traboule access, as many of these passageways are within private buildings."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Les Nuits de Fourvière Festival",
                "type": "Cultural Event",
                "description": "Experience Lyon's premier summer festival in the ancient Roman theaters atop Fourvière Hill, featuring diverse performances from international music acts to theater, dance, and circus arts.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "This festival runs from June through July in the spectacular setting of Lyon's 2,000-year-old Roman amphitheaters.",
                "booking_tips": "Book tickets months in advance for popular acts. Arrive early to enjoy the sunset views over Lyon before performances begin."
            },
            {
                "name": "Riverside Guinguettes",
                "type": "Food & Drink",
                "description": "Enjoy Lyon's summer pop-up riverside bars (guinguettes) along both the Rhône and Saône rivers, with food, drinks, music, and dancing under the stars.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "These seasonal open-air venues operate only in summer months, creating a festive atmosphere along Lyon's riverbanks.",
                "booking_tips": "No reservations needed for most guinguettes, but arrive early evening to secure tables. La Terrasse de La Guillotière and La Commune are local favorites."
            },
            {
                "name": "Cruise the Saône and Rhône",
                "type": "Boat Tour",
                "description": "Take a river cruise through the heart of Lyon, viewing the city's architectural treasures from the water while learning about its 2,000-year history.",
                "indoor": false,
                "best_time": "Sunset",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings offer beautiful light for photography and pleasant temperatures for open-air deck viewing.",
                "booking_tips": "Book dinner cruises at least a week in advance. For standard sightseeing cruises, the 'Lyon City Boat' offers regular departures from various docks."
            },
            {
                "name": "Cinema Under the Stars",
                "type": "Cinema",
                "description": "Experience outdoor film screenings in various Lyon locations, from the ancient Roman theaters to riverside venues and park settings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free-Budget",
                "seasonal_notes": "Summer brings multiple open-air cinema events throughout the city, with both classic and contemporary films.",
                "booking_tips": "Check the Institut Lumière (birthplace of cinema) program for their summer screenings. Bring a blanket and arrive early for popular films."
            },
            {
                "name": "Tout Le Monde Dehors Festival",
                "type": "Festival",
                "description": "Participate in Lyon's summer-long outdoor festival featuring hundreds of free events throughout the city, from concerts and dance lessons to art installations and theatrical performances.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "From June to September, this festival animates parks, squares, and streets with daily activities for all ages.",
                "booking_tips": "No booking required for most events. Pick up a program from the Tourist Office or download the app to plan your activities."
            },
            {
                "name": "Gourmet Food Tour of Les Halles",
                "type": "Food & Drink",
                "description": "Explore Lyon's culinary heart at Les Halles de Lyon Paul Bocuse on a guided tasting tour through this famous indoor food market.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Summer brings seasonal fruits and vegetables but also provides a cool escape from the heat while sampling Lyon's gastronomic treasures.",
                "booking_tips": "Book small-group tours at least a week in advance. The market is closed Mondays, and vendors may take summer vacations in August."
            },
            {
                "name": "Vieux Lyon Renaissance Festival",
                "type": "Festival",
                "description": "Step back in time at this historical festival in Lyon's Renaissance quarter, featuring period costumes, music, crafts, and food that celebrate the city's 16th-century golden age.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This weekend festival in early summer transforms the old town with historical reenactments and authentic Renaissance atmosphere.",
                "booking_tips": "No booking required, but guided tours of normally closed Renaissance courtyards during the festival should be reserved in advance."
            },
            {
                "name": "Kayaking on the Rhône",
                "type": "Water Sport",
                "description": "Paddle through the heart of Lyon in a kayak or canoe, experiencing unique perspectives of the city's architecture and bridges from river level.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions with warm temperatures and generally calm river conditions, especially in the mornings.",
                "booking_tips": "Rent equipment at Lyon Kayak near the Confluence district or join guided tours that include safety equipment and instruction."
            },
            {
                "name": "Festival Woodstower",
                "type": "Music Festival",
                "description": "Enjoy this eco-responsible music festival at Grand Parc Miribel Jonage, combining outdoor concerts with lake swimming, nature activities, and sustainable initiatives.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Taking place in late August, this festival offers a perfect end-of-summer celebration in a beautiful natural setting.",
                "booking_tips": "Purchase tickets in advance and consider camping options if attending multiple days. Public transportation is available but limited late at night."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Lyon Street Food Festival",
                "type": "Food & Drink",
                "description": "Indulge in Lyon's largest food festival where renowned chefs, food trucks, and culinary artisans gather to showcase creative street food interpretations of both local and international cuisine.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "This September event highlights Lyon's gastronomic innovation in the atmospheric setting of former industrial spaces.",
                "booking_tips": "Purchase entry tickets online before arriving and buy food tokens once inside. Go early to avoid the longest lines at popular vendors."
            },
            {
                "name": "Beaujolais Nouveau Release",
                "type": "Food & Drink",
                "description": "Participate in the celebrated release of Beaujolais Nouveau wine on the third Thursday of November, with tastings and festivities throughout Lyon's bouchons and wine bars.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This famous French wine tradition is especially significant in Lyon given its proximity to the Beaujolais region.",
                "booking_tips": "Reserve tables at popular bouchons weeks in advance for the release night. Many venues offer special menus paired with the new vintage."
            },
            {
                "name": "Mushroom Foraging in Monts du Lyonnais",
                "type": "Outdoor Activity",
                "description": "Join expert guides for a mushroom hunting expedition in the forests around Lyon, learning to identify edible varieties like cèpes, chanterelles, and trompettes de la mort.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn rains create ideal conditions for wild mushrooms in the forests and mountains surrounding Lyon.",
                "booking_tips": "Book with certified guides who ensure safe foraging. Tours often include transportation from Lyon and a cooking demonstration with your findings."
            },
            {
                "name": "Festival Lumière",
                "type": "Film Festival",
                "description": "Celebrate cinema in the city where it was born at this major film festival named after the Lumière brothers, featuring classic film screenings, restorations, and tributes to major directors and actors.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This October festival brings film enthusiasts to Lyon with special screenings in historic venues including the original Lumière factory.",
                "booking_tips": "Book tickets for major events and retrospectives well in advance. The Lumière Award ceremony is a highlight attended by international film personalities."
            },
            {
                "name": "Salon du Chocolat Lyon",
                "type": "Food Event",
                "description": "Explore Lyon's chocolate fair featuring master chocolatiers, tastings, demonstrations, and chocolate fashion shows highlighting the art of fine chocolate.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "This November event coincides with the cooler autumn weather perfect for chocolate appreciation.",
                "booking_tips": "Purchase tickets online for faster entry. Attend workshops and demonstrations by registering upon arrival at the venue."
            },
            {
                "name": "Contemporary Art Biennale",
                "type": "Art Exhibition",
                "description": "Experience contemporary art installations throughout the city during Lyon's renowned Biennale of Contemporary Art, one of Europe's premier art events.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "This major art event takes place in odd-numbered years from September through January, transforming spaces throughout Lyon.",
                "booking_tips": "Purchase the Biennale pass for access to all venues. Major installations at La Sucrière and the Museum of Contemporary Art are highlights."
            },
            {
                "name": "Autumn Colors in Parc de la Tête d'Or",
                "type": "Outdoor Activity",
                "description": "Witness the spectacular autumn transformation of Lyon's largest park as its 8,000+ trees display vibrant fall colors around the lake and botanical garden.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Mid-October to early November typically offers the most dramatic color display before the leaves fall.",
                "booking_tips": "No booking required. The park is accessible from multiple gates with the Porte des Enfants du Rhône entrance convenient to the golden-hued tree collections."
            },
            {
                "name": "Cooking Class at Plum Lyon",
                "type": "Workshop",
                "description": "Learn to prepare autumn Lyonnaise specialties in an intimate cooking workshop in the Croix-Rousse district, focusing on seasonal market ingredients and traditional techniques.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn classes highlight game, mushrooms, and seasonal produce with dishes perfectly suited to cooler weather.",
                "booking_tips": "Classes are held in a traditional Lyon apartment and limited to 6-8 participants, so book several weeks in advance."
            },
            {
                "name": "Lyon Whisky Festival",
                "type": "Food & Drink",
                "description": "Sample fine whiskies from around the world at this specialized festival, with masterclasses, food pairings, and opportunities to meet distillers.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "This autumn event complements Lyon's cooler weather with warming spirits and expert-led tastings.",
                "booking_tips": "Purchase tickets in advance as sessions often sell out. Consider special masterclass tickets for in-depth experiences with specific distilleries."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Fête des Lumières (Festival of Lights)",
                "type": "Festival",
                "description": "Experience Lyon's world-famous light festival when the entire city becomes an open-air gallery of spectacular light installations, video projections, and artistic illuminations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This four-day festival in early December transforms Lyon's monuments, rivers, parks and streets with stunning light art viewed by millions.",
                "booking_tips": "Book accommodation months in advance. Follow suggested routes provided by the city to see the major installations and avoid the most crowded areas."
            },
            {
                "name": "Christmas Market at Place Carnot",
                "type": "Market",
                "description": "Wander through Lyon's traditional Christmas market with its wooden chalets offering festive foods, crafts, and seasonal specialties from across France and Europe.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "From late November through December, the market creates a magical winter atmosphere with lights, decorations, and seasonal treats.",
                "booking_tips": "Visit on weekday evenings to avoid the weekend crowds. Try Lyonnaise holiday specialties like papillotes (chocolate wrapped in colorful paper) and vin chaud (mulled wine)."
            },
            {
                "name": "Cooking Class at Institut Paul Bocuse",
                "type": "Workshop",
                "description": "Master the art of traditional Lyonnaise winter cuisine with a cooking workshop at the prestigious culinary school founded by Lyon's most celebrated chef.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Winter classes focus on hearty Lyonnaise classics like coq au vin, gratins, and festive desserts perfect for the season.",
                "booking_tips": "Book at least a month in advance, especially for December classes. Gift certificates are available for a unique Lyon souvenir."
            },
            {
                "name": "Ice Skating at Place Bellecour",
                "type": "Outdoor Activity",
                "description": "Glide on ice in Lyon's largest public square with the seasonal ice rink set up during winter months, surrounded by festive decorations and winter charm.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The rink typically operates from December through February, with special evening sessions featuring music and lights.",
                "booking_tips": "No advance booking required. Skate rental is available on site, but bring your own thick socks. Weekday mornings are least crowded."
            },
            {
                "name": "Salon du Chocolat Lyon",
                "type": "Food Event",
                "description": "Indulge in Lyon's winter chocolate festival featuring master chocolatiers, tastings, demonstrations, and chocolate fashion shows highlighting the art of fine chocolate.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "This February event provides a sweet escape during the winter months with warming chocolate creations.",
                "booking_tips": "Purchase tickets online for faster entry. Attend workshops and demonstrations by registering upon arrival at the venue."
            },
            {
                "name": "Museum Marathon",
                "type": "Cultural",
                "description": "Take advantage of Lyon's excellent museums during the winter months, using the Lyon City Card for access to the Museum of Fine Arts, Gallo-Roman Museum, and Confluence Museum.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is ideal for museum exploration with special exhibitions and fewer tourists than summer months.",
                "booking_tips": "Purchase the multi-day Lyon City Card for museum access plus public transportation. Many museums are closed on Tuesdays."
            },
            {
                "name": "Traditional Bouchon Experience",
                "type": "Food & Drink",
                "description": "Savor the ultimate Lyon winter comfort food experience in an authentic bouchon restaurant, enjoying hearty traditional specialties like pike quenelles, andouillette, and gratins.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season for Lyon's rich, warming traditional cuisine served in these historic restaurants.",
                "booking_tips": "Reserve at certified 'Authentic Bouchons Lyonnais' like Daniel et Denise or Café des Fédérations. Lunch offers the best value with set menus."
            },
            {
                "name": "Opera or Ballet at Opéra de Lyon",
                "type": "Performance",
                "description": "Attend a world-class opera or ballet performance at Lyon's stunning opera house, a renaissance exterior with a dramatically modern interior designed by Jean Nouvel.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "The winter season features classic productions and innovative performances in this internationally renowned venue.",
                "booking_tips": "Book tickets well in advance, especially for classic productions. Tours of the opera house are available during the day for those interested in the architecture."
            },
            {
                "name": "Wine Tasting in Vieux Lyon",
                "type": "Food & Drink",
                "description": "Escape the winter chill with a guided wine tasting in a historic cellar in Vieux Lyon, exploring the regions of Beaujolais, Côtes du Rhône, and Burgundy.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter evenings are perfect for discovering the rich red wines of the region in atmospheric historic settings.",
                "booking_tips": "Book specialized tastings at places like La Cave des Voyageurs or Copper Lyon offering expert guidance through regional vintages."
            }
        ]
    }
}