{
    "Spring": {
        "activities": [
            {
                "name": "Easter Processions and Religious Celebrations",
                "type": "Religious Festival",
                "description": "Experience traditional Easter celebrations in Avignon's historic churches, including special masses at Cathédrale Notre-Dame des Doms and beautiful processions through the medieval streets.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings beautiful weather for outdoor religious celebrations. The medieval atmosphere enhances the spiritual experience.",
                "booking_tips": "Check church schedules for special Easter services. Arrive early for processions. Respectful attire required."
            },
            {
                "name": "Provençal Market Season Opening",
                "type": "Market Experience",
                "description": "Welcome the spring season at Les Halles d'Avignon with fresh local produce, spring vegetables, Provençal herbs, and the first local strawberries and asparagus.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the best selection of fresh local produce. Market is most vibrant on Tuesday, Thursday, and Saturday mornings.",
                "booking_tips": "Arrive early for best selection. Bring a basket and try free samples. Practice basic French phrases for better interaction with vendors."
            },
            {
                "name": "Palais des Papes Spring Tours",
                "type": "Historical Tour",
                "description": "Explore the papal palace in perfect spring weather with comfortable temperatures for walking through the grand halls and gardens. Spring light enhances the medieval architecture.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Comfortable temperatures make this ideal season for exploring the palace. Spring crowds are manageable before summer tourism peaks.",
                "booking_tips": "Book guided tours in advance or use audio guides. Combine with visits to the cathedral and Rocher des Doms."
            },
            {
                "name": "Rhône River Promenade Walks",
                "type": "Outdoor Activity",
                "description": "Enjoy peaceful walks along the Rhône River with beautiful spring views of the city, blooming trees, and the opportunity to see the famous Pont d'Avignon from different angles.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Perfect spring weather with mild temperatures and beautiful blossoms. River views are spectacular in the soft spring light.",
                "booking_tips": "Start from Rocher des Doms and walk along the riverbanks. Bring camera for beautiful spring photography opportunities."
            },
            {
                "name": "Provençal Cooking Classes with Spring Ingredients",
                "type": "Culinary Workshop",
                "description": "Learn to prepare traditional Provençal dishes using spring ingredients like fresh herbs, young vegetables, and local cheeses in authentic cooking workshops.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring provides the best seasonal ingredients for authentic Provençal cuisine. Perfect time to learn about local culinary traditions.",
                "booking_tips": "Book in advance with local cooking schools. Often includes market visits and full meal. Great for rainy spring days."
            },
            {
                "name": "Medieval Ramparts Photography",
                "type": "Photography",
                "description": "Capture stunning spring landscapes from Avignon's medieval ramparts, with beautiful views of the city, Rhône River, and surrounding Provençal countryside.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Spring light provides excellent photography conditions. Wildflowers bloom along the ramparts and city walls.",
                "booking_tips": "Best light is 1-2 hours before sunset. Bring tripod for long exposures. Access ramparts from multiple points around the city."
            },
            {
                "name": "Truffle Hunting in Provence",
                "type": "Culinary Experience",
                "description": "Join guided truffle hunting expeditions in the Provençal countryside, learning about this prized ingredient and enjoying truffle-based meals.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring truffle season offers unique opportunities to experience this Provençal tradition. Perfect weather for outdoor activities.",
                "booking_tips": "Book with specialized tour operators. Often includes transportation and gourmet lunch. Limited availability - book well in advance."
            },
            {
                "name": "Garden Tours at Rocher des Doms",
                "type": "Nature Activity",
                "description": "Explore the beautiful spring gardens at Rocher des Doms with blooming Mediterranean plants, panoramic city views, and peaceful walking paths.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings beautiful flowers and mild temperatures perfect for garden exploration. Gardens are less crowded than in summer.",
                "booking_tips": "Visit early morning for best light and peaceful atmosphere. Bring water and comfortable walking shoes."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Festival d'Avignon",
                "type": "Cultural Festival",
                "description": "Experience the world-famous Festival d'Avignon, one of Europe's largest performing arts festivals, featuring theater, dance, and music performances throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The highlight of Avignon's cultural calendar, transforming the city into a vibrant arts hub. Performances in historic venues and outdoor spaces.",
                "booking_tips": "Book tickets and accommodation well in advance. Festival runs July-August. Many free street performances available."
            },
            {
                "name": "Avignon OFF Festival",
                "type": "Alternative Arts Festival",
                "description": "Discover emerging artists and experimental performances at the OFF Festival, running parallel to the main festival with hundreds of shows in intimate venues.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Perfect summer activity with air-conditioned venues. Great opportunity to see cutting-edge performances at affordable prices.",
                "booking_tips": "Pick up the OFF program guide. Many shows offer last-minute tickets. Great for discovering new talent."
            },
            {
                "name": "Evening Ramparts Walks",
                "type": "Cultural Activity",
                "description": "Enjoy magical evening walks along the medieval ramparts as the city cools down, with beautiful sunset views and illuminated palace views.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings provide pleasant temperatures for walking. The illuminated palace creates a magical atmosphere.",
                "booking_tips": "Start walking after sunset for cooler temperatures. Bring water and comfortable shoes. Multiple access points around the city."
            },
            {
                "name": "Rhône River Sunset Cruises",
                "type": "Boat Tour",
                "description": "Experience Avignon from the water on evening river cruises, offering unique perspectives of the palace, bridge, and city skyline during golden hour.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular sunsets and calm river conditions. Perfect for romantic evenings and photography.",
                "booking_tips": "Book sunset cruises well in advance during peak season. Bring camera and light jacket for evening return."
            },
            {
                "name": "Provençal Market Shopping",
                "type": "Cultural Experience",
                "description": "Experience the vibrant summer markets with fresh local produce, Provençal specialties, and the opportunity to shop alongside locals in the morning coolness.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer offers the best selection of local produce and seasonal specialties. Morning markets provide relief from afternoon heat.",
                "booking_tips": "Visit early morning for best selection and cooler temperatures. Try local summer specialties like melons and fresh herbs."
            },
            {
                "name": "Palace Gardens Evening Concerts",
                "type": "Music Experience",
                "description": "Enjoy classical and contemporary music performances in the beautiful palace gardens, combining culture with the magical summer atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings provide perfect weather for outdoor concerts. The historic setting enhances the musical experience.",
                "booking_tips": "Check palace event calendar. Bring light jacket for evening coolness. Some events require advance booking."
            },
            {
                "name": "Provençal Wine Tasting",
                "type": "Wine Experience",
                "description": "Visit local vineyards in the Rhône Valley to taste Châteauneuf-du-Pape and other regional wines, learning about Provençal winemaking traditions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer harvest season offers insights into winemaking process. Indoor tastings provide relief from afternoon heat.",
                "booking_tips": "Book vineyard tours in advance. Often includes transportation and food pairings. Designated driver required."
            },
            {
                "name": "Medieval Street Performances",
                "type": "Street Entertainment",
                "description": "Experience the vibrant street culture during summer months, with musicians, performers, and artists bringing the medieval streets to life.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer brings the most street performers and cultural activities. The medieval atmosphere enhances the entertainment experience.",
                "booking_tips": "No booking needed. Best performances in Place de l'Horloge and around the palace. Support artists with tips."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Truffle Season Culinary Experiences",
                "type": "Culinary Festival",
                "description": "Celebrate the start of truffle season with special menus at local restaurants, truffle markets, and culinary events throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn marks the beginning of truffle season in Provence. Many restaurants offer special truffle menus and tastings.",
                "booking_tips": "Reserve at restaurants known for truffle dishes. Check for special truffle events and markets. Best paired with local wines."
            },
            {
                "name": "Palais des Papes Autumn Tours",
                "type": "Museum",
                "description": "Explore the papal palace in comfortable autumn weather with fewer crowds, allowing deeper appreciation of the medieval architecture and history.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Cooler autumn temperatures make indoor cultural activities more appealing. Fewer crowds than summer months.",
                "booking_tips": "Check for special autumn exhibitions. Guided tours available. Combine with visit to nearby museums and churches."
            },
            {
                "name": "Provençal Olive Harvest Experience",
                "type": "Agricultural Experience",
                "description": "Join local olive groves during harvest season to pick olives and learn about traditional Provençal olive oil production.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September to November is olive harvest season. Experience authentic agricultural traditions and seasonal rhythms.",
                "booking_tips": "Contact local olive groves directly. Often includes meals and olive oil tasting. Advance booking essential."
            },
            {
                "name": "Rhône Valley Hiking",
                "type": "Outdoor Activity",
                "description": "Enjoy perfect hiking weather to explore the beautiful countryside around Avignon, with stunning views of the Rhône Valley and Provençal landscapes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Ideal hiking temperatures without summer heat. Crystal clear autumn air provides spectacular views of the valley.",
                "booking_tips": "Join guided hiking groups or create your own routes. Bring camera and comfortable hiking shoes. Check weather conditions."
            },
            {
                "name": "Autumn Market Specialties",
                "type": "Market Experience",
                "description": "Discover autumn specialties at Les Halles, including seasonal mushrooms, chestnuts, game meats, and preserved foods for winter.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings unique seasonal products and traditional preserved foods. Market atmosphere is more relaxed than summer.",
                "booking_tips": "Visit early morning for best selection. Ask vendors about seasonal specialties. Great time to stock up on local products."
            },
            {
                "name": "Storm Watching from Rocher des Doms",
                "type": "Natural Phenomenon",
                "description": "Experience dramatic autumn storms and weather from the elevated position of Rocher des Doms, watching powerful weather patterns over the Rhône Valley.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings more dramatic weather and spectacular storm watching opportunities. Impressive cloud formations over the valley.",
                "booking_tips": "Check weather conditions for safety. Best during windy days. Dress warmly and bring rain protection."
            },
            {
                "name": "Traditional Craft Workshops",
                "type": "Cultural Workshop",
                "description": "Learn traditional Provençal crafts like pottery, textile work, or olive wood carving from local artisans in preparation for the holiday season.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is perfect for learning indoor crafts. Many artisans offer workshops as tourist season winds down.",
                "booking_tips": "Book with local artisan associations. Often includes take-home pieces. Great for unique souvenirs."
            },
            {
                "name": "Mushroom Foraging in Provence",
                "type": "Nature Activity",
                "description": "Join guided foraging trips to discover edible mushrooms in Provençal forests, learning about local varieties and traditional uses.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Peak mushroom season in Provençal forests. Important part of traditional Provençal cuisine and culture.",
                "booking_tips": "Must join guided tours for safety. Often includes cooking session. Check weather for recent rain."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Market in Place de l'Horloge",
                "type": "Holiday Market",
                "description": "Browse the charming Christmas market featuring local Provençal crafts, seasonal treats, and holiday decorations in the heart of historic Avignon.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Brings festive warmth to winter evenings. Features unique Provençal holiday traditions and locally made gifts.",
                "booking_tips": "No booking required. Best atmosphere in evening when lights are on. Try local holiday specialties like calissons."
            },
            {
                "name": "Indoor Museum Marathon",
                "type": "Cultural Activity",
                "description": "Spend winter days exploring Avignon's excellent museums including Palais des Papes, Musée du Petit Palais, and Musée Calvet during cooler weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect weather for indoor cultural exploration. Museums are less crowded and offer deeper exploration opportunities.",
                "booking_tips": "Consider museum passes for multiple visits. Many offer guided tours. Combine with café stops for warmth."
            },
            {
                "name": "Traditional Provençal Winter Meals",
                "type": "Culinary Experience",
                "description": "Enjoy hearty winter meals featuring daube Provençale, truffle dishes, and other traditional Provençal winter foods in cozy local restaurants.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Peak season for traditional winter foods. Truffle season provides unique culinary opportunities.",
                "booking_tips": "Reserve at traditional restaurants. Try pairing with aged Provençal cheeses and local Rhône wines."
            },
            {
                "name": "Palace Winter Tours",
                "type": "Historical Experience",
                "description": "Experience the papal palace in winter atmosphere with fewer crowds, allowing intimate exploration of the medieval architecture and papal history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides peaceful exploration of the palace. The medieval atmosphere is enhanced by cooler temperatures.",
                "booking_tips": "Book guided tours for deeper historical insights. Combine with visits to the cathedral and nearby churches."
            },
            {
                "name": "Provençal Wine Bar Evenings",
                "type": "Social Activity",
                "description": "Warm up in traditional wine bars with local Rhône Valley vintages, charcuterie platters, and the company of locals during long winter evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect season for indoor socializing. Wine bars offer warmth, local atmosphere, and seasonal food pairings.",
                "booking_tips": "No reservations usually needed. Learn basic French phrases for better interaction. Try different neighborhoods for variety."
            },
            {
                "name": "Winter Photography in Medieval Streets",
                "type": "Photography",
                "description": "Capture dramatic winter scenes in Avignon's medieval streets, with moody lighting, historic architecture, and atmospheric winter atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and atmospheric conditions perfect for photography. Fewer tourists allow for better compositions.",
                "booking_tips": "Dress warmly and protect camera equipment. Best after storms when light is dramatic. Check weather conditions."
            },
            {
                "name": "Traditional Provençal Cooking Classes",
                "type": "Culinary Workshop",
                "description": "Learn to prepare hearty winter Provençal dishes using seasonal ingredients like truffles, game meats, and preserved foods.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Winter is perfect for learning hearty Provençal cuisine. Indoor cooking provides warmth and comfort.",
                "booking_tips": "Book with local cooking schools. Often includes market visits and full meal. Great for cold winter days."
            },
            {
                "name": "Cozy Café Culture",
                "type": "Cultural Experience",
                "description": "Experience authentic Provençal café culture in winter, enjoying coffee, pastries, and local atmosphere in historic cafés around the city.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter provides perfect atmosphere for café culture. Historic cafés offer warmth and authentic local experience.",
                "booking_tips": "Visit traditional cafés like Café de la Paix. Try local winter specialties and warm drinks. Great for people-watching."
            }
        ]
    }
}