{
    "sites": [
      {
        "name": "Palais des Papes",
        "type": "Palace",
        "description": "The largest Gothic palace in Europe, this UNESCO World Heritage site was the residence of the Popes during the 14th century when Avignon was the center of Christianity. The massive fortress-palace features stunning frescoes, grand halls, and offers breathtaking views over the city and Rhône River.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "High",
        "seasonal_notes": "Less crowded during weekday mornings. Summer can be very hot inside - early morning visits recommended. Winter offers comfortable temperatures for exploration.",
        "booking_tips": "Purchase tickets online to avoid queues. Audio guides available in multiple languages. Combined tickets with other sites available.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 5
        },
        "latitude": 43.9508,
        "longitude": 4.8083
      },
      {
        "name": "Pont d'Avignon (Pont Saint-Bénézet)",
        "type": "Bridge",
        "description": "Famous bridge immortalized in the children's song 'Sur le pont d'Avignon.' This medieval bridge, built in the 12th century, once spanned the Rhône River but was partially destroyed by floods. Today, visitors can walk on the remaining four arches and learn about its fascinating history.",
        "indoor": false,
        "best_time": "Sunset",
        "price_range": "Moderate",
        "seasonal_notes": "Beautiful sunset views year-round. Can be windy during winter months. Summer evenings offer pleasant temperatures for walking.",
        "booking_tips": "Combined tickets with Palais des Papes available. Audio guide included with admission. Photography allowed.",
        "ratings": {
          "cost_estimate": 5,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 43.9519,
        "longitude": 4.8083
      },
      {
        "name": "Cathédrale Notre-Dame des Doms",
        "type": "Cathedral",
        "description": "This Romanesque cathedral, built in the 12th century, stands majestically above the Palais des Papes. The cathedral features a golden statue of the Virgin Mary on its bell tower, beautiful frescoes, and houses the tombs of several popes. The panoramic views from the terrace are spectacular.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Peaceful atmosphere in early morning hours. Special masses and religious ceremonies throughout the year. Terrace access may be weather-dependent.",
        "booking_tips": "Free entry to cathedral. Terrace access requires separate ticket. Respectful attire required.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 43.9508,
        "longitude": 4.8083
      },
      {
        "name": "Rocher des Doms",
        "type": "Garden",
        "description": "A beautiful public garden perched on a rocky outcrop above the city, offering spectacular panoramic views of Avignon, the Rhône River, and the surrounding countryside. The garden features Mediterranean vegetation, walking paths, and is perfect for a peaceful stroll or picnic.",
        "indoor": false,
        "best_time": "Sunset",
        "price_range": "Free",
        "seasonal_notes": "Stunning sunset views year-round. Spring offers beautiful flowers. Summer can be hot - evening visits recommended. Winter provides crisp, clear views.",
        "booking_tips": "Free access. Bring water and comfortable shoes. Great spot for photography, especially during golden hour.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.9512,
        "longitude": 4.8087
      },
      {
        "name": "Place de l'Horloge",
        "type": "Square",
        "description": "The heart of Avignon's old town, this lively square is surrounded by historic buildings, cafes, and restaurants. The square features a beautiful 19th-century clock tower and is the perfect place to experience local life, enjoy a coffee, or watch street performers.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most vibrant during summer evenings with outdoor dining and street performances. Winter offers cozy indoor café experiences. Year-round local atmosphere.",
        "booking_tips": "No booking required. Great for people-watching and enjoying Provençal café culture. Restaurant reservations recommended during peak season.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Musée du Petit Palais",
        "type": "Museum",
        "description": "Housed in a beautiful 14th-century palace, this museum showcases an exceptional collection of medieval and Renaissance art, including works by Botticelli, Carpaccio, and other Italian masters. The building itself is a masterpiece of Gothic architecture.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Climate-controlled environment perfect for hot summer days. Special exhibitions rotate seasonally. Less crowded during weekday afternoons.",
        "booking_tips": "Combined tickets with other museums available. Audio guides recommended. Student discounts available.",
        "ratings": {
          "cost_estimate": 6,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 43.9508,
        "longitude": 4.8083
      },
      {
        "name": "Les Halles d'Avignon",
        "type": "Market",
        "description": "A covered market hall featuring the best of Provençal gastronomy. The market offers fresh local produce, cheeses, charcuterie, olive oils, wines, and regional specialties. It's perfect for discovering local flavors and picking up picnic supplies.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Varies",
        "seasonal_notes": "Best selection early in the morning. Summer offers more fresh produce and local specialties. Some stalls close during lunch hours.",
        "booking_tips": "No booking required. Bring cash for smaller vendors. Try free samples of local products. Great for food photography.",
        "ratings": {
          "cost_estimate": 20,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Rue des Teinturiers",
        "type": "Historic Street",
        "description": "A charming cobblestone street along the Sorgue River, once home to Avignon's textile dyers. The street features historic water wheels, art galleries, boutiques, and cafes. It's perfect for a leisurely stroll and discovering local artisans.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Beautiful year-round. Spring and autumn offer pleasant temperatures for walking. Summer can be hot - afternoon visits with café stops recommended.",
        "booking_tips": "No booking required. Allow time to explore galleries and boutiques. Great for unique souvenirs and local art.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.9489,
        "longitude": 4.8056
      },
      {
        "name": "Basilique Saint-Pierre d'Avignon",
        "type": "Basilica",
        "description": "This beautiful Gothic basilica, built in the 14th century, features stunning architecture and houses important religious artifacts. The church is known for its elaborate carved wooden doors and beautiful interior decoration.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Peaceful atmosphere for reflection. Check local calendar for special masses and cultural events. Beautiful light through stained glass windows.",
        "booking_tips": "Free entry. Respectful attire required. Photography allowed (without flash).",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Jardin des Doms",
        "type": "Garden",
        "description": "A peaceful garden area adjacent to the Rocher des Doms, featuring Mediterranean plants, shaded walking paths, and beautiful viewpoints. The garden offers a perfect escape from the city's bustle and excellent photo opportunities.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Spring offers beautiful flowers and mild temperatures. Summer mornings are pleasant before the heat. Autumn provides beautiful colors. Year-round peaceful atmosphere.",
        "booking_tips": "Free access. Bring water and comfortable shoes. Great for bird watching and nature photography.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 3
        },
        "latitude": 43.9512,
        "longitude": 4.8087
      },
      {
        "name": "Musée Calvet",
        "type": "Museum",
        "description": "This fine arts museum houses an impressive collection of paintings, sculptures, and decorative arts from the 15th to 20th centuries. The collection includes works by French, Italian, and Flemish masters in a beautiful 18th-century mansion.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Climate-controlled environment perfect for hot summer days. Special exhibitions rotate seasonally. Less crowded during weekday afternoons.",
        "booking_tips": "Combined tickets with other museums available. Audio guides recommended. Free entry on first Sunday of each month.",
        "ratings": {
          "cost_estimate": 6,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Remparts d'Avignon",
        "type": "City Walls",
        "description": "The well-preserved medieval city walls, built in the 14th century, encircle the historic center of Avignon. Walking along the ramparts offers unique perspectives of the city and beautiful views. Several gates provide access to different parts of the old town.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Beautiful sunset views year-round. Summer evenings offer pleasant temperatures. Winter provides crisp, clear views of the city.",
        "booking_tips": "Free access. Wear comfortable walking shoes. Great for photography and understanding the city's medieval layout.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.9508,
        "longitude": 4.8083
      },
      {
        "name": "Place du Palais",
        "type": "Square",
        "description": "The grand square in front of the Palais des Papes, offering spectacular views of the palace facade. This historic square has witnessed centuries of papal ceremonies and is the perfect starting point for exploring Avignon's most important sites.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Best lighting for photography in the morning. Summer can be very hot - early visits recommended. Winter offers comfortable temperatures for exploration.",
        "booking_tips": "No booking required. Great for photography and understanding the scale of the palace. Combine with palace visit.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4
        },
        "latitude": 43.9508,
        "longitude": 4.8083
      },
      {
        "name": "Église Saint-Agricol",
        "type": "Church",
        "description": "A beautiful 14th-century church in the heart of Avignon's old town, featuring Gothic architecture and important religious artwork. The church is known for its beautiful stained glass windows and peaceful atmosphere.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Peaceful atmosphere for reflection. Beautiful light through stained glass windows. Check local calendar for special masses.",
        "booking_tips": "Free entry. Respectful attire required. Photography allowed (without flash).",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 3
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Promenade de la Durance",
        "type": "Promenade",
        "description": "A scenic walking path along the Durance River, offering beautiful views of the surrounding countryside and a peaceful escape from the city center. The promenade is popular with locals for walking, jogging, and enjoying nature.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Perfect for evening strolls year-round. Spring and autumn offer beautiful colors. Summer evenings provide pleasant temperatures.",
        "booking_tips": "No booking required. Bring comfortable walking shoes. Great for bird watching and nature photography.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3
        },
        "latitude": 43.9489,
        "longitude": 4.8056
      },
      {
        "name": "Musée Angladon",
        "type": "Museum",
        "description": "A small but charming museum housed in a beautiful 18th-century mansion, featuring a collection of Impressionist and Post-Impressionist paintings. The museum includes works by Van Gogh, Cézanne, and other notable artists in an intimate setting.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Climate-controlled environment perfect for hot summer days. Intimate setting allows for close viewing of artworks. Less crowded than larger museums.",
        "booking_tips": "Combined tickets with other museums available. Audio guides recommended. Photography restrictions apply.",
        "ratings": {
          "cost_estimate": 6,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Place Pie",
        "type": "Square",
        "description": "A lively square in the heart of Avignon's old town, surrounded by historic buildings, cafes, and shops. The square is perfect for experiencing local life and enjoying the Provençal atmosphere.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most vibrant during summer evenings with outdoor dining. Winter offers cozy indoor café experiences. Year-round local atmosphere.",
        "booking_tips": "No booking required. Great for people-watching and enjoying local culture. Restaurant reservations recommended during peak season.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 3
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      },
      {
        "name": "Chapelle des Pénitents Gris",
        "type": "Chapel",
        "description": "A beautiful 17th-century chapel featuring Baroque architecture and important religious artwork. The chapel is known for its beautiful interior decoration and peaceful atmosphere.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Peaceful atmosphere for reflection. Beautiful light through windows. Check local calendar for special masses and events.",
        "booking_tips": "Free entry. Respectful attire required. Photography allowed (without flash).",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 3
        },
        "latitude": 43.9497,
        "longitude": 4.8064
      }
    ]
  }