{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather",
                "details": "April in Porto offers mild temperatures (averaging 17-19°C) and increasing sunshine, ideal for exploring the Ribeira district, Vila Nova de Gaia cellars, and the Douro riverfront before summer crowds arrive."
            },
            {
                "reason": "Blooming Gardens",
                "details": "Enjoy the spring blooms in Porto's beautiful gardens, such as the Crystal Palace Gardens (Jardins do Palácio de Cristal) and the Serralves Park, offering colourful displays and scenic walks."
            },
            {
                "reason": "Easter & Freedom Day Celebrations",
                "details": "Experience traditional Portuguese Easter celebrations if they fall in April, and witness the national holiday, Freedom Day (Dia da Liberdade) on April 25th, commemorating the Carnation Revolution."
            },
            {
                "reason": "Fewer Crowds than Summer",
                "details": "Explore iconic landmarks like the Dom Luís I Bridge, Clérigos Church, and Livraria Lello with relatively fewer tourists compared to the peak summer season."
            },
            {
                "reason": "Port Wine Experiences",
                "details": "The cooler weather is perfect for cozy Port wine tastings in the cellars of Vila Nova de Gaia across the river, which are generally less crowded than in summer."
            },
            {
                "reason": "Douro River Activities",
                "details": "Enjoy scenic walks along the Douro, take a traditional Rabelo boat cruise (Six Bridges Cruise), or even venture on a day trip into the budding Douro Valley."
            },
            {
                "reason": "Vibrant Atmosphere",
                "details": "Porto buzzes with a renewed energy in spring, with outdoor cafes in Ribeira filling up and a general sense of anticipation for the warmer months."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Higher Chance of Rain",
                "details": "April is one of Porto's wetter months compared to Lisbon. Expect spring showers and pack accordingly with a waterproof jacket and umbrella."
            },
            {
                "reason": "Easter Holiday Crowds & Closures",
                "details": "If Easter falls in April, anticipate larger crowds, higher accommodation prices, and potential closures of some shops or attractions, particularly on Good Friday and Easter Sunday."
            },
            {
                "reason": "Freedom Day Closures",
                "details": "April 25th (Freedom Day) is a major public holiday. Banks, post offices, and many businesses will close. Most tourist sites and restaurants remain open, but public transport operates on a holiday schedule."
            },
            {
                "reason": "Variable Temperatures",
                "details": "While daytime can be pleasant, mornings and evenings remain cool. Layering clothing is essential for comfort throughout the day."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "9°C"
                },
                "precipitation": "Moderate to high chance of rain, averaging around 100mm for the month, often spread across 10-12 days. Sunshine hours are increasing.",
                "general_tips": "Pack layers, including sweaters and a waterproof jacket. An umbrella is highly recommended. Comfortable, water-resistant walking shoes are crucial for Porto's hills and potentially wet cobblestones."
            },
            "tourism_level": {
                "crowds": "Moderate shoulder season crowds. Busier if Easter falls within this period.",
                "pricing": "Mid-range, rising slightly around Easter.",
                "overall_atmosphere": "Pleasantly awakening spring vibe. Ribeira starts getting lively, but still comfortable to explore."
            },
            "events_holidays": [
                {
                    "name": "Easter Celebrations (Semana Santa)",
                    "date": "Varies (can fall in early April)",
                    "description": "Religious observances, special church services, and traditional Easter foods like 'Folar da Páscoa'. Porto's celebrations might include specific local traditions or processions.",
                    "notes": "Good Friday may see some business closures. Accommodation prices can increase."
                },
                {
                    "name": "Local Markets & Fairs",
                    "date": "Various weekends",
                    "description": "Check for local craft markets or food fairs that often pop up in squares like Praça de Carlos Alberto as the weather improves.",
                    "notes": "Good opportunity to find local crafts and produce."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Ribeira District",
                    "where": "Ribeira",
                    "description": "Wander the UNESCO World Heritage site along the Douro riverfront, admiring colourful medieval buildings, narrow streets, and lively cafes.",
                    "practical_tips": "Wear comfortable shoes for cobblestones; enjoy people-watching from a cafe; explore the backstreets.",
                    "best_time": "Anytime, particularly lively late afternoon/evening",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Across Dom Luís I Bridge",
                    "where": "Connects Porto & Vila Nova de Gaia",
                    "description": "Walk across the iconic two-level metal bridge designed by a disciple of Eiffel. Use the upper level for stunning panoramic views of Porto and Gaia.",
                    "practical_tips": "Upper level is shared with Metro; lower level for cars and pedestrians. Free to walk.",
                    "best_time": "Daytime for clarity, sunset for atmosphere",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Port Wine Cellar Tour & Tasting",
                    "where": "Vila Nova de Gaia",
                    "description": "Cross the bridge to Gaia and visit one of the famous Port wine cellars (e.g., Cálem, Sandeman, Taylor's) for a tour explaining the process and a tasting.",
                    "practical_tips": "Book tours in advance, especially for popular cellars; different cellars offer varied experiences and price points.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit São Francisco Church (Igreja de São Francisco)",
                    "where": "Near Ribeira",
                    "description": "Marvel at the incredibly ornate Baroque interior, almost entirely covered in gilded wood carvings. A striking contrast to its Gothic exterior.",
                    "practical_tips": "Small entrance fee; photography often restricted inside; includes visit to catacombs.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "11°C"
                },
                "precipitation": "Still a chance of showers, but often interspersed with longer sunny periods. Days feel noticeably warmer.",
                "general_tips": "Continue layering, but lighter options may suffice during sunny afternoons. Keep waterproofs handy. Sunscreen might be needed."
            },
            "tourism_level": {
                "crowds": "Moderate to High, increasing towards May. Noticeably busy around Freedom Day (April 25th).",
                "pricing": "Mid-range, potential peak around the public holiday.",
                "overall_atmosphere": "Full spring swing. City feels vibrant, outdoor spaces well-utilized, good energy for exploring."
            },
            "events_holidays": [
                {
                    "name": "Freedom Day (Dia da Liberdade)",
                    "date": "April 25",
                    "description": "National holiday commemorating the 1974 Carnation Revolution. Expect official ceremonies, potential parades (check local listings, often near Avenida dos Aliados), concerts, and political gatherings.",
                    "notes": "Public holiday: banks, schools, many shops closed. Main attractions usually open. Public transport runs on holiday schedule."
                },
                {
                    "name": "Serralves em Festa (Preparations/Early Events)",
                    "date": "Main event usually later, but check for early activities/exhibitions",
                    "description": "While the main free 40-hour cultural festival is typically in late May/early June, check Serralves Foundation's schedule for related exhibitions or events starting in late April.",
                    "notes": "Check Serralves website for specifics."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Climb Clérigos Tower (Torre dos Clérigos)",
                    "where": "Near Livraria Lello",
                    "description": "Climb the 240 steps of Porto's iconic baroque bell tower for breathtaking 360-degree views of the city and the Douro River.",
                    "practical_tips": "Narrow staircase; can get crowded, buy tickets online or go early/late; ticket includes church museum visit.",
                    "best_time": "Clear days for best views, avoid midday crowds",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Livraria Lello",
                    "where": "Near Clérigos Tower",
                    "description": "Explore one of the world's most beautiful bookstores, famed for its stunning neo-Gothic interior, red staircase, and stained-glass ceiling (rumored Harry Potter inspiration).",
                    "practical_tips": "Requires purchasing a voucher (redeemable against book purchase); often very crowded, book timed entry online well in advance.",
                    "best_time": "Opening time or late afternoon",
                    "estimated_cost": "Low (voucher cost)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Six Bridges Cruise (Cruzeiro das Seis Pontes)",
                    "where": "Departs from Ribeira or Gaia quay",
                    "description": "Take a relaxing ~50-minute boat trip on the Douro River, passing under Porto's six distinctive bridges and offering great views of the city skyline.",
                    "practical_tips": "Multiple companies offer tours; book ahead or buy at the quay; can be cool on the water, bring a jacket.",
                    "best_time": "Anytime, sunset cruises popular",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Foz do Douro",
                    "where": "Western Porto, where Douro meets Atlantic",
                    "description": "Take a tram (Line 1) or bus to the coast. Walk along the promenade (Pérgola da Foz), see the Felgueiras Lighthouse, and enjoy the sea air and seaside cafes.",
                    "practical_tips": "Can be windy; pleasant walk or bike ride from Ribeira along the river.",
                    "best_time": "Sunny afternoon",
                    "estimated_cost": "Low (transport cost)",
                    "weather_dependent": true
                }
            ]
        }
    }
}