{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Lowest Crowds & Best Value",
                "details": "February is Porto's deep low season. Enjoy iconic sights like the Clérigos Tower, Livraria Lello, and Ribeira district with virtually no queues and find the best deals on flights and accommodation."
            },
            {
                "reason": "Cool but Tolerable Weather",
                "details": "Expect cool, damp weather (avg. 14°C high), but it's often milder than inland Europe. Dry, sunny spells offer comfortable conditions for exploring."
            },
            {
                "reason": "Carnival (Carnaval) Atmosphere",
                "details": "If Carnival falls in February, Porto has its own celebrations, often more traditional and local than Lisbon, including parades, costumes, and festive food. Nearby towns like Ovar have famous Carnival traditions."
            },
            {
                "reason": "Cozy Indoor Activities",
                "details": "Ideal month for exploring Porto's indoor treasures: Port wine cellars in Gaia, Soares dos Reis National Museum, Bolsa Palace, São Francisco Church, and cozying up in historic cafes like Majestic."
            },
            {
                "reason": "Authentic Porto Experience",
                "details": "With fewer tourists, experience the city's true rhythm. Enjoy the calmer atmosphere in Ribeira, wander through Bolhão Market (temporary location or renovated original), and interact more with locals."
            },
             {
                "reason": "Essência do Vinho Wine Fair",
                "details": "Often held in late February at the Palácio da Bolsa, this major wine event showcases hundreds of Portuguese wines, offering tastings and masterclasses (check dates)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "High Likelihood of Rain",
                "details": "February remains one of Porto's wettest months. Expect frequent rain, potentially heavy at times, requiring good waterproofs and flexibility."
            },
            {
                "reason": "Cool and Damp Conditions",
                "details": "Winter chill persists, especially evenings and nights (avg. 6°C low). Humidity can make it feel colder. Good heating in accommodation is crucial."
            },
            {
                "reason": "Shorter Daylight Hours",
                "details": "Daylight is still limited (sunrise ~7:30 AM, sunset ~6:30 PM by end of month), reducing time for outdoor photography and sightseeing."
            },
            {
                "reason": "Limited River/Beach Activities",
                "details": "Douro river cruises may operate on reduced schedules or require minimum numbers. Beach visits are bracing rather than relaxing."
            },
            {
                "reason": "Carnival Closures (if applicable)",
                "details": "If Carnival occurs, Shrove Tuesday may see some local business closures, though it's not a public holiday. Parades can cause temporary street blockages."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "14°C",
                    "low": "6°C"
                },
                "precipitation": "Frequent rain likely, averaging 110-130mm over 12-14 days. Can range from drizzle to heavy showers, with occasional sunny breaks.",
                "general_tips": "Pack warm layers (fleece, sweaters), a reliable waterproof and windproof coat, umbrella, scarf, hat, gloves, and waterproof shoes suitable for wet cobblestones."
            },
            "tourism_level": {
                "crowds": "Very low. Likely the quietest time to visit Porto's main attractions.",
                "pricing": "Lowest prices of the year for flights and accommodation.",
                "overall_atmosphere": "Quiet, somewhat sleepy. Perfect for those seeking a calm city break focused on indoor culture and local life."
            },
            "events_holidays": [
                {
                    "name": "Valentine's Day (Dia dos Namorados)",
                    "date": "February 14",
                    "description": "Similar observances to elsewhere. Porto's romantic setting makes it popular for couples. Restaurants offer special menus.",
                    "notes": "Book desirable restaurants well in advance. Not a public holiday."
                },
                 {
                    "name": "Carnival Preparations (if applicable)",
                    "date": "Leading up to Carnival",
                    "description": "Costume shops become active. Look out for early signs of local neighborhood preparations if Carnival is late in the month.",
                    "notes": "Carnival dates are linked to Easter."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Livraria Lello",
                    "where": "Near Clérigos Tower",
                    "description": "Explore the famous bookstore in relative peace, allowing more time to admire its stunning architecture without jostling crowds.",
                    "practical_tips": "Book timed entry voucher online. Check opening hours. Voucher cost is deductible from book purchase.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Low (voucher cost)",
                    "weather_dependent": false
                },
                {
                    "activity": "Port Wine Cellar Tour & Tasting",
                    "where": "Vila Nova de Gaia",
                    "description": "Indulge in a cozy tour and tasting experience in the warm cellars of Gaia, learning about Port wine production. Ideal winter activity.",
                    "practical_tips": "Book ahead, especially for specific language tours, though walk-ins might be easier than in peak season. Many cellars within walking distance.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                 {
                    "activity": "Explore Ribeira District",
                    "where": "Ribeira riverfront",
                    "description": "Wander the historic Ribeira district when it's quiet, appreciating the colourful facades and views across to Gaia without the usual throngs of people.",
                    "practical_tips": "Be prepared for rain; seek shelter in cafes. Wear sturdy, waterproof footwear. Enjoy the moody atmosphere.",
                    "best_time": "Daytime (during dry spells)",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": true
                },
                {
                    "activity": "Warm Up in Majestic Café",
                    "where": "Rua de Santa Catarina",
                    "description": "Enjoy coffee or hot chocolate in the opulent Belle Époque surroundings of Porto's most famous historic café. Perfect refuge from winter weather.",
                    "practical_tips": "Still popular, but queues likely shorter than other seasons. Higher prices reflect the ambiance.",
                    "best_time": "Mid-morning / Late Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "7°C"
                },
                "precipitation": "Rain remains frequent, but potential for slightly longer dry or sunny spells increases towards March. Daylight hours noticeably lengthen.",
                "general_tips": "Continue with warm, waterproof layers. An umbrella remains a trusty companion. Be ready for variable conditions within a single day."
            },
            "tourism_level": {
                "crowds": "Still low, but can see a temporary increase if Carnival falls in this period or during the Essência do Vinho event.",
                "pricing": "Generally low, potentially rising slightly around specific events like Carnival or wine fairs.",
                "overall_atmosphere": "Remains quiet overall, but Carnival can bring bursts of local festivity. Hints of spring might appear on sunny days."
            },
            "events_holidays": [
                {
                    "name": "Carnival (Carnaval)",
                    "date": "Varies (can fall in late Feb)",
                    "description": "Porto has smaller parades and events. Significant traditional celebrations occur in nearby towns like Ovar (famous for elaborate costumes and parades) and Estarreja.",
                    "notes": "Requires travel outside Porto for major traditional parades. Shrove Tuesday (Terça-feira Gorda) is not a public holiday but may see some closures."
                },
                 {
                    "name": "Essência do Vinho - Porto",
                    "date": "Usually late February (check specific dates)",
                    "description": "Major wine fair held at Palácio da Bolsa, featuring hundreds of Portuguese wine producers, tastings, food pairings, and expert talks.",
                    "notes": "Requires tickets, different options available. Very popular with wine lovers. Book accommodation early if attending."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit the Bolsa Palace (Palácio da Bolsa)",
                    "where": "Near Ribeira",
                    "description": "Take a guided tour through the stunningly decorated rooms of Porto's former stock exchange, particularly the lavish Arab Room.",
                    "practical_tips": "Guided tours are mandatory and run frequently in various languages. Book upon arrival or slightly ahead. Excellent indoor option.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Climb Clérigos Tower",
                    "where": "Near Livraria Lello",
                    "description": "Ascend the iconic Baroque tower for panoramic views of Porto, hopefully catching a clear spell between showers. Far fewer people climbing than usual.",
                    "practical_tips": "Check opening hours. Can be windy at the top. The narrow staircase is easier to navigate without crowds.",
                    "best_time": "On a clear day/during a dry spell",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Soares dos Reis National Museum",
                    "where": "Near Crystal Palace Gardens",
                    "description": "Discover Portuguese art from the 19th and 20th centuries, including works by the sculptor Soares dos Reis, housed in the historic Carrancas Palace.",
                    "practical_tips": "Good indoor activity for several hours. Check opening times (often closed Mondays).",
                    "best_time": "Anytime",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Across Dom Luís I Bridge (Upper Level)",
                    "where": "Connects Porto & Gaia",
                    "description": "Brave the elements for stunning, windswept views of the Ribeira, Douro River, and Gaia from the top deck of the iconic bridge.",
                    "practical_tips": "Wear windproof clothing. Shared with the Metro. Offers dramatic views, especially with dynamic winter skies.",
                    "best_time": "During a dry spell, daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}