{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Festa de São João (St. John's Festival)",
                "details": "June in Porto culminates in its biggest festival, Festa de São João, celebrating St. John the Baptist. The night of June 23rd sees the entire city erupt in street parties, fireworks, music, grilled sardines, and playful traditions like hitting passersby with plastic hammers."
            },
            {
                "reason": "Pleasant Warm Weather",
                "details": "June offers lovely warm and sunny weather, usually without the intense heat of later summer. Ideal for exploring Ribeira, Gaia cellars, parks, and taking boat trips."
            },
            {
                "reason": "Longest Daylight Hours",
                "details": "Benefit from the longest days of the year, with daylight extending past 9 PM, allowing maximum time for sightseeing and enjoying Porto's outdoor attractions."
            },
            {
                "reason": "Grilled Sardines Season",
                "details": "Like Lisbon, June is prime season for delicious grilled sardines (sardinhas assadas), a fixture at São João parties and readily available at restaurants."
            },
            {
                "reason": "Lively Pre-Festival Atmosphere",
                "details": "Throughout June, especially leading up to São João, neighborhoods start decorating, smaller events pop up, and a festive anticipation builds across the city."
            },
            {
                "reason": "Serralves em Festa",
                "details": "Often held in early June, Serralves em Festa is a massive 40-hour non-stop free cultural festival at the Serralves Foundation, featuring music, dance, theatre, circus, exhibitions, and workshops."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "São João Crowds & Noise",
                "details": "The night of São João (June 23rd) is incredibly crowded and noisy throughout the city, especially in central areas and Ribeira/Gaia. Not ideal if seeking peace and quiet."
            },
            {
                "reason": "Increasing Tourist Numbers",
                "details": "June marks the start of high season. Expect growing crowds at popular attractions like Livraria Lello, Clérigos Tower, and Port wine cellars compared to spring."
            },
            {
                "reason": "Rising Prices",
                "details": "Accommodation and flight prices increase significantly in June. Booking far in advance is essential, particularly around São João."
            },
            {
                "reason": "São João Accommodation Peak",
                "details": "Finding accommodation for the night of June 23rd can be very difficult and expensive if not booked months ahead."
            },
            {
                "reason": "Potential for Early Heat",
                "details": "While typically pleasant, June can sometimes bring early heatwaves, making midday exploration less comfortable."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "14°C"
                },
                "precipitation": "Low chance of rain, typically only 4-6 days with light rain. Expect predominantly sunny and pleasant warm days.",
                "general_tips": "Pack light clothing, including t-shirts, shorts, and dresses. Bring sunscreen, sunglasses, and a hat. Comfortable walking shoes are essential. A light jacket for cooler evenings is useful."
            },
            "tourism_level": {
                "crowds": "Moderate to High, increasing throughout the period. Busy around Portugal Day (June 10th).",
                "pricing": "High season prices take effect. Book accommodation and tours in advance.",
                "overall_atmosphere": "Pleasantly warm and sunny. City feels vibrant. Anticipation for São João builds, and Serralves em Festa (if scheduled) creates a cultural buzz."
            },
            "events_holidays": [
                {
                    "name": "Serralves em Festa",
                    "date": "Usually early June weekend (check specific dates)",
                    "description": "A 40-hour non-stop free arts festival across the Serralves Museum grounds, park, and villa, featuring hundreds of events: music, dance, performance, cinema, workshops.",
                    "notes": "Extremely popular, expect large crowds. Check program in advance. Food and drink available on site. Runs day and night."
                },
                {
                    "name": "Portugal Day (Dia de Portugal)",
                    "date": "June 10",
                    "description": "National holiday. May involve some official ceremonies or military displays, but generally a day for locals to relax or travel.",
                    "notes": "Public holiday: Banks, schools, some businesses closed. Most tourist sites open. Public transport on holiday schedule."
                },
                 {
                    "name": "São João Preparations Begin",
                    "date": "Throughout early/mid June",
                    "description": "Neighborhoods start putting up colorful decorations (balloons, streamers, basil pots). Street vendors begin selling plastic hammers and leeks.",
                    "notes": "Noticeable festive build-up across the city."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend Serralves em Festa",
                    "where": "Serralves Foundation",
                    "description": "Immerse yourself in a huge, diverse, and free cultural celebration spanning contemporary art, music, dance, and more across beautiful grounds.",
                    "practical_tips": "Plan your visit using the program. Wear comfortable shoes. Can get very crowded, especially for popular performances. Accessible by bus.",
                    "best_time": "Festival Weekend (Day & Night)",
                    "estimated_cost": "Free entry (food/drink extra)",
                    "weather_dependent": true
                },
                {
                    "activity": "Douro River Cruise (Six Bridges)",
                    "where": "Departs Ribeira / Gaia",
                    "description": "Enjoy a relaxing boat trip along the Douro, offering classic views of Porto's skyline, bridges, and the Gaia cellars.",
                    "practical_tips": "Many operators available. Book ahead or queue. Good way to see the city from a different perspective.",
                    "best_time": "Anytime (less intense sun morning/late afternoon)",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Vila Nova de Gaia Cellars",
                    "where": "Vila Nova de Gaia",
                    "description": "Visit one or more Port wine cellars for a tour explaining the history and production, followed by a tasting.",
                    "practical_tips": "Book popular cellars in advance. Various tour types and price points available. Pleasant way to spend an afternoon.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk along Foz do Douro Promenade",
                    "where": "Foz do Douro (river mouth)",
                    "description": "Take a bus or the historic tram (Line 1) to Foz and enjoy a walk along the seaside promenade (Pérgola da Foz), admiring the ocean views.",
                    "practical_tips": "Can be breezy. Several cafes and restaurants along the way. Nice change of scenery from the city center.",
                    "best_time": "Late Afternoon / Early Evening",
                    "estimated_cost": "Low (transport cost)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "24°C",
                    "low": "15°C"
                },
                "precipitation": "Very low chance of rain. Days are typically long, sunny, and warm.",
                "general_tips": "Sun protection essential. Light summer clothing is sufficient. Evenings remain pleasant."
            },
            "tourism_level": {
                "crowds": "High, peaking dramatically around São João (June 23/24). Central Porto is extremely crowded on the festival night.",
                "pricing": "High season prices, potentially surging for accommodation around São João.",
                "overall_atmosphere": "Builds to an intense, city-wide party for São João. The rest of the period is lively summer high season."
            },
            "events_holidays": [
                {
                    "name": "Festa de São João (St. John's Festival)",
                    "date": "Peak on Night of June 23rd to 24th",
                    "description": "Porto's biggest party! Includes street parties everywhere, grilled sardines, music, dancing, fireworks over the Douro at midnight, releasing sky lanterns (balões), and hitting people with plastic hammers (martelinhos) or garlic flowers (alho-porro).",
                    "notes": "Night of 23rd is chaotic, crowded, and loud but unforgettable. Public holiday in Porto on June 24th. Many businesses closed on 24th."
                },
                 {
                    "name": "São João Regatta",
                    "date": "June 24th (usually afternoon)",
                    "description": "Traditional race of the historic Rabelo boats (used to transport Port wine) on the Douro River.",
                    "notes": "Best viewed from Ribeira or Gaia quaysides. Adds to the festive atmosphere on the holiday."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Festa de São João",
                    "where": "City-wide (esp. Ribeira, Gaia, Aliados, Fontainhas)",
                    "description": "Dive into Porto's wild and unique street festival. Eat sardines, get hit by hammers, watch fireworks over the river, and soak up the incredible atmosphere.",
                    "practical_tips": "Wear comfortable clothes/shoes you don't mind getting dirty. Bring cash. Be prepared for massive crowds and noise all night. Secure belongings.",
                    "best_time": "Night of June 23rd",
                    "estimated_cost": "Low to Moderate (food/hammers/drinks)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Watch São João Fireworks over the Douro",
                    "where": "Ribeira, Vila Nova de Gaia, Dom Luís I Bridge",
                    "description": "Find a spot to watch the spectacular midnight fireworks display launched from barges on the river.",
                    "practical_tips": "Prime viewing spots (bridge, quaysides) get packed hours in advance. Consider viewpoints like Serra do Pilar (Gaia) or less central spots.",
                    "best_time": "Midnight, June 23rd-24th",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Eat Grilled Sardines & Caldo Verde",
                    "where": "Street Stalls, Tascas, Festival Areas",
                    "description": "Indulge in the traditional São João foods: freshly grilled sardines and Caldo Verde soup, widely available during the festival period.",
                    "practical_tips": "Best enjoyed outdoors amidst the party atmosphere. Expect queues at popular stalls.",
                    "best_time": "Around São João (esp. night of 23rd)",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Relax at Matosinhos Beach",
                    "where": "Matosinhos (via Metro/Bus)",
                    "description": "Escape the city bustle (after São João recovery!) for a day at Porto's main beach, perhaps trying surfing or just enjoying the sun.",
                    "practical_tips": "Easily accessible. Can get busy on warm days. Water is cool. Many seafood restaurants nearby.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport) + food",
                    "weather_dependent": true
                }
            ]
        }
    }
}