{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Early Spring Atmosphere",
                "details": "March welcomes spring to Porto. Enjoy increasingly sunny days and milder temperatures (avg. 16°C high), perfect for exploring Ribeira, Gaia, and parks as the city awakens."
            },
            {
                "reason": "Manageable Crowds",
                "details": "Visit Porto's main attractions like Clérigos Tower, Livraria Lello, and Bolsa Palace with fewer tourists than peak season, allowing for a more relaxed visit."
            },
            {
                "reason": "Shoulder Season Value",
                "details": "Benefit from lower prices for flights and accommodation compared to the busy summer months, offering good value for a city break."
            },
            {
                "reason": "Camellia Season",
                "details": "Porto is renowned for its camellias, which are often in full bloom in March in gardens like the Jardins do Palácio de Cristal and private estates in the region."
            },
            {
                "reason": "Comfortable Walking Weather",
                "details": "The milder temperatures are ideal for tackling Porto's hilly streets, walking across the Dom Luís I Bridge, and exploring different neighborhoods on foot."
            },
             {
                "reason": "Fantasporto Film Festival",
                "details": "Often held in late February/early March, Fantasporto is a major international fantasy and sci-fi film festival attracting genre fans."
            },
            {
                "reason": "Douro Valley Awakening",
                "details": "Consider a day trip to the Douro Valley as the vineyards begin to show green, offering beautiful landscapes without summer crowds (though weather dependent)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "March remains unpredictable. Expect a mix of sunny days and potential rain showers, sometimes heavy. Pack for variable conditions."
            },
            {
                "reason": "Cool Evenings & Mornings",
                "details": "While days warm up, mornings and evenings can still be quite cool (avg. low 7°C) and damp, requiring warm layers."
            },
            {
                "reason": "Windy Conditions Possible",
                "details": "Porto's location near the coast means March can still experience windy days, especially near the river and Foz."
            },
             {
                "reason": "Easter Holiday Crowds/Prices (if applicable)",
                "details": "If Easter falls in late March, anticipate increased visitor numbers, higher prices for accommodation, and potential closures around Good Friday/Easter Sunday."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "7°C"
                },
                "precipitation": "Still a notable chance of rain, averaging around 90-110mm over 11-13 days. Expect a mix of conditions: sun, cloud, showers.",
                "general_tips": "Layering is key. Pack sweaters, a waterproof and windproof jacket, umbrella, and comfortable, water-resistant shoes for Porto's hilly, potentially wet streets."
            },
            "tourism_level": {
                "crowds": "Low to moderate. Easy access to most attractions.",
                "pricing": "Shoulder season rates offer good value.",
                "overall_atmosphere": "Quiet and authentic Porto experience. City feels local, slowly transitioning to spring."
            },
            "events_holidays": [
                 {
                    "name": "Fantasporto Film Festival (often concludes early March)",
                    "date": "Late Feb / Early March (check dates)",
                    "description": "Porto's major international festival dedicated to fantasy, sci-fi, and horror films, held at Teatro Rivoli.",
                    "notes": "Tickets required for screenings. Draws international filmmakers and fans."
                 },
                 {
                    "name": "St. Patrick's Day",
                    "date": "March 17 (observed around)",
                    "description": "Not a local holiday, but Irish pubs in Porto will host celebrations with promotions and live music.",
                    "notes": "Celebrations localized to specific Irish-themed pubs."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Ribeira District",
                    "where": "Ribeira",
                    "description": "Wander the colourful UNESCO World Heritage riverfront district with fewer crowds, enjoying the atmosphere and views across to Gaia.",
                    "practical_tips": "Wear good shoes for cobblestones. Enjoy a coffee at an outdoor cafe if the sun is out (bring layers).",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit a Port Wine Cellar",
                    "where": "Vila Nova de Gaia",
                    "description": "Take a guided tour and enjoy a tasting in one of the famous Port wine cellars. A great indoor activity for cooler or wetter days.",
                    "practical_tips": "Book ahead for specific tours/languages, though often easier to walk in than peak season. Cellars are temperature-stable.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Climb Clérigos Tower",
                    "where": "Near Livraria Lello",
                    "description": "Ascend the iconic Baroque tower for panoramic city views, potentially clearer in the crisp spring air, without long queues.",
                    "practical_tips": "Check opening hours. Fewer people make the narrow staircase easier to navigate.",
                    "best_time": "Clear Day",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Admire Camellias at Palácio de Cristal Gardens",
                    "where": "Jardins do Palácio de Cristal",
                    "description": "Stroll through these scenic gardens overlooking the Douro, potentially catching the beautiful camellia blooms for which Porto is known.",
                    "practical_tips": "Free entry. Also offers great viewpoints. Check if any specific flower shows are scheduled.",
                    "best_time": "Sunny Afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "8°C"
                },
                "precipitation": "Rain becomes slightly less frequent, with more sunny intervals anticipated. Days feel noticeably warmer when the sun is out.",
                "general_tips": "Continue layering. A lighter jacket might suffice on sunny days, but keep waterproofs handy. Sunscreen useful for clear days."
            },
            "tourism_level": {
                "crowds": "Moderate, but increases significantly if Easter falls during this period.",
                "pricing": "Remains shoulder season, but spikes around Easter if applicable.",
                "overall_atmosphere": "Noticeably more spring-like. Outdoor cafes get busier. City feels more energetic, especially if Easter approaches."
            },
            "events_holidays": [
                 {
                    "name": "Easter Week (Semana Santa) Preparations (if applicable)",
                    "date": "Late March (varies)",
                    "description": "If Easter occurs, expect religious services, appearance of traditional Folar da Páscoa (Easter bread) in bakeries, and potentially some local processions.",
                    "notes": "Good Friday/Easter Sunday may have some closures. Increased visitors and prices if Easter is in March."
                 },
                 {
                    "name": "Porto Half Marathon (usually later in year, but check)",
                    "date": "Check specific dates (often Sept/Oct)",
                    "description": "While the main half marathon is typically in autumn, check local calendars for any other running events that might occur in spring.",
                    "notes": "Major races cause road closures."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Livraria Lello",
                    "where": "Near Clérigos Tower",
                    "description": "Explore one of the world's most beautiful bookstores with fewer crowds than peak season, allowing better photo opportunities of its famous staircase.",
                    "practical_tips": "Book timed entry voucher online. Check opening hours (may vary around Easter). Voucher redeemable against book purchase.",
                    "best_time": "Booked Slot",
                    "estimated_cost": "Low (voucher cost)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Across Dom Luís I Bridge",
                    "where": "Connects Porto & Gaia",
                    "description": "Walk across the iconic bridge's upper deck for stunning panoramic views of both Porto and Gaia, potentially enjoying pleasant spring sunshine.",
                    "practical_tips": "Upper level shared with Metro. Can be windy. Offers fantastic photo opportunities.",
                    "best_time": "Sunny Day",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore the World of Wine (WOW)",
                    "where": "Vila Nova de Gaia",
                    "description": "Visit this cultural complex featuring multiple museums focused on wine, chocolate, cork, fashion, and Porto history, plus restaurants and viewpoints.",
                    "practical_tips": "Buy tickets for individual museums or combo passes. Great indoor option with fantastic views back towards Porto.",
                    "best_time": "Anytime",
                    "estimated_cost": "Moderate to High (depending on museums visited)",
                    "weather_dependent": false
                },
                {
                    "activity": "Ride Tram Line 1 to Foz",
                    "where": "Starts near São Francisco Church",
                    "description": "Take the charming historic tram along the Douro riverbank to Foz do Douro, where the river meets the Atlantic Ocean.",
                    "practical_tips": "Check timetable as service might be less frequent than summer. Enjoy the coastal views at Foz upon arrival.",
                    "best_time": "Sunny Afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                }
            ]
        }
    }
}