{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Excellent Spring Weather",
                "details": "May typically offers Porto's best weather balance: warm, sunny days (avg. 20°C high), comfortable evenings, and less rain than early spring, ideal for extensive exploration."
            },
            {
                "reason": "Queima das Fitas (Student Festival)",
                "details": "Porto hosts a massive student festival, Queima das Fitas (Burning of the Ribbons), usually in early May. Experience parades (Cortejo Académico), concerts, parties, and unique academic traditions."
            },
            {
                "reason": "Gardens in Bloom",
                "details": "Porto's gardens, like the Jardins do Palácio de Cristal and Serralves Park, are lush and colorful in May. Roses are often particularly beautiful this month."
            },
            {
                "reason": "Pre-Peak Season Shoulder Month",
                "details": "Enjoy fantastic weather and long days with generally fewer crowds and slightly better prices than the absolute peak months of July and August."
            },
            {
                "reason": "Outdoor Cafes & Riverside Buzz",
                "details": "Perfect conditions for enjoying outdoor seating along the Ribeira and Cais de Gaia, soaking up the vibrant atmosphere by the Douro River."
            },
            {
                "reason": "Primavera Sound Festival (Late May/Early June)",
                "details": "The major international indie and alternative music festival, Primavera Sound, often takes place straddling late May or early June in Parque da Cidade."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Queima das Fitas Crowds & Disruption",
                "details": "During Queima das Fitas week (early May), expect large crowds of students, potential noise, higher prices in some areas, and traffic disruptions during parades."
            },
            {
                "reason": "Increasing Tourist Numbers",
                "details": "May sees a marked increase in tourists. Popular spots like Livraria Lello, Clérigos Tower, and key viewpoints will be busy, especially on weekends."
            },
            {
                "reason": "Rising Accommodation Prices",
                "details": "Prices for flights and hotels climb significantly as high season begins. Booking ahead is advisable, especially during festival weeks."
            },
            {
                "reason": "Occasional Rain Still Possible",
                "details": "While much drier than previous months, May can still have occasional spring showers, so packing a light waterproof layer is wise."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "11°C"
                },
                "precipitation": "Decreasing rain chance, typically 7-9 days with mostly light showers, totaling around 60-70mm. More consistent sunshine.",
                "general_tips": "Pack layers: t-shirts, light long sleeves, a versatile jacket or sweater for evenings. Comfortable walking shoes essential. Sunscreen and sunglasses needed."
            },
            "tourism_level": {
                "crowds": "Moderate to High, peaking significantly during Queima das Fitas week. Very busy in student/festival areas.",
                "pricing": "Shoulder to High season prices. Spikes during Queima das Fitas. Book accommodation far in advance if visiting during the festival.",
                "overall_atmosphere": "Very lively, especially during Queima das Fitas with student parades and concerts. Otherwise, pleasant spring vibrancy."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Dia do Trabalhador)",
                    "date": "May 1",
                    "description": "Public holiday. Often sees union marches or demonstrations. Many locals enjoy a day off.",
                    "notes": "Public holiday: Banks, post offices, some shops closed. Most tourist attractions, restaurants remain open. Holiday transport schedule."
                },
                {
                    "name": "Queima das Fitas (Burning of the Ribbons)",
                    "date": "Usually first full week of May (check dates)",
                    "description": "Huge week-long university student graduation festival. Key events include Serenata Monumental (opening serenade), Cortejo Académico (massive themed float parade), concerts, and nightly parties (Queimódromo).",
                    "notes": "Cortejo Académico causes major city center disruption. Queimódromo requires tickets. Very boisterous atmosphere city-wide."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Watch the Cortejo Académico (Queima das Fitas Parade)",
                    "where": "Main streets (route varies slightly)",
                    "description": "Witness the massive, colourful, and noisy student parade with elaborate floats representing different university faculties.",
                    "practical_tips": "Find the route map online. Arrive very early for a spot. Expect huge crowds, loud music, and general revelry.",
                    "best_time": "Parade Day Afternoon (usually a Tuesday)",
                    "estimated_cost": "Free (to watch)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Ribeira District",
                    "where": "Ribeira",
                    "description": "Enjoy the vibrant atmosphere of Porto's riverside district in pleasant May weather. Admire the views, browse shops, enjoy cafes.",
                    "practical_tips": "Can be busy, especially weekends. Great spot for photos. Enjoy wandering the narrow backstreets too.",
                    "best_time": "Anytime, particularly lively afternoon/evening",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Jardins do Palácio de Cristal",
                    "where": "Massarelos",
                    "description": "Stroll through the beautiful Crystal Palace Gardens, enjoying blooming flowers (especially roses), peacocks, and stunning views over the Douro.",
                    "practical_tips": "Free entry. Great spot for sunset views. Check for any events in the Super Bock Arena.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Port Wine Tasting in Gaia",
                    "where": "Vila Nova de Gaia",
                    "description": "Take a tour and tasting at a Port wine cellar. May offers pleasant weather for enjoying their outdoor terraces if available.",
                    "practical_tips": "Book ahead, especially for popular lodges or specific times. Many options available across the river.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "13°C"
                },
                "precipitation": "Lower chance of rain, mostly dry and sunny. Days feel consistently warm, approaching summer conditions.",
                "general_tips": "Light summer clothing usually sufficient, but keep a light jacket for evenings. Sunscreen essential. Comfortable shoes always needed."
            },
            "tourism_level": {
                "crowds": "High. Busy season is well underway. Attractions and popular spots are consistently crowded.",
                "pricing": "High season prices for accommodation and flights. Book in advance.",
                "overall_atmosphere": "Vibrant early summer feel. Perfect weather for sightseeing and enjoying Porto's outdoor lifestyle. Buzz builds if Primavera Sound is late May."
            },
            "events_holidays": [
                {
                    "name": "Primavera Sound Porto (sometimes starts late May)",
                    "date": "Late May / Early June (check dates)",
                    "description": "Major international music festival focused on indie, rock, electronic, and alternative genres, held in Parque da Cidade (City Park).",
                    "notes": "Requires tickets, often sells out. Large park venue near the coast. Check lineup and dates well ahead."
                },
                 {
                    "name": "Serralves em Festa (sometimes late May)",
                    "date": "Late May / Early June (check dates)",
                    "description": "The 40-hour free cultural festival at Serralves Foundation might fall in late May some years.",
                    "notes": "Check specific dates annually. See first half description if applicable."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend Primavera Sound (if applicable)",
                    "where": "Parque da Cidade",
                    "description": "Experience a major European music festival in Porto's largest urban park, featuring top international and national artists.",
                    "practical_tips": "Book tickets and accommodation far in advance. Plan transport to the park. Venue is large and near the ocean.",
                    "best_time": "Festival Days (Afternoon/Evening)",
                    "estimated_cost": "High (festival ticket)",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk Across Dom Luís I Bridge (Upper Level)",
                    "where": "Connects Porto & Gaia",
                    "description": "Enjoy stunning panoramic views of Porto, Gaia, and the Douro River from the top deck of the bridge in beautiful May weather.",
                    "practical_tips": "Best views in clear weather. Can be windy. Shared with Metro line.",
                    "best_time": "Late Afternoon / Sunset",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Relax at Foz do Douro",
                    "where": "Foz do Douro",
                    "description": "Visit the area where the Douro meets the Atlantic. Enjoy the promenade, beaches (water still cold), seaside cafes, and Felgueiras Lighthouse.",
                    "practical_tips": "Take historic Tram Line 1 or bus. Nice place to unwind and enjoy the sea air.",
                    "best_time": "Sunny Afternoon",
                    "estimated_cost": "Low (transport) + food/drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Livraria Lello (Book Ahead)",
                    "where": "Near Clérigos Tower",
                    "description": "Explore the famous ornate bookstore. Booking timed entry online is essential as queues will be significant.",
                    "practical_tips": "Book voucher well in advance for preferred time slot. Be prepared for crowds inside even with timed entry.",
                    "best_time": "Booked Slot (try early morning)",
                    "estimated_cost": "Low (voucher cost)",
                    "weather_dependent": false
                }
            ]
        }
    }
}