{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Spring Blooms & Lakeside Parks",
                "details": "Witness Geneva's parks (Parc La Grange, Parc des Eaux-Vives, Jardin Anglais, Botanical Gardens) burst into color with tulips, cherry blossoms, and magnolias."
            },
            {
                "reason": "Pleasant Temperatures for Exploration",
                "details": "Enjoy milder weather perfect for exploring the Old Town (Vieille Ville), strolling along Lake Geneva (Lac Léman), visiting Carouge, or seeing the Jet d'Eau."
            },
            {
                "reason": "Shoulder Season Advantages",
                "details": "Benefit from potentially fewer crowds at museums (Art & History, Red Cross) and attractions compared to peak summer. Accommodation might offer slightly better rates (outside Easter)."
            },
            {
                "reason": "Lake Navigation Resumes",
                "details": "Lake Geneva boat companies (CGN, Mouettes Genevoises) typically resume more frequent spring/summer schedules, offering scenic cruises and transport across the lake."
            },
            {
                "reason": "Hiking Season Begins (Lower Elevations)",
                "details": "Trails on nearby Mont Salève become more accessible for hiking as snow recedes, offering stunning panoramic views of Geneva and the Alps."
            },
             {
                "reason": "Outdoor Markets & Cafes",
                "details": "Enjoy the vibrant atmosphere of markets like Plainpalais or Carouge, and relax at outdoor cafe terraces as they open for the season."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Unpredictable Spring Weather",
                "details": "April can bring variable weather: sunshine, rain showers ('giboulées de mars'), and wind are all common. Temperatures can fluctuate significantly during the day."
            },
            {
                "reason": "Cool Temperatures Persist",
                "details": "While milder than winter, average highs are around 15°C, and nights remain cool (around 5°C). Packing layers is essential."
            },
            {
                "reason": "Easter Holiday Impact (if applicable)",
                "details": "If Easter falls in April, expect closures or reduced hours for shops and some services on public holidays (Good Friday, Easter Sunday/Monday). Attractions usually remain open but verify timings."
            },
            {
                "reason": "Jet d'Eau Operation",
                "details": "While typically operating from spring, the Jet d'Eau's operation can be affected by strong winds or maintenance. Check daily status if it's a must-see."
            },
            {
                "reason": "Pollen Season Starts",
                "details": "Spring blooms mean pollen (especially birch) is high, potentially affecting allergy sufferers."
            },
            {
                "reason": "High Mountain Excursions Still Limited",
                "details": "While Salève becomes accessible, higher Alpine destinations easily reachable from Geneva (like Chamonix/Mont Blanc region) will still have winter conditions. Some high mountain cable cars may be closed for maintenance before summer."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "14°C",
                    "low": "4°C"
                },
                "precipitation": "Variable; mix of sun, cloud, and frequent rain showers possible. Snow in the city is rare but not impossible.",
                "general_tips": "Pack layers: T-shirts, sweaters/fleeces, a waterproof/windproof jacket, comfortable walking shoes (water-resistant). Umbrella is essential. Sunglasses for sunny spells."
            },
            "tourism_level": {
                "crowds": "Moderate. Shoulder season, generally less crowded than summer but increases significantly if Easter falls during this period.",
                "pricing": "Mid-range. Accommodation might be slightly cheaper than peak summer, but Easter can cause price spikes.",
                "overall_atmosphere": "City awakening to spring. Parks greening up, early flowers blooming. Outdoor cafe terraces begin opening, often with blankets."
            },
            "events_holidays": [
                {
                    "name": "Easter Weekend (Pâques)",
                    "date": "Varies (can fall in early/mid-April)",
                    "description": "Includes Good Friday (Vendredi Saint), Easter Sunday (Dimanche de Pâques), and Easter Monday (Lundi de Pâques - often a holiday in Vaud but variable in Geneva). Religious significance and family focus.",
                    "notes": "Shops largely closed on public holidays. Restaurants/cafes mostly open. Check specific attraction opening times. Chocolate shops feature Easter specialties."
                },
                {
                    "name": "Geneva International Motor Show (GIMS)",
                    "date": "If scheduled, often early March/April (check status)",
                    "description": "Major international car show at Palexpo.",
                    "notes": "Check official GIMS website for confirmation and dates as the event schedule has varied."
                },
                {
                     "name": "Start of Tulip Festival in Morges",
                     "date": "Typically starts early April",
                     "description": "Though in Morges (nearby town), the stunning tulip displays begin in Parc de l'Indépendance.",
                     "notes": "Worth a short train trip for flower lovers."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the Old Town (Vieille Ville)",
                    "where": "Left Bank, around St. Pierre Cathedral",
                    "description": "Wander the historic cobblestone streets, visit St. Pierre Cathedral (climb towers for views), relax on Place du Bourg-de-Four, see Maison Tavel.",
                    "practical_tips": "Wear comfortable shoes for hills/cobblestones. Allow 2-3 hours. Quieter early morning.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking), costs for cathedral towers/museums",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Red Cross Museum (MICR)",
                    "where": "International District",
                    "description": "Explore the moving history of humanitarian action at the International Red Cross and Red Crescent Museum.",
                    "practical_tips": "Allow 2 hours. Accessible by bus. Consider combining with a walk past Palais des Nations.",
                    "best_time": "Anytime during opening hours (check closures).",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk along Lake Geneva Promenade",
                    "where": "Quai du Mont-Blanc, Quai Wilson, Jardin Anglais, Quai Gustave-Ador",
                    "description": "Enjoy bracing walks along the lakefront, see the Flower Clock (L'horloge fleurie), look for the Jet d'Eau (check if operating), admire views.",
                    "practical_tips": "Flat and easy walk. Many benches and viewpoints. Cafes nearby.",
                    "best_time": "Daytime, especially on clearer days.",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Carouge District",
                    "where": "South of the Arve River",
                    "description": "Discover Geneva's 'Italian' district with its unique architecture, artisan boutiques, cafes, and relaxed atmosphere. Visit Place du Marché.",
                    "practical_tips": "Take tram 12 or 18. Allow a few hours to wander and browse shops. Great for coffee/lunch.",
                    "best_time": "Daytime (shops open Tues-Sat typically).",
                    "estimated_cost": "Free (walking), costs for shopping/food",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "5°C"
                },
                "precipitation": "Still variable, increasing chance of warmer days but rain remains common. 'April showers' can be sudden.",
                "general_tips": "Continue layering; waterproof outer layer crucial. Sun protection needed for sunny days. Be prepared for quick weather changes."
            },
            "tourism_level": {
                "crowds": "Moderate. Shoulder season continues, generally pleasant.",
                "pricing": "Mid-range.",
                "overall_atmosphere": "Full spring bloom in parks. More activity along the lake. Outdoor dining becomes more common. General feeling of the city opening up for warmer months."
            },
            "events_holidays": [
                 {
                    "name": "Peak Tulip Bloom (Morges)",
                    "date": "Mid-late April (weather dependent)",
                    "description": "The Tulip Festival in nearby Morges usually reaches peak bloom during this period.",
                    "notes": "Ideal time for a day trip if interested in the festival."
                },
                 {
                    "name": "Start of more frequent Lake Cruises",
                    "date": "Late April onwards",
                    "description": "CGN boat company often transitions to more frequent schedules for lake cruises and transport.",
                    "notes": "Check CGN website for updated timetables."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Take a Lake Geneva Cruise",
                    "where": "Depart from Mont-Blanc pier or Jardin Anglais",
                    "description": "Enjoy a scenic boat trip on Lac Léman. Options include short 'Mouettes' shuttle crossings, one-hour 'Mermaid Cruise', or longer trips towards Lausanne/Montreux or Yvoire (France).",
                    "practical_tips": "Check CGN or Mouettes schedules. Dress warmly (windy on deck). Great views of city, Jura, Alps.",
                    "best_time": "Afternoon on a clear day.",
                    "estimated_cost": "Moderate (cost varies by trip length)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Ascend Mont Salève",
                    "where": "France (accessible via bus + cable car)",
                    "description": "Take a bus (e.g., No. 8 to Veyrier-Douane) then the cable car ('Téléphérique du Salève') up for stunning panoramic views of Geneva, the lake, Jura, and Mont Blanc massif.",
                    "practical_tips": "Check cable car operating status/hours (may have maintenance closures). Bring passport (crossing border). Trails available at top (check conditions).",
                    "best_time": "Clear day for best views.",
                    "estimated_cost": "Moderate (Bus fare + Cable car ticket)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Parc La Grange & Eaux-Vives",
                    "where": "Left Bank, Eaux-Vives neighborhood",
                    "description": "Explore these large, beautiful lakeside parks. See the rose garden (may start blooming late April), enjoy lake views, ancient trees, and maybe catch early outdoor events.",
                    "practical_tips": "Combine with a walk along Quai Gustave-Ador. Good spot for picnics.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Plainpalais Market Exploration",
                    "where": "Plaine de Plainpalais",
                    "description": "Browse the large flea market (Wed/Sat/Sun - check days) or the produce/food market (Tue/Fri/Sun). Experience a lively local gathering spot.",
                    "practical_tips": "Best atmosphere on market days. Wear comfortable shoes. Bring cash for market purchases.",
                    "best_time": "Market mornings/lunchtime.",
                    "estimated_cost": "Free (browsing), costs for purchases",
                    "weather_dependent": true
                }
            ]
        }
    }
}