{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Early Summer Weather",
                "details": "June offers lovely warm, sunny weather (avg highs 24°C/75°F), ideal for exploring the city, strolling along Lake Geneva, and enjoying outdoor cafes before the peak summer heat."
            },
            {
                "reason": "Long Daylight Hours",
                "details": "Maximize your sightseeing with very long daylight hours, especially around the summer solstice (June 21st), perfect for evening boat trips, park visits, and soaking up the atmosphere."
            },
            {
                "reason": "Lake Swimming Season in Full Swing",
                "details": "Lake Geneva swimming spots like Bains des Pâquis and Genève Plage are popular destinations, inviting everyone to enjoy swimming, sunbathing, and lakeside relaxation."
            },
            {
                "reason": "Major Events: Fête de la Musique & Bol d'Or",
                "details": "June is packed with events! Experience the city-wide Fête de la Musique (June 21st) with free concerts everywhere, and witness the spectacular Bol d'Or Mirabaud sailing race on the lake."
            },
            {
                "reason": "Lush Parks & Vibrant Outdoor Life",
                "details": "Geneva's lakeside parks (Parc La Grange, Parc des Eaux-Vives, Jardin Anglais) are beautiful. Outdoor seating at cafes and bars buzzes with activity."
            },
            {
                "reason": "Ideal for Excursions & Vineyards",
                "details": "Comfortable temperatures for taking the cable car up Mont Salève, exploring the blooming Genevan vineyards (Satigny), or taking boat trips to Nyon or Yvoire (France)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Start of High Season Crowds",
                "details": "Tourist numbers increase significantly. Expect noticeable crowds at the Jet d'Eau, in the Old Town, at popular lake spots, and during major events."
            },
            {
                "reason": "Rising Prices",
                "details": "June marks the shift into peak season pricing for flights and accommodation. Costs are higher than in spring, book ahead."
            },
            {
                "reason": "Potential for Rain & Thunderstorms",
                "details": "While often sunny, June can bring sudden afternoon thunderstorms or occasional rainy days. A rain jacket is advisable."
            },
            {
                "reason": "Booking Ahead Increasingly Necessary",
                "details": "Booking popular hotels, specific boat tours (especially during Bol d'Or), event tickets (if applicable), and desirable restaurants is recommended."
            },
            {
                "reason": "Pollen Season Continues",
                "details": "Grass pollen is typically high in June, potentially affecting allergy sufferers enjoying the parks and outdoors."
            },
             {
                "reason": "Bol d'Or Weekend Disruption/Crowds",
                "details": "The weekend of the Bol d'Or Mirabaud sailing race brings huge crowds to the lakefront and can impact boat traffic and hotel availability."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "23°C (73°F)",
                    "low": "13°C (55°F)"
                },
                "precipitation": "Mix of warm, sunny spells and potential for showers or afternoon thunderstorms. Generally very pleasant.",
                "general_tips": "Pack layers – t-shirts, shorts, light trousers, a sweater or light jacket. Sunscreen, sunglasses, hat are important. Include a light waterproof jacket/umbrella."
            },
            "tourism_level": {
                "crowds": "High season ramps up. Busier than May, particularly around the lake, Old Town, and on sunny weekends. Bol d'Or weekend is exceptionally busy.",
                "pricing": "High season pricing takes effect.",
                "overall_atmosphere": "Beautiful early summer feel. Parks are lush, outdoor dining is standard, lake activities begin. Lively atmosphere, especially during Bol d'Or."
            },
            "events_holidays": [
                 {
                    "name": "Bol d'Or Mirabaud",
                    "date": "Usually a weekend in mid-June (check exact dates)",
                    "description": "Europe's most important inland lake regatta. Hundreds of sailboats race from Geneva to Le Bouveret and back. Great spectacle from the lake shores.",
                    "notes": "Check official dates. Expect huge crowds along Quai Gustave-Ador and Quai du Mont-Blanc. Impacts CGN boat schedules. Book accommodation far in advance."
                },
                {
                    "name": "Geneva Pride (Potential Timing)",
                    "date": "Often mid-June (check exact dates)",
                    "description": "Geneva's LGBTQ+ pride celebration, typically featuring a parade, community events, and parties.",
                    "notes": "Check official Geneva Pride website for dates and program. Parade causes temporary disruptions."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Watch the Bol d'Or Start/Finish",
                    "where": "Lakefront, particularly Quai Gustave-Ador, Jetée des Pâquis",
                    "description": "Witness the spectacular sight of hundreds of sailboats setting off or returning during the Bol d'Or race.",
                    "practical_tips": "Find a spot early, especially for the start. Bring binoculars. Be prepared for massive crowds.",
                    "best_time": "Bol d'Or Saturday morning (start) / Sunday (finish - variable)",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Relax or Swim at Bains des Pâquis",
                    "where": "Quai du Mont-Blanc",
                    "description": "Enjoy the increasingly warm weather at this popular lakeside spot. Swim, sunbathe, enjoy the buvette's affordable food with great Jet d'Eau views.",
                    "practical_tips": "Small entry fee. Water temperature still rising. Gets busy on warm days.",
                    "best_time": "Sunny afternoons",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                },
                 {
                    "activity": "Stroll through Parc La Grange & Parc des Eaux-Vives",
                    "where": "Left Bank, near lake",
                    "description": "Explore these beautiful adjoining parks, known for their rose gardens (peak bloom often in June), ancient trees, lake views, and the Théâtre de l'Orangerie.",
                    "practical_tips": "Free entry. Ideal for picnics. Check for free concerts at the Théâtre de Verdure.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 },
                {
                    "activity": "Take a Boat Trip to Nyon",
                    "where": "Departing from Jardin Anglais / Eaux-Vives",
                    "description": "Enjoy a scenic CGN boat ride across the lake to the charming town of Nyon, known for its castle, Roman museum, and lovely lakeside setting.",
                    "practical_tips": "Check CGN schedules. Allow at least 3-4 hours for the round trip and visit. Nyon is in Canton Vaud.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (boat fare)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "24°C (75°F)",
                    "low": "14°C (57°F)"
                },
                "precipitation": "Typically warm and sunny, ideal summer weather. Afternoon thunderstorms remain possible. Longest daylight hours around June 21st.",
                "general_tips": "Standard summer packing: light clothing, sun protection essential. Keep rain gear handy just in case. Enjoy the very long evenings."
            },
            "tourism_level": {
                "crowds": "High season continues. Fête de la Musique brings massive local crowds into the streets and parks.",
                "pricing": "Peak season prices persist.",
                "overall_atmosphere": "Peak early summer vibrancy. Longest days, warm weather, city is alive with music (especially around June 21st) and outdoor activities."
            },
            "events_holidays": [
                {
                    "name": "Fête de la Musique",
                    "date": "Around June 21st (often the closest weekend)",
                    "description": "Massive, free city-wide music festival. Hundreds of stages (official and spontaneous) pop up in parks, squares, streets, courtyards, featuring all musical genres.",
                    "notes": "Check the official program but also just wander! Extremely popular and crowded, especially in the Old Town and parks. Spans several days."
                },
                {
                    "name": "Summer Solstice",
                    "date": "Around June 21st",
                    "description": "The longest day of the year, perfect for maximizing outdoor activities and enjoying the extended evening light.",
                    "notes": "Coincides with Fête de la Musique energy."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Immerse Yourself in the Fête de la Musique",
                    "where": "City-wide: Old Town, Parc des Bastions, Parc La Grange, various streets/squares",
                    "description": "Wander through the city experiencing countless free live music performances of every imaginable style.",
                    "practical_tips": "Wear comfortable shoes! Be prepared for huge crowds and noise. Grab a program or check online, but spontaneous discovery is key.",
                    "best_time": "Afternoon/Evening around June 21st weekend",
                    "estimated_cost": "Free (music), Costs for food/drinks",
                    "weather_dependent": true
                },
                 {
                    "activity": "Evening Picnic by the Lake",
                    "where": "Jardin Anglais, Parc La Grange, Quai Wilson",
                    "description": "Take advantage of the long, warm evenings and enjoy a picnic dinner with views of the lake and the Jet d'Eau.",
                    "practical_tips": "Buy supplies at local supermarkets (e.g., Coop, Migros). Find a spot on the grass or benches. Dispose of litter properly.",
                    "best_time": "Early evening",
                    "estimated_cost": "Low-Moderate (food costs)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Explore the Vineyards of Satigny",
                    "where": "Geneva countryside (accessible by regional train)",
                    "description": "Visit Switzerland's largest wine-producing commune. Walk or cycle among the vineyards, potentially visit a winery ('cave') for a tasting (check opening hours/need for appointment).",
                    "practical_tips": "Take the train towards La Plaine, get off at Satigny. Follow marked paths. Combine with a visit to Dardagny castle.",
                    "best_time": "Daytime, preferably sunny",
                    "estimated_cost": "Low (train fare) + potential tasting costs",
                    "weather_dependent": true
                 },
                {
                    "activity": "Outdoor Drinks in Carouge or Eaux-Vives",
                    "where": "Place du Marché (Carouge), Rue Henri-Blanvalet (Eaux-Vives)",
                    "description": "Enjoy the evening buzz away from the main lakefront. Carouge offers a bohemian atmosphere, while Eaux-Vives has many trendy bars with terraces.",
                    "practical_tips": "Carouge accessible by tram. Both areas popular with locals. Many dining options nearby.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                }
            ]
        }
    }
}