{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May often brings pleasant, mild spring weather (avg highs ~20°C/68°F) with significantly longer daylight hours, perfect for exploring Geneva, strolling the lakefront, and enjoying parks."
            },
            {
                "reason": "Parks & Gardens in Full Bloom",
                "details": "Experience Geneva's stunning parks like Parc La Grange (renowned rose garden starts blooming), Parc des Eaux-Vives, Jardin Anglais (Flower Clock), and the Botanical Garden at their peak spring beauty."
            },
            {
                "reason": "Outdoor Cafes & Lakeside Ambiance",
                "details": "Terraces ('terrasses') at cafes and restaurants flourish. Enjoy drinks or meals by Lake Geneva, in the Old Town's squares, or in Carouge's charming streets."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "Enjoy Geneva's attractions like the Jet d'Eau, museums, and boat trips with fewer tourists than in July/August, allowing for a more relaxed visit."
            },
            {
                "reason": "Ideal for Excursions & Outdoor Activities",
                "details": "Comfortable temperatures for taking the cable car up Mont Salève for views, cycling along the Rhône or lake, or exploring the nearby Genevan vineyards."
            },
            {
                "reason": "Full Lake Navigation Schedule",
                "details": "Lake Geneva boat companies (CGN, Mouettes) operate their full spring/summer schedules, offering frequent scenic cruises and cross-lake transport."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "May can still be unpredictable, with potential for rainy days, cooler spells, or afternoon thunderstorms, even amidst the sunshine."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May sees a definite rise in tourism. Expect more people at key sites and increasing prices for flights and accommodation as high season approaches."
            },
            {
                "reason": "Public Holidays Impact",
                "details": "May 1st (Labour Day) and Ascension Day (Jeudi de l'Ascension - variable date) are public holidays with widespread shop closures."
            },
            {
                "reason": "Pollen Season Peaks",
                "details": "Grass pollen levels are often high in May, potentially causing discomfort for allergy sufferers spending time in parks or the countryside."
            },
            {
                "reason": "Lake Water Still Chilly",
                "details": "Despite warmer air temperatures, Lake Geneva's water is generally still too cold for comfortable swimming for most people in May."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "8°C (46°F)"
                },
                "precipitation": "Mix of sunny, pleasant spring days and periods of rain or showers. Still potential for cooler days.",
                "general_tips": "Pack layers: t-shirts, sweaters, a light to medium-weight jacket (waterproof useful), comfortable walking shoes. Sunscreen, sunglasses important for sunny days. Allergy medication if needed."
            },
            "tourism_level": {
                "crowds": "Moderate and increasing. Busy around May 1st holiday and potentially Ascension Day if early. More relaxed than summer peaks.",
                "pricing": "Shoulder/High season prices. Book ahead, especially around public holidays.",
                "overall_atmosphere": "City bursts into spring colours. Parks are magnificent. Outdoor cafe culture thrives. May 1st brings closures/demonstrations."
            },
            "events_holidays": [
                {
                    "name": "Labour Day (Fête du Travail)",
                    "date": "May 1",
                    "description": "Public holiday. Expect demonstrations, particularly around Plainpalais/city center. Widespread closures of shops, banks, offices.",
                    "notes": "Check opening hours for museums/attractions (many open). Transport may have minor disruptions."
                },
                {
                    "name": "Geneva Marathon",
                    "date": "Usually the first weekend of May (check exact dates)",
                    "description": "Major running event with marathon, half-marathon, relays, and kids' races, often finishing on Pont du Mont-Blanc.",
                    "notes": "Causes significant road closures and crowds along the route, especially on Sunday. Check official website for details."
                },
                {
                    "name": "Ascension Day (Jeudi de l'Ascension)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday creating a long weekend for many. Shops closed.",
                    "notes": "Check date for the year. Attractions usually open. Can be a busy travel weekend."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Admire Blooms in Parc La Grange & Eaux-Vives",
                    "where": "Left Bank, near lake",
                    "description": "Witness the spectacular display of roses (starting peak bloom) and other flowers in Geneva's premier lakeside parks.",
                    "practical_tips": "Free entry. Perfect for strolling, picnics. Check for events at Théâtre de l'Orangerie or Théâtre de Verdure.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Ascend Mont Salève via Cable Car",
                    "where": "Veyrier (accessible by bus 8)",
                    "description": "Take the cable car for stunning panoramic views of Geneva, Lake Geneva, the Jura, and the Alps, enhanced by clear spring air.",
                    "practical_tips": "Check weather/visibility. Bring passport (it's France). Wear layers. Restaurant/hiking trails at top.",
                    "best_time": "Clear days",
                    "estimated_cost": "Moderate (bus + cable car)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Stroll the Jardin Anglais & See the Flower Clock",
                    "where": "Lakefront, near Pont du Mont-Blanc",
                    "description": "Visit the famous L'horloge fleurie, newly planted for the season, and enjoy the lakeside promenade.",
                    "practical_tips": "Easy access, central location. Combine with watching the Jet d'Eau.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Explore the Old Town (Vieille Ville)",
                    "where": "Above city center",
                    "description": "Wander the historic streets, visit St. Peter's Cathedral, browse galleries, and enjoy the atmosphere of Place du Bourg-de-Four with its outdoor cafes.",
                    "practical_tips": "Wear comfortable shoes for hills/cobblestones. Good option regardless of weather.",
                    "best_time": "Anytime",
                    "estimated_cost": "Free (walking) to Moderate/High (dining/shopping/cathedral towers)",
                    "weather_dependent": false
                 }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "21°C (70°F)",
                    "low": "10°C (50°F)"
                },
                "precipitation": "Often features more stable, warm, and sunny weather, feeling like early summer, though afternoon showers/thunderstorms remain possible.",
                "general_tips": "Likely need lighter clothing (t-shirts, light trousers/shorts), but keep a sweater/light jacket for evenings. Sun protection essential."
            },
            "tourism_level": {
                "crowds": "High season feeling develops. Busy, especially on sunny weekends and if public holidays fall late.",
                "pricing": "High season prices generally apply. Advance booking strongly recommended.",
                "overall_atmosphere": "Beautiful late spring/early summer. Ideal conditions for enjoying the lake, parks, and outdoor dining. Vibrant city life."
            },
            "events_holidays": [
                {
                   "name": "Nuit des Musées (Museum Night - Potential Timing)",
                   "date": "Often a Saturday in mid/late May (check exact dates!)",
                   "description": "Many Geneva museums open late with special programs, workshops, music, and food, usually for a single entry fee.",
                   "notes": "Date varies yearly! Check official program ('La Nuit des Musées Genève'). Very popular."
                },
                {
                    "name": "Whit Monday (Lundi de Pentecôte) (Potential Timing)",
                    "date": "Varies (50 days after Easter - often late May/early June)",
                    "description": "Public holiday. Widespread shop closures.",
                    "notes": "Check date for the year. Attractions typically open."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Take a Lake Geneva Cruise",
                    "where": "Departing from Jardin Anglais / Mont-Blanc / Eaux-Vives",
                    "description": "Enjoy a scenic boat trip on the lake with the full summer schedule operating. Options range from one-hour tours to longer cruises (e.g., towards Nyon, Yvoire, Lausanne).",
                    "practical_tips": "Check CGN website for routes/timetables. Book popular cruises or weekend trips in advance. Bring sunscreen.",
                    "best_time": "Daytime or early evening",
                    "estimated_cost": "Moderate to High (depending on cruise length)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Carouge Market & Atmosphere",
                    "where": "Place du Marché, Carouge",
                    "description": "Visit the vibrant market (Wednesdays/Saturdays), browse the unique boutiques, and enjoy the bohemian, Mediterranean atmosphere of Carouge's cafes and squares.",
                    "practical_tips": "Accessible by tram. Market days are busiest. Ideal for finding local products and crafts.",
                    "best_time": "Market mornings (Wed/Sat) or daytime for shops/cafes",
                    "estimated_cost": "Free (walking) to Moderate (shopping/dining)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Conservatory and Botanical Garden (CJB)",
                    "where": "Near Nations district",
                    "description": "Explore the extensive outdoor gardens showcasing diverse plant collections in full spring glory, plus the greenhouses.",
                    "practical_tips": "Free entry. Allow ample time to wander the large grounds. Restaurant on site.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Enjoy Lakeside Drinks or Aperitif",
                    "where": "Buvette Bains des Pâquis, La Terrasse, various lakeside cafes/bars",
                    "description": "Relax with a drink by the water, enjoying the long evenings and views of the Jet d'Eau and lake.",
                    "practical_tips": "Popular spots get busy, especially on sunny evenings. Bains des Pâquis is casual and affordable.",
                    "best_time": "Late afternoon / Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                 }
            ]
        }
    }
}