{
    "neighborhoods": [
        {
            "name": "Historic Center",
            "alternate_names": [
                "Old Town",
                "City Center",
                "Oude Stad"
            ],
            "character": "Enchanting and vibrant with medieval architecture, cobbled streets, and waterways, blending Gothic splendor with a lively student atmosphere and cultural richness.",
            "location": {
                "central": true,
                "description": "Heart of Ghent, formed by the confluence of the Lys and Scheldt rivers, creating the historic core from which the city developed.",
                "borders": [
                    "Patershol",
                    "Arts Quarter",
                    "University District",
                    "Portus Ganda"
                ],
                "landmarks": [
                    "St. Bavo's Cathedral",
                    "Ghent Belfry",
                    "Gravensteen Castle"
                ]
            },
            "history": {
                "overview": "Evolved from a settlement at the confluence of the Lys and Scheldt rivers, flourished during the Middle Ages as Europe's second-largest city after Paris, dominated by textile trade and became a powerful merchant city, experienced golden age in 14th-15th centuries, preserved its medieval character through centuries despite industrialization.",
                "significance": "Represents Ghent's evolution from medieval commercial powerhouse to modern cultural center while maintaining an exceptional level of architectural preservation.",
                "notable_events": [
                    "Medieval textile industry prosperity",
                    "Signing of the Pacification of Ghent in 1576",
                    "Ghent Altarpiece completion by Van Eyck in 1432",
                    "Ghent's Revolt against Charles V",
                    "Preservation efforts preventing modernization in the 19th-20th centuries"
                ]
            },
            "practical_info": {
                "transit": [
                    "Tram stops throughout the district",
                    "Bus connections across the area",
                    "Boat tours on the canals",
                    "Extensive pedestrian zones"
                ],
                "safety": "Very safe, even at night, though be alert for bicycle traffic",
                "best_time_to_visit": "Morning for attractions, afternoon for shopping, evening for dining",
                "walkability": "Highly walkable with pedestrianized streets and compact layout"
            },
            "appeal": {
                "known_for": [
                    "Medieval architecture",
                    "Waterways and bridges",
                    "The Ghent Altarpiece"
                ],
                "atmosphere": [
                    "Historic",
                    "Lively",
                    "Cultural"
                ],
                "best_for": [
                    "Tourists",
                    "History enthusiasts",
                    "Cultural explorers"
                ]
            },
            "categories": {
                "touristy": 5,
                "residential": 2,
                "green_spaces": 2,
                "shopping": 4,
                "dining": 5,
                "nightlife": 4,
                "cultural": 5,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "St. Bavo's Cathedral",
                        "type": "Gothic Cathedral",
                        "description": "Magnificent Gothic cathedral housing the world-famous Ghent Altarpiece (The Adoration of the Mystic Lamb) by the Van Eyck brothers.",
                        "appeal": "Experience one of the most significant masterpieces in European art history within a breathtaking Gothic setting."
                    },
                    {
                        "name": "Gravensteen Castle",
                        "type": "Medieval Castle",
                        "description": "Imposing 12th-century stone castle with moat, torture museum, and panoramic views of the city.",
                        "appeal": "Step back in time in this remarkably preserved medieval fortress right in the heart of the city."
                    },
                    {
                        "name": "Ghent Belfry",
                        "type": "UNESCO Bell Tower",
                        "description": "UNESCO-listed 91-meter tower offering panoramic views and housing historic bells that once regulated city life.",
                        "appeal": "Climb to the top for spectacular views of Ghent's three famous towers and historic center."
                    }
                ],
                "dining": [
                    {
                        "name": "Publiek",
                        "cuisine": "Modern Belgian",
                        "price_range": "€€€",
                        "known_for": "Sophisticated Belgian cuisine with seasonal ingredients",
                        "atmosphere": "Contemporary bistro in historic setting with warm, elegant ambiance."
                    },
                    {
                        "name": "Brasserie Ha'",
                        "cuisine": "Belgian-French",
                        "price_range": "€€",
                        "known_for": "Classic Flemish dishes with modern touches",
                        "atmosphere": "Traditional brasserie with contemporary flair in historic building."
                    }
                ],
                "activities": [
                    {
                        "name": "Canal Boat Tour",
                        "type": "Sightseeing",
                        "description": "Guided boat tour through Ghent's historic waterways with views of medieval architecture from a unique perspective.",
                        "suitable_for": [
                            "First-time visitors",
                            "Photography enthusiasts",
                            "History lovers"
                        ]
                    },
                    {
                        "name": "Ghent Altarpiece Visit",
                        "type": "Cultural",
                        "description": "Viewing the masterpiece by the Van Eyck brothers in its newly restored state within St. Bavo's Cathedral.",
                        "suitable_for": [
                            "Art enthusiasts",
                            "Cultural travelers",
                            "History buffs"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to be immersed in medieval architecture and atmosphere",
                "You prioritize walking access to major attractions and dining options",
                "You enjoy vibrant urban environments with historical character"
            ],
            "avoid_if": [
                "You're looking for quiet, as the center can be lively especially during festivals",
                "You need easy car access, as much of the center is pedestrianized",
                "You're on a tight budget, as accommodations tend to be more expensive"
            ],
            "insider_tips": [
                "Visit the Cathedral early morning to see the Altarpiece with fewer crowds",
                "The city is beautifully illuminated at night with an award-winning lighting plan",
                "Many museums offer free entry on the last Wednesday of each month"
            ]
        },
        {
            "name": "Patershol",
            "alternate_names": [
                "Monk's Hollow",
                "Medieval Quarter",
                "Gastronomic District"
            ],
            "character": "Charming and intimate with a gastronomic focus, featuring narrow cobblestone streets, medieval houses, and a high concentration of quality restaurants.",
            "location": {
                "central": true,
                "description": "Small medieval quarter north of the historic center, adjacent to Gravensteen Castle, characterized by a labyrinth of narrow alleys and historic buildings.",
                "borders": [
                    "Historic Center",
                    "Gravensteen",
                    "Rabot",
                    "Port Area"
                ],
                "landmarks": [
                    "Caermersklooster",
                    "House of Alijn",
                    "Sint-Veerleplein"
                ]
            },
            "history": {
                "overview": "Developed in the Middle Ages as a residential area for wealthy traders near Gravensteen Castle, declined into a working-class district in the industrial era, nearly demolished for urban renewal in the 1970s, then preserved and revitalized into a culinary and cultural hub while maintaining its medieval street plan.",
                "significance": "Represents resilient cultural heritage preservation and urban revitalization while maintaining authentic historic character.",
                "notable_events": [
                    "Medieval development as wealthy enclave",
                    "Industrial-era decline into working-class area",
                    "Threatened demolition in the 1970s",
                    "Successful preservation movement",
                    "Transformation into gastronomic quarter since the 1980s"
                ]
            },
            "practical_info": {
                "transit": [
                    "Walking distance from city center tram stops",
                    "Limited vehicle access due to narrow streets",
                    "Best explored on foot",
                    "Bicycle parking at district edges"
                ],
                "safety": "Very safe, including evening hours",
                "best_time_to_visit": "Evening for dining, daytime for exploring quiet streets",
                "walkability": "Extremely walkable, designed for pedestrians with limited car access"
            },
            "appeal": {
                "known_for": [
                    "Restaurants",
                    "Medieval atmosphere",
                    "Charming alleys"
                ],
                "atmosphere": [
                    "Intimate",
                    "Gastronom ic",
                    "Historic"
                ],
                "best_for": [
                    "Foodies",
                    "Romantic couples",
                    "Photographers"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 4,
                "green_spaces": 1,
                "shopping": 2,
                "dining": 5,
                "nightlife": 3,
                "cultural": 4,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Caermersklooster",
                        "type": "Historic Monastery/Exhibition Space",
                        "description": "Former Carmelite monastery converted into a cultural center and exhibition space with regular art shows.",
                        "appeal": "Experience contemporary art and culture within the atmospheric setting of a medieval monastery."
                    },
                    {
                        "name": "House of Alijn",
                        "type": "Folk Museum",
                        "description": "Museum of everyday life housed in a former almshouse, documenting 20th-century Belgian daily culture.",
                        "appeal": "Step into the daily lives of 20th-century Belgians through immersive exhibits in a historic building complex."
                    }
                ],
                "dining": [
                    {
                        "name": "De Vitrine",
                        "cuisine": "Contemporary Belgian",
                        "price_range": "€€€",
                        "known_for": "Innovative use of local ingredients",
                        "atmosphere": "Modern dining in historic building with intimate setting."
                    },
                    {
                        "name": "Chez Léontine",
                        "cuisine": "Traditional Flemish",
                        "price_range": "€€",
                        "known_for": "Authentic regional specialties and beer pairings",
                        "atmosphere": "Cozy, historic restaurant with traditional décor and friendly service."
                    }
                ],
                "activities": [
                    {
                        "name": "Culinary Walk",
                        "type": "Food/Cultural",
                        "description": "Self-guided walking tour of the district's renowned restaurants and historic buildings.",
                        "suitable_for": [
                            "Food enthusiasts",
                            "Architecture lovers",
                            "Casual photographers"
                        ]
                    },
                    {
                        "name": "Hidden Courtyards Exploration",
                        "type": "Cultural/Historical",
                        "description": "Discovering the secluded courtyards and hidden architectural details throughout the district.",
                        "suitable_for": [
                            "Curious explorers",
                            "History enthusiasts",
                            "Photographers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You prioritize dining experiences and gastronomic exploration",
                "You appreciate quiet, historic surroundings with character",
                "You want an authentic medieval atmosphere with contemporary comforts"
            ],
            "avoid_if": [
                "You need spacious accommodations, as buildings tend to be historic and compact",
                "You require convenient parking or vehicle access",
                "You prefer modern amenities and spaces over historic character"
            ],
            "insider_tips": [
                "Make restaurant reservations well in advance, especially for weekends",
                "Visit mid-week to experience the quarter at its most peaceful and atmospheric",
                "Explore the small alleys leading off the main streets to discover hidden architectural gems"
            ]
        },
        {
            "name": "Arts Quarter",
            "alternate_names": [
                "Museum District",
                "Cultural Quarter",
                "South Quarter"
            ],
            "character": "Creative and cultured with a bohemian atmosphere, featuring museums, galleries, design shops, and a vibrant mix of historic and contemporary architecture.",
            "location": {
                "central": false,
                "description": "South of the historic center near Citadelpark, characterized by elegant streets, cultural institutions, and a mix of architectural styles.",
                "borders": [
                    "Historic Center",
                    "Citadelpark",
                    "Sint-Pieters Station Area",
                    "University District"
                ],
                "landmarks": [
                    "SMAK (Museum of Contemporary Art)",
                    "MSK (Museum of Fine Arts)",
                    "Design Museum Gent"
                ]
            },
            "history": {
                "overview": "Developed in the 19th century as an upscale extension of the city, initially planned around museums and cultural institutions, evolved into a center for arts and design, experienced renewal in recent decades with addition of contemporary museums and creative businesses.",
                "significance": "Represents Ghent's cultural evolution and artistic identity, bridging historical traditions with contemporary creativity.",
                "notable_events": [
                    "Establishment of Museum of Fine Arts in 1798",
                    "Creation of Citadelpark in late 19th century",
                    "Opening of SMAK contemporary art museum in 1975",
                    "Development as design and creative district since 1990s",
                    "Integration of historic institutions with contemporary arts spaces"
                ]
            },
            "practical_info": {
                "transit": [
                    "Tram connections to city center and train station",
                    "Bus routes throughout the area",
                    "Bicycle-friendly with dedicated lanes",
                    "Approximately 15-minute walk from historic center"
                ],
                "safety": "Very safe, including evening hours",
                "best_time_to_visit": "Daytime for museums, evening for dining and cultural events",
                "walkability": "Very walkable with pleasant streets and good sidewalks"
            },
            "appeal": {
                "known_for": [
                    "Museums",
                    "Art galleries",
                    "Design shops"
                ],
                "atmosphere": [
                    "Cultural",
                    "Creative",
                    "Sophisticated"
                ],
                "best_for": [
                    "Art lovers",
                    "Culture seekers",
                    "Design enthusiasts"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 4,
                "green_spaces": 4,
                "shopping": 4,
                "dining": 4,
                "nightlife": 3,
                "cultural": 5,
                "historic": 3
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "SMAK (Municipal Museum of Contemporary Art)",
                        "type": "Contemporary Art Museum",
                        "description": "Leading contemporary art museum with provocative exhibitions and significant collection housed in a modernist building in Citadelpark.",
                        "appeal": "Experience cutting-edge contemporary art in a museum known for challenging conventional boundaries."
                    },
                    {
                        "name": "MSK (Museum of Fine Arts)",
                        "type": "Fine Arts Museum",
                        "description": "Historic museum with extensive collection spanning from medieval to modern art, particularly strong in Flemish painting.",
                        "appeal": "Explore an outstanding collection of Flemish masters in a beautifully renovated neoclassical building."
                    }
                ],
                "dining": [
                    {
                        "name": "OAK",
                        "cuisine": "Contemporary fusion",
                        "price_range": "€€€",
                        "known_for": "Seasonal tasting menus with creative presentations",
                        "atmosphere": "Sophisticated restaurant with minimalist design and artistic touches."
                    },
                    {
                        "name": "Le Botaniste",
                        "cuisine": "Organic Plant-based",
                        "price_range": "€€",
                        "known_for": "Innovative vegan cuisine in apothecary-themed setting",
                        "atmosphere": "Unique botanical laboratory concept with health-focused menu."
                    }
                ],
                "activities": [
                    {
                        "name": "Gallery Hopping",
                        "type": "Cultural",
                        "description": "Self-guided tour of the district's numerous art galleries and exhibition spaces.",
                        "suitable_for": [
                            "Art enthusiasts",
                            "Collectors",
                            "Cultural explorers"
                        ]
                    },
                    {
                        "name": "Design Shopping",
                        "type": "Shopping/Cultural",
                        "description": "Exploring the quarter's design shops, concept stores, and boutiques showcasing Belgian designers.",
                        "suitable_for": [
                            "Design enthusiasts",
                            "Shoppers seeking unique items",
                            "Creative professionals"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You're primarily interested in art, design, and culture",
                "You prefer a quieter area with easy access to the city center",
                "You appreciate a mix of historic and contemporary environments"
            ],
            "avoid_if": [
                "You want to be in the heart of the historic center",
                "You're looking for medieval atmosphere and architecture",
                "You prefer busy, lively neighborhoods with constant activity"
            ],
            "insider_tips": [
                "Many museums are closed on Mondays, plan accordingly",
                "Visit the area during exhibition openings for a chance to meet local artists",
                "The park between SMAK and MSK is perfect for a break between museum visits"
            ]
        },
        {
            "name": "Portus Ganda",
            "alternate_names": [
                "Docklands",
                "Eastern Harbor",
                "Confluence Quarter"
            ],
            "character": "Regenerated and scenic with a waterfront focus, featuring converted warehouses, modern developments, and recreational facilities around the confluence of Ghent's rivers.",
            "location": {
                "central": false,
                "description": "Eastern edge of the city center where the Lys and Scheldt rivers meet, historically the site of Ghent's original harbor, now redeveloped as a marina and recreational area.",
                "borders": [
                    "Historic Center",
                    "Dampoort",
                    "Macharius-Heirnis",
                    "Sint-Macharius"
                ],
                "landmarks": [
                    "Portus Ganda Marina",
                    "Roman archaeological site",
                    "Van Eyck Swimming Pool"
                ]
            },
            "history": {
                "overview": "Originated as Ghent's first harbor where the city was founded, named after the Roman-era port 'Ganda' at the confluence of the Lys and Scheldt rivers, declined as a commercial port when larger facilities were built elsewhere, underwent significant redevelopment in the early 2000s transforming industrial space into recreational and residential areas.",
                "significance": "Represents Ghent's origins and its modern urban renewal, connecting the city's founding location with contemporary waterfront living.",
                "notable_events": [
                    "Roman settlement at the confluence",
                    "Medieval development as Ghent's first port",
                    "Industrial decline in the 20th century",
                    "Major regeneration project launched in 2001",
                    "Portus Ganda Marina opening in 2005"
                ]
            },
            "practical_info": {
                "transit": [
                    "Tram connections to city center",
                    "Bus services throughout the area",
                    "Bicycle paths along the waterfront",
                    "Water taxi services in summer"
                ],
                "safety": "Very safe, including evening hours",
                "best_time_to_visit": "Afternoon for water activities, evening for riverside dining",
                "walkability": "Very walkable with pleasant waterfront promenades"
            },
            "appeal": {
                "known_for": [
                    "Marina",
                    "Waterfront views",
                    "Recreational activities"
                ],
                "atmosphere": [
                    "Relaxed",
                    "Scenic",
                    "Active"
                ],
                "best_for": [
                    "Water enthusiasts",
                    "Outdoor activity lovers",
                    "Architecture admirers"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 4,
                "green_spaces": 4,
                "shopping": 2,
                "dining": 3,
                "nightlife": 2,
                "cultural": 3,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Portus Ganda Marina",
                        "type": "Waterfront/Marina",
                        "description": "Modern marina at the historic confluence of the Lys and Scheldt rivers with moorings for recreational boats and pleasant waterfront areas.",
                        "appeal": "Enjoy the peaceful atmosphere where Ghent's rivers meet and understand the city's connection to water."
                    },
                    {
                        "name": "Van Eyck Swimming Pool",
                        "type": "Architectural Landmark/Recreation",
                        "description": "Historic art deco swimming pool carefully restored to its 1930s glory while functioning as a modern swimming facility.",
                        "appeal": "Swim in one of Europe's most beautiful swimming pools, a masterpiece of art deco design."
                    }
                ],
                "dining": [
                    {
                        "name": "Lekker Gec",
                        "cuisine": "Contemporary Belgian",
                        "price_range": "€€",
                        "known_for": "Fresh local ingredients with waterfront views",
                        "atmosphere": "Modern bistro with riverside terrace and relaxed vibe."
                    },
                    {
                        "name": "De Lieve",
                        "cuisine": "Mediterranean-Belgian Fusion",
                        "price_range": "€€€",
                        "known_for": "Seafood specialties and waterside dining",
                        "atmosphere": "Elegant restaurant in converted waterfront building with panoramic views."
                    }
                ],
                "activities": [
                    {
                        "name": "River Kayaking",
                        "type": "Outdoor Recreation",
                        "description": "Kayak rental and guided tours along Ghent's historic waterways starting from the marina.",
                        "suitable_for": [
                            "Active travelers",
                            "Water sports enthusiasts",
                            "Unique perspective seekers"
                        ]
                    },
                    {
                        "name": "Waterfront Cycling",
                        "type": "Outdoor Recreation",
                        "description": "Cycling along dedicated paths following the rivers, connecting historic center with outlying areas.",
                        "suitable_for": [
                            "Casual cyclists",
                            "Photography enthusiasts",
                            "Active sightseers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You enjoy waterfront views and activities",
                "You prefer a relaxed atmosphere with good access to the center",
                "You appreciate the combination of historic significance and modern amenities"
            ],
            "avoid_if": [
                "You want to be surrounded by medieval architecture",
                "You're looking for extensive shopping options or nightlife",
                "You prefer bustling urban environments over water-oriented spaces"
            ],
            "insider_tips": [
                "Book the Van Eyck pool in advance if you want to swim in this architectural gem",
                "The morning light is perfect for photographs of the riverside buildings",
                "Waterside paths connect to longer cycling routes into the countryside"
            ]
        },
        {
            "name": "University District",
            "alternate_names": [
                "Student Quarter",
                "Overpoort",
                "Sint-Pietersnieuwstraat Area"
            ],
            "character": "Energetic and youthful with a vibrant atmosphere, featuring a mix of historic university buildings, student hangouts, and cultural venues catering to Ghent's large student population.",
            "location": {
                "central": false,
                "description": "South-east of the historic center around Ghent University's main buildings, extending toward Sint-Pieters Station with Overpoort as its nightlife hub.",
                "borders": [
                    "Historic Center",
                    "Arts Quarter",
                    "Sint-Pieters Station Area",
                    "Strop"
                ],
                "landmarks": [
                    "Ghent University Book Tower",
                    "Aula Academica",
                    "Overpoort Street"
                ]
            },
            "history": {
                "overview": "Developed around Ghent University, founded in 1817 as the first Dutch-speaking university in Belgium, expanded significantly in the 20th century as the university grew, transformed the surrounding area into a student-focused district with increasing cultural and social venues.",
                "significance": "Represents Ghent's intellectual life and youth culture, contributing to the city's reputation as a progressive cultural center.",
                "notable_events": [
                    "Founding of Ghent University in 1817",
                    "Construction of iconic Book Tower in 1930s",
                    "Student protests of the 1960s-70s",
                    "Development of Overpoort as nightlife street",
                    "Recent sustainable campus developments"
                ]
            },
            "practical_info": {
                "transit": [
                    "Tram connections to city center and train station",
                    "Bus routes throughout the area",
                    "Very bicycle-friendly with extensive bike paths",
                    "Approximately 20-minute walk from historic center"
                ],
                "safety": "Generally safe, though Overpoort can be rowdy on weekend nights",
                "best_time_to_visit": "Weekday afternoons for university buildings, evenings for student atmosphere",
                "walkability": "Very walkable with good pedestrian infrastructure"
            },
            "appeal": {
                "known_for": [
                    "Student life",
                    "Academic buildings",
                    "Budget dining"
                ],
                "atmosphere": [
                    "Youthful",
                    "Intellectual",
                    "Lively"
                ],
                "best_for": [
                    "Young travelers",
                    "Budget travelers",
                    "Nightlife seekers"
                ]
            },
            "categories": {
                "touristy": 2,
                "residential": 4,
                "green_spaces": 3,
                "shopping": 3,
                "dining": 4,
                "nightlife": 5,
                "cultural": 4,
                "historic": 3
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Book Tower",
                        "type": "Architectural Landmark",
                        "description": "Modernist university library designed by Henry van de Velde, housing over 3 million books in its distinctive 64-meter tower.",
                        "appeal": "Visit this masterpiece of modernist architecture, recently restored to its original glory, with spectacular views from the upper floors."
                    },
                    {
                        "name": "Aula Academica",
                        "type": "Historic University Building",
                        "description": "Ceremonial hall of Ghent University built in neoclassical style, hosting academic ceremonies and events.",
                        "appeal": "Step inside the historic heart of Ghent's academic tradition in this magnificent 19th-century building."
                    }
                ],
                "dining": [
                    {
                        "name": "De Geus van Gent",
                        "cuisine": "Belgian Comfort Food",
                        "price_range": "€",
                        "known_for": "Student-friendly prices and hearty portions",
                        "atmosphere": "Casual café with student vibe and lively conversations."
                    },
                    {
                        "name": "Soup'R",
                        "cuisine": "Healthy/Vegetarian",
                        "price_range": "€",
                        "known_for": "Fresh homemade soups and sandwiches",
                        "atmosphere": "Bright, contemporary space popular with students and faculty."
                    }
                ],
                "activities": [
                    {
                        "name": "University Building Tour",
                        "type": "Cultural/Educational",
                        "description": "Self-guided tour of the university's historic and architectural highlights.",
                        "suitable_for": [
                            "Architecture enthusiasts",
                            "Education history buffs",
                            "Photography fans"
                        ]
                    },
                    {
                        "name": "Student Nightlife",
                        "type": "Entertainment",
                        "description": "Experiencing the energetic bar scene along Overpoort Street, the center of student nightlife.",
                        "suitable_for": [
                            "Young travelers",
                            "Nightlife enthusiasts",
                            "Budget-conscious visitors"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You're looking for budget-friendly accommodations and dining",
                "You enjoy youthful energy and student atmosphere",
                "You appreciate intellectual environments and cultural activities"
            ],
            "avoid_if": [
                "You prefer quiet, as the area can be lively, especially during term time",
                "You're looking for luxury accommodations or fine dining",
                "You want a traditional tourist experience focused on medieval Ghent"
            ],
            "insider_tips": [
                "University buildings are quieter and more accessible during semester breaks",
                "Look for student restaurants offering 'dagschotel' (dish of the day) for great value meals",
                "The Botanical Garden of Ghent University is a peaceful hidden gem in this busy area"
            ]
        }
    ],
    "activityTypes": {
        "spring": [
            "Cherry blossom viewing at Ghent University Botanical Garden",
            "Boat tours on the canals as they reopen for the season",
            "Design Museum Gent special exhibitions",
            "Outdoor café culture in Korenmarkt",
            "Photography walks through Patershol as flowers emerge",
            "Spring markets in the historic center",
            "MSK (Museum of Fine Arts) special exhibitions",
            "Cycling tours of the city outskirts"
        ],
        "summer": [
            "Ghent Festival (Gentse Feesten) in July throughout Historic Center",
            "Rooftop bar visits for sunset views",
            "Outdoor concerts in Citadelpark",
            "Swimming at historic Van Eyck pool",
            "Kayaking on urban waterways",
            "Light Festival (triennial event)",
            "Picnics along the Graslei waterfront",
            "Open-air cinema evenings"
        ],
        "autumn": [
            "Ghent Film Festival",
            "Cultural season opening events at various venues",
            "Autumn beer tastings at local breweries",
            "Contemporary art exhibitions at SMAK",
            "Photography in Historic Center with fall colors",
            "Food festivals celebrating harvest season",
            "Jazz concerts in historic venues",
            "Theater season premieres in Arts Quarter"
        ],
        "winter": [
            "Ghent Light Festival (when occurring in winter cycle)",
            "Winter markets throughout Historic Center",
            "Cozy beer café exploration in Patershol",
            "Cathedral concerts and musical performances",
            "Museum visits to escape cold weather",
            "Belgian chocolate workshops",
            "New Year's celebrations along the Graslei",
            "Winter food walking tours focusing on comfort foods"
        ]
    }
}