{
    "Spring": {
        "activities": [
            {
                "name": "Ghent Floralies",
                "type": "Flower Exhibition",
                "description": "Belgium's prestigious flower show featuring magnificent floral displays and garden designs from around the world.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring showcases flowers at their peak bloom for this quadrennial event.",
                "booking_tips": "Purchase tickets online to avoid long queues."
            },
            {
                "name": "Ghent Book Festival",
                "type": "Festival",
                "description": "A celebration of literature with book presentations, author signings, and literary discussions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Annual spring event perfect for book lovers of all ages.",
                "booking_tips": "Check schedule for popular author events and arrive early."
            },
            {
                "name": "Graslei and Korenlei Stroll",
                "type": "Historical Walk",
                "description": "Walk along Ghent's picturesque medieval harbor with its guild houses and vibrant waterfront.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring provides pleasant temperatures for sightseeing.",
                "booking_tips": "No booking required, but consider a guided walking tour for historical insights."
            },
            {
                "name": "University Botanical Garden",
                "type": "Garden",
                "description": "Explore Ghent University's botanical collection with specialty gardens and greenhouses.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring is ideal for viewing blooming plants and new growth.",
                "booking_tips": "Check university website for special spring exhibitions."
            },
            {
                "name": "Blaarmeersen Recreation Area",
                "type": "Outdoor Recreation",
                "description": "Enjoy outdoor activities at this recreational park with walking paths, lake, and sports facilities.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring weather is perfect for outdoor activities without summer crowds.",
                "booking_tips": "No reservation needed for general access."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Gentse Feesten",
                "type": "Festival",
                "description": "One of Europe's largest cultural festivals with music, theater, and performances throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held in July, the festival transforms the entire city for ten days.",
                "booking_tips": "Book accommodations months in advance if visiting during this period."
            },
            {
                "name": "Boat Tour on Ghent Canals",
                "type": "Boat Tour",
                "description": "Cruise through Ghent's medieval canals for unique views of the city's architecture and landmarks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the best weather for water activities.",
                "booking_tips": "Purchase tickets at departure points along Graslei or book online."
            },
            {
                "name": "Film Fest Gent in the Park",
                "type": "Film Festival",
                "description": "Outdoor film screenings in Ghent's parks as part of the city's renowned film festival.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings are perfect for outdoor cinema.",
                "booking_tips": "Check the festival program and book tickets for popular screenings."
            },
            {
                "name": "Kouter Flower Market",
                "type": "Market",
                "description": "Browse the traditional Sunday flower market on Kouter Square, a Ghent tradition since 1772.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer offers the widest variety of flowers and plants.",
                "booking_tips": "Arrive early for the best selection and to avoid crowds."
            },
            {
                "name": "Bourgoyen-Ossemeersen Nature Reserve",
                "type": "Nature",
                "description": "Explore this wetland nature reserve with walking paths and rich biodiversity just outside the city center.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer brings abundant wildlife and lush vegetation.",
                "booking_tips": "No reservation needed, but bring binoculars for birdwatching."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Ghent Light Festival",
                "type": "Light Show",
                "description": "A spectacular light art festival transforming the city's historical center with installations by international artists.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held in autumn every three years, when early darkness enhances light displays.",
                "booking_tips": "Follow the suggested route to see all installations."
            },
            {
                "name": "Ghent Beer Festival",
                "type": "Festival",
                "description": "Sample local and Belgian craft beers with tastings and brewery demonstrations.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn's cooler temperatures complement hearty Belgian beers.",
                "booking_tips": "Purchase a tasting package for the best experience."
            },
            {
                "name": "Museum Night Ghent",
                "type": "Cultural Event",
                "description": "Visit Ghent's museums after hours with special exhibitions, performances, and activities.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn evenings create the perfect atmosphere for museum exploration.",
                "booking_tips": "Buy a pass for access to all participating museums."
            },
            {
                "name": "Ghent Art Book Fair",
                "type": "Art Fair",
                "description": "Discover independent publishers, artists' books, and print works from international creators.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Indoor autumn event perfect for art and book enthusiasts.",
                "booking_tips": "Check event website for workshops and talks schedule."
            },
            {
                "name": "MSK Fine Arts Museum",
                "type": "Museum",
                "description": "Explore Ghent's finest art collection with works from the Middle Ages to the 20th century.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is ideal for indoor cultural activities.",
                "booking_tips": "Check for temporary exhibitions that may require separate tickets."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Ghent Winter Festival",
                "type": "Market",
                "description": "Experience the festive Christmas market with local crafts, food stalls, and winter attractions.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter illuminations create a magical atmosphere throughout the historical center.",
                "booking_tips": "Visit on weekdays to avoid weekend crowds."
            },
            {
                "name": "Ice Skating at Korenmarkt",
                "type": "Ice Skating",
                "description": "Enjoy ice skating in the heart of the city with view of Saint Nicholas' Church.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "A classic winter activity in Ghent's festive setting.",
                "booking_tips": "Rent skates on-site and arrive early on weekends."
            },
            {
                "name": "Winter Wonderland Light Trail",
                "type": "Light Show",
                "description": "Follow a magical light path through the city center showcasing Ghent's historical buildings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Early winter darkness enhances the light displays.",
                "booking_tips": "Download the map or use the free app to follow the complete route."
            },
            {
                "name": "St. Bavo's Cathedral Concerts",
                "type": "Concert",
                "description": "Attend classical and choral performances in the magnificent setting of St. Bavo's Cathedral.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter acoustics and atmosphere enhance the musical experience.",
                "booking_tips": "Book well in advance for Christmas and New Year's concerts."
            },
            {
                "name": "STAM City Museum",
                "type": "Museum",
                "description": "Discover the history of Ghent from the Middle Ages to present day in this interactive museum.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for exploring Ghent's fascinating history indoors.",
                "booking_tips": "Audio guides are available in multiple languages."
            }
        ]
    }
}