{
    "Spring": {
        "activities": [
            {
                "name": "Springfestival Graz",
                "type": "Music Festival",
                "description": "Urban indoor festival focused on electronic art and music, featuring international artists across various venues throughout Graz. This prestigious festival showcases cutting-edge electronic music, digital art installations, and experimental performances in historic and modern venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive (depends on ticket type)",
                "seasonal_notes": "Kicks off the festival season in Graz, usually late May/early June. The festival coincides with the city's spring awakening and offers a perfect blend of contemporary culture and historic atmosphere.",
                "booking_tips": "Check festival website for specific dates, lineup, and ticket sales. Book accommodation early as the festival attracts international visitors. Consider purchasing multi-day passes for the full experience.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Explore Eggenberg Palace Gardens",
                "type": "Park / Garden",
                "description": "Witness the blooming flowers and lush greenery in the expansive gardens of Eggenberg Palace. The UNESCO World Heritage site comes alive in spring with peacocks displaying, historic fountains flowing, and the palace's Baroque gardens in full bloom.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget (Park entry fee)",
                "seasonal_notes": "Gardens come alive in spring; peacocks are often seen displaying. The palace gardens feature over 400 years of horticultural history with rare plants and seasonal blooms.",
                "booking_tips": "Palace interior tours require separate booking/tickets. Visit on weekdays for fewer crowds. Bring a picnic to enjoy in the gardens.",
                "coordinates": {
                    "latitude": 47.0742,
                    "longitude": 15.3917
                }
            },
            {
                "name": "Hike the Murradweg (Mur River Bike Path)",
                "type": "Outdoor Activity",
                "description": "Enjoy hiking or cycling along sections of the Mur River path as the weather warms up. The well-maintained path offers scenic views of the river, passing through historic districts and providing access to local cafes and viewpoints.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Pleasant temperatures and budding nature make for scenic walks/rides. Spring brings fresh greenery and blooming wildflowers along the riverbanks.",
                "booking_tips": "Path is accessible from various points in the city. Rent bikes from local shops or use the city's bike-sharing system. Pack water and snacks for longer excursions.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Visit the Farmers Markets",
                "type": "Market",
                "description": "Experience the vibrant spring markets at Kaiser-Josef-Platz and Lendplatz, offering fresh seasonal produce, local specialties, and the first harvests of the year. These markets showcase Styrian agricultural traditions and local food culture.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature fresh asparagus, wild herbs, and early vegetables. The atmosphere is particularly lively as locals celebrate the return of fresh produce.",
                "booking_tips": "Visit early for the best selection. Bring cash as many vendors don't accept cards. Try local specialties like pumpkin seed oil and Styrian wines.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Explore the Schlossberg",
                "type": "Outdoor Activity",
                "description": "Hike up the Schlossberg hill to enjoy panoramic views of Graz as the city awakens from winter. The historic hill offers walking paths, the iconic Clock Tower, and peaceful spots to enjoy the spring weather.",
                "indoor": false,
                "best_time": "Morning or Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings fresh greenery and blooming flowers to the Schlossberg. The hill is less crowded than summer and offers pleasant temperatures for hiking.",
                "booking_tips": "Access via stairs, funicular, or elevator. Early morning offers the best light for photography. Pack a picnic to enjoy at the top.",
                "coordinates": {
                    "latitude": 47.0744,
                    "longitude": 15.4389
                }
            },
            {
                "name": "Styrian Wine Tasting",
                "type": "Food & Drink",
                "description": "Visit local wine taverns (Buschenschank) in the South Styrian wine region to taste young wines and seasonal specialties. The spring season offers unique wine experiences as vineyards begin their new growing cycle.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is ideal for visiting Buschenschank taverns as they reopen after winter. Taste young wines and seasonal specialties like asparagus dishes.",
                "booking_tips": "Many Buschenschank require advance booking. Consider a guided wine tour for the best experience. Check opening times as they vary by season.",
                "coordinates": {
                    "latitude": 46.75,
                    "longitude": 15.6
                }
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Styriarte Music Festival",
                "type": "Music Festival",
                "description": "Prestigious festival for classical and early music held in various historic venues across Graz, including Eggenberg Palace and the Graz Cathedral. The festival features world-renowned musicians and unique performances in stunning historic settings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Major classical music event, typically June/July. The festival takes advantage of Graz's historic venues and pleasant summer evenings.",
                "booking_tips": "Book tickets well in advance, especially for popular performances. Consider package deals for multiple events. Dress appropriately for historic venues.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "La Strada Street Theatre Festival",
                "type": "Festival",
                "description": "International festival of street art, puppet theatre, and nouveau cirque taking over the city's squares and streets. The festival transforms Graz into a vibrant stage with performances, installations, and interactive art experiences.",
                "indoor": false,
                "best_time": "Daytime & Evening",
                "price_range": "Mostly Free (some indoor shows may require tickets)",
                "seasonal_notes": "Brings a vibrant, artistic atmosphere to the city, usually late July/early August. Perfect for families and art enthusiasts.",
                "booking_tips": "Check the program for locations and times of performances. Some indoor shows require advance booking. Plan your route to catch multiple performances.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Swimming at Schwarzlsee",
                "type": "Lake / Recreation",
                "description": "Popular recreational lake south of Graz offering swimming, water sports, and leisure facilities. The lake features sandy beaches, water slides, and various sports activities in a natural setting.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget (Entry fee)",
                "seasonal_notes": "Ideal for cooling off on hot summer days. The lake is surrounded by forests and offers hiking trails and picnic areas.",
                "booking_tips": "Can get busy on weekends; easily reachable by bus. Arrive early to secure a good spot. Bring your own food and drinks.",
                "coordinates": {
                    "latitude": 46.9667,
                    "longitude": 15.4167
                }
            },
            {
                "name": "Aufsteirern Festival",
                "type": "Cultural Festival",
                "description": "Largest folk culture festival in Austria celebrating Styrian traditions with food, music, dance, and crafts. The festival showcases traditional costumes, folk music, and regional specialties in a festive atmosphere.",
                "indoor": false,
                "best_time": "Afternoon / Evening",
                "price_range": "Budget/Moderate (Food/Drink purchases)",
                "seasonal_notes": "Usually held in September, marking the end of summer. Experience authentic Styrian culture and traditions.",
                "booking_tips": "Very popular, expect large crowds. Wear comfortable shoes. Try traditional Styrian dishes and local wines.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Outdoor Dining at Hauptplatz",
                "type": "Dining",
                "description": "Enjoy al fresco dining at the historic Hauptplatz, surrounded by beautiful architecture and the lively atmosphere of Graz's main square. Many restaurants offer outdoor seating with views of the Town Hall and surrounding historic buildings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Summer evenings are perfect for outdoor dining with pleasant temperatures and extended daylight hours.",
                "booking_tips": "Reserve tables in advance, especially on weekends. Consider restaurants with views of the square for the best atmosphere.",
                "coordinates": {
                    "latitude": 47.0705,
                    "longitude": 15.4393
                }
            },
            {
                "name": "Bike Tour of Graz",
                "type": "Outdoor Activity",
                "description": "Explore Graz by bicycle, following dedicated bike paths and discovering hidden corners of the city. The well-developed cycling infrastructure makes it easy to navigate between attractions and neighborhoods.",
                "indoor": false,
                "best_time": "Morning or Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Summer offers long daylight hours and pleasant weather for cycling. The city's bike paths are well-maintained and scenic.",
                "booking_tips": "Rent bikes from local shops or use the city's bike-sharing system. Plan your route to include major attractions and parks.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Visit Kunsthaus Graz",
                "type": "Museum",
                "description": "Explore the iconic 'Friendly Alien' building housing contemporary art exhibitions. The unique architecture and cutting-edge exhibitions make this a must-visit cultural destination in summer.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "The air-conditioned museum offers a cool retreat from summer heat while showcasing contemporary art.",
                "booking_tips": "Check exhibition schedules in advance. Combine with a visit to the Murinsel for a complete modern art experience.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Steirischer Herbst Festival",
                "type": "Arts Festival",
                "description": "Avant-garde festival for contemporary art, theatre, performance, and discourse held across various venues. This internationally renowned festival showcases cutting-edge contemporary culture and artistic innovation.",
                "indoor": true,
                "best_time": "Varies (Check Program)",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Major international arts festival, typically September/October. The festival attracts artists and visitors from around the world.",
                "booking_tips": "Book tickets for specific performances and exhibitions in advance. Check the festival program for venues and schedules.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Klanglicht Light Art Festival",
                "type": "Festival",
                "description": "Impressive festival illuminating the city center with light installations and artistic projections. Historic buildings and public spaces become canvases for stunning light art, creating a magical atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Transforms the city after dark, usually late October. The festival creates a unique way to experience Graz's architecture.",
                "booking_tips": "Popular event, best explored on foot. Dress warmly as evenings can be cool. Follow the festival map for the best route.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Lange Nacht der Museen (Long Night of Museums)",
                "type": "Cultural Event",
                "description": "One ticket grants access to numerous museums across Graz and Styria, open late into the night. This annual event offers special exhibitions, guided tours, and unique cultural experiences.",
                "indoor": true,
                "best_time": "Evening / Night",
                "price_range": "Budget (Single ticket price)",
                "seasonal_notes": "Usually held in early October. The event provides a unique opportunity to explore museums in a different atmosphere.",
                "booking_tips": "Plan your route in advance, utilize the shuttle services if available. Start with smaller museums to avoid crowds.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Wine Tasting along South Styrian Wine Route",
                "type": "Culinary / Sightseeing",
                "description": "Take a day trip to the nearby wine region to enjoy scenic vineyards, taste young wine ('Sturm'), and visit traditional 'Buschenschank' taverns. The rolling hills offer stunning autumn colors and excellent wine experiences.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate (Transport, food, wine)",
                "seasonal_notes": "Harvest season, beautiful autumn colors. Experience the traditional wine culture and seasonal specialties.",
                "booking_tips": "Requires car or organized tour. Check Buschenschank opening times. Book wine tastings in advance.",
                "coordinates": {
                    "latitude": 46.75,
                    "longitude": 15.6
                }
            },
            {
                "name": "Autumn Walk in Stadtpark",
                "type": "Park",
                "description": "Enjoy a peaceful walk through Graz's Stadtpark, experiencing the beautiful autumn foliage and serene atmosphere. The park features walking paths, historic monuments, and seasonal displays.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The park is particularly beautiful in autumn with vibrant fall colors and fewer crowds than summer.",
                "booking_tips": "Visit in the afternoon for the best lighting for photography. Bring a camera to capture the autumn colors.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Visit Landeszeughaus (Styrian Armoury)",
                "type": "Museum",
                "description": "Explore the world's largest historic armoury, housing over 32,000 pieces of medieval and Renaissance weaponry. The museum offers a fascinating glimpse into Styria's military history and craftsmanship.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler weather makes indoor museums an ideal choice for cultural enrichment.",
                "booking_tips": "Purchase tickets online to avoid queues. Consider a guided tour for deeper historical insights.",
                "coordinates": {
                    "latitude": 47.0705,
                    "longitude": 15.4393
                }
            },
            {
                "name": "Cooking Class - Styrian Cuisine",
                "type": "Workshop",
                "description": "Learn to cook traditional Styrian dishes with a hands-on cooking class, focusing on seasonal ingredients and regional specialties like pumpkin seed oil dishes and Styrian Backhendl.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides a bounty of ingredients for culinary exploration, including pumpkins and seasonal vegetables.",
                "booking_tips": "Book early, especially for popular classes. Check if the class includes a market visit for ingredient selection.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Graz Advent Markets (Christmas Markets)",
                "type": "Market / Festival",
                "description": "Multiple charming Christmas markets spread across the city center, offering crafts, food, Glühwein, and festive atmosphere. Each market has its own character, from traditional to modern, creating a magical winter experience.",
                "indoor": false,
                "best_time": "Afternoon / Evening",
                "price_range": "Budget (Food/Drink purchases)",
                "seasonal_notes": "Runs from late November until Christmas. The markets create a warm, festive atmosphere with traditional Austrian Christmas traditions.",
                "booking_tips": "Each market has a slightly different theme; visit several. Weekdays are less crowded. Try traditional Styrian Christmas specialties.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Ice Rink in Landhaus Courtyard",
                "type": "Ice Skating",
                "description": "Skate in the magical setting of the Renaissance Landhaus courtyard, transformed into an ice rink during Advent. The historic architecture provides a stunning backdrop for this winter tradition.",
                "indoor": false,
                "best_time": "Afternoon / Evening",
                "price_range": "Budget (Skate rental/entry fee)",
                "seasonal_notes": "Part of the Graz Advent experience. The rink is open during the Christmas market season.",
                "booking_tips": "Check specific opening hours and potential time slots. Skate rentals are available on-site.",
                "coordinates": {
                    "latitude": 47.0705,
                    "longitude": 15.4393
                }
            },
            {
                "name": "Skiing/Snowboarding near Graz",
                "type": "Ski Resort",
                "description": "Access smaller, local ski resorts near Graz (e.g., Präbichl, Salzstiegl) or larger resorts within a couple of hours drive for winter sports. The region offers various options for different skill levels.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate to Expensive (Lift pass, rental, transport)",
                "seasonal_notes": "Dependent on snow conditions, typically December-March. The resorts offer both downhill and cross-country skiing options.",
                "booking_tips": "Check snow reports and resort operating status. Consider day trip bus packages. Book equipment rentals in advance.",
                "coordinates": {
                    "latitude": 47.50,
                    "longitude": 15.00
                }
            },
            {
                "name": "Visit Eggenberg Palace",
                "type": "Historical Site",
                "description": "Tour the magnificent Eggenberg Palace and its museums, offering a warm retreat from winter weather. The palace's state rooms and art collections provide cultural enrichment during the colder months.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers fewer crowds, allowing a more leisurely exploration of the palace and its collections.",
                "booking_tips": "Purchase tickets online to avoid queues. Consider an audio guide for a self-paced tour.",
                "coordinates": {
                    "latitude": 47.0742,
                    "longitude": 15.3917
                }
            },
            {
                "name": "Hot Chocolate at Traditional Cafes",
                "type": "Café",
                "description": "Warm up with traditional Austrian hot chocolate and pastries at historic cafes like Delikatessen Frankowitsch or other traditional establishments. Experience the cozy atmosphere of Graz's cafe culture.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season for enjoying indulgent hot beverages and traditional Austrian pastries.",
                "booking_tips": "Visit during off-peak times to avoid crowds. Try traditional Austrian pastries like Sachertorte or Apfelstrudel.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            },
            {
                "name": "Attend a Concert at Graz Cathedral",
                "type": "Concert",
                "description": "Experience classical music concerts in the stunning setting of Graz Cathedral, known for its impressive architecture and excellent acoustics. The cathedral hosts various musical performances throughout the winter season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter evenings are perfect for indoor concerts, providing warmth and cultural enrichment in a historic setting.",
                "booking_tips": "Book tickets well in advance, as concerts often sell out quickly. Dress appropriately for the historic venue.",
                "coordinates": {
                    "latitude": 47.0705,
                    "longitude": 15.4393
                }
            },
            {
                "name": "Explore the Covered Markets",
                "type": "Shopping",
                "description": "Wander through Graz's historic covered markets and shopping passages, featuring unique shops, cafes, and beautiful architecture. These indoor spaces provide a cozy retreat from winter weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The covered markets provide a warm retreat from the winter chill while offering local shopping experiences.",
                "booking_tips": "Take your time to explore the various passages and markets. Many shops offer traditional Styrian products and souvenirs.",
                "coordinates": {
                    "latitude": 47.0707,
                    "longitude": 15.4395
                }
            }
        ]
    }
} 