{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May offers arguably Stockholm's most pleasant weather: increasingly sunny, mild temperatures (average highs ~16°C/61°F), perfect for exploring outdoors as the city bursts into green."
            },
            {
                "reason": "City in Bloom",
                "details": "Experience Stockholm adorned with spring flowers. See tulips in Kungsträdgården and potentially the tail end of the cherry blossoms early in the month. Parks are lush and inviting."
            },
            {
                "reason": "Outdoor Cafes & Lively Atmosphere",
                "details": "Outdoor seating ('uteserveringar') becomes widespread. Enjoy coffee, drinks, or meals outdoors, soaking up the returning warmth and vibrant city life."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "While tourism picks up significantly, May generally sees fewer crowds and potentially better prices than the peak months of June, July, and August."
            },
            {
                "reason": "Archipelago Awakens",
                "details": "Ferry services to the archipelago increase, making it easier and more pleasant to take day trips to nearby islands as services and amenities reopen."
            },
            {
                "reason": "Gröna Lund Amusement Park Opens",
                "details": "Stockholm's beloved seaside amusement park on Djurgården usually opens for the season in late April/early May, offering rides and entertainment."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "While often pleasant, May can still bring cooler days, wind, and rain showers. Packing layers is essential."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks a definite shift towards high season. Expect more noticeable crowds and rising prices for flights and accommodation compared to early spring."
            },
            {
                "reason": "May Day Holiday (May 1st)",
                "details": "May 1st is a major public holiday. Expect widespread closures (shops, Systembolaget, banks) and potentially large demonstrations/marches affecting city center access and transport."
            },
            {
                "reason": "Ascension Day Holiday (Potential)",
                "details": "Ascension Day (Kristi Himmelsfärdsdag), a public holiday, often falls in May (date varies). This creates a long weekend, increasing domestic travel and potentially impacting availability/prices."
            },
            {
                "reason": "Pollen Season",
                "details": "Spring blooms, especially birch trees, mean high pollen counts, significantly affecting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C (59°F)",
                    "low": "6°C (43°F)"
                },
                "precipitation": "Moderate chance of rain showers, but significantly more sunshine and longer days than April. Can still be cool, especially evenings.",
                "general_tips": "Pack layers: t-shirts, sweaters, a medium-weight jacket (waterproof useful), comfortable walking shoes. Sunglasses and potentially allergy medication."
            },
            "tourism_level": {
                "crowds": "Moderate, noticeably busier than April. Very busy around May 1st and potentially Walpurgis Night hangover (April 30th).",
                "pricing": "Shoulder/High season prices emerging. Book ahead, especially around May 1st.",
                "overall_atmosphere": "Vibrant spring awakening. City is greening up. Lively feel, especially when sunny. Potential disruption/closures on May 1st."
            },
            "events_holidays": [
                {
                    "name": "Walpurgis Night (Valborgsmässoafton) - Evening Before",
                    "date": "April 30 (Evening)",
                    "description": "Eve of May 1st. Celebrated with bonfires, singing, and student festivities. Main Stockholm celebration usually at Skansen. Riddarholmen sometimes has events.",
                    "notes": "Popular event, especially at Skansen (expect crowds). May impact city atmosphere leading into May 1st."
                },
                {
                    "name": "May Day / Labor Day (Första maj)",
                    "date": "May 1",
                    "description": "Public holiday. Characterized by political demonstrations and marches by labor unions, primarily in the city center.",
                    "notes": "Widespread closures (shops, Systembolaget, banks). Expect traffic/transport disruptions in central areas due to marches. Check opening status for museums/sites."
                },
                {
                    "name": "Cherry Blossom Peak (Potential End)",
                    "date": "Early May",
                    "description": "The spectacular pink cherry blossoms in Kungsträdgården typically peak late April/early May. You might catch the end of the bloom.",
                    "notes": "Very popular photo spot when in bloom."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "See Cherry Blossoms in Kungsträdgården",
                    "where": "Kungsträdgården park, city center",
                    "description": "If timing is right (early May), witness the beautiful pink cherry blossoms. Even without peak bloom, the park is pleasant.",
                    "practical_tips": "Check bloom status online ('körsbärsblomning Kungsträdgården'). Can get very crowded during peak bloom.",
                    "best_time": "Daytime, early May",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Skansen Open-Air Museum",
                    "where": "Djurgården island",
                    "description": "Explore the historic buildings, see Nordic animals, and enjoy spring activities. Check for any specific May Day or spring programs.",
                    "practical_tips": "Good activity for May 1st if open (check hours). Allow several hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Fika at an Outdoor Café ('Uteservering')",
                    "where": "Various locations (Gamla Stan, Södermalm, Östermalm)",
                    "description": "Enjoy the Swedish coffee and cake tradition at one of the many outdoor seating areas opening up.",
                    "practical_tips": "Choose a sunny spot. Great for people-watching.",
                    "best_time": "Mid-morning or Afternoon",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": true
                 },
                {
                    "activity": "Explore Djurgården Island",
                    "where": "Djurgården",
                    "description": "Walk or cycle around the green 'museum island', home to Vasa Museum, Skansen, ABBA Museum, Nordic Museum, Rosendals Trädgård (garden), and more.",
                    "practical_tips": "Rent bikes near the bridge or use public transport (tram/bus/ferry). Very pleasant in spring.",
                    "best_time": "Full Day",
                    "estimated_cost": "Free (to explore) / High (multiple museum entries)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "18°C (64°F)",
                    "low": "8°C (46°F)"
                },
                "precipitation": "Generally pleasant, sunny, and warmer spring weather. Reduced chance of rain. Long daylight hours.",
                "general_tips": "Focus on lighter layers, but keep a jacket/sweater for evenings. Sun protection increasingly important."
            },
            "tourism_level": {
                "crowds": "High season approaching. Busy, especially on weekends and if Ascension Day falls here.",
                "pricing": "High season prices likely in effect for most accommodations/flights.",
                "overall_atmosphere": "Beautiful late spring / early summer feel. Ideal for outdoor activities and exploring the city before peak summer heat/crowds."
            },
            "events_holidays": [
                 {
                    "name": "Ascension Day (Kristi Himmelsfärdsdag)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday. Creates a long weekend ('klämdag' - bridge day on Friday is common).",
                    "notes": "Check date for the year. Expect closures (shops, banks). Increased domestic travel; book accommodation/transport ahead if traveling this weekend."
                 },
                 {
                    "name": "Gröna Lund Amusement Park Open",
                    "date": "Usually daily or weekends by late May",
                    "description": "Enjoy rides, games, and potentially concerts at Stockholm's amusement park.",
                    "notes": "Check official website for opening hours and concert schedule."
                 },
                 {
                    "name": "Stockholm Marathon (Potential - Check Dates)",
                    "date": "Sometimes late May / early June",
                    "description": "Major international marathon event through central Stockholm.",
                    "notes": "Significant road closures and crowds along the route if occurring. Check date for the year."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Archipelago Day Trip",
                    "where": "Vaxholm, Grinda, Sandhamn (further), etc.",
                    "description": "Take a ferry further into the archipelago as more routes and island services become available. Enjoy island walks, cafes, and scenery.",
                    "practical_tips": "Check Waxholmsbolaget/Strömma timetables. Book popular routes/restaurants ahead, especially weekends/Ascension weekend.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Rosendals Trädgård (Garden)",
                    "where": "Djurgården island",
                    "description": "Explore the beautiful biodynamic garden with orchards, flower beds, greenhouses, a shop, and a popular café serving organic food and pastries.",
                    "practical_tips": "Lovely spot for lunch or fika in a green setting. Accessible by walking/biking on Djurgården or bus.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (to wander) / Moderate (café/shop)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Cycle Around the City",
                    "where": "Various routes (e.g., Djurgården, Skeppsholmen, Södermalm waterfront)",
                    "description": "Rent a bike and explore Stockholm's bike-friendly paths in pleasant spring weather.",
                    "practical_tips": "Numerous rental options available. Be mindful of dedicated bike lanes.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (bike rental)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Enjoy Evening Drinks by the Water",
                    "where": "Waterfront bars/restaurants (e.g., Strandvägen, Södermälarstrand, Hornstull)",
                    "description": "Take advantage of the long, mild evenings to have drinks or dinner with views over the water.",
                    "practical_tips": "Popular spots can get busy. Some locations offer stunning sunset views.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                 }
            ]
        }
    }
}