{
    "Spring": {
        "activities": [
            {
                "name": "ARoS Art Museum Visit",
                "type": "Museum",
                "description": "Experience contemporary art at ARoS, including the famous Rainbow Panorama rooftop installation by Olafur Eliasson offering colorful views of the city.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is perfect for enjoying both the indoor exhibitions and rooftop views as days get longer.",
                "booking_tips": "Purchase tickets online to avoid queues. Consider the combined ticket if you plan to visit other attractions."
            },
            {
                "name": "Aarhus Literature Festival",
                "type": "Festival",
                "description": "Join Denmark's vibrant literary scene with readings, discussions and cultural events featuring Danish and international authors.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held annually in April, perfect for book enthusiasts and cultural explorers.",
                "booking_tips": "Check the program online and reserve seats for popular author events in advance."
            },
            {
                "name": "Botanical Gardens and Tropical Houses",
                "type": "Garden",
                "description": "Explore Aarhus University's beautiful botanical gardens with their distinctive domed greenhouses featuring Mediterranean and tropical plants.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings beautiful blooms and pleasant temperatures for exploring both outdoor gardens and greenhouses.",
                "booking_tips": "Free entry to both gardens and tropical houses. Guided tours available for a small fee."
            },
            {
                "name": "Aarhus Street Food Market",
                "type": "Market",
                "description": "Sample international cuisine in this popular covered market housed in repurposed shipping containers with over 30 food stalls.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Budget",
                "seasonal_notes": "Spring is a great time to visit as the market comes alive with new seasonal offerings.",
                "booking_tips": "No bookings required. Visit during weekdays to avoid weekend crowds."
            },
            {
                "name": "Harbor Bath and Beach",
                "type": "Outdoor Recreation",
                "description": "Experience Aarhus' urban beach and harbor swimming facilities designed by renowned architect Bjarke Ingels Group.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Late spring can be warm enough for sunbathing, though water may still be chilly for swimming.",
                "booking_tips": "No booking required. Changing facilities available on site."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "NorthSide Festival",
                "type": "Music Festival",
                "description": "Experience one of Denmark's premier music festivals featuring international artists and a focus on sustainability.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held in June, this festival showcases the best of Danish summer with long daylight hours.",
                "booking_tips": "Purchase tickets months in advance as they sell out quickly. Consider camping packages."
            },
            {
                "name": "Den Gamle By (The Old Town)",
                "type": "Open-Air Museum",
                "description": "Step back in time at this living museum featuring relocated historic buildings from across Denmark representing different eras.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the full experience with all buildings open and costumed staff bringing history to life.",
                "booking_tips": "Plan for at least half a day. Purchase tickets online for a small discount."
            },
            {
                "name": "Aarhus Harbor Kayaking",
                "type": "Water Activity",
                "description": "Paddle through Aarhus' revitalized harbor area, taking in modern architecture and waterfront developments from a unique perspective.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions with calm waters and warm temperatures.",
                "booking_tips": "Book guided tours in advance. No experience necessary for basic tours."
            },
            {
                "name": "Moesgaard Beach",
                "type": "Beach",
                "description": "Relax at this beautiful beach south of Aarhus with its distinctive forest backdrop and clear swimming waters.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Popular among locals during Danish summer holidays, with good swimming conditions.",
                "booking_tips": "Accessible by bus or bike from the city center. Bring your own refreshments."
            },
            {
                "name": "Aarhus Festival",
                "type": "Cultural Festival",
                "description": "Experience Denmark's largest cultural festival with hundreds of events spanning music, theater, dance, art and gastronomy throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Held in late August/early September, offering perfect late summer weather for outdoor events.",
                "booking_tips": "Many events are free, but popular performances require advance tickets."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Moesgaard Museum",
                "type": "Museum",
                "description": "Explore Denmark's prehistoric and Viking history in this architectural marvel built into a hillside south of Aarhus.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is perfect for exploring indoor exhibits, followed by a walk in the surrounding forest with fall colors.",
                "booking_tips": "Book tickets online. Allow at least 3 hours to explore the exhibitions thoroughly."
            },
            {
                "name": "Aarhus Beer Festival",
                "type": "Festival",
                "description": "Sample craft beers from across Denmark and beyond with a focus on local Aarhus and Jutland breweries.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn's cooler weather pairs perfectly with rich Danish craft beers.",
                "booking_tips": "Purchase tasting packages online. Designated driver options available."
            },
            {
                "name": "Dokk1 Cultural Center",
                "type": "Cultural Space",
                "description": "Visit Scandinavia's largest public library and cultural center, an architectural landmark on the waterfront with events and exhibitions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings a variety of events and a cozy atmosphere for reading and cultural activities.",
                "booking_tips": "Check online calendar for special events and workshops."
            },
            {
                "name": "Marselisborg Forests Hike",
                "type": "Nature Walk",
                "description": "Explore the beautiful forests south of Aarhus with well-marked trails, stunning autumn colors, and views of Aarhus Bay.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "October offers spectacular fall colors and crisp, clear days ideal for hiking.",
                "booking_tips": "Download trail maps from the VisitAarhus website or use the official Marselisborg app."
            },
            {
                "name": "Aarhus Theatre Season Opening",
                "type": "Performing Arts",
                "description": "Experience Danish drama at Aarhus' beautiful Art Nouveau theater as the autumn season begins with new productions.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn marks the beginning of the main theater season with premier productions.",
                "booking_tips": "English subtitles available for selected performances. Book well in advance for popular shows."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Aarhus Christmas Market",
                "type": "Market",
                "description": "Experience traditional Danish Christmas spirit at the festive market in the historic Latin Quarter with crafts, food, and mulled wine (gløgg).",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Experience the hygge atmosphere of a Danish Christmas with twinkling lights and seasonal decorations.",
                "booking_tips": "Visit on weekdays to avoid weekend crowds. Try the æbleskiver (traditional Danish pancake balls)."
            },
            {
                "name": "Ice Skating at Musikhusparken",
                "type": "Ice Skating",
                "description": "Enjoy outdoor ice skating in the heart of Aarhus with the Concert Hall as a beautiful backdrop.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "A perfect winter activity running from December through February, weather permitting.",
                "booking_tips": "Skate rental available on-site. Evening sessions feature colorful lights and music."
            },
            {
                "name": "Winter Wellness at Badeanstalten Spanien",
                "type": "Wellness",
                "description": "Warm up in this historic bathhouse with saunas, steam rooms, and cold water plunges in a beautifully restored building.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season to enjoy traditional Nordic sauna culture.",
                "booking_tips": "Women-only days are available. Bring your own towel or rent one on-site."
            },
            {
                "name": "Aarhus Symphony Orchestra Winter Concerts",
                "type": "Concert",
                "description": "Enjoy classical music performances in the stunning Musikhuset concert hall with special winter and holiday programming.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The concert hall's acoustics offer a perfect escape from winter weather with world-class performances.",
                "booking_tips": "Book tickets early for Christmas and New Year special performances."
            },
            {
                "name": "Winter Light Festival",
                "type": "Festival",
                "description": "Experience Aarhus transformed by light installations throughout the city center, illuminating dark winter evenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Brings color and warmth to the darkest time of year in February.",
                "booking_tips": "Download the festival map to follow the complete light trail. Walking tours available."
            }
        ]
    }
}