{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Nytårsdag)",
          "notes": "New Year's Day is a public holiday throughout Denmark. Most attractions, shops, and restaurants are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations at Rådhuspladsen. ARoS Aarhus Art Museum and other major museums typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout central Aarhus, particularly along Strøget and in Bruun's Galleri. Christmas decorations gradually come down. The Latin Quarter offers cozy indoor cafés perfect for the cold winter days."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Off-season with few tourists and excellent hotel value. Cold winter weather with occasional snow. Limited daylight hours (approximately 7-8 hours). Winter sales (Vinterudsalg) continue throughout January, particularly in the shopping district. ARoS Aarhus Art Museum and Moesgaard Museum offer excellent indoor experiences during this quiet season. The Aarhus Symphony Orchestra winter season is in full swing."
        }
      ],
      "weatherHighC": 2,
      "weatherLowC": -3,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "Winter continues with cold weather but slightly longer days (approximately 8-9 hours of daylight). Aarhus' low tourism season continues, making it ideal for museum visits and indoor cultural activities without crowds. Den Gamle By (The Old Town) offers a glimpse into traditional Danish winter life in the past centuries."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 3,
          "special": true,
          "event": "Winter Break (Vinterferie)",
          "notes": "Danish school winter break typically falls in February. Family-friendly activities are available at Aarhus' museums and cultural institutions. ARoS Aarhus Art Museum and Moesgaard Museum often feature special exhibitions and activities for children. The Botanical Gardens' tropical houses provide a warm escape."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "special": true,
          "event": "Fastelavn",
          "notes": "Fastelavn (Danish Carnival) typically occurs in February, with children's activities throughout the city. Traditions include 'slå katten af tønden' (hitting a decorated barrel), costumes, and special Fastelavn buns (fastelavnsboller) available at bakeries throughout Aarhus."
        }
      ],
      "weatherHighC": 3,
      "weatherLowC": -2,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Early spring brings warming temperatures and longer days (10-11 hours of daylight). Crocuses and snowdrops appear in the University Park and Botanical Gardens. The harbor area begins to become more lively as temperatures rise. The Aarhus Symphony Orchestra continues its spring season at Musikhuset Aarhus."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Forårets begyndelse)",
          "notes": "Spring officially begins, bringing early blooms to the Botanical Gardens and parks around Aarhus. Perfect time for exploring the city's historic center and Latin Quarter as café life begins to move outdoors on warmer days. Easter markets appear if Easter falls in late March. ARoS Aarhus Art Museum often introduces special spring exhibitions."
        }
      ],
      "weatherHighC": 7,
      "weatherLowC": 0,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Påske)",
          "notes": "Easter celebrations typically fall in April, with Maundy Thursday, Good Friday, Easter Sunday, and Easter Monday as public holidays. Easter markets operate in central Aarhus in the week before Easter. Spring blooms peak throughout the city's parks, especially at the Botanical Gardens and Marselisborg Palace Gardens. Outdoor cafés in the Latin Quarter become increasingly popular."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Aarhus Spring Festival",
          "notes": "The cultural spring season begins with performances at Musikhuset Aarhus and other venues. The harbor area becomes increasingly lively with outdoor activities. Den Permanente beach begins to see visitors on warmer days. Marselisborg Forests offer beautiful spring hiking with blooming anemones."
        }
      ],
      "weatherHighC": 11,
      "weatherLowC": 3,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day (Arbejdernes Kampdag)",
          "notes": "Labor Day is marked with demonstrations and events at Tangkrogen and central Aarhus. Many businesses are closed, but outdoor festivities and special museum exhibitions are available. Traditional May Day speeches and gatherings take place in parks."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 5,
          "notes": "May brings perfect spring weather with longer days (approximately 16 hours of daylight). The outdoor café scene in the Latin Quarter is in full swing. The harbor front promenade becomes a popular evening spot. The Botanical Gardens show spectacular late spring blooms."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26],
          "score": 5,
          "special": true,
          "event": "Ascension and Whitsun Holidays",
          "notes": "Ascension Day (40 days after Easter) is a public holiday with outdoor excursions popular in Marselisborg Forests and along Aarhus Bay. Whitsun weekend (50 days after Easter) brings a long holiday weekend with Whit Monday as a public holiday. Many locals take extended breaks. Perfect time for visiting Aarhus' attractions."
        },
        {
          "days": [27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "SPOT Festival",
          "notes": "SPOT Festival, showcasing new Scandinavian music, typically takes place in late May, bringing performances to venues throughout Aarhus. The city's cultural calendar is packed with events. The beaches along Aarhus Bay begin to see more visitors as summer approaches."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 7,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 5,
          "special": true,
          "event": "Constitution Day (Grundlovsdag)",
          "notes": "June 5th is Constitution Day, a half-holiday in Denmark with political speeches and celebrations throughout Aarhus, particularly at Tangkrogen and the University Park. Many businesses close at noon, but tourist attractions remain open."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "Northside Festival",
          "notes": "Northside Festival, a major music event, typically takes place in mid-June at Ådalen near Aarhus. The summer solstice brings the longest days of the year with approximately 18 hours of daylight. The harbor front, Latin Quarter, and beaches are bustling with activity. Outdoor dining reaches its peak."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Midsummer (Sankt Hans)",
          "notes": "Sankt Hans (Midsummer) on June 23rd features bonfires along the beaches of Aarhus Bay, particularly at Den Permanente and Tangkrogen. Traditional songs and speeches accompany the lighting of bonfires, complete with witch effigies. A festive atmosphere pervades the city."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Peak summer with warm temperatures. Danish school holidays begin, increasing family tourism. Excellent time for beach activities at Den Permanente and Ballehage. The Forest Tower in Marselisborg Forests offers panoramic views of Aarhus Bay. Many locals are on vacation, giving parts of the city a relaxed atmosphere."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Aarhus Jazz Festival",
          "notes": "The Aarhus Jazz Festival typically runs for 8-9 days in mid-to-late July, with performances throughout the city at various venues including the Concert Hall, Dokk1, and outdoor stages. The harbor front hosts evening concerts and food markets. Peak tourist season with bustling beaches and outdoor attractions."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
          "score": 4,
          "special": true,
          "event": "Aarhus Festival Prelude",
          "notes": "Early August continues the summer holiday season with warm weather perfect for beach visits and outdoor dining. Cultural events begin to intensify as the city prepares for the annual Aarhus Festival. The harbor front remains a center of activity with outdoor markets and performances."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Aarhus Festival (Aarhus Festuge)",
          "notes": "The Aarhus Festival, Denmark's largest cultural event, typically begins in late August and continues into early September. The entire city transforms with hundreds of cultural events including concerts, theater, art installations, and food experiences. The festival spans multiple venues including Musikhuset Aarhus, ARoS Aarhus Art Museum, and various outdoor spaces."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 5,
          "special": true,
          "event": "Aarhus Festival continues",
          "notes": "The Aarhus Festival continues into early September, bringing world-class entertainment to Denmark's second city. Perfect late summer weather for outdoor events and cultural activities. Tourism begins to decrease while weather remains beautiful. Danish schools are back in session."
        },
        {
          "days": [10, 11],
          "score": 4,
          "special": true,
          "event": "European Heritage Days (Historiens Dage)",
          "notes": "European Heritage Days (second weekend of September) open normally inaccessible historical buildings throughout Aarhus, including historic cellars, industrial sites, and architectural landmarks."
        },
        {
          "days": [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Aarhus Film Festival",
          "notes": "The Aarhus Film Festival typically takes place in September, showcasing international and Danish films at venues throughout the city. Perfect autumn weather for festival activities and exploring the historic city center. The Latin Quarter and canal area are particularly charming as leaves begin to change."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 9,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 4,
          "notes": "Perfect autumn weather for exploring Aarhus' historic districts and parks. Fall colors transform the University Park, Botanical Gardens, and Marselisborg Forests. Cultural events return to indoor venues as the weather cools. The Aarhus Symphony Orchestra's autumn season is in full swing at Musikhuset Aarhus."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21],
          "score": 4,
          "special": true,
          "event": "Autumn School Holiday (Efterårsferie)",
          "notes": "The Danish autumn school holiday typically falls in mid-October, bringing families to Aarhus' cultural attractions. ARoS Aarhus Art Museum, Moesgaard Museum, and Den Gamle By offer special activities for children. The Tivoli Friheden amusement park often has Halloween-themed events during this period."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Halloween",
          "notes": "Halloween celebrations have become increasingly popular in Denmark, with themed events at Tivoli Friheden, Den Gamle By, and restaurants throughout Aarhus. Cultural events continue at indoor venues as the days grow shorter (approximately 9-10 hours of daylight by month's end)."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 6,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 3,
          "notes": "Full autumn with cooler temperatures. Excellent time for museum visits and indoor cultural activities. The Latin Quarter becomes particularly appealing with its cozy cafés. The fall foliage reaches its peak in early November in Marselisborg Forests and the University Park."
        },
        {
          "days": [11],
          "score": 3,
          "special": true,
          "event": "St. Martin's Day (Mortensaften)",
          "notes": "Mortensaften (St. Martin's Eve) is celebrated with traditional roast duck dinners at restaurants throughout Aarhus. Many restaurants offer special menus on this evening, requiring advance reservations. Not a public holiday but a cultural tradition."
        },
        {
          "days": [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 3,
          "notes": "Mid-November sees cooling temperatures. Indoor attractions like ARoS Aarhus Art Museum and Moesgaard Museum offer special exhibitions. The Aarhus Symphony Orchestra presents special fall concerts at Musikhuset Aarhus. Daylight hours decrease to approximately 8 hours by month's end."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Advent Season begins",
          "notes": "The city prepares for its Christmas celebrations. Decorations appear throughout the city center, particularly around Store Torv and in the Latin Quarter. The first Advent Sunday (four Sundays before Christmas) typically falls in late November, marking the official start of the Christmas season. Advent concerts begin at Aarhus Cathedral and other churches."
        }
      ],
      "weatherHighC": 7,
      "weatherLowC": 2,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Aarhus Christmas Market (Julemarked)",
          "notes": "The Aarhus Christmas Market transforms the city center from late November until December 23rd. Festive stalls spread across multiple locations including Store Torv, Lille Torv, and the Latin Quarter, featuring traditional crafts, food, and gløgg (mulled wine). The historic buildings provide a stunning backdrop with special light projections. December 13 brings Santa Lucia celebrations with candle-lit processions."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Juleaften)",
          "notes": "Christmas Eve is the main celebration day for most Danish families. Most businesses close by early afternoon. The Christmas Market ends. Aarhus Cathedral and other churches hold special services. Restaurants that remain open often require advance reservations for special Christmas Eve dinners."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Days (Juledage)",
          "notes": "December 25 (First Christmas Day) and December 26 (Second Christmas Day) are both public holidays. Most businesses, restaurants, and attractions are closed or operate with limited hours. A quiet time in the city with Marselisborg Forests and winter garden walks popular for locals."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is quiet. Major museums including ARoS Aarhus Art Museum, Moesgaard Museum, and Den Gamle By remain open. Good time for winter sales shopping along Strøget and in Bruun's Galleri. The Aarhus Symphony Orchestra typically performs special year-end productions."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Nytårsaften)",
          "notes": "New Year's Eve celebrations center around Rådhuspladsen with fireworks at midnight. The Queen's New Year's speech is broadcast at 6:00 PM and is traditionally watched by most Danes before evening festivities. Many restaurants offer special fixed-price Nytårsaften menus (advance reservation essential), and hotels host celebration events. The historic city center provides a spectacular backdrop for festivities."
        }
      ],
      "weatherHighC": 3,
      "weatherLowC": -1,
      "tourismLevel": 6
    }
  },
  "activityTypes": {
    "spring": [
      "Aarhus Spring Festival at the harbor front (April)",
      "Botanical Gardens Spring Blooms (March through May)",
      "ARoS Aarhus Art Museum Special Spring Exhibitions",
      "Latin Quarter Walking Tours",
      "Marselisborg Palace Gardens (tulips in April, roses begin in May)",
      "Den Gamle By (The Old Town) Spring Season",
      "SPOT Festival (late May)",
      "Outdoor café season begins in the Latin Quarter"
    ],
    "summer": [
      "Northside Festival (June)",
      "Aarhus Jazz Festival (July)",
      "Beach life at Den Permanente and Ballehage",
      "Harbor front events and outdoor dining",
      "Marselisborg Forest hikes and cycling",
      "Aarhus Festival (late August to early September)",
      "Canal tours and harbor boat trips",
      "Tivoli Friheden amusement park"
    ],
    "autumn": [
      "Aarhus Film Festival (September)",
      "European Heritage Days (second weekend of September)",
      "Autumn Colors at University Park and Marselisborg Forests (October-November)",
      "ARoS Aarhus Art Museum Fall Exhibitions",
      "Aarhus Symphony Orchestra Autumn Season",
      "Latin Quarter Autumn Atmosphere",
      "Moesgaard Museum Special Exhibitions",
      "Cultural events at Musikhuset Aarhus"
    ],
    "winter": [
      "Aarhus Christmas Market (late November to December 23)",
      "New Year's Eve Celebration at Rådhuspladsen (December 31)",
      "Winter Garden Tours at Botanical Gardens",
      "ARoS Aarhus Art Museum Winter Exhibitions",
      "Indoor shopping at Bruun's Galleri and the Latin Quarter",
      "Aarhus Symphony Orchestra Winter Season performances",
      "Cozy café culture in the Latin Quarter",
      "Winter swimming at Den Permanente (for the brave)"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or cold winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}