{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather",
                "details": "April in Lisbon boasts mild temperatures (averaging 18-20°C) and plenty of sunshine, perfect for exploring the city's hilly streets, viewpoints, and coastal areas before the summer heat arrives."
            },
            {
                "reason": "Blooming Jacaranda Trees",
                "details": "While peaking later, April often sees the start of the Jacaranda bloom, adding splashes of purple to Lisbon's already colorful cityscape, particularly in areas like Largo do Carmo."
            },
            {
                "reason": "Easter & Freedom Day Celebrations",
                "details": "Experience traditional Portuguese Easter celebrations if they fall in April, and witness the significant national holiday, Freedom Day (Dia da Liberdade) on April 25th, commemorating the Carnation Revolution."
            },
            {
                "reason": "Fewer Crowds than Summer",
                "details": "Enjoy popular attractions like Belém Tower, Jerónimos Monastery, and São Jorge Castle with relatively fewer tourists compared to the peak summer months."
            },
            {
                "reason": "Outdoor Activities",
                "details": "The comfortable weather is ideal for enjoying Lisbon's outdoor cafes, walking tours, exploring Alfama's narrow streets, and taking day trips to nearby Sintra or Cascais."
            },
            {
                "reason": "Peixe em Lisboa (Fish & Flavours)",
                "details": "Lisbon's premier gastronomic event dedicated to fish and seafood often takes place in April, featuring renowned chefs, cooking demonstrations, and gourmet tastings."
            },
            {
                "reason": "Spring Festivals and Events",
                "details": "April often hosts various cultural events, music festivals (like IndieLisboa film festival), and outdoor markets as the city embraces the spring season."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Spring Showers Possible",
                "details": "While generally sunny, April can still bring occasional rain showers. Pack layers and a light waterproof jacket or umbrella."
            },
            {
                "reason": "Easter Holiday Crowds & Closures",
                "details": "If Easter falls in April, expect larger crowds, higher accommodation prices, and potential closures of some shops or attractions during the main holiday days."
            },
            {
                "reason": "Freedom Day Closures",
                "details": "April 25th (Freedom Day) is a major public holiday. Banks, post offices, and many businesses will be closed, though most tourist attractions and restaurants remain open. Public transport runs on a holiday schedule."
            },
            {
                "reason": "Variable Temperatures",
                "details": "While days are pleasant, evenings and early mornings can still be cool, requiring layers of clothing."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "11°C"
                },
                "precipitation": "Moderate chance of spring showers, averaging around 60-70mm for the month, typically spread across 8-10 days. Days are getting longer and sunnier.",
                "general_tips": "Pack layers including sweaters and a light jacket for cooler evenings. Comfortable walking shoes are essential for Lisbon's hills and cobblestones. An umbrella is advisable."
            },
            "tourism_level": {
                "crowds": "Moderate shoulder season crowds. Increases significantly if Easter falls within this period.",
                "pricing": "Mid-range, potentially higher around Easter.",
                "overall_atmosphere": "Pleasant spring atmosphere, city feels vibrant but not overly crowded. Outdoor terraces start filling up."
            },
            "events_holidays": [
                {
                    "name": "Easter Celebrations (Semana Santa)",
                    "date": "Varies (can fall in early April)",
                    "description": "Religious processions (though less elaborate than in Spain or parts of Portugal), special church services, and traditional Easter foods like 'Folar da Páscoa' (sweet bread).",
                    "notes": "Good Friday might see some closures. Expect increased visitor numbers if Easter is in this period."
                },
                 {
                    "name": "Peixe em Lisboa (Fish & Flavours)",
                    "date": "Often early to mid-April (check specific year)",
                    "description": "Major seafood festival held at Pavilhão Carlos Lopes, featuring top chef demonstrations, tastings, and a gourmet market.",
                    "notes": "Requires tickets; very popular, book in advance or expect queues."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Alfama District",
                    "where": "Alfama",
                    "description": "Wander the oldest district of Lisbon, with its narrow cobblestone streets, Fado houses, colourful buildings, and São Jorge Castle.",
                    "practical_tips": "Wear comfortable shoes; get lost intentionally; many small cafes and viewpoints (miradouros); best explored on foot.",
                    "best_time": "Morning or late afternoon",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": false
                },
                {
                    "activity": "Ride Tram 28",
                    "where": "Various districts",
                    "description": "Take a rickety, iconic yellow tram ride through many of Lisbon's most famous neighborhoods, including Graça, Alfama, Baixa, and Estrela.",
                    "practical_tips": "Can get very crowded, ride early morning or late evening to avoid peak times; watch for pickpockets; buy Viva Viagem card for cheaper fares.",
                    "best_time": "Early Morning / Late Evening",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Belém Tower & Jerónimos Monastery",
                    "where": "Belém",
                    "description": "Explore these UNESCO World Heritage sites, key landmarks of the Manueline style and Portugal's Age of Discoveries.",
                    "practical_tips": "Buy combo tickets or Lisboa Card for savings; expect queues, especially for the Monastery; visit nearby Pastéis de Belém bakery.",
                    "best_time": "Morning (opens at 10 am)",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "São Jorge Castle Visit",
                    "where": "Alfama Hilltop",
                    "description": "Explore the historic Moorish castle overlooking the city, offering panoramic views of Lisbon and the Tagus River.",
                    "practical_tips": "Allow 1.5-2 hours; peacocks roam the grounds; wear good shoes for walking.",
                    "best_time": "Late Afternoon for sunset views",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "12°C"
                },
                "precipitation": "Decreasing chance of rain towards the end of the month, more consistent sunshine and warmer days.",
                "general_tips": "Lighter clothing suitable for daytime, but keep a sweater or light jacket for evenings. Sunscreen recommended on sunny days. Comfortable shoes remain crucial."
            },
            "tourism_level": {
                "crowds": "Moderate to High, increasing towards May. Busy around Freedom Day (April 25th).",
                "pricing": "Mid-range, potentially higher around the public holiday.",
                "overall_atmosphere": "Vibrant spring energy, more outdoor events, pleasant for extensive sightseeing."
            },
            "events_holidays": [
                {
                    "name": "Freedom Day (Dia da Liberdade)",
                    "date": "April 25",
                    "description": "National holiday commemorating the 1974 Carnation Revolution. Official ceremonies, parades (especially on Avenida da Liberdade), concerts, and political events.",
                    "notes": "Public holiday: banks, schools, many shops closed. Main attractions usually open. Public transport runs on holiday schedule."
                },
                {
                    "name": "IndieLisboa International Independent Film Festival",
                    "date": "Typically late April / early May (check dates)",
                    "description": "Major film festival showcasing independent cinema from around the world in various Lisbon cinemas.",
                    "notes": "Tickets required for screenings; festival pass available."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to Sintra",
                    "where": "Sintra (near Lisbon)",
                    "description": "Visit the fairytale town of Sintra, exploring Pena Palace, Quinta da Regaleira, and the Moorish Castle.",
                    "practical_tips": "Take the train from Rossio station (approx. 40 mins); Sintra is hilly, use local buses or tuk-tuks; book palace tickets online in advance to save time.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate to High (transport + entrance fees)",
                    "weather_dependent": true
                },
                {
                    "activity": "LX Factory Visit",
                    "where": "Alcântara",
                    "description": "Explore a trendy industrial complex converted into a hub of independent shops, restaurants, art studios, and creative spaces.",
                    "practical_tips": "Best visited afternoon/evening; Sunday market is popular; check for specific events or workshops.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "Low (free entry, costs vary)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Time Out Market Lisboa",
                    "where": "Cais do Sodré",
                    "description": "Experience Lisbon's vibrant food scene in this popular food hall featuring curated stalls from top chefs and restaurants.",
                    "practical_tips": "Can get very crowded, especially at peak meal times; communal seating; find a table before ordering.",
                    "best_time": "Lunch or Dinner (off-peak)",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Sunset Boat Tour on the Tagus",
                    "where": "Tagus River (departures from Belém or Cais do Sodré)",
                    "description": "Enjoy stunning views of Lisbon's skyline, Belém Tower, and the 25 de Abril Bridge from the water as the sun sets.",
                    "practical_tips": "Book in advance, especially on weekends; bring a jacket as it can be windy on the water.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                }
            ]
        }
    }
}