{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Fewer Crowds & Lower Prices",
                "details": "February is deep low season in Lisbon. Enjoy major attractions like Jerónimos Monastery and São Jorge Castle with minimal queues and benefit from lower prices for flights and accommodation."
            },
            {
                "reason": "Mild Winter Weather",
                "details": "While potentially rainy, Lisbon's February temperatures (avg. 15°C high) are much milder than most of Europe, allowing for comfortable sightseeing on dry days."
            },
            {
                "reason": "Carnival Celebrations",
                "details": "If Carnival falls in February, experience Portuguese celebrations. While Lisbon's isn't as famous as others, there are parades (especially for children), costume parties (bailes), and traditional treats."
            },
            {
                "reason": "Cozy Indoor Experiences",
                "details": "Perfect time to explore Lisbon's museums (like the Calouste Gulbenkian or National Azulejo Museum), enjoy long meals in traditional restaurants, or relax in historic cafes."
            },
            {
                "reason": "Authentic Atmosphere",
                "details": "Experience Lisbon more like a local, with fewer tourists around. Enjoy a calmer pace in neighborhoods like Alfama and Graça."
            },
            {
                "reason": "Early Almond Blossoms",
                "details": "Depending on the year's weather, late February might offer glimpses of early almond blossoms in parks or on day trips, hinting at the approaching spring."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Higher Chance of Rain",
                "details": "February is still within Lisbon's rainy season. Expect several overcast or rainy days, which can impact outdoor activities and views."
            },
            {
                "reason": "Cooler Temperatures",
                "details": "Although mild compared to elsewhere, it's still winter. Evenings and nights can be chilly (avg. 8°C low), requiring warm clothing."
            },
            {
                "reason": "Shorter Daylight Hours",
                "details": "Daylight hours are still relatively short (sunrise ~7:30 AM, sunset ~6:15 PM), limiting time for outdoor exploration in daylight."
            },
            {
                "reason": "Some Outdoor Activities Limited",
                "details": "Beach activities are generally off-limits, and some seasonal outdoor tours or attractions might operate on reduced schedules or not at all."
            },
            {
                "reason": "Carnival Crowds & Closures (if applicable)",
                "details": "If Carnival occurs, expect specific areas to be crowded during parades, potential minor closures on Shrove Tuesday (not a public holiday but observed by some), and possibly higher prices around that specific weekend."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "8°C"
                },
                "precipitation": "Still a relatively wet month, averaging 80-100mm of rain spread over 10-12 days. Expect a mix of sunny spells, overcast skies, and rainy periods.",
                "general_tips": "Pack layers, including sweaters and a waterproof/windproof jacket. An umbrella is essential. Comfortable, water-resistant footwear is recommended for cobblestones."
            },
            "tourism_level": {
                "crowds": "Low. Minimal queues at most attractions.",
                "pricing": "Low season rates for flights and accommodation, offering good value.",
                "overall_atmosphere": "Quiet and calm. Ideal for museum hopping and enjoying the city at a relaxed pace."
            },
            "events_holidays": [
                {
                    "name": "Valentine's Day (Dia dos Namorados)",
                    "date": "February 14",
                    "description": "Observed similarly to other Western countries. Restaurants may offer special menus, and flower/chocolate shops are busy.",
                    "notes": "Book popular restaurants in advance if planning a special meal. Not a public holiday."
                },
                {
                    "name": "Carnival Preparations (if applicable)",
                    "date": "Leading up to Carnival",
                    "description": "Shops start selling costumes and masks. Some initial smaller events or parties might occur.",
                    "notes": "Carnival dates vary based on Easter."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit the Calouste Gulbenkian Museum",
                    "where": "Avenidas Novas",
                    "description": "Explore a world-class collection of art spanning various eras and cultures, housed in a modernist building with beautiful gardens (even in winter).",
                    "practical_tips": "Excellent indoor activity. Allow several hours. Check opening times (usually closed Tuesdays). Gardens offer a peaceful walk.",
                    "best_time": "Anytime",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore Alfama District",
                    "where": "Alfama",
                    "description": "Wander the narrow, winding streets of Lisbon's oldest neighborhood without the summer crowds. Discover hidden squares, viewpoints, and traditional tascas.",
                    "practical_tips": "Wear comfortable, grippy shoes for steep, potentially wet cobblestones. Get lost and enjoy the atmosphere.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": true
                },
                {
                    "activity": "Ride Tram 28 (Quietly)",
                    "where": "Various districts",
                    "description": "Experience the iconic tram journey through historic neighborhoods with far fewer passengers than in peak season, allowing for better views and comfort.",
                    "practical_tips": "Still wise to watch belongings. Use Viva Viagem card. A round trip offers great sightseeing.",
                    "best_time": "Mid-morning or Mid-afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                },
                {
                    "activity": "Enjoy Portuguese Comfort Food",
                    "where": "Various traditional restaurants (Tasca)",
                    "description": "Sample hearty winter dishes like Cozido à Portuguesa (Portuguese stew), Arroz de Pato (duck rice), or Açorda (bread soup) in a cozy setting.",
                    "practical_tips": "Look for restaurants popular with locals. Lunch menus (prato do dia) offer good value.",
                    "best_time": "Lunch or Dinner",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "16°C",
                    "low": "9°C"
                },
                "precipitation": "Rain chance may slightly decrease towards the end of the month, but still expect mixed conditions. Daylight hours gradually increase.",
                "general_tips": "Continue with layered, waterproof clothing. Might encounter slightly milder, sunnier days, but evenings remain cool."
            },
            "tourism_level": {
                "crowds": "Remains low, unless Carnival falls during this period, which would cause a temporary spike.",
                "pricing": "Low season pricing persists, except possibly around Carnival weekend if applicable.",
                "overall_atmosphere": "Still quiet, but perhaps a subtle feeling of approaching spring on sunnier days. Carnival can bring pockets of lively celebration."
            },
            "events_holidays": [
                {
                    "name": "Carnival (Carnaval)",
                    "date": "Varies (can fall in late Feb)",
                    "description": "Main celebrations usually occur over the weekend leading up to Shrove Tuesday (Terça-feira Gorda). Includes street parades (like the children's parade in Principe Real), masked balls (bailes), and general revelry.",
                    "notes": "Shrove Tuesday is not an official public holiday but schools close and some businesses may too. Torres Vedras (outside Lisbon) has a very famous, traditional Carnival. Lisbon's is more low-key."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Jerónimos Monastery",
                    "where": "Belém",
                    "description": "Marvel at the intricate Manueline architecture of this UNESCO World Heritage site without the long queues typical of warmer months.",
                    "practical_tips": "Check opening times (usually closed Mondays). Allow ample time for the church (free entry) and the cloisters (paid entry).",
                    "best_time": "Morning",
                    "estimated_cost": "Moderate (for cloisters)",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore the National Azulejo Museum",
                    "where": "Beato",
                    "description": "Discover the history and artistry of Portuguese painted tiles (azulejos) in a beautiful former convent. Perfect for a rainy or cool day.",
                    "practical_tips": "Accessible by bus. Allow 1.5-2 hours. Includes a stunning chapel within the museum.",
                    "best_time": "Anytime",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Attend a Fado Performance",
                    "where": "Alfama or Bairro Alto",
                    "description": "Experience the soulful sounds of Fado in an intimate setting. The cozy atmosphere is particularly appealing on a cool winter evening.",
                    "practical_tips": "Book ahead for popular venues. Choose between venues offering dinner + show or drinks + show. Be respectful during performances.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                },
                 {
                    "activity": "Day Trip to Sintra (Quieter)",
                    "where": "Sintra (near Lisbon)",
                    "description": "Visit the fairytale palaces and castles of Sintra with significantly fewer crowds than in summer. The misty winter atmosphere can add a unique charm.",
                    "practical_tips": "Take the train from Rossio. Weather can be cooler and wetter than Lisbon; dress accordingly. Some outdoor areas might be slippery.",
                    "best_time": "Full Day (choose a potentially drier day)",
                    "estimated_cost": "Moderate to High (transport + entrance fees)",
                    "weather_dependent": true
                }
            ]
        }
    }
}