{
    "July": {
        "reasons_to_visit": [
            {
                "reason": "Peak Summer Weather",
                "details": "July offers Lisbon's hottest and sunniest weather, perfect for enjoying rooftop bars, viewpoints (miradouros), and the vibrant outdoor cafe culture. Long daylight hours maximize sightseeing time."
            },
            {
                "reason": "NOS Alive Music Festival",
                "details": "One of Portugal's biggest music festivals, NOS Alive, takes place in early July in nearby Algés, attracting major international rock, indie, and pop acts."
            },
            {
                "reason": "Beach Season in Full Swing",
                "details": "Ideal month for hitting the beaches near Lisbon. Take easy train rides to Cascais and Estoril or cross the river to the expansive Costa da Caparica beaches."
            },
            {
                "reason": "Festival ao Largo",
                "details": "Enjoy free outdoor performances of classical music, opera, ballet, and theatre in the beautiful Largo de São Carlos square throughout July."
            },
            {
                "reason": "Lively Atmosphere",
                "details": "The city buzzes with energy in July. Streets are lively, outdoor terraces are full, and there's a palpable summer holiday vibe, especially in the evenings."
            },
            {
                "reason": "Outdoor Dining & Nightlife",
                "details": "Experience Lisbon's fantastic al fresco dining scene and enjoy warm evenings at rooftop bars or in bustling nightlife districts like Bairro Alto and Cais do Sodré."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Peak Tourist Season & Crowds",
                "details": "July is peak season. Expect significant crowds at all major attractions (Belém, São Jorge Castle, Sintra), long queues, and packed public transport."
            },
            {
                "reason": "Intense Heat",
                "details": "Temperatures frequently exceed 30°C (86°F), and heatwaves are possible. The urban heat island effect and Lisbon's hills can make midday exploring strenuous."
            },
            {
                "reason": "Highest Prices",
                "details": "Accommodation and flight prices peak in July. Book everything far in advance for availability and better (though still high) rates."
            },
            {
                "reason": "Accommodation Scarcity",
                "details": "Finding good accommodation, especially with air conditioning (highly recommended), can be difficult and expensive if not booked well ahead."
            },
            {
                "reason": "Potential for Wildfires Nearby",
                "details": "While usually not impacting the city center directly, July is peak wildfire season in surrounding areas, which can occasionally affect air quality or day trip plans."
            }
        ],
        "first_half": {
            "date_range": "July 1–15",
            "weather": {
                "average_temperature": {
                    "high": "28°C",
                    "low": "18°C"
                },
                "precipitation": "Very little rainfall expected, typically only 1-2 days with measurable rain in the entire month. Expect long, hot, sunny days.",
                "general_tips": "Pack light summer clothing (cotton, linen), swimwear, hat, sunglasses, and high SPF sunscreen. Stay hydrated. Plan sightseeing for mornings and evenings to avoid peak heat."
            },
            "tourism_level": {
                "crowds": "Peak. Extremely busy at popular sites and viewpoints. Long queues are standard.",
                "pricing": "Peak season high for flights and accommodation. Book months in advance.",
                "overall_atmosphere": "Vibrant, energetic, and crowded. Strong summer holiday feel."
            },
            "events_holidays": [
                {
                    "name": "NOS Alive Festival",
                    "date": "Usually early/mid July (check specific dates)",
                    "description": "Major international music festival held over several days at Passeio Marítimo de Algés (just outside Lisbon). Features rock, indie, pop, and electronic acts.",
                    "notes": "Tickets sell out far in advance. Easily accessible by train/tram from central Lisbon. Expect large crowds."
                },
                {
                    "name": "Festival ao Largo",
                    "date": "Throughout July",
                    "description": "Free outdoor festival in Largo de São Carlos featuring nightly performances of classical music, opera, dance, and sometimes theatre by national companies.",
                    "notes": "Free entry, arrive early for seats. Evening performances. Beautiful setting in front of the São Carlos National Theatre."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend NOS Alive",
                    "where": "Passeio Marítimo de Algés",
                    "description": "Experience one of Europe's top summer music festivals with major international headliners and a lively atmosphere by the river.",
                    "practical_tips": "Book tickets and accommodation far ahead. Use public transport. Stay hydrated and use sun protection.",
                    "best_time": "Festival Days (Afternoon/Evening)",
                    "estimated_cost": "High (tickets + transport/food)",
                    "weather_dependent": false
                },
                {
                    "activity": "Beach Day in Cascais",
                    "where": "Cascais (via train)",
                    "description": "Take a scenic train ride to the coastal town of Cascais to enjoy its beaches, lively atmosphere, and seafood restaurants.",
                    "practical_tips": "Train from Cais do Sodré (~40 mins). Beaches will be crowded; go early or walk further from the station. Water can still be quite cold.",
                    "best_time": "Full Day",
                    "estimated_cost": "Low (transport) + food/activities",
                    "weather_dependent": true
                },
                 {
                    "activity": "Enjoy Festival ao Largo",
                    "where": "Largo de São Carlos, Chiado",
                    "description": "Catch a free evening performance of classical music, opera, or dance in a charming Lisbon square.",
                    "practical_tips": "Check the schedule online. Arrive 30-60 mins before start time for a seat. Bring water.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Sunset Views from a Miradouro",
                    "where": "Various (e.g., Miradouro da Senhora do Monte, Miradouro de Santa Catarina)",
                    "description": "Experience breathtaking sunset views over Lisbon's rooftops and the Tagus River from one of the city's many viewpoints.",
                    "practical_tips": "Can get crowded at popular spots. Some have kiosks selling drinks. Senhora do Monte offers the highest, most panoramic view.",
                    "best_time": "Evening (around sunset)",
                    "estimated_cost": "Free (or cost of drinks)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "July 16–31",
            "weather": {
                "average_temperature": {
                    "high": "29°C",
                    "low": "19°C"
                },
                "precipitation": "Continues to be very dry and sunny. Peak summer heat is most likely during this period.",
                "general_tips": "Air conditioning in accommodation is highly desirable. Seek shade during midday. Utilize indoor attractions like museums or churches during the hottest hours (approx. 1-4 PM)."
            },
            "tourism_level": {
                "crowds": "Remains at peak levels. Tourist density is high throughout central Lisbon and popular day trip destinations.",
                "pricing": "Peak season high prices persist for all travel-related costs.",
                "overall_atmosphere": "Intensely summery and bustling. Evenings are very lively as people escape the daytime heat."
            },
            "events_holidays": [
                 {
                    "name": "Festival ao Largo continues",
                    "date": "Throughout July",
                    "description": "Free outdoor performances continue in Largo de São Carlos.",
                    "notes": "Check schedule for specific performances."
                },
                 {
                    "name": "Super Bock Super Rock Festival (sometimes in July)",
                    "date": "Varies (check specific year, often near Meco beach south of Lisbon)",
                    "description": "Another major rock and alternative music festival, sometimes held in July in the greater Lisbon area.",
                    "notes": "Location varies year to year. Requires planning for transport if outside the city. Check dates and lineup."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Cool Off at Costa da Caparica",
                    "where": "Costa da Caparica (via ferry/bus or bus)",
                    "description": "Escape the heat at the long stretch of beaches south of the river. Take the mini-train (Transpraia) to find less crowded spots further down the coast.",
                    "practical_tips": "Bus from Praça de Espanha or ferry + bus combo. Beaches near the town are busiest. Water is Atlantic-cool.",
                    "best_time": "Full Day",
                    "estimated_cost": "Low (transport) + food",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit MAAT (Museum of Art, Architecture and Technology)",
                    "where": "Belém Waterfront",
                    "description": "Explore contemporary exhibitions in a stunning modern building with river views. Air-conditioned and a good escape from the heat.",
                    "practical_tips": "Check opening hours. Walkable roof offers great views. Combine with other Belém sights.",
                    "best_time": "Afternoon (to escape heat)",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Dinner in Bairro Alto / Principe Real",
                    "where": "Bairro Alto / Principe Real",
                    "description": "Enjoy dinner at one of the many restaurants in these lively neighborhoods, followed by drinks as the area comes alive at night.",
                    "practical_tips": "Bairro Alto is known for bars, Principe Real for slightly more upscale dining. Book popular restaurants. Streets get very busy late at night.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                },
                {
                    "activity": "Sintra Day Trip (Strategic Planning Needed)",
                    "where": "Sintra",
                    "description": "Visit Sintra's magical palaces, but be prepared for significant crowds and heat. Focus on one or two main sites.",
                    "practical_tips": "Go very early. Book tickets online WAY in advance. Consider visiting less crowded sites like Monserrate Palace or Quinta da Regaleira (still busy). Stay hydrated.",
                    "best_time": "Full Day (start extremely early)",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                }
            ]
        }
    }
}