{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Festas de Lisboa (Lisbon Festivals)",
                "details": "June is Lisbon's main festival month, celebrating the popular saints (Santos Populares), especially Santo António (St. Anthony), the city's patron saint. Expect street parties (arraiais), parades, concerts, grilled sardine stalls, and decorations throughout the historic neighborhoods."
            },
            {
                "reason": "Santo António Celebrations",
                "details": "The peak of the Festas is around St. Anthony's Day (June 13th), featuring the famous popular marches (Marchas Populares) parade on Avenida da Liberdade (night of June 12th) and mass weddings (Casamentos de Santo António)."
            },
            {
                "reason": "Warm & Sunny Weather",
                "details": "June offers reliably warm and sunny weather, ideal for exploring the city, enjoying viewpoints, dining outdoors, and taking day trips to nearby beaches before the peak summer heat arrives."
            },
            {
                "reason": "Long Daylight Hours",
                "details": "Enjoy the longest days of the year, with daylight lasting until after 9 PM, providing ample time for sightseeing, evening strolls, and enjoying Lisbon's vibrant atmosphere."
            },
            {
                "reason": "Grilled Sardines Season",
                "details": "June marks the peak season for grilled sardines (sardinhas assadas), a quintessential Lisbon experience enjoyed at street stalls and restaurants, especially during the Festas."
            },
            {
                "reason": "Lively Street Atmosphere",
                "details": "Historic neighborhoods like Alfama, Graça, Mouraria, and Bica come alive with street parties, music, dancing, and food stalls, creating an incredibly festive and unique atmosphere."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Increasing Crowds",
                "details": "June marks the start of the high tourist season. While perhaps not as packed as July/August, expect significant crowds at major attractions, especially around festival dates."
            },
            {
                "reason": "Higher Prices",
                "details": "Accommodation and flight prices increase significantly in June compared to spring. Booking well in advance is crucial, especially around the Santo António festival."
            },
            {
                "reason": "Festival Noise & Crowds",
                "details": "If staying in historic neighborhoods (Alfama, Graça, Bica), be prepared for noise from street parties (arraiais) lasting late into the night throughout June."
            },
            {
                "reason": "Potential for Heat",
                "details": "While generally pleasant, June can experience early heatwaves with temperatures climbing above 30°C (86°F), making midday exploration tiring."
            },
            {
                "reason": "Santo António Specific Crowds",
                "details": "The days around June 12th-13th are extremely busy, particularly along Avenida da Liberdade for the parade and in Alfama."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "25°C",
                    "low": "16°C"
                },
                "precipitation": "Low chance of rain, typically only 3-5 rainy days in the month with minimal amounts. Expect mostly sunny and warm conditions.",
                "general_tips": "Pack light summer clothing, sunglasses, hat, and sunscreen. Include comfortable walking shoes for hills and cobblestones. A light jacket or sweater might be needed for evenings."
            },
            "tourism_level": {
                "crowds": "High, especially around Portugal Day (June 10th) and leading up to Santo António (June 13th). Very crowded in festival neighborhoods.",
                "pricing": "High season prices. Book accommodation and popular tours/restaurants well in advance.",
                "overall_atmosphere": "Extremely festive and lively, particularly in historic districts due to Festas de Lisboa. Peak party atmosphere around Santo António."
            },
            "events_holidays": [
                {
                    "name": "Festas de Lisboa / Santos Populares Kick-off",
                    "date": "Throughout early June",
                    "description": "Street parties (arraiais) begin in neighborhoods like Alfama, Graça, Bica, Mouraria. Decorations go up, sardine grills appear, and music fills the streets.",
                    "notes": "Follow the music and smell of sardines! Arraiais get busier in the evenings and weekends."
                },
                {
                    "name": "Portugal Day (Dia de Portugal, de Camões e das Comunidades Portuguesas)",
                    "date": "June 10",
                    "description": "National holiday celebrating Portugal, Luís de Camões (national poet), and the Portuguese diaspora. Military parades and official ceremonies often take place.",
                    "notes": "Public holiday: Banks, post offices, many businesses closed. Most tourist attractions open. Expect patriotic displays."
                },
                {
                    "name": "Marchas Populares (Popular Marches Parade)",
                    "date": "Night of June 12",
                    "description": "The highlight of Festas de Lisboa. Elaborate parade down Avenida da Liberdade where different neighborhoods compete with themed costumes, songs, and choreography.",
                    "notes": "Extremely crowded event. Arrive hours early for a viewing spot. Runs very late into the night. Festive, loud atmosphere."
                },
                 {
                    "name": "Santo António (St. Anthony's Day)",
                    "date": "June 13",
                    "description": "Municipal holiday in Lisbon. Religious processions (especially around Sé Cathedral and Santo António Church), mass weddings (Casamentos de Santo António), and continued street parties.",
                    "notes": "Many Lisboetas take the day off. Expect large crowds in Alfama near the saint's church. Arraiais continue."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience an Arraial (Street Party)",
                    "where": "Alfama, Graça, Bica, Mouraria",
                    "description": "Join the locals at a neighborhood street party. Enjoy grilled sardines, caldo verde (green soup), beer/wine, pimba music (popular Portuguese folk music), and dancing.",
                    "practical_tips": "Best experienced in the evening/night. Bring cash. Wear comfortable shoes. Embrace the crowded, festive atmosphere.",
                    "best_time": "Evening / Night",
                    "estimated_cost": "Low to Moderate (food/drinks)",
                    "weather_dependent": true
                },
                {
                    "activity": "Watch the Marchas Populares Parade",
                    "where": "Avenida da Liberdade",
                    "description": "Witness the spectacular parade showcasing neighborhood pride with elaborate costumes and performances.",
                    "practical_tips": "Stake out a spot hours in advance (or find a spot further up/down the avenue). Be prepared for huge crowds and standing for a long time.",
                    "best_time": "Evening/Night of June 12th",
                    "estimated_cost": "Free (to watch)",
                    "weather_dependent": true
                },
                {
                    "activity": "Eat Grilled Sardines",
                    "where": "Street stalls, restaurants (esp. in Alfama/Graça)",
                    "description": "Try the iconic Lisbon summer food, freshly grilled sardines served simply on bread.",
                    "practical_tips": "Best during June (peak season). Eat with your hands like a local! Often sold from outdoor grills during Festas.",
                    "best_time": "Lunch or Dinner",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Santo António Church & Sé Cathedral",
                    "where": "Alfama",
                    "description": "Visit the church built on St. Anthony's birthplace and the nearby Lisbon Cathedral, especially significant around June 13th.",
                    "practical_tips": "Expect crowds around June 13th. Dress respectfully for church entry.",
                    "best_time": "Morning (before peak crowds on 13th)",
                    "estimated_cost": "Low (donations welcome)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "26°C",
                    "low": "17°C"
                },
                "precipitation": "Remains very dry and sunny. Temperatures continue to climb towards the end of the month.",
                "general_tips": "Sun protection is crucial. Stay hydrated. Consider accommodations with air conditioning. Evenings are pleasantly warm."
            },
            "tourism_level": {
                "crowds": "High. Continues to be busy as summer season progresses, though the intense festival peak around Santo António subsides slightly.",
                "pricing": "High season pricing continues. Advance booking still highly recommended.",
                "overall_atmosphere": "Festive atmosphere continues with arraiais (though potentially fewer mid-week), warm evenings perfect for outdoor dining and rooftop bars."
            },
            "events_holidays": [
                {
                    "name": "Festas de Lisboa / Santos Populares Continue",
                    "date": "Throughout June",
                    "description": "While the peak is mid-month, neighborhood street parties (arraiais) often continue, especially on weekends, throughout June.",
                    "notes": "Check local listings or wander through historic neighborhoods on weekend evenings."
                },
                 {
                    "name": "OUT JAZZ Festival",
                    "date": "Weekends throughout summer (starts May/June)",
                    "description": "Free jazz concerts held in different Lisbon gardens each weekend afternoon/evening.",
                    "notes": "Relaxed atmosphere. Check schedule for specific locations (e.g., Jardim da Estrela, Jardim do Campo Grande). Bring a blanket."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to Cascais/Estoril Beaches",
                    "where": "Cascais/Estoril (via train)",
                    "description": "Take the scenic coastal train to enjoy the beaches and relaxed vibe of these nearby towns.",
                    "practical_tips": "Train from Cais do Sodré. Beaches will be busy; consider walking further along the coast (paredão). Water is refreshing (cool).",
                    "best_time": "Full Day",
                    "estimated_cost": "Low (transport) + food",
                    "weather_dependent": true
                },
                {
                    "activity": "Sunset Boat Tour on the Tagus",
                    "where": "Departures from Belém or Cais do Sodré",
                    "description": "Enjoy beautiful views of the city skyline, bridges, and monuments from the river as the sun sets.",
                    "practical_tips": "Book in advance, especially for weekend evenings. Bring a light jacket as it can be breezy on the water.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Belém Monuments",
                    "where": "Belém",
                    "description": "Visit Jerónimos Monastery, Belém Tower, and the Monument to the Discoveries. Go early to avoid the worst queues.",
                    "practical_tips": "Consider buying a combined ticket or Lisboa Card. Allow ample time. Visit Pastéis de Belém bakery nearby.",
                    "best_time": "Early Morning",
                    "estimated_cost": "Moderate (entrance fees)",
                    "weather_dependent": false
                },
                {
                    "activity": "Rooftop Bar Drinks",
                    "where": "Various (e.g., TOPO Chiado, Park Bar, Sky Bar)",
                    "description": "Enjoy cocktails and stunning city views from one of Lisbon's many popular rooftop bars, perfect on warm June evenings.",
                    "practical_tips": "Can get crowded, especially at sunset. Some have cover charges or minimum spends. Dress code might apply at more upscale venues.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                }
            ]
        }
    }
}