{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather Emerging",
                "details": "March marks the arrival of spring in Lisbon, with increasingly sunny days, milder temperatures (avg. 17°C high), and the city starting to bloom, making it ideal for exploring before summer crowds."
            },
            {
                "reason": "Fewer Crowds",
                "details": "Enjoy Lisbon's major attractions like São Jorge Castle, Belém Tower, and museums with significantly fewer tourists than in peak season, allowing for a more relaxed experience."
            },
            {
                "reason": "Lower Prices (Shoulder Season)",
                "details": "Benefit from shoulder season pricing for flights and accommodation, offering better value compared to the summer months."
            },
            {
                "reason": "Blooming Mimosa Trees",
                "details": "Parts of the city and surrounding areas burst with yellow mimosa blossoms, adding vibrant color to the landscape, particularly noticeable on sunny days."
            },
            {
                "reason": "Outdoor Activities Resume",
                "details": "The improving weather makes it pleasant for walking tours, exploring Alfama's streets, enjoying viewpoints (miradouros), and potentially the first comfortable outdoor cafe sessions."
            },
             {
                "reason": "Cultural Events",
                "details": "March often hosts film festivals (like Monstra - Lisbon Animation Festival) and other cultural events as the city emerges from winter."
            },
            {
                "reason": "Day Trips More Comfortable",
                "details": "Weather becomes more suitable for day trips to Sintra, Cascais, or Óbidos, with fewer crowds than in summer."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Unpredictable Spring Weather",
                "details": "March weather can be changeable. While often pleasant, expect potential rain showers and occasional windy days. Pack accordingly."
            },
            {
                "reason": "Cool Evenings",
                "details": "Despite warmer days, evenings can still be quite cool (avg. low 9°C), requiring jackets or sweaters, especially near the river."
            },
            {
                "reason": "Not Peak Bloom Season Yet",
                "details": "While some flowers bloom, it's not the peak season for jacarandas or other famous floral displays seen later in spring."
            },
            {
                "reason": "Easter Holiday Crowds/Prices (if applicable)",
                "details": "If Easter falls in late March, expect a significant increase in visitors, higher accommodation prices, and potential closures on Good Friday and Easter Sunday."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C",
                    "low": "9°C"
                },
                "precipitation": "Moderate chance of rain, averaging around 60-80mm spread over 10-12 days. Mix of sunny periods and showery days.",
                "general_tips": "Pack layers including sweaters and a waterproof/windproof jacket. Comfortable walking shoes are essential. An umbrella is recommended."
            },
            "tourism_level": {
                "crowds": "Low to moderate. Attractions are easily accessible without long waits.",
                "pricing": "Shoulder season rates, good value for accommodation.",
                "overall_atmosphere": "Calm and pleasant. City feels local, gradually transitioning towards spring."
            },
            "events_holidays": [
                {
                    "name": "Monstra - Lisbon Animation Festival",
                    "date": "Often mid-March (check specific dates)",
                    "description": "International animation festival showcasing a wide range of animated films, workshops, and exhibitions across various city venues.",
                    "notes": "Tickets required for screenings/workshops. Attracts animation enthusiasts and professionals."
                },
                {
                    "name": "St. Patrick's Day Celebrations",
                    "date": "March 17 (observed around)",
                    "description": "While not a Portuguese holiday, many Irish pubs and some other bars in Lisbon host St. Patrick's Day events with live music and special promotions.",
                    "notes": "Concentrated in specific pubs, particularly in the Cais do Sodré area. Can be lively but localized."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Alfama & Castle",
                    "where": "Alfama",
                    "description": "Wander the historic Alfama district and visit São Jorge Castle with fewer crowds and pleasant temperatures for climbing the hills.",
                    "practical_tips": "Wear comfortable shoes. Enjoy getting lost in the narrow streets. Castle offers great views, potentially clearer in spring air.",
                    "best_time": "Morning or Afternoon",
                    "estimated_cost": "Moderate (Castle entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the National Azulejo Museum",
                    "where": "Beato",
                    "description": "Discover the history of Portuguese tiles in a beautiful former convent. An excellent choice for a potentially rainy day.",
                    "practical_tips": "Accessible by bus. Allow 1.5-2 hours. Features a stunning chapel inside.",
                    "best_time": "Anytime",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Ride Tram 28",
                    "where": "Various districts",
                    "description": "Take the iconic yellow tram through Lisbon's neighbourhoods. Less crowded than summer, offering better views.",
                    "practical_tips": "Still advisable to be mindful of belongings. Use Viva Viagem card for cheaper fares.",
                    "best_time": "Mid-morning",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                },
                {
                    "activity": "Enjoy a Bica at a Viewpoint",
                    "where": "Various Miradouros (e.g., Portas do Sol, Graça)",
                    "description": "Grab an espresso (bica) from a kiosk at one of Lisbon's viewpoints and enjoy the scenery as the weather starts to warm up.",
                    "practical_tips": "Viewpoints can be breezy, bring a jacket. Kiosks offer simple drinks and snacks.",
                    "best_time": "Sunny Afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "10°C"
                },
                "precipitation": "Chance of rain decreases slightly, with more frequent sunny spells. Days feel noticeably longer and warmer.",
                "general_tips": "Continue layering, but lighter options might suffice on warmer days. Sunscreen becoming more important on sunny days."
            },
            "tourism_level": {
                "crowds": "Moderate, increasing significantly if Easter falls in this period.",
                "pricing": "Shoulder season rates, but expect sharp increases around Easter if applicable.",
                "overall_atmosphere": "Spring is more evident. Outdoor cafes become busier. Increased activity if coinciding with Easter preparations."
            },
            "events_holidays": [
                {
                    "name": "Easter Week (Semana Santa) Activities (if applicable)",
                    "date": "Late March (varies)",
                    "description": "If Easter falls late March, expect religious processions (though less elaborate than Spain), special church services, and traditional Easter foods like Folar da Páscoa (sweet bread) appearing in bakeries.",
                    "notes": "Good Friday and Easter Sunday can see some closures. Increased visitor numbers and higher prices likely."
                },
                {
                    "name": "Lisbon Half Marathon (Meia Maratona de Lisboa)",
                    "date": "Usually Mid/Late March (check specific date)",
                    "description": "Major international running event, often crossing the 25 de Abril Bridge, attracting thousands of participants and spectators.",
                    "notes": "Significant road closures in certain areas on race day. Lively atmosphere along the course."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to Sintra",
                    "where": "Sintra",
                    "description": "Visit the fairytale palaces and castles of Sintra as the weather becomes more reliable and gardens start showing more spring color.",
                    "practical_tips": "Take the train from Rossio. Still fewer crowds than summer, but Easter week can be busy. Book popular palace tickets online.",
                    "best_time": "Full Day (choose a dry day)",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Jerónimos Monastery & Belém",
                    "where": "Belém",
                    "description": "Explore the stunning monastery and other Belém landmarks with manageable crowds (unless it's Easter week).",
                    "practical_tips": "Check opening times. Combine with Pastéis de Belém. Pleasant for walking along the waterfront on a nice day.",
                    "best_time": "Morning",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore LX Factory",
                    "where": "Alcântara",
                    "description": "Browse the independent shops, restaurants, and art spaces in this trendy converted industrial complex.",
                    "practical_tips": "Good spot for lunch or afternoon coffee. Sunday market is popular. Easily accessible by Tram 15.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Low (entry free, costs vary)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Along the Tagus Riverfront",
                    "where": "Cais das Colunas to Belém (sections)",
                    "description": "Enjoy a walk or bike ride along the renovated riverfront areas as the weather improves, taking in views of the bridge and city.",
                    "practical_tips": "Flat and accessible. Can be breezy. Rent bikes near Cais do Sodré or Praça do Comércio.",
                    "best_time": "Sunny Afternoon",
                    "estimated_cost": "Low (bike rental moderate)",
                    "weather_dependent": true
                }
            ]
        }
    }
}