{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather",
                "details": "May offers arguably Lisbon's best weather: reliably warm and sunny days (avg. 22°C high), comfortable evenings, and minimal rain, perfect for exploring the city on foot."
            },
            {
                "reason": "Jacaranda Trees in Bloom",
                "details": "Late May often sees Lisbon's famous jacaranda trees burst into vibrant purple bloom, particularly stunning in areas like Largo do Carmo, Avenida Dom Carlos I, and Parque Eduardo VII."
            },
            {
                "reason": "Pre-Peak Season Shoulder Month",
                "details": "Enjoy pleasant weather and longer days with slightly fewer crowds and potentially lower prices than the absolute peak months of July and August."
            },
            {
                "reason": "Outdoor Activities Flourish",
                "details": "Ideal conditions for enjoying Lisbon's viewpoints (miradouros), rooftop bars, outdoor cafes, riverfront walks, and the start of the beach season nearby."
            },
            {
                "reason": "OUT JAZZ Festival Begins",
                "details": "The popular free OUT JAZZ festival usually kicks off in May, offering relaxed weekend afternoon/evening jazz concerts in different city gardens each month."
            },
            {
                "reason": "Festas de Lisboa Buzz Begins",
                "details": "While the main celebrations are in June, late May sees the festive atmosphere building, decorations appearing, and maybe even some early street party (arraial) setups in historic neighborhoods."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Increasing Crowds",
                "details": "May marks a significant increase in tourist numbers compared to early spring. Expect popular attractions and viewpoints to be busy, especially on weekends."
            },
            {
                "reason": "Rising Prices",
                "details": "Accommodation and flight prices rise considerably as the high season approaches. Booking in advance is recommended for better rates."
            },
            {
                "reason": "Potential for Early Heat",
                "details": "While generally pleasant, May can occasionally experience early heat spells with temperatures climbing towards 30°C (86°F), especially later in the month."
            },
            {
                "reason": "Popular Day Trips Get Busier",
                "details": "Destinations like Sintra become noticeably more crowded in May, requiring early starts and advance planning/booking."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "13°C"
                },
                "precipitation": "Low chance of rain, typically only 5-7 days with light showers possible. Expect plenty of sunshine and pleasant warmth.",
                "general_tips": "Pack layers - t-shirts and light clothing for the day, but bring a sweater or light jacket for evenings. Comfortable walking shoes are essential. Sunscreen and sunglasses recommended."
            },
            "tourism_level": {
                "crowds": "Moderate to High. Busy, especially around Labor Day (May 1st) and weekends, but generally more manageable than late summer.",
                "pricing": "Shoulder season turning into high season. Prices higher than spring but likely lower than July/August. Book ahead.",
                "overall_atmosphere": "Pleasantly vibrant. Outdoor cafes buzzing, parks are popular, and a clear sense of approaching summer."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Dia do Trabalhador)",
                    "date": "May 1",
                    "description": "Public holiday. Often marked by union parades or demonstrations in central areas (like Alameda or Marquês de Pombal). Many locals enjoy the day off.",
                    "notes": "Public holiday: Banks, post offices, many shops closed. Most museums, attractions, restaurants usually open. Public transport on holiday schedule."
                },
                {
                    "name": "IndieLisboa Film Festival (often concludes early May)",
                    "date": "Late April / Early May",
                    "description": "Lisbon's major independent film festival may still be running its final days in early May, showcasing international and Portuguese films.",
                    "notes": "Check specific festival dates. Screenings at various cinemas (e.g., Cinema São Jorge). Tickets required."
                },
                 {
                    "name": "OUT JAZZ Festival Starts",
                    "date": "Weekends, usually starting in May",
                    "description": "Free weekend jazz concerts begin in one of Lisbon's gardens (location changes monthly).",
                    "notes": "Check the official schedule for the May location and timings. Relaxed, popular local event."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Enjoy Views from Miradouro da Senhora do Monte",
                    "where": "Graça",
                    "description": "Take in arguably the highest and most panoramic viewpoint over Lisbon, especially beautiful in the clear spring air.",
                    "practical_tips": "Accessible by Tram 28 (nearby stop) or tuk-tuk/taxi. Can be windy. Less crowded than Portas do Sol.",
                    "best_time": "Late Afternoon / Sunset",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Belém Monuments",
                    "where": "Belém",
                    "description": "Visit Jerónimos Monastery, Belém Tower, and the Discoveries Monument with pleasant weather and before peak summer queues.",
                    "practical_tips": "Go early, especially on weekends. Consider Lisboa Card for entry/transport. Allow several hours.",
                    "best_time": "Morning",
                    "estimated_cost": "Moderate (entrance fees)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Around Alfama",
                    "where": "Alfama",
                    "description": "Get lost in the charming, narrow streets of Lisbon's oldest district as flowers bloom on balconies and the weather invites exploration.",
                    "practical_tips": "Wear comfortable shoes. Enjoy the small squares, Fado restaurants, and local life. Stop at viewpoints like Portas do Sol.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (mostly free)",
                    "weather_dependent": true
                },
                {
                    "activity": "First Beach Trip to Cascais",
                    "where": "Cascais (via train)",
                    "description": "Take the scenic train ride to Cascais. While the water is still cold, May offers pleasant weather for enjoying the sand, town, and seaside cafes.",
                    "practical_tips": "Train from Cais do Sodré (~40 mins). Beaches near station get busy. Water temperature around 16-17°C.",
                    "best_time": "Sunny Day",
                    "estimated_cost": "Low (transport) + food",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "14°C"
                },
                "precipitation": "Very low chance of rain. Days are consistently sunny and warm, feeling like early summer.",
                "general_tips": "Summer clothing is appropriate. Sunscreen, hat, and sunglasses are essential. Evenings remain comfortable, often just needing a light layer."
            },
            "tourism_level": {
                "crowds": "High. Feels like the start of peak season. Attractions, popular restaurants, and Sintra are busy.",
                "pricing": "High season pricing is largely in effect for accommodation and flights.",
                "overall_atmosphere": "Vibrant and summery. Outdoor terraces are packed, jacarandas may be blooming, and anticipation for June's Festas builds."
            },
            "events_holidays": [
                {
                    "name": "ARCOlisboa Art Fair",
                    "date": "Usually mid/late May (check dates)",
                    "description": "Major international contemporary art fair held at Cordoaria Nacional, attracting galleries, collectors, and artists from around the world.",
                    "notes": "Tickets required. Focus on contemporary art. Prestigious event in the art world calendar."
                },
                {
                    "name": "OUT JAZZ Continues",
                    "date": "Weekends",
                    "description": "Free weekend jazz concerts continue in a designated city garden.",
                    "notes": "Check schedule for location. Perfect for a relaxed weekend afternoon."
                },
                 {
                    "name": "Festas de Lisboa Preparations",
                    "date": "Late May",
                    "description": "Neighborhoods like Alfama, Graça, Bica start putting up colorful decorations and setting up stages/stalls for the June festivities.",
                    "notes": "Atmosphere becomes increasingly festive. You might see early, smaller arraiais pop up on weekends."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "See the Blooming Jacarandas",
                    "where": "Largo do Carmo, Av. Dom Carlos I, Parque Eduardo VII",
                    "description": "Seek out the stunning purple jacaranda trees which typically reach peak bloom in late May/early June.",
                    "practical_tips": "Peak bloom varies slightly year to year. Largo do Carmo offers a beautiful concentration. Great photo opportunities.",
                    "best_time": "Late May Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Rooftop Bar Sunset Drinks",
                    "where": "Various (e.g., Park Bar, TOPO Martim Moniz, Sky Bar)",
                    "description": "Enjoy cocktails and panoramic city views from a rooftop bar as the sun sets on a warm May evening.",
                    "practical_tips": "Popular spots get busy, especially at sunset. Arrive early or book if possible. Enjoy the warm evening air.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Sintra (Go Early!)",
                    "where": "Sintra",
                    "description": "Visit Sintra's enchanting palaces and gardens. Needs very early start to beat increasing crowds.",
                    "practical_tips": "Take the earliest train possible. Book tickets online well in advance. Prioritize 1-2 main sites. Weather usually excellent.",
                    "best_time": "Full Day (start extremely early)",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Principe Real & Botanical Garden",
                    "where": "Principe Real",
                    "description": "Wander through the trendy Principe Real neighborhood with its boutiques and cafes, and visit the adjacent Botanical Garden.",
                    "practical_tips": "Principe Real has a charming square (Praça das Flores nearby). Botanical garden offers shady escape (check opening times).",
                    "best_time": "Afternoon",
                    "estimated_cost": "Low (Garden entry fee applies)",
                    "weather_dependent": true
                }
            ]
        }
    }
}