{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Lá Cinn Bliana)",
          "notes": "New Year's Day is a public holiday throughout Ireland. Most attractions, shops, and restaurants in Galway city are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. Galway Cathedral and most museums typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout Galway, particularly on Shop Street, Quay Street, and in shopping centers like Eyre Square Centre. Christmas decorations gradually come down. The city's cozy traditional pubs offer warm refuge from winter weather."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is the off-season with few tourists and excellent hotel value. Cool winter weather with potential for rain and strong Atlantic winds. Limited daylight hours. Winter sales continue throughout January in the main shopping district. The Galway City Museum and NUI Galway campus offer excellent indoor experiences during this quiet season. Traditional music sessions in pubs provide warm respite from winter conditions."
        }
      ],
      "weatherHighC": 8,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "Winter continues with cool weather but slightly longer days. Galway's low tourism season continues, making it ideal for museum visits and indoor cultural activities without crowds. Salthill Promenade offers bracing walks on dry days with dramatic views of Galway Bay."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 3,
          "special": true,
          "event": "Mid-Term Break",
          "notes": "Irish school mid-term break typically falls in February. Family-friendly activities are available at Galway's museums and cultural institutions. The Galway City Museum and Galway Atlantaquaria often feature special exhibitions and activities for children."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Late February begins to show early signs of spring in Galway. Planning for St. Patrick's Day events begins around the city. Cultural venues like the Town Hall Theatre and Druid Theatre offer winter programming. Traditional music sessions in the Latin Quarter pubs provide authentic evening entertainment."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. The city begins to prepare for St. Patrick's Day celebrations. NUI Galway's campus becomes particularly attractive as spring blooms appear. The cultural calendar becomes more active with various events across the city."
        },
        {
          "days": [17],
          "score": 5,
          "special": true,
          "event": "St. Patrick's Day (Lá Fhéile Pádraig)",
          "notes": "Galway's St. Patrick's Festival features a large parade through the city center with thousands of participants. The day is a national holiday with businesses closed, but pubs, restaurants, and entertainment venues are bustling. The parade route typically runs through the city center, with various performances, music, and cultural events surrounding the festival. Galway is known for one of Ireland's most vibrant St. Patrick's Day celebrations."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Tús an Earraigh)",
          "notes": "Spring officially begins, bringing early blooms to Eyre Square and the grounds of NUI Galway. Perfect time for exploring the Latin Quarter and Salthill as café life begins to move outdoors on warmer days. Easter markets appear if Easter falls in late March."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 4,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Cáisc)",
          "notes": "Easter celebrations typically fall in April, with Good Friday, Easter Sunday, and Easter Monday as public holidays. Special Easter markets and events operate in Galway in the week before Easter. Spring blooms peak throughout the city's parks and along Salthill Promenade. Outdoor cafés in the Latin Quarter become increasingly popular."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Cúirt International Festival of Literature",
          "notes": "The Cúirt International Festival of Literature typically takes place in late April, bringing writers and literary figures from around the world to Galway. Events take place in venues across the city including the Town Hall Theatre, Charlie Byrne's Bookshop, and various cultural spaces. The cultural spring season is in full swing with performances at Druid Theatre and other venues."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 5,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "May Day/Labour Day (Lá Bealtaine)",
          "notes": "May Day is marked with some events in Galway city. Many businesses are closed for the public holiday, but museums and cultural attractions remain open. Traditional celebrations of Bealtaine (the Celtic festival marking the beginning of summer) may take place at Brigit's Garden outside the city."
        },
        {
          "days": [2, 3, 4, 5],
          "score": 5,
          "special": true,
          "event": "May Bank Holiday Weekend",
          "notes": "The first Monday in May is a bank holiday in Ireland. This long weekend often features special events and festivals in Galway and throughout Connemara. The Connemara Mussel Festival in Tullycross celebrates local seafood and traditional culture."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "May brings perfect spring weather with longer days (approximately 16 hours of daylight). The outdoor café scene in the Latin Quarter is in full swing. The Spanish Arch and Nimmo's Pier become popular evening spots. Salthill Promenade sees increasing activity as the waters of Galway Bay warm slightly. Tourism begins to increase but the city isn't yet at peak season crowds."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 7,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3],
          "score": 5,
          "special": true,
          "event": "June Bank Holiday Weekend",
          "notes": "The first Monday in June is a bank holiday in Ireland. Various festivals and events take place in Galway and the surrounding region during this weekend. Clifden Traditional Music Festival in Connemara celebrates Irish music, song and dance with sessions throughout the town."
        },
        {
          "days": [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Early summer brings warm weather and extended daylight hours to Galway. Tourism increases but the city remains less crowded than July and August. Perfect time for exploring both the city and daytrips to Connemara, the Aran Islands, and the Burren. The summer solstice brings the longest days of the year with approximately 17 hours of daylight. Traditional Galway Hooker sailing boats begin to appear more frequently in Galway Bay, with training and races becoming regular sights."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "notes": "High summer with warmer temperatures and long daylight hours. Irish school holidays are in full swing, increasing family tourism. Excellent time for visits to Connemara National Park, the Aran Islands, and coastal activities. Salthill becomes particularly busy with swimmers at Blackrock and other beaches. The city's outdoor dining scene is at its most vibrant in the Latin Quarter."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Galway International Arts Festival",
          "notes": "The renowned Galway International Arts Festival takes place in mid-to-late July, transforming the city with theater, music, visual arts, dance, and literature events. The Festival Garden in Eyre Square becomes a hub of activity, while the Festival Big Top hosts major musical performances. This internationally significant event draws visitors from around the world, making it Galway's busiest tourism period. Accommodation books up well in advance."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 4,
          "special": true,
          "event": "August Bank Holiday Weekend",
          "notes": "The first Monday in August is a bank holiday in Ireland. This long weekend often features festivals and events in Galway city and throughout the county. Ideal time for exploring Connemara and coastal areas."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Galway Races Summer Festival",
          "notes": "The famous Galway Races Summer Festival typically takes place in late July/early August at Ballybrit Racecourse, bringing horse racing enthusiasts from across Ireland and beyond. This week-long event significantly impacts the city, with increased visitors, special events, and a festival atmosphere. Ladies' Day is particularly popular. High summer with typically warm, pleasant weather continues. Peak tourism season with visitors from Ireland and abroad. The Aran Islands and Connemara are particularly popular destinations. Galway Market is bustling with locally sourced summer produce. Tourism begins to decrease slightly toward the end of the month as Irish schools prepare to return."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "notes": "Perfect late summer weather for outdoor activities and exploring the city without the peak season crowds. Tourism begins to decrease as Irish schools are back in session, making it an excellent time to visit with good weather but fewer crowds. The waters of Galway Bay remain relatively warm for swimming at Salthill. Traditional Galway Hooker boat races continue in the bay."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Galway Culture Night & Clifden Arts Festival",
          "notes": "September typically brings Culture Night to Galway (a nationwide celebration of arts and culture with free events across the city). The Clifden Arts Festival in Connemara also takes place in mid-September, featuring literature, music, and visual arts events. The Galway International Oyster & Seafood Festival, established in 1954, celebrates Galway's famous oysters with food events, the World Oyster Opening Championship, and festivities throughout the city."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 4,
          "notes": "Autumn weather brings cooler temperatures to Galway, but remains pleasant for city exploration. Perfect time for visiting indoor attractions like the Galway City Museum, St. Nicholas' Church, and Lynch's Castle. NUI Galway campus displays beautiful autumn colors. Good month for experiencing Galway's cozy pub culture with traditional music sessions in the Latin Quarter."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "October Bank Holiday Weekend",
          "notes": "The October bank holiday weekend (last weekend of October) often features special events throughout Galway. Connemara's scenery is particularly stunning with autumn colors. The Galway Theatre Festival typically takes place around this time, featuring performances in venues across the city."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "Halloween & Macnas Parade",
          "notes": "Halloween (Oíche Shamhna) is celebrated with the spectacular Macnas parade through Galway city center. This internationally renowned spectacle features giant puppets, costumes, music, and performers in a magical nighttime procession that draws thousands of spectators. The parade represents Galway's creative spirit and celebrates the ancient Celtic festival of Samhain."
        }
      ],
      "weatherHighC": 13,
      "weatherLowC": 8,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 3,
          "notes": "Full autumn with cooler, often rainy weather and Atlantic storms possible. Excellent time for museum visits and indoor cultural activities. The Galway Market becomes particularly appealing with seasonal produce. Traditional pubs with open fires offer cozy retreats from the weather. Latin Quarter pubs host some of the best traditional music sessions during this quieter tourism period. The city begins early preparations for the Christmas season."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Christmas Season Begins",
          "notes": "Galway's Christmas celebrations begin in late November with the lighting of the city's Christmas lights. The Galway Continental Christmas Market opens in Eyre Square, featuring wooden chalets, amusement rides, live music, and seasonal food and crafts. The market has become one of Ireland's largest and most popular Christmas markets. Christmas shopping begins in earnest on Shop Street, Quay Street, and in the city's shopping centers."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Galway Continental Christmas Market",
          "notes": "The Galway Continental Christmas Market runs from late November until December 23rd. Eyre Square is transformed with wooden chalets, a 32-meter high Big Wheel, traditional carousel, and Santa's Grotto. The market features vendors from Ireland and across Europe selling traditional crafts, food, and mulled wine. The city center is beautifully decorated with Christmas lights. Latin Quarter and Shop Street are bustling with Christmas shoppers. Traditional music sessions take on a festive character in the city's historic pubs."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Oíche Nollag)",
          "notes": "Christmas Eve is an important celebration day for most Irish families. Most businesses close by early afternoon. The Christmas Market ends. Galway Cathedral and other churches hold special services. Restaurants that remain open often require advance reservations for special Christmas Eve dinners."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Day & St. Stephen's Day",
          "notes": "December 25 (Christmas Day) and December 26 (St. Stephen's Day) are both public holidays. Most businesses, restaurants, and attractions are closed or operate with limited hours. The Christmas Day swim at Blackrock in Salthill is a beloved local tradition, with hundreds of brave swimmers taking the plunge for charity despite the cold Atlantic waters."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is typically quiet but with a festive atmosphere. Major museums and some attractions reopen. Good time for winter sales shopping along Shop Street and in the Eyre Square Centre. Traditional music sessions continue in the Latin Quarter pubs."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Oíche Chinn Bliana)",
          "notes": "New Year's Eve celebrations center around Galway city center with midnight countdown events in Eyre Square. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), and hotels host celebration events. Pubs and clubs throughout the Latin Quarter offer special New Year's parties. The medieval city center provides a spectacular backdrop for festivities."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 4,
      "tourismLevel": 6
    }
  },
  "activityTypes": {
    "spring": [
      "Galway St. Patrick's Festival Parade (March)",
      "Cúirt International Festival of Literature (April)",
      "Galway Early Music Festival (May)",
      "NUI Galway Campus Gardens Spring Blooms (March through May)",
      "Galway Cathedral Tours",
      "Brigit's Garden seasonal celebrations",
      "Connemara National Park as wildflowers emerge",
      "Outdoor café culture begins in the Latin Quarter"
    ],
    "summer": [
      "Galway International Arts Festival (July)",
      "Galway Film Fleadh (July)",
      "Galway Races Summer Festival (late July/early August)",
      "Galway International Oyster Festival (September)",
      "Traditional boat racing with Galway Hookers in Galway Bay",
      "Swimming at Salthill beaches and Blackrock diving tower",
      "Day trips to the Aran Islands",
      "Evening walks along the Salthill Promenade"
    ],
    "autumn": [
      "Galway Theatre Festival (October)",
      "Macnas Halloween Parade (October 31)",
      "Baboró International Arts Festival for Children (October)",
      "Autumn Colors at NUI Galway Campus",
      "Galway Culture Night (September)",
      "Traditional Music Sessions in historic Latin Quarter pubs",
      "Clifden Arts Festival (September)",
      "Connemara scenic drives with dramatic autumn landscapes"
    ],
    "winter": [
      "Galway Continental Christmas Market (late November to December 23)",
      "Christmas lights throughout the Latin Quarter",
      "New Year's Eve Celebration in Eyre Square",
      "Winter Shopping on Shop Street",
      "The Galway Market Winter Food Experience",
      "Christmas Day Swim at Blackrock, Salthill",
      "Cozy pub culture in traditional Galway establishments",
      "Druid Theatre winter performances"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or cool, wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}