{
    "Spring": {
        "activities": [
            {
                "name": "Galway St. Patrick's Festival",
                "type": "Festival",
                "description": "Experience Ireland's national celebration with Galway's vibrant parade, street performances, music events, and family activities throughout the city center, known for its particularly colorful and creative community floats.",
                "indoor": false,
                "best_time": "March 17th and surrounding days",
                "price_range": "Free",
                "seasonal_notes": "One of Ireland's most important cultural celebrations, with Galway city hosting one of the country's most creative and community-focused festivities.",
                "booking_tips": "No booking required for the parade, but arrive early for good viewing spots along the route through Shop Street and Eyre Square. Check the festival program online for any ticketed events."
            },
            {
                "name": "Cúirt International Festival of Literature",
                "type": "Literary Festival",
                "description": "Immerse yourself in Ireland's premier literary festival featuring readings, discussions, poetry events, and workshops with acclaimed international and Irish writers throughout Galway's atmospheric venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held annually in April, this festival celebrates Galway's rich literary tradition and brings world-class authors to the city's historic spaces.",
                "booking_tips": "Purchase tickets online in advance for popular author events. Festival passes available for multiple events. Charlie Byrne's Bookshop serves as a festival hub with book signings."
            },
            {
                "name": "Brigit's Garden",
                "type": "Garden/Cultural Site",
                "description": "Explore this enchanting 11-acre Celtic garden that celebrates Irish heritage and mythology through four distinct gardens representing the Celtic festivals, with beautiful spring blooms and special seasonal activities.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings spectacular blooms to the gardens, especially in the Imbolc and Bealtaine sections which celebrate renewal and growth in Celtic tradition.",
                "booking_tips": "Located 20 minutes from Galway city in Rosscahill. No advance booking required but check website for special spring events that may need reservation."
            },
            {
                "name": "Connemara National Park",
                "type": "Nature Reserve",
                "description": "Experience the awakening of one of Ireland's most spectacular landscapes as spring brings new growth to the mountains, bogs, and heathlands, with walking trails for all abilities including the popular Diamond Hill loop.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers fewer crowds than summer, the emergence of wildflowers, active birdlife, and the possibility of clear days revealing spectacular views without summer haze.",
                "booking_tips": "No booking required. Located about 1 hour from Galway city near Letterfrack. Visitor center has exhibits, information, and café. Diamond Hill trail takes approximately a half day."
            },
            {
                "name": "Galway Early Music Festival",
                "type": "Music Festival",
                "description": "Discover the sounds of medieval, renaissance, and baroque music performed on period instruments in some of Galway's most historic venues, including St. Nicholas' Collegiate Church and other atmospheric spaces.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Held in May, this unique festival brings history to life through music in venues that complement the historical performances.",
                "booking_tips": "Book tickets online in advance as historic venues have limited capacity. Festival passes available for multiple concerts. Check for special workshops which require separate booking."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Galway International Arts Festival",
                "type": "Arts Festival",
                "description": "Experience Ireland's largest arts festival transforming Galway with two weeks of theater, music, visual arts, dance, and street performances throughout the city, including the famous Big Top concert venue.",
                "indoor": false,
                "best_time": "Varies by event",
                "price_range": "Varies",
                "seasonal_notes": "Held in July, this flagship festival turns the entire city into a cultural playground with events in conventional venues, pop-up spaces, and on the streets.",
                "booking_tips": "Book headline acts and popular theater shows months in advance. The Festival Garden in Eyre Square offers free performances. Purchase tickets online for specific events."
            },
            {
                "name": "Galway Film Fleadh",
                "type": "Film Festival",
                "description": "Attend Ireland's leading film festival showcasing new Irish and international cinema, documentaries, animation, and short films, with director Q&As, masterclasses, and industry events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in early July, this prestigious festival attracts filmmakers and cinema enthusiasts from around the world to Galway's summer cultural calendar.",
                "booking_tips": "Book tickets online as screenings often sell out, especially for opening and closing films. Festival passes available for dedicated film buffs."
            },
            {
                "name": "Aran Islands Day Trip",
                "type": "Island Exploration",
                "description": "Discover these stunning islands with their unique limestone landscapes, prehistoric stone forts, traditional culture, and spectacular Atlantic views, just a short ferry ride from Galway.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Summer offers the most reliable weather for island exploration and ferry crossings, with longest daylight hours allowing full-day experiences.",
                "booking_tips": "Book ferry tickets in advance from Rossaveal (30 minutes from Galway) or flights from Connemara Airport. Consider staying overnight on Inis Mór to experience the islands after day-trippers leave."
            },
            {
                "name": "Galway Races Summer Festival",
                "type": "Horse Racing/Cultural Event",
                "description": "Experience Ireland's most famous horse racing festival at Ballybrit Racecourse, featuring world-class racing, fashion competitions, social events, and a unique festival atmosphere that defines Galway's summer social calendar.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Held in late July/early August, this week-long festival attracts visitors from across Ireland and abroad, with Ladies' Day being particularly spectacular.",
                "booking_tips": "Book tickets well in advance, especially for Ladies' Day and weekends. Enclosure and hospitality packages available. Consider transport options as parking can be limited."
            },
            {
                "name": "Salthill Promenade and Beaches",
                "type": "Coastal Recreation",
                "description": "Enjoy Galway's seaside suburb with its 2km promenade ('the Prom'), beaches, diving tower at Blackrock, and spectacular views across Galway Bay to the Burren hills of County Clare.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer brings swimmers to Salthill's beaches and the famous Blackrock diving tower. Evening walks along the Prom offer spectacular sunsets over Galway Bay.",
                "booking_tips": "No booking required. Don't forget to 'kick the wall' at the end of the Prom for good luck, as locals have done for generations. Lifeguards on duty at main beaches during summer months."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Galway International Oyster & Seafood Festival",
                "type": "Food Festival",
                "description": "Celebrate the opening of the oyster season at the world's longest-running oyster festival, featuring the World Oyster Opening Championship, gala events, food trails, and the finest seafood from Galway Bay.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Held in late September, this festival marks the harvest of Galway's famous native oysters and celebrates the city's rich maritime culinary heritage.",
                "booking_tips": "Book tickets for the Gala Evening and main events well in advance. Many restaurants offer special oyster menus throughout the festival period."
            },
            {
                "name": "Macnas Halloween Parade",
                "type": "Street Performance/Festival",
                "description": "Experience Galway's spectacular Halloween parade featuring giant puppets, remarkable costumes, atmospheric music, and hundreds of performers creating a magical nighttime spectacle through the city streets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on or near October 31st, this internationally renowned parade creates an otherworldly experience rooted in the ancient Celtic festival of Samhain.",
                "booking_tips": "No booking required. Arrive early to secure good viewing spots along the parade route, which is published on the Macnas website beforehand. Bring flashlights for children."
            },
            {
                "name": "Connemara Scenic Drive",
                "type": "Nature/Scenic Tour",
                "description": "Experience the dramatic beauty of Connemara in autumn colors with a drive through its stunning landscapes of mountains, lakes, and coastline, including the famous Sky Road loop near Clifden.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (car rental costs apply)",
                "seasonal_notes": "Autumn brings spectacular colors to Connemara's landscape, with heather-covered hillsides turning purple and golden. Tourist numbers decrease while weather often remains mild.",
                "booking_tips": "No booking required if self-driving. Various tour companies operate day trips from Galway if you prefer not to drive. Kylemore Abbey and Connemara National Park make excellent stopping points."
            },
            {
                "name": "Baboró International Arts Festival for Children",
                "type": "Family/Arts Festival",
                "description": "Introduce children to the creative arts through this dedicated international children's festival featuring theater, dance, music, puppetry, and visual arts specifically designed for young audiences.",
                "indoor": true,
                "best_time": "Morning or Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Held in October, this festival provides creative indoor activities during the autumn season, with events designed for specific age groups from toddlers to teenagers.",
                "booking_tips": "Book tickets online in advance as shows are categorized by age suitability and often sell out. School groups attend weekday performances; family shows are busiest on weekends."
            },
            {
                "name": "Galway Theatre Festival",
                "type": "Performing Arts",
                "description": "Discover innovative theater in unexpected venues throughout Galway city, with a focus on new work, physical theater, and experimental performances from both established and emerging companies.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in autumn, this festival brings theatrical innovation to conventional and unconventional spaces throughout the city.",
                "booking_tips": "Book online in advance as smaller venue capacities mean shows can sell out quickly. Festival passes available for theater enthusiasts planning to attend multiple performances."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Galway Continental Christmas Market",
                "type": "Festival/Market",
                "description": "Experience one of Ireland's largest Christmas markets in Eyre Square, featuring wooden chalets selling crafts and seasonal food, amusement rides including a 32-meter Ferris wheel, live entertainment, and a magical festive atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free entry (purchases and rides extra)",
                "seasonal_notes": "Running from late November through December 23rd, this market transforms Galway's city center into a winter wonderland with lights, music, and seasonal cheer.",
                "booking_tips": "No booking required for general access, but arrive early on weekends to avoid the largest crowds. Some Santa experiences may require booking."
            },
            {
                "name": "Traditional Music Sessions in the Latin Quarter",
                "type": "Music/Cultural",
                "description": "Warm up in Galway's historic pubs with world-famous traditional Irish music sessions, where local musicians gather to play authentic tunes in an informal, convivial atmosphere.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free (cost of drinks)",
                "seasonal_notes": "Winter is the perfect time to experience the cozy atmosphere of a traditional Irish session, with pubs like The Crane Bar, Tig Cóilí, and Taaffes hosting regular music nights.",
                "booking_tips": "No booking required. Arrive early (8-8:30pm) to get seating close to musicians. Winter offers a more authentic experience with fewer tourists than summer months."
            },
            {
                "name": "Galway City Museum Winter Exhibitions",
                "type": "Museum/Cultural",
                "description": "Explore Galway's history and heritage in this modern museum beside the Spanish Arch, featuring exhibitions on medieval Galway, the city's maritime history, and rotating special collections.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter brings special exhibitions and the museum offers a warm cultural haven during the cold months, with fewer visitors than peak season.",
                "booking_tips": "No booking required. Free guided tours available on selected days - check the website for current schedule. Located adjacent to the Spanish Arch."
            },
            {
                "name": "Christmas Day Swim at Blackrock",
                "type": "Traditional Event",
                "description": "Witness or participate in the famous Christmas Day swim at Blackrock diving tower in Salthill, where hundreds of brave swimmers take the plunge into the Atlantic for charity, continuing a decades-old Galway tradition.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "This uniquely Galway Christmas tradition takes place regardless of weather conditions, with spectators and participants creating a festive atmosphere on the usually quiet Christmas morning.",
                "booking_tips": "No booking required for participants or spectators. Charity collections often take place. Warm clothes essential for spectators, as Atlantic winds can be biting in December."
            },
            {
                "name": "Druid Theatre Winter Season",
                "type": "Performing Arts",
                "description": "Experience world-class theater at Galway's internationally renowned Druid Theatre, with winter productions often featuring classic Irish plays and contemporary works in their intimate Mick Lally Theatre.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Winter season typically includes festive productions and classic works perfect for the darker months, performed by one of Ireland's most celebrated theater companies.",
                "booking_tips": "Book tickets well in advance online as productions by this prestigious company frequently sell out. The intimate theater means there are no bad seats, but capacity is limited."
            }
        ]
    }
}