{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Early Summer Weather",
                "details": "June typically offers warm, sunny weather (avg highs 22°C/72°F) perfect for exploring Lausanne's steep streets, strolling along the Ouchy waterfront, and enjoying early summer boat cruises on Lake Geneva."
            },
            {
                "reason": "Long Daylight Hours",
                "details": "Maximize your sightseeing time with very long daylight hours, especially around the summer solstice (June 21st), allowing for extended vineyard walks, exploring parks, and enjoying lakeside evenings."
            },
            {
                "reason": "Lake Geneva Activities Begin",
                "details": "The Lake Geneva swimming season starts at spots like Vidy and Lutry-Plage, and CGN boat cruises operate on summer schedules. Paddleboarding and kayaking become popular as the water gradually warms."
            },
            {
                "reason": "Prime Time for Lavaux Vineyards",
                "details": "June is arguably the best month to explore the lush, green UNESCO World Heritage Lavaux vineyards before the intense summer heat, enjoying walks, views, and potential wine tastings."
            },
            {
                "reason": "Lush Green Parks & Blooming Gardens",
                "details": "Experience Lausanne's vibrant green spaces like Parc de Mon Repos, Parc Olympique, and the Jardin Botanique, often featuring beautiful floral displays."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "While visitor numbers increase, June is generally less crowded than July and August, offering a slightly more relaxed experience at the Olympic Museum, Plateforme 10, and popular lakeside spots."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Start of High Season Crowds",
                "details": "Tourist numbers increase significantly in June. Expect growing crowds at the Olympic Museum, Plateforme 10, Ouchy waterfront, and on popular boat routes."
            },
            {
                "reason": "Rising Prices",
                "details": "June marks the beginning of peak season pricing for accommodation and some activities. Costs are higher than in spring."
            },
            {
                "reason": "Potential for Rain & Thunderstorms",
                "details": "While often sunny, June can still bring rainy days or afternoon thunderstorms, potentially impacting lake activities or vineyard walks."
            },
            {
                "reason": "Booking Ahead Recommended",
                "details": "It's advisable to book popular hotels, specific boat cruises (like gourmet ones on CGN), museum tickets (especially Olympic Museum), and desirable lakeside restaurants in advance."
            },
            {
                "reason": "Pollen Season Continues",
                "details": "Grass pollen season peaks in June, which can affect allergy sufferers enjoying the lakeside promenades, parks, and vineyards."
            },
            {
                "reason": "Cool Lake Water Temperatures",
                "details": "While swimming begins, the Lake Geneva water temperature might still be quite chilly in early June for prolonged swims."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "22°C (72°F)",
                    "low": "12°C (54°F)"
                },
                "precipitation": "Mix of sunny days and potential rain showers or thunderstorms, common in the afternoons. Generally pleasant early summer conditions.",
                "general_tips": "Pack layers: t-shirts, light long sleeves, a sweater or light jacket for evenings/mountains (Jura). Comfortable walking shoes essential for steep streets. Include sunscreen, sunglasses, hat, and rain protection."
            },
            "tourism_level": {
                "crowds": "High season begins. Noticeably busier than May, especially around the Olympic Museum, Ouchy waterfront, Plateforme 10, and popular viewpoints.",
                "pricing": "High season pricing for accommodation and some tours.",
                "overall_atmosphere": "Vibrant start to summer. Outdoor dining flourishes. Parks are green, lake activities begin. Longer evenings encourage lakeside strolls and enjoying the views."
            },
            "events_holidays": [
                {
                    "name": "Whit Monday (Lundi de Pentecôte)",
                    "date": "Varies (can fall in early June)",
                    "description": "Public holiday in Switzerland (including Vaud). Expect closures of shops, banks, and some services. Most tourist attractions (check hours), restaurants, and boat services operate, possibly on a Sunday/holiday schedule.",
                    "notes": "Check specific opening hours and transport schedules if planning activities on this day."
                },
                 {
                    "name": "Corpus Christi (Fête-Dieu)",
                    "date": "Varies (Thursday, 60 days after Easter, can be early June)",
                    "description": "Public holiday in Vaud canton (and other Catholic regions). Similar impact to Whit Monday with shop closures. Less widely observed with public processions in Lausanne itself compared to more traditional villages.",
                    "notes": "Main impact is shop closures. Tourist sites often remain open."
                 },
                 {
                     "name": "Caribana Festival (nearby Crans-près-Céligny)",
                     "date": "Typically early June (check dates)",
                     "description": "Pop/rock music festival held by the lake near Nyon, easily accessible from Lausanne. Features international and Swiss artists.",
                     "notes": "Requires tickets. Check caribana-festival.ch for program and dates."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the Lavaux Vineyards",
                    "where": "Between Lutry and St-Saphorin (accessible by train/bus)",
                    "description": "Walk or take the 'Lavaux Express' tourist train through the stunningly green terraced vineyards, a UNESCO World Heritage site, enjoying breathtaking views over Lake Geneva and the Alps.",
                    "practical_tips": "Early June offers lush greenery before peak summer heat. Wear comfortable shoes. Bring water and sun protection. Consider stopping in villages like Cully or Rivaz.",
                    "best_time": "Daytime, preferably sunny",
                    "estimated_cost": "Free (walking), Moderate (tourist train/wine tasting)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Olympic Museum & Park",
                    "where": "Quai d'Ouchy 1",
                    "description": "Explore the interactive exhibits detailing the history of the Olympic Games in its dedicated museum, and wander through the adjacent sculpture park by the lake.",
                    "practical_tips": "Book tickets online for convenience. Allow 2-3 hours. Good option for any weather. The park is lovely in June.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate-High (museum entry fee)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Stroll along the Ouchy Waterfront",
                    "where": "Quai d'Ouchy & Quai de Belgique",
                    "description": "Enjoy a leisurely walk along Lausanne's lakeside promenade, admiring the flower displays, watching the boats, enjoying views of the French Alps, and stopping at cafes.",
                    "practical_tips": "Flat and easy walking. Popular spot for locals and visitors. Many restaurants and ice cream stands.",
                    "best_time": "Late afternoon or evening",
                    "estimated_cost": "Free (walking)",
                    "weather_dependent": true
                 },
                {
                    "activity": "Scenic Lake Geneva Cruise",
                    "where": "Departing from Lausanne-Ouchy pier",
                    "description": "Take a relaxing boat trip on Lake Geneva (Lac Léman), admiring the city skyline, the Lavaux vineyards from the water, and the alpine panorama.",
                    "practical_tips": "CGN operates various routes (e.g., towards Montreux, Geneva, or French side). Check summer schedules. Consider Belle Époque paddle steamers.",
                    "best_time": "Daytime, sunny weather ideal",
                    "estimated_cost": "Moderate-High (cruise ticket)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "23°C (73°F)",
                    "low": "13°C (55°F)"
                },
                "precipitation": "Typically warm and sunny summer weather, but afternoon thunderstorms remain a possibility. Longest days of the year around the solstice (June 21st).",
                "general_tips": "Pack for warm weather but always include rain protection. Sunscreen/hat crucial. Utilize the extended daylight for activities like vineyard walks or lakeside evenings."
            },
            "tourism_level": {
                "crowds": "High season fully underway. Popular sites like the Olympic Museum, Ouchy, boat cruises, and Plateforme 10 are busy.",
                "pricing": "Peak season prices for accommodation and some activities.",
                "overall_atmosphere": "Full summer mode. Long, bright evenings, lively lakeside promenades and outdoor dining. Ideal time for combining city exploration, lake activities, and vineyard visits."
            },
            "events_holidays": [
                {
                    "name": "Fête de la Musique",
                    "date": "Around June 21st (check exact date)",
                    "description": "Free music festival celebrating the summer solstice with numerous live performances of various genres happening on outdoor stages and in venues across the city.",
                    "notes": "Creates a very lively atmosphere throughout Lausanne. Check local listings for stage locations and schedules."
                },
                {
                    "name": "Start of School Holidays (Late June - Vaud)",
                    "date": "End of June",
                    "description": "Local school summer holidays begin, potentially increasing crowds slightly at family-friendly attractions and lakeside spots, especially on weekends.",
                    "notes": "Main impact felt more in July/August, but the transition starts."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Plateforme 10 Arts District",
                    "where": "Near Lausanne train station",
                    "description": "Visit Lausanne's impressive arts hub, housing the Cantonal Museum of Fine Arts (MCBA), Photo Elysée (photography museum), and mudac (design museum).",
                    "practical_tips": "Check opening hours. Can easily spend half a day or more. Good indoor option if weather is poor or too hot. Consider combined tickets.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate per museum",
                    "weather_dependent": false
                },
                 {
                    "activity": "Visit Lausanne Cathedral & Climb the Tower",
                    "where": "La Cité (Old Town)",
                    "description": "Explore the impressive Gothic Lausanne Cathedral in the historic upper town and climb its tower for panoramic views over the city, Lake Geneva, and the Alps.",
                    "practical_tips": "Tower climb involves many stairs and has a small fee. Cathedral interior is free. Check tower opening times.",
                    "best_time": "Daytime for views (check tower hours)",
                    "estimated_cost": "Low (tower fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Hike or Visit Signal de Bougy (Nearby Park)",
                    "where": "Above Rolle (requires car or specific bus)",
                    "description": "Family-friendly park with large playgrounds, mini-golf, farm animals, and fantastic panoramic views over Lake Geneva towards Mont Blanc. Offers easy walks.",
                    "practical_tips": "More easily accessed by car, but check bus options. Great for a family day out. Can be busy on sunny weekends.",
                    "best_time": "Sunny daytime",
                    "estimated_cost": "Free entry (parking/some activities may have fees)",
                    "weather_dependent": true
                 },
                {
                    "activity": "Enjoy Sunset Apéro in Flon or Ouchy",
                    "where": "Bars/restaurants in the trendy Flon district or along the Ouchy waterfront",
                    "description": "Experience the local tradition of an evening apéritif (drinks and snacks) on a terrace, enjoying the long summer evenings and vibrant atmosphere.",
                    "practical_tips": "Flon offers a more urban, modern vibe; Ouchy offers lake views. Reservations might be needed for popular spots.",
                    "best_time": "Early evening (6-8pm)",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                }
            ]
        }
    }
}