{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May often brings pleasant, mild spring weather (avg highs ~19°C/66°F) and significantly longer daylight hours, ideal for comfortable sightseeing, boat cruises on Lake Geneva, and exploring Lausanne's diverse neighborhoods."
            },
            {
                "reason": "Lavaux Vineyards & Parks in Bloom",
                "details": "Experience the stunning UNESCO Lavaux vineyards in their vibrant green spring attire. Lausanne's parks (Mon Repos, Denantou, Botanical Garden) are filled with blooming flowers."
            },
            {
                "reason": "Outdoor Cafes & Lakeside Life",
                "details": "Outdoor seating at cafes and restaurants becomes widespread. Enjoy drinks or meals in the trendy Flon district, on sunny Old Town squares, or with stunning views from terraces in Ouchy."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "Enjoy Lausanne with fewer tourists than in the peak summer months (July/August), offering a more relaxed experience at the Olympic Museum, Plateforme 10, and along the Ouchy waterfront."
            },
            {
                "reason": "Ideal Hiking & Cycling Conditions",
                "details": "Temperatures are generally perfect for hiking through the Lavaux vineyards, exploring trails in the nearby Jura mountains, or cycling along Lake Geneva's shores before the summer heat sets in."
            },
            {
                "reason": "Full Lake Navigation Season Starts",
                "details": "Lake Geneva's boat company (CGN) typically switches to its full summer schedule in May, offering more frequent connections and routes, including to France and scenic spots like Montreux."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather ('Saints de Glace')",
                "details": "May can still be unpredictable. The 'Ice Saints' ('Saints de Glace', mid-May) can bring sudden cold snaps. Rain showers and cooler days are still possible, potentially obscuring Alpine views across the lake."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks a noticeable increase in tourism. Expect more people at attractions like the Olympic Museum and on popular boat routes. Accommodation prices rise towards high season levels."
            },
            {
                "reason": "Public Holidays Impact",
                "details": "May 1st (Labour Day), Ascension Day (Ascension - variable), and potentially Whit Monday (Lundi de Pentecôte - variable) are public holidays with widespread shop closures in Vaud/Lausanne."
            },
            {
                "reason": "Pollen Season Peaks",
                "details": "Grass pollen counts are typically high in May, which can significantly affect allergy sufferers enjoying the lakeside promenades, parks, and vineyards."
            },
            {
                "reason": "Lake Geneva Still Cold for Swimming",
                "details": "While lakeside lounging begins, Lake Geneva's water temperature is usually still quite cold for comfortable swimming in May."
            },
            {
                "reason": "Higher Jura Trails Still Potentially Muddy/Snowy",
                "details": "While lower vineyard trails are fine, higher altitude hiking trails in the Jura mountains may still have muddy sections or patches of snow, especially early in the month."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "8°C (46°F)"
                },
                "precipitation": "Mix of sunny spring days and potential rain showers. The 'Ice Saints' ('Saints de Glace', roughly May 11-15) can bring a noticeable cold snap. Lake breezes can feel cool.",
                "general_tips": "Pack layers: t-shirts, sweaters, a light to medium-weight jacket (waterproof recommended), comfortable walking shoes for steep streets. Sunscreen and sunglasses needed. Allergy medication if needed."
            },
            "tourism_level": {
                "crowds": "Moderate and increasing. Busy around May 1st holiday and Ascension Day (if early). Shoulder season feel with noticeable visitor numbers at the Olympic Museum and Ouchy.",
                "pricing": "Shoulder/High season prices. Book popular hotels and specific cruises ahead, especially around holidays.",
                "overall_atmosphere": "Vibrant spring awakening. Parks and vineyards are lush green. Outdoor dining returns noticeably. May 1st sees closures."
            },
            "events_holidays": [
                {
                    "name": "Labour Day (Fête du Travail)",
                    "date": "May 1",
                    "description": "Public holiday in Vaud. Widespread closures of shops, banks, etc. Plan activities accordingly.",
                    "notes": "Most museums/attractions usually open (check hours). CGN boats typically run."
                },
                 {
                    "name": "Spring Markets (Marchés de Printemps)",
                    "date": "Check specific dates (often weekends)",
                    "description": "Local spring markets might appear in squares (e.g., Place de la Riponne) or specific neighborhoods, offering crafts, food, plants, and flowers.",
                    "notes": "Check local listings (Lausanne Tourisme) for exact dates and locations."
                 },
                 {
                    "name": "Ascension Day (Ascension)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday creating a long weekend. Shops closed. Special church services (e.g., at the Cathedral).",
                    "notes": "Check date for the year. Increased domestic travel. Attractions, boats generally operate."
                 },
                 {
                     "name": "Cultural Events (Opera, Ballet, Concerts)",
                     "date": "Check schedules",
                     "description": "Check programs for Opéra de Lausanne, Béjart Ballet Lausanne, Orchestre de Chambre de Lausanne, and venues like Les Docks for performances.",
                     "notes": "Book tickets in advance for popular shows."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Hike Through the Lavaux Vineyards",
                    "where": "Between Lutry and St-Saphorin (accessible by train/bus)",
                    "description": "Walk amidst the stunningly green UNESCO World Heritage terraced vineyards overlooking Lake Geneva. May offers pleasant temperatures and vibrant foliage.",
                    "practical_tips": "Wear comfortable shoes. Bring water and sun protection. Follow marked trails. Consider the Lavaux Panoramic train or stopping for a tasting (check availability).",
                    "best_time": "Daytime on a clear day",
                    "estimated_cost": "Free (hiking), Moderate (train/tasting)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Olympic Museum & Park",
                    "where": "Quai d'Ouchy 1",
                    "description": "Explore the world-renowned museum dedicated to the Olympic Games and enjoy the adjacent sculpture park blooming with spring flowers by the lake.",
                    "practical_tips": "Book museum tickets online. Allow 2-3 hours minimum. Good option for any weather.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate-High (museum entry fee)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Lake Geneva Boat Cruise",
                    "where": "Departing from Lausanne-Ouchy pier",
                    "description": "Enjoy a scenic cruise on the lake as summer schedules begin. Admire the lush green shoreline, the Lavaux vineyards from the water, and the Alpine backdrop.",
                    "practical_tips": "Check CGN timetable for routes (Montreux, Yvoire, Geneva) and potential paddle steamer trips. Swiss Travel Pass may offer discounts.",
                    "best_time": "Daytime, preferably sunny",
                    "estimated_cost": "Moderate-High (cruise ticket)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Explore Lausanne's Parks in Bloom",
                    "where": "Parc de Mon Repos, Parc de Milan (Botanical Garden), Parc Olympique, Parc Denantou",
                    "description": "Wander through Lausanne's beautiful parks enjoying spring blossoms, green lawns, and scenic viewpoints.",
                    "practical_tips": "Mon Repos offers elegant landscaping, the Botanical Garden showcases diverse plants, Parc Olympique has sculptures, Denantou has a Thai pavilion.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                 }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "20°C (68°F)",
                    "low": "10°C (50°F)"
                },
                "precipitation": "Generally more stable and warmer than early May, with plenty of sunshine, but afternoon showers or thunderstorms remain possible. Pleasant for outdoor activities.",
                "general_tips": "Focus on lighter clothing but keep layers (sweater/light jacket) for evenings or potential cool days. Sun protection essential. Longer daylight hours perfect for excursions."
            },
            "tourism_level": {
                "crowds": "High season approaching rapidly. Noticeably busy, especially on weekends and around holidays like Ascension (if late) or Whit Monday.",
                "pricing": "High season prices generally apply. Book popular excursions, vineyard tastings (if applicable), and accommodation well in advance.",
                "overall_atmosphere": "Beautiful late spring/early summer feel. Ideal weather for combining vineyard walks, lake activities, and city exploration. Vibrant atmosphere along the Ouchy waterfront and in Flon."
            },
            "events_holidays": [
                 {
                    "name": "Caves Ouvertes Vaudoises (Open Wine Cellars - Potential)",
                    "date": "Check dates (often late May/early June weekend)",
                    "description": "Winegrowers across the Vaud canton (including Lavaux) open their cellars for tastings. A special pass allows access to numerous participating wineries.",
                    "notes": "Very popular event. Check Vaud Promotion or local tourist info for exact dates and pass details. Plan transport (often includes shuttle buses)."
                 },
                 {
                    "name": "Whit Monday (Lundi de Pentecôte) (Potential Timing)",
                    "date": "Varies (50 days after Easter - often late May/early June)",
                    "description": "Public holiday. Widespread shop closures. Attractions, boats usually operate, but check hours.",
                    "notes": "Check date for the year. Expect increased travel over the long weekend."
                 },
                 {
                     "name": "Museum Night (Nuit des Musées - Potential Timing)",
                     "date": "Check dates (sometimes in May)",
                     "description": "Lausanne museums offer special late-night openings with unique events, workshops, and reduced entry fees.",
                     "notes": "Check the official Nuit des Musées Lausanne-Pully website for dates and program."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Participate in Caves Ouvertes Vaudoises (if dates align)",
                    "where": "Lavaux vineyards and other Vaud wine regions",
                    "description": "Purchase a tasting pass and spend the weekend visiting numerous open wine cellars, sampling local Chasselas and other Vaudois wines, and meeting growers.",
                    "practical_tips": "Plan your route using the event map/app. Utilize shuttle buses or trains. Designate a driver or use public transport. Very festive atmosphere.",
                    "best_time": "Designated weekend during the event",
                    "estimated_cost": "Moderate (tasting pass fee)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Plateforme 10 Arts District",
                    "where": "Near Lausanne train station",
                    "description": "Visit the Cantonal Museum of Fine Arts (MCBA), Photo Elysée (photography), and mudac (design) in Lausanne's central arts hub.",
                    "practical_tips": "Ideal for a mixed-weather day. Check opening times and consider combined tickets if visiting multiple museums.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate per museum",
                    "weather_dependent": false
                },
                 {
                    "activity": "Walk or Cycle along Lake Geneva Shore",
                    "where": "Paths extending west from Ouchy towards Vidy/St-Sulpice or east towards Lutry",
                    "description": "Enjoy the pleasant late spring weather with a walk or bike ride along the lake, passing parks, beaches, and enjoying views.",
                    "practical_tips": "Bike rentals available in Lausanne. Paths are generally flat and well-maintained. Great for a relaxed afternoon.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking), Low-Moderate (bike rental)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Visit Lausanne Cathedral & Market Square",
                    "where": "La Cité (Old Town) & Place de la Palud",
                    "description": "Explore the Gothic Cathedral, climb the tower for views, then wander down to Place de la Palud to see the animated clock and browse the market stalls (Wed & Sat mornings).",
                    "practical_tips": "Wear comfortable shoes for steep streets. Market is busiest in the morning. Check tower opening times.",
                    "best_time": "Wednesday or Saturday morning for market",
                    "estimated_cost": "Free (walking/market browsing), Low (tower fee)",
                    "weather_dependent": false
                 }
            ]
        }
    }
}