{
  "sites": [
    {
      "name": "Santa Claus Village",
      "type": "Theme Park",
      "description": "The official hometown of Santa Claus on the Arctic Circle. Meet Santa Claus himself, visit Santa's Main Post Office, cross the magical Arctic Circle line, and enjoy various shops, restaurants, and activities like reindeer and husky rides. A year-round Christmas destination.",
      "indoor": false,
      "best_time": "Winter",
      "price_range": "Free (entry), Moderate-High (activities)",
      "seasonal_notes": "Magical during winter with snow and Christmas lights (Nov-Jan). Open year-round, but most activities are winter-focused. Summer offers Midnight Sun experiences. Northern Lights visible from late August to early April.",
      "booking_tips": "Meeting Santa is free, no booking needed. Activities like sleigh rides should be booked in advance, especially during peak season (Dec-Jan). Located 8 km north of Rovaniemi city center, easily accessible by bus or taxi. Allow a full day.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 6.0,
        "cultural_significance": 5
      },
      "latitude": 66.5436,
      "longitude": 25.8471
    },
    {
      "name": "Arktikum Science Museum & Arctic Centre",
      "type": "Museum",
      "description": "A science center and museum exploring Arctic issues and the history and culture of Finnish Lapland. Features exhibitions on Arctic nature, cultures, and climate change research. Housed in an architecturally significant building with a glass tube extending towards the Ounasjoki river.",
      "indoor": true,
      "best_time": "Year-round",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with consistent hours. Offers insights into Arctic phenomena like the Northern Lights and Midnight Sun regardless of the season. Indoor exhibitions provide a warm escape during cold winter days.",
      "booking_tips": "No advance booking usually required for general admission. Consider the Culture Pass for entry to Arktikum, Korundi, and Pilke. Located within walking distance from the city center. Allow 2-3 hours for a visit.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 66.5069,
      "longitude": 25.7303
    },
    {
      "name": "Ounasvaara Hill",
      "type": "Nature",
      "description": "A year-round recreational area next to the city center offering diverse activities. Features a ski resort with downhill and cross-country skiing trails in winter, and hiking trails, a summer toboggan run, adventure park, and scenic views in summer. Home to Santasport Olympic Training Center.",
      "indoor": false,
      "best_time": "Year-round",
      "price_range": "Free (trails), Moderate (activities/skiing)",
      "seasonal_notes": "Winter (Nov-Apr) for skiing, snowboarding, snowshoeing. Summer (Jun-Aug) for hiking, biking, summer sledding, adventure park. Autumn (Sep-Oct) offers beautiful 'ruska' foliage colors. Ideal spot for viewing Northern Lights away from city lights.",
      "booking_tips": "Access to nature trails is free. Ski passes, equipment rentals, and adventure park tickets can be purchased on-site or online (recommended during peak times). Located just east of the city center. Duration varies greatly depending on activity (1 hour to full day).",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 3
      },
      "latitude": 66.5040,
      "longitude": 25.7750
    },
    {
      "name": "Korundi House of Culture",
      "type": "Cultural Center",
      "description": "Home to the Rovaniemi Art Museum and the Lapland Chamber Orchestra. Showcases Northern contemporary art and Finnish modernism. Housed in a converted post bus depot, one of the few buildings that survived WWII. Features changing art exhibitions, concerts, and events.",
      "indoor": true,
      "best_time": "Year-round",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with changing exhibitions and concert schedules. Offers indoor cultural experiences suitable for any weather. Check the event calendar for specific concerts and performances.",
      "booking_tips": "Exhibition tickets usually available at the door. Concert tickets should be booked in advance. Consider the Culture Pass for entry to Korundi, Arktikum, and Pilke. Located near the city center. Allow 1.5-2 hours for exhibitions.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 66.4995,
      "longitude": 25.7268
    },
    {
      "name": "Pilke Science Centre",
      "type": "Museum",
      "description": "An interactive science center focused on northern forests and the sustainable use of wood. Offers hands-on exhibits about forest ecology, forestry, and wood products. Housed in an impressive timber-framed building next to Arktikum.",
      "indoor": true,
      "best_time": "Year-round",
      "price_range": "Low",
      "seasonal_notes": "Open year-round, providing an engaging indoor activity suitable for all seasons. Focuses on the year-round importance of forests.",
      "booking_tips": "Tickets available at the door. Can be combined with a visit to the adjacent Arktikum. Consider the Culture Pass for entry to Pilke, Arktikum, and Korundi. Located next to Arktikum, near the city center. Allow 1-1.5 hours.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 66.5065,
      "longitude": 25.7315
    },
    {
      "name": "Rovaniemi Church",
      "type": "Religious Site",
      "description": "The main church of Rovaniemi, completed in 1950 after the previous church was destroyed in WWII. Designed by Bertel Liljequist, it features a prominent fresco 'Source of Life' by Lennart Segerstr책le behind the altar and distinctive architecture.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round, but visitor hours may be limited during services or events, especially during Christmas and Easter. The surrounding cemetery is particularly atmospheric in winter snow.",
      "booking_tips": "No booking required for general visits. Check service times if planning a visit. Located centrally in Rovaniemi. Allow 20-30 minutes for a visit.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 66.5008,
      "longitude": 25.7350
    },
    {
      "name": "Lumberjack's Candle Bridge (J채tk채nkynttil채)",
      "type": "Landmark",
      "description": "An iconic cable-stayed bridge crossing the Kemijoki river, connecting Ounasvaara with the city center. Famous for the large 'eternal flame' structures atop its pylons, resembling lumberjack candles used for light in logging camps. Offers great views of the river and city.",
      "indoor": false,
      "best_time": "Evening/Night",
      "price_range": "Free",
      "seasonal_notes": "Visually striking year-round, especially when illuminated at night. Particularly beautiful during winter with snow and ice on the river, or under the Midnight Sun in summer. A good spot for viewing Northern Lights if they appear over the city.",
      "booking_tips": "No booking needed. Accessible by foot or car. Can be crossed as part of a walk along the riverbanks or to/from Ounasvaara. Allow 15-30 minutes to walk across and enjoy the views.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 66.5030,
      "longitude": 25.7399
    }
  ]
}