{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Weather",
                "details": "June offers ideal conditions in Madrid with consistently sunny days, warm temperatures (averaging 25-28°C), low humidity, and minimal rainfall, perfect for exploring the historic center and enjoying outdoor activities without the extreme heat of July and August."
            },
            {
                "reason": "Pre-Peak Season",
                "details": "June provides an excellent balance with summer atmosphere but without the intense crowds and premium prices of July and August, allowing more relaxed visits to attractions like the Prado, Royal Palace, and historic center."
            },
            {
                "reason": "Outdoor Season Begins",
                "details": "June marks the official start of outdoor season with comfortable temperatures for activities in parks like Retiro and Casa de Campo, open-air dining, and evening promenades along the Manzanares River."
            },
            {
                "reason": "Cultural Festivities",
                "details": "June hosts several important cultural events including the Night of San Juan (Midsummer) celebrations, Madrid Design Festival, and numerous neighborhood ferias showcasing authentic Spanish traditions."
            },
            {
                "reason": "Extended Daylight Hours",
                "details": "June's long daylight hours (light until after 9:30pm) provide extra time for sightseeing, evening dining on outdoor terraces, and enjoying Madrid's illuminated historic monuments and vibrant plazas."
            },
            {
                "reason": "Gastronomic Experiences",
                "details": "The pleasant June weather creates perfect conditions for enjoying Madrid's culinary scene, from traditional tapas in historic bars to dining on rooftop terraces with panoramic city views."
            },
            {
                "reason": "Outdoor Activities",
                "details": "June's reliable weather makes it ideal for outdoor activities including cycling along the Manzanares River, visiting Casa de Campo park, and guided walking tours through the city's historic districts."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Rising Temperatures",
                "details": "While generally pleasant, late June can occasionally experience early heat waves with temperatures exceeding 30°C, particularly in the city center, requiring careful planning for midday activities."
            },
            {
                "reason": "Increasing Tourism",
                "details": "As June progresses, tourist numbers steadily increase, with growing queues at major attractions like the Prado and Royal Palace, particularly on weekends and around the San Juan holiday period."
            },
            {
                "reason": "Rising Accommodation Costs",
                "details": "Hotel and rental apartment prices begin climbing throughout June as the summer season approaches, though they remain lower than during the peak months of July and August."
            },
            {
                "reason": "Weekend Crowds",
                "details": "Madrid has become increasingly popular for weekend breaks from northern European cities and for Spanish domestic tourists, making the city noticeably busier from Friday to Sunday, with more competition for restaurant reservations."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "26°C",
                    "low": "15°C"
                },
                "precipitation": "Very low chance of rain with predominantly clear, sunny skies. The continental climate ensures warm, dry days with comfortable humidity levels.",
                "general_tips": "Pack summer clothing, sun protection (high SPF sunscreen, sunglasses, hat), and a light layer for occasional evening breezes. Comfortable walking shoes essential for Madrid's historic center."
            },
            "tourism_level": {
                "crowds": "Moderate, with manageable visitor numbers at main attractions like the Prado, Royal Palace, and Plaza Mayor. Parks generally uncrowded during weekdays with more activity on weekends.",
                "pricing": "Mid-range; accommodation prices beginning to rise but still offering good value compared to high season rates in July-August.",
                "overall_atmosphere": "Pleasantly vibrant with a good mix of tourists and locals enjoying outdoor dining and cultural activities without overwhelming crowds."
            },
            "events_holidays": [
                {
                    "name": "Madrid Design Festival",
                    "date": "Early June (varies annually)",
                    "description": "Celebration of design and architecture with exhibitions, installations, and events throughout the city showcasing contemporary Spanish and international design.",
                    "notes": "Various venues across the city; mix of free and ticketed events; program available from tourist offices; advance booking recommended for popular events."
                },
                {
                    "name": "Corpus Christi Procession",
                    "date": "Usually early June (varies annually)",
                    "description": "Traditional religious procession through Madrid's historic center with flower carpets decorating the streets and ceremonial displays.",
                    "notes": "Main procession typically on Sunday morning; some streets in historic center may be temporarily closed; good photo opportunity for traditional aspects of Spanish culture."
                },
                {
                    "name": "Early Summer Concerts",
                    "date": "Throughout early June",
                    "description": "Open-air concerts and performances in various venues including Retiro Park, Plaza Mayor, and other historic locations, featuring a mix of classical, contemporary, and traditional music.",
                    "notes": "Check local listings for schedule; ticket prices vary but many municipal events are free or low-cost; some venues offer combined visit and concert tickets."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Morning Visit to Retiro Park",
                    "where": "Parque del Retiro",
                    "description": "Explore Madrid's most famous park in the cooler morning hours, enjoying the Crystal Palace, rose garden, and peaceful lake with rowing boats.",
                    "practical_tips": "Arrive early for best experience; wear comfortable walking shoes; bring water; consider renting a rowing boat on the lake.",
                    "best_time": "Early morning (opening until 11am)",
                    "estimated_cost": "Free; rowing boats €6-8",
                    "weather_dependent": true
                },
                {
                    "activity": "Museo del Prado",
                    "where": "Paseo del Prado",
                    "description": "Visit Spain's premier art museum featuring masterpieces by Velázquez, Goya, and other Spanish and European masters.",
                    "practical_tips": "Combined tickets available; audio guides recommended; visit during Spanish lunch hours (2-4pm) for fewer crowds; regular temporary exhibitions rotate alongside permanent collection.",
                    "best_time": "Weekday afternoon",
                    "estimated_cost": "€15",
                    "weather_dependent": false
                },
                {
                    "activity": "Plaza Mayor and Surroundings",
                    "where": "Historic Center",
                    "description": "Explore Madrid's historic main square and surrounding streets, featuring beautiful architecture, outdoor cafés, and street performers.",
                    "practical_tips": "More comfortable in morning or evening; excellent for photography; numerous restaurants and cafés with outdoor seating; connects to other historic areas.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "Free to explore; €10-20 for drinks and snacks",
                    "weather_dependent": true
                },
                {
                    "activity": "Casa de Campo Morning",
                    "where": "Parque Casa de Campo",
                    "description": "Enjoy Madrid's largest park in the peaceful morning hours with comfortable temperatures, walking trails, and the zoo before the crowds arrive.",
                    "practical_tips": "Arrive before 11am for best experience; multiple activities available; water particularly important; easily accessible by metro.",
                    "best_time": "Morning (9am-12pm)",
                    "estimated_cost": "Free for park; varies for attractions",
                    "weather_dependent": true
                },
                {
                    "activity": "Real Jardín Botánico",
                    "where": "Plaza de Murillo",
                    "description": "Wander through this beautiful botanical garden featuring species from around the world in a historic setting near the Prado Museum.",
                    "practical_tips": "Take metro to Atocha; arrive early for cooler temperatures; good option for plant enthusiasts and photographers; historic greenhouses provide insight into 18th-century botanical science.",
                    "best_time": "Morning",
                    "estimated_cost": "€4",
                    "weather_dependent": true
                },
                {
                    "activity": "Evening Tapas Tour",
                    "where": "La Latina and surrounding streets",
                    "description": "Experience the authentic Spanish tradition of tapas-hopping through the historic center, sampling different specialties and local wines.",
                    "practical_tips": "Self-guided or with local guides; tapas culture starts later than in northern Spain (8:30pm onwards); smaller portions when ordered with drinks; traditional establishments often more economical.",
                    "best_time": "Evening (8:30pm-11pm)",
                    "estimated_cost": "€25-40 self-guided, €50-75 guided tour",
                    "weather_dependent": false
                },
                {
                    "activity": "Mercado de San Miguel",
                    "where": "Plaza de San Miguel",
                    "description": "Visit Madrid's stunning 19th-century iron market featuring fresh produce and tapas counters among locals.",
                    "practical_tips": "Most authentic on weekday mornings; closes early afternoon and Sundays; excellent for food photography; several tapas bars inside offer excellent fresh market products.",
                    "best_time": "Morning to early afternoon",
                    "estimated_cost": "Free to browse, €10-15 for tapas and drinks",
                    "weather_dependent": false
                },
                {
                    "activity": "Manzanares River Park",
                    "where": "Madrid Río",
                    "description": "Enjoy Madrid's revitalized riverfront with cycling paths, walking trails, and recreational areas along the Manzanares River.",
                    "practical_tips": "Early morning or evening best for outdoor activities; multiple access points; bike rentals available; several playgrounds and recreational areas.",
                    "best_time": "Early morning or evening",
                    "estimated_cost": "Free; bike rental available",
                    "weather_dependent": true
                },
                {
                    "activity": "Lavapiés Street Art Tour",
                    "where": "Lavapiés District",
                    "description": "Explore Madrid's urban art scene featuring large-scale murals and graffiti by international artists that have transformed this multicultural neighborhood.",
                    "practical_tips": "Self-guided walking tour possible with maps available online or from tourist office; area perfectly safe during day; constantly evolving with new works.",
                    "best_time": "Morning or late afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Toledo",
                    "where": "Toledo (30 minutes from Madrid)",
                    "description": "Visit this UNESCO World Heritage city featuring medieval architecture, historic cathedral, and rich cultural heritage.",
                    "practical_tips": "Regular high-speed trains from Madrid; comfortable walking shoes essential; guided tours available; combine with evening return to Madrid.",
                    "best_time": "Full day, starting early",
                    "estimated_cost": "€20-30 for transportation plus museum fees",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "28°C",
                    "low": "16°C"
                },
                "precipitation": "Virtually no rainfall with clear blue skies. Slightly warmer than early June with occasional hot days.",
                "general_tips": "Increased importance of sun protection and hydration; light, breathable clothing essential; consider accommodations with air conditioning; siesta hours (2-5pm) increasingly worth observing."
            },
            "tourism_level": {
                "crowds": "Moderate to high, increasing noticeably as the month progresses and European school holidays begin. Advance booking becoming advisable for popular restaurants and experiences.",
                "pricing": "Increasing toward high season rates, particularly for accommodations in the last week of June as July approaches.",
                "overall_atmosphere": "Increasingly vibrant summer atmosphere with more street performances, outdoor dining, and cultural activities. Good balance of animation without overwhelming crowds."
            },
            "events_holidays": [
                {
                    "name": "Noche de San Juan (St. John's Eve)",
                    "date": "June 23-24",
                    "description": "Major midsummer celebration with bonfires and festivities in various locations throughout the city, featuring music, food stalls, and fireworks.",
                    "notes": "Multiple celebration points across the city; celebration begins evening of 23rd and continues past midnight; public transportation runs later than usual."
                },
                {
                    "name": "Madrid Pride (Orgullo Madrid)",
                    "date": "Late June",
                    "description": "One of Europe's largest LGBTQ+ celebrations, featuring parades, concerts, and cultural events throughout the city, particularly in the Chueca neighborhood.",
                    "notes": "Main parade usually on Saturday afternoon; growing event in recent years; festive atmosphere throughout central districts; many hotels and businesses display rainbow flags."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Royal Palace and Gardens",
                    "where": "Calle Bailén",
                    "description": "Visit Spain's largest royal palace with its impressive architecture, art collections, and historic gardens, enjoying the cooler morning hours.",
                    "practical_tips": "Advance online booking recommended; morning slots cooler; total visit 2-3 hours; combined ticket with Almudena Cathedral available.",
                    "best_time": "Early morning departure",
                    "estimated_cost": "€12",
                    "weather_dependent": true
                },
                {
                    "activity": "Reina Sofía Museum",
                    "where": "Calle Santa Isabel",
                    "description": "Explore Spain's national museum of 20th-century art, featuring Picasso's Guernica and other modern masterpieces.",
                    "practical_tips": "Free entry on certain days; audio guides available; excellent café in central courtyard; good midday activity during peak heat.",
                    "best_time": "Late afternoon",
                    "estimated_cost": "€10",
                    "weather_dependent": false
                },
                {
                    "activity": "Cooking Class: Spanish Cuisine",
                    "where": "Various cooking schools in city center",
                    "description": "Learn to prepare traditional Spanish specialties like paella, tortilla, and tapas in a hands-on cooking workshop.",
                    "practical_tips": "Several operators offer classes in English; typically includes market visit, cooking instruction, and meal with wine; vegetarian options usually available; advance booking recommended.",
                    "best_time": "Morning (with market visit) or evening",
                    "estimated_cost": "€65-90",
                    "weather_dependent": false
                },
                {
                    "activity": "Salamanca District Shopping",
                    "where": "Barrio de Salamanca",
                    "description": "Explore Madrid's upscale shopping district with designer boutiques, traditional Spanish brands, and elegant architecture.",
                    "practical_tips": "Morning shopping before heat; numerous cafés for breaks; mix of international and Spanish brands; some stores close for siesta.",
                    "best_time": "Morning",
                    "estimated_cost": "Free to browse; varies for shopping",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Segovia",
                    "where": "Segovia (30 minutes from Madrid)",
                    "description": "Visit this spectacular city with its Roman aqueduct, medieval architecture, and historic cathedral.",
                    "practical_tips": "Direct high-speed trains from Madrid; check weather forecast as fog can obscure views; comfortable walking shoes essential.",
                    "best_time": "Full day on clear days",
                    "estimated_cost": "€20-30 for transportation plus museum fees",
                    "weather_dependent": true
                },
                {
                    "activity": "Flamenco Show",
                    "where": "Corral de la Morería or Cardamomo",
                    "description": "Experience authentic flamenco in an intimate venue with passionate performances of this iconic Spanish art form.",
                    "practical_tips": "Book in advance; smaller venues offer more authentic experience; typically start late (9:30pm or later); combine with dinner in historic center beforehand.",
                    "best_time": "Evening",
                    "estimated_cost": "€20-35",
                    "weather_dependent": false
                },
                {
                    "activity": "Bike Tour of Madrid",
                    "where": "Various starting points",
                    "description": "Explore Madrid's landmarks and neighborhoods on a guided bicycle tour, visiting major sites and hidden gems.",
                    "practical_tips": "Morning or evening tours recommended; several operators offer different routes; suitable for all fitness levels; helmets provided.",
                    "best_time": "Early morning or evening",
                    "estimated_cost": "€25-40",
                    "weather_dependent": true
                },
                {
                    "activity": "Sunset at Templo de Debod",
                    "where": "Parque del Oeste",
                    "description": "Visit this ancient Egyptian temple gifted to Spain, particularly beautiful at sunset with views over the city.",
                    "practical_tips": "Check opening times; free entry; bring camera for sunset photos; combine with visit to nearby Plaza de España.",
                    "best_time": "1-2 hours before sunset",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Evening at Plaza de Santa Ana",
                    "where": "Historic Center",
                    "description": "Experience the heart of Madrid's social life at this beautiful square surrounded by cafés and historic buildings.",
                    "practical_tips": "Most animated after 8pm; numerous restaurants and bars with outdoor seating; perfect people-watching spot; connects to other historic areas.",
                    "best_time": "Evening",
                    "estimated_cost": "Free to explore; €10-15 for drinks and snacks",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Ávila",
                    "where": "Ávila (1.5 hours from Madrid)",
                    "description": "Visit this UNESCO World Heritage city famous for its medieval walls, historic architecture, and connection to Saint Teresa.",
                    "practical_tips": "Accessible by train or bus; significantly cooler than Madrid due to elevation; comfortable walking shoes essential; guided tours available.",
                    "best_time": "Full day, starting early",
                    "estimated_cost": "€20-30 for transportation plus museum fees",
                    "weather_dependent": true
                }
            ]
        }
    }
}