{
  "sites": [
    {
      "name": "Uffizi Gallery",
      "type": "Museum",
      "description": "The Uffizi Gallery is one of the most famous museums in the world, housing masterpieces of Renaissance art. Originally built as offices for Florentine magistrates, it was transformed into a museum in the late 18th century. The collection includes works by Botticelli, Leonardo da Vinci, Michelangelo, Raphael, and Titian. The Birth of Venus and Primavera by Botticelli are among its most celebrated pieces.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Expensive",
      "seasonal_notes": "Extremely crowded during summer months. Winter offers lighter crowds except around Christmas and New Year. Consider visiting on weekdays for a less crowded experience.",
      "booking_tips": "Advance online booking essential to avoid long lines. Early morning or late afternoon entry times recommended. Closed on Mondays.",
      "ratings": {
        "cost_estimate": 22,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 43.7684,
      "longitude": 11.2556
    },
    {
      "name": "Florence Cathedral (Duomo)",
      "type": "Church",
      "description": "The Cathedral of Santa Maria del Fiore, known as the Duomo, dominates Florence's skyline with its magnificent Renaissance dome designed by Brunelleschi. Construction began in 1296 and was completed in 1436. The exterior features intricate marble panels in shades of green, pink, and white. Visitors can climb the 463 steps to the top of the dome for panoramic views or ascend Giotto's Bell Tower next door.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Extremely crowded during summer months and Catholic holidays. The cathedral itself is free, but the museum, baptistery, bell tower, and dome require tickets. Dress modestly (covered shoulders and knees).",
      "booking_tips": "Unified ticket covers all monuments. Dome climb requires specific time slot and should be booked well in advance. Early morning climbs offer cooler temperatures and smaller crowds.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 43.7731,
      "longitude": 11.2566
    },
    {
      "name": "Accademia Gallery",
      "type": "Museum",
      "description": "The Galleria dell'Accademia houses Michelangelo's David, perhaps the world's most famous sculpture. Standing 17 feet tall, the marble masterpiece depicts the biblical hero before his battle with Goliath. The museum also contains other significant works by Michelangelo, including his unfinished Prisoners series, as well as paintings by Florentine artists from the 13th-16th centuries and a collection of musical instruments.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "High season (April-October) brings long lines. January and February are relatively quiet. The museum is climate-controlled and provides a welcome respite from summer heat.",
      "booking_tips": "Advance online booking essential. Reserved tickets allow you to skip the notoriously long lines. Closed on Mondays.",
      "ratings": {
        "cost_estimate": 16,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 43.7765,
      "longitude": 11.2590
    },
    {
      "name": "Ponte Vecchio",
      "type": "Bridge",
      "description": "The Ponte Vecchio ('Old Bridge') is Florence's most iconic bridge, spanning the Arno River at its narrowest point. Built in 1345, it's known for the shops built along its edges—a common feature of bridges in medieval times. Originally hosting butchers and tanners, today the bridge houses jewelers and souvenir shops. The Vasari Corridor runs above the shops, connecting Palazzo Pitti to the Uffizi and Palazzo Vecchio.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Spectacular at sunset when golden light reflects on the Arno. Early morning offers the best opportunity for photographs without crowds. Exceptionally crowded during peak tourism months (May-September).",
      "booking_tips": "No booking required for walking across the bridge. Consider a boat tour on the Arno for unique views of the bridge's architecture.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 43.7680,
      "longitude": 11.2531
    },
    {
      "name": "Palazzo Pitti",
      "type": "Palace/Museum",
      "description": "This massive Renaissance palace was once the residence of Florence's rulers, including the Medici family and later the House of Lorraine. Today it houses several important museums, including the Palatine Gallery with works by Raphael and Titian, the Royal Apartments, Gallery of Modern Art, Costume Gallery, Silver Museum, and Porcelain Museum. Behind the palace lie the magnificent Boboli Gardens.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Expensive",
      "seasonal_notes": "The palace offers a cool retreat during summer heat. Different sections may close on different days. The attached Boboli Gardens are particularly beautiful in spring when flowers bloom.",
      "booking_tips": "Combined tickets available for palace museums and Boboli Gardens. Ticket valid for three consecutive days. Different tickets required for different sections of the complex.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 43.7659,
      "longitude": 11.2502
    },
    {
      "name": "Boboli Gardens",
      "type": "Garden",
      "description": "These elaborate gardens behind Palazzo Pitti were designed for the Medici family in the 16th century and exemplify formal Italian Renaissance garden design. Covering 45,000 square meters, they feature grottos, fountains, classical statues, ancient and Renaissance sculptures, and peaceful pathways. The Amphitheater, Neptune's Fountain, and the Grotta Grande are notable highlights.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Most beautiful in spring when flowers are in bloom. Early mornings offer cooler temperatures in summer. Some water features may not operate during winter or drought conditions.",
      "booking_tips": "Combined tickets available with Palazzo Pitti museums. Bring water as drinking fountains are limited. Wear comfortable shoes as terrain includes hills and gravel paths.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 43.7639,
      "longitude": 11.2476
    },
    {
      "name": "Piazza della Signoria",
      "type": "Square",
      "description": "This L-shaped square functions as Florence's political center and open-air sculpture gallery. Dominated by Palazzo Vecchio, the medieval town hall, the piazza features famous sculptures including a replica of Michelangelo's David, Cellini's Perseus, Giambologna's Rape of the Sabine Women, and the Neptune Fountain. The Loggia dei Lanzi displays Renaissance and classical sculptures for public viewing.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Busy throughout the day in all seasons. Evening lighting creates a magical atmosphere. Cafes around the square offer overpriced but atmospheric dining with views of surrounding monuments.",
      "booking_tips": "No booking required for the square. Palazzo Vecchio requires separate tickets. Consider guided walking tours for historical context.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 43.7696,
      "longitude": 11.2558
    },
    {
      "name": "Palazzo Vecchio",
      "type": "Palace/Museum",
      "description": "Florence's town hall since the 14th century, this fortress-palace combines medieval military architecture with Renaissance opulence. The interior contains lavishly decorated chambers, including the Salone dei Cinquecento with its 39-foot ceilings and battle scenes painted by Vasari. The structure is topped by a 308-foot bell tower, and archaeological excavations beneath reveal Roman ruins of an ancient theater.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with special evening openings in summer. The Tower climb offers spectacular views but may close during inclement weather.",
      "booking_tips": "Online booking recommended. Secret passages tour available for additional fee. Museum and tower require separate tickets. Discounts with Firenze Card.",
      "ratings": {
        "cost_estimate": 14,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 43.7698,
      "longitude": 11.2558
    },
    {
      "name": "San Lorenzo and Medici Chapels",
      "type": "Church/Museum",
      "description": "The Basilica of San Lorenzo was the parish church of the Medici family and features architecture by Brunelleschi. The adjoining Medici Chapels include the Sagrestia Nuova with Michelangelo's magnificent sculptures of Dawn, Dusk, Day, and Night adorning the tombs of Lorenzo and Giuliano de' Medici, and the Chapel of Princes, a mausoleum with lavish decor featuring semi-precious stones and marble.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Interiors maintain consistent temperatures year-round. Less crowded in winter months. The church and chapels operate as separate entities with different entrance fees and hours.",
      "booking_tips": "Separate tickets required for basilica, library, and Medici Chapels. Online booking recommended for Medici Chapels. Closed on specific days; check schedule in advance.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 43.7747,
      "longitude": 11.2545
    },
    {
      "name": "Piazzale Michelangelo",
      "type": "Scenic Viewpoint",
      "description": "This large, partly pedestrianized square offers the most famous panoramic view of Florence. Created in 1869 as part of urban renewal, it features bronze copies of Michelangelo's sculptures, including David. The terraced piazza is reached by a scenic walk up the hill from the Arno or by bus. Particularly spectacular at sunset, it provides unparalleled views of the Duomo, Palazzo Vecchio, and the city's historic center.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Crowded at sunset year-round. Summer evenings feature outdoor cafes and occasional live music. Winter offers crisp, clear views on sunny days.",
      "booking_tips": "No booking required. Accessible by bus #12 or 13 from the city center. Arrive early for sunset to secure good viewing spots.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 43.7629,
      "longitude": 11.2652
    },
    {
      "name": "Basilica di Santa Croce",
      "type": "Church",
      "description": "The largest Franciscan church in the world and Florence's principal parish church, Santa Croce contains funerary monuments and tombs of illustrious Italians including Michelangelo, Galileo, Machiavelli, and Rossini. The basilica features sixteen chapels decorated with stunning frescoes by Giotto and his pupils. The adjacent museum displays works from the church and attached monastery.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "The church may close occasionally for religious ceremonies. The piazza hosts markets and events throughout the year, including a Christmas market and historical football matches in June.",
      "booking_tips": "Entrance fee required. Audio guides available. Modest dress required (shoulders and knees covered).",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 43.7687,
      "longitude": 11.2621
    },
    {
      "name": "Bargello Museum",
      "type": "Museum",
      "description": "Housed in a 13th-century former barracks and prison, the Bargello is Italy's foremost sculpture museum. The collection includes Renaissance masterpieces by Michelangelo, Donatello (including the original bronze David), Ghiberti, Cellini, and Giambologna. The museum also displays medieval and Renaissance decorative arts, including ceramics, textiles, tapestries, ivory, silver, armor, and coins.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded than other major museums. Closed on specific days; check schedule in advance. The courtyard occasionally hosts concerts during summer evenings.",
      "booking_tips": "Online booking available. Included in Firenze Card. Consider combining with nearby Badia Fiorentina and Dante's House.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 43.7704,
      "longitude": 11.2581
    },
    {
      "name": "Mercato Centrale (Central Market)",
      "type": "Market",
      "description": "This historic two-level market in the San Lorenzo district offers an authentic food shopping and dining experience. The ground floor features traditional vendors selling fresh produce, meat, fish, cheese, and specialty foods. The upper floor, renovated in 2014, contains an upscale food court with artisanal producers offering prepared foods, wine bars, and restaurants—all showcasing Tuscan and Italian cuisine.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Ground floor market closes in early afternoon. Upper floor restaurants remain open into the evening. Less crowded on weekdays. Some vendors may take August vacations.",
      "booking_tips": "No booking required for browsing. Some upstairs eateries take reservations for dinner. Cooking classes sometimes available—book in advance.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 43.7767,
      "longitude": 11.2532
    },
    {
      "name": "San Miniato al Monte",
      "type": "Church",
      "description": "Perched on one of the highest points in Florence, this 11th-century Romanesque church offers spectacular views and architectural beauty. The marble façade, intricate interior mosaics, and Romanesque architectural elements make it one of Florence's most beautiful churches. Below the main church lies a crypt with early Christian frescoes, while a monastery next door continues to produce famous honey and liqueurs.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Monks still perform Gregorian chants at 5:30pm daily. Serene atmosphere throughout the year. The cemetery behind the church contains graves of notable Florentines and offers additional view points.",
      "booking_tips": "No booking required. Reached by a steep climb beyond Piazzale Michelangelo or by bus #12. Church shop sells products made by the monks.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 43.7628,
      "longitude": 11.2652
    },
    {
      "name": "Oltrarno District",
      "type": "District",
      "description": "The 'other side of the Arno' neighborhood maintains a more authentic atmosphere than the tourist-filled historic center. Known for artisan workshops, antique stores, and traditional restaurants, the area includes highlights such as Palazzo Pitti, Boboli Gardens, and Santo Spirito. Narrow streets and piazzas reveal Renaissance palaces, local bars, and craft studios where traditional techniques continue to be practiced.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Lively throughout the year with locals and fewer tourists than the city center. Summer evenings bring outdoor dining and events in Santo Spirito square. Artisan shops may close for extended lunch breaks.",
      "booking_tips": "No booking required for exploring. Artisan workshop tours available through various organizations—book in advance. Restaurant reservations recommended, especially on weekends.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 43.7662,
      "longitude": 11.2467
    },
    {
      "name": "Museo dell'Opera del Duomo",
      "type": "Museum",
      "description": "This museum houses original artwork and artifacts from Florence Cathedral, including Ghiberti's original Gates of Paradise, Michelangelo's Pietà, Donatello's Mary Magdalene, liturgical objects, and architectural models. Extensively renovated in 2015, the museum brilliantly contextualizes the construction and decoration of the Duomo complex through interactive displays and thoughtfully arranged exhibits.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Included in the unified Duomo complex ticket. Less crowded than the Cathedral and dome climb. Provides context that enhances visits to other Duomo monuments.",
      "booking_tips": "Part of combined ticket for all Duomo monuments. Valid for 72 hours from first use. Consider visiting before climbing the dome for historical context.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 43.7734,
      "longitude": 11.2578
    },
    {
      "name": "Museo Galileo",
      "type": "Museum",
      "description": "Dedicated to the history of science, this museum houses an impressive collection of scientific instruments, including Galileo's original telescopes and the lens with which he discovered Jupiter's moons. The collection spans from the Renaissance to the 20th century, featuring astronomical devices, globes, thermometers, and anatomical models that trace scientific advancement through the ages.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round and generally less crowded than art museums. Interactive exhibits appeal to children and adults alike. Air-conditioned interior provides relief during summer heat.",
      "booking_tips": "Online booking available but rarely necessary. Audio guides recommended. Located near the Uffizi, making for convenient combination visits.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 43.7687,
      "longitude": 11.2553
    },
    {
      "name": "Museo Nazionale del Bargello",
      "type": "Museum",
      "description": "Housed in a former barracks and prison dating to the 13th century, the Bargello is Italy's premier sculpture museum. The collection includes Renaissance masterpieces by Donatello, Michelangelo, Cellini, and Giambologna, alongside decorative arts, ceramics, textiles, tapestries, ivory, silver, armor, and coins. The museum's courtyard and Gothic architecture add to its appeal.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded than Florence's more famous museums. The interior courtyard offers a pleasant respite during summer. Occasional temporary exhibitions enhance the permanent collection.",
      "booking_tips": "Online booking available but seldom necessary. Included in Firenze Card. Consider guidebook or audio guide as information panels are limited.",
      "ratings": {
        "cost_estimate": 9,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 43.7704,
      "longitude": 11.2582
    },
    {
      "name": "Brancacci Chapel",
      "type": "Church",
      "description": "Located in the Church of Santa Maria del Carmine, this chapel contains one of the most important fresco cycles of the early Renaissance, painted by Masaccio, Masolino, and Filippino Lippi between 1425-1427. The frescoes depict the life of St. Peter and are considered revolutionary for their use of perspective, realistic figures, and emotional expressiveness that influenced generations of artists including Michelangelo.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Strict visitor limits mean advance booking is essential in high season. The chapel maintains controlled temperature and humidity to preserve the frescoes. Located in the less-visited Oltrarno district.",
      "booking_tips": "Advance reservations required. Limited to 30 visitors every 30 minutes. Photography not permitted. Closed on Tuesdays.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 43.7687,
      "longitude": 11.2423
    },
    {
      "name": "Bistecca alla Fiorentina",
      "type": "Cultural Experience",
      "description": "This iconic Florentine dish is a thick-cut T-bone steak from Chianina cattle, minimally seasoned with salt and pepper, grilled over wood or charcoal to rare doneness, and finished with olive oil. Traditionally 3-4 cm thick and weighing 1.2-1.5 kg, it's meant to be shared. The dish exemplifies Tuscan cuisine's simplicity and focus on high-quality ingredients.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Expensive",
      "seasonal_notes": "Available year-round at traditional Florentine steakhouses. Quality and prices vary significantly between establishments. Best enjoyed with local Chianti Classico or Brunello di Montalcino wines.",
      "booking_tips": "Reservations recommended for renowned steakhouses. Prices typically by weight (€50-80/kg). Authentic versions only served rare—be prepared to accept this traditional preparation.",
      "ratings": {
        "cost_estimate": 45,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 43.7710,
      "longitude": 11.2550
    },
    {
      "name": "Biblioteca Medicea Laurenziana",
      "type": "Library",
      "description": "Designed by Michelangelo, this historic library houses one of the world's most important collections of manuscripts and early printed books. The dramatic entrance staircase and reading room with unique wooden benches designed by Michelangelo represent architectural innovation, while the collection includes rare manuscripts from the Medici family and classical texts that fueled Renaissance humanism.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open limited hours on varying days. Climate-controlled environment preserves ancient manuscripts. Less frequented by tourists despite its significance.",
      "booking_tips": "Check opening days as hours are limited. Located within the San Lorenzo complex but requires separate ticket. Special exhibitions of rare manuscripts occur periodically.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 43.7747,
      "longitude": 11.2548
    },
    {
      "name": "Mercato di Sant'Ambrogio",
      "type": "Market",
      "description": "This authentic local market offers a genuine Florentine shopping experience away from the tourist crowds. Food vendors sell fresh produce, meats, cheeses, bread, and prepared foods, while the surrounding streets host clothing and household goods. More frequented by locals than visitors, it provides insight into everyday Florentine life and cuisine.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited weekday mornings when most vendors are open. Saturday mornings particularly lively. Some vendors close by early afternoon. Seasonal produce reflects genuine Tuscan agricultural traditions.",
      "booking_tips": "No booking required. Simple eateries inside serve authentic, inexpensive Tuscan cuisine. Vendors appreciate basic Italian phrases. Bring cash as many smaller vendors don't accept cards.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 43.7706,
      "longitude": 11.2656
    },
    {
      "name": "Cappella dei Principi",
      "type": "Chapel/Museum",
      "description": "This monumental chapel behind San Lorenzo Basilica serves as the mausoleum for Medici grand dukes. Its octagonal design features spectacular inlaid marble and semi-precious stone decorations covering every surface in geometric patterns and family crests. The immense dome rises 59 meters, making it one of Florence's most ambitious architectural projects of the 17th century.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Temperature controlled environment year-round. Part of the Medici Chapels complex, which may have varying seasonal hours. Less crowded than major Florence attractions.",
      "booking_tips": "Accessed through the Medici Chapels Museum. Online booking recommended. Combined with the adjoining Sagrestia Nuova (New Sacristy) designed by Michelangelo.",
      "ratings": {
        "cost_estimate": 9,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 43.7746,
      "longitude": 11.2536
    },
    {
      "name": "Giardino Bardini",
      "type": "Garden",
      "description": "These restored Renaissance gardens offer spectacular views of Florence in a less crowded setting than nearby Boboli Gardens. Featuring a baroque staircase, wisteria tunnel, azalea garden, and panoramic terrace, the gardens surround Villa Bardini, which houses a museum and temporary exhibitions. The carefully designed landscape blends Italian formal garden traditions with English woodland style.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Spectacular wisteria blooms in April. Rose gardens peak in May and June. Fall foliage creates dramatic colors in October and November. The garden cafe offers seasonal refreshments with panoramic views.",
      "booking_tips": "Combined ticket available with Boboli Gardens and Pitti Palace. Often overlooked by tourists, providing a peaceful alternative to more famous viewpoints. Comfortable shoes recommended for hillside paths.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 43.7650,
      "longitude": 11.2580
    },
    {
      "name": "Museo Novecento",
      "type": "Museum",
      "description": "Dedicated to Italian art of the 20th century, this museum is housed in the historic Leopoldine complex in Piazza Santa Maria Novella. The collection features paintings, sculptures, video installations, and multimedia works organized chronologically through fifteen exhibition areas. Artists represented include Giorgio de Chirico, Giorgio Morandi, Alberto Magnelli, and other influential Italian modernists.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded than Renaissance-focused museums. Air-conditioned galleries provide relief during summer heat. Regular temporary exhibitions complement the permanent collection.",
      "booking_tips": "Online booking available but rarely necessary. Included in Firenze Card. Free entry on the first Sunday of each month. Rooftop cafe offers views of Santa Maria Novella church.",
      "ratings": {
        "cost_estimate": 9,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 43.7732,
      "longitude": 11.2498
    }
  ]
}