{
    "Spring": {
        "activities": [
            {
                "name": "Villa Durazzo Pallavicini Gardens",
                "type": "Garden",
                "description": "Visit this magnificent 19th-century garden in Nervi when spring flowers create a romantic landscape masterpiece with exotic plants and beautiful pathways.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings lush greenery, blooming flowers, and comfortable temperatures to explore this extensive historic garden.",
                "booking_tips": "Tickets can be purchased online or at the entrance; combined tickets available with other Nervi attractions."
            },
            {
                "name": "Coastal Walking in Boccadasse",
                "type": "Outdoor",
                "description": "Explore the charming fishing village of Boccadasse when spring wildflowers bloom along the coastal paths and the Mediterranean sparkles.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring offers ideal weather for coastal walks with blooming flowers and comfortable temperatures for exploring the colorful cliffside houses.",
                "booking_tips": "No booking needed; take Bus #15 or #17 from Genoa center for a 20-minute journey."
            },
            {
                "name": "Pesto alla Genovese Festival",
                "type": "Cultural",
                "description": "Experience Genoa's celebration of its most famous culinary export during the annual pesto festival in the historic center.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This spring tradition celebrates the city's signature dish with tastings, demonstrations, and competitions in Piazza San Lorenzo.",
                "booking_tips": "No booking required, but arrive early to sample the best pesto from local artisans and restaurants."
            },
            {
                "name": "Genoa International Boat Show",
                "type": "Maritime",
                "description": "Experience one of Europe's most important boat shows featuring luxury yachts, sailing vessels, and marine technology.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Expensive",
                "seasonal_notes": "Held annually in spring at the Porto Antico, this prestigious event showcases the latest in maritime innovation and luxury boating.",
                "booking_tips": "Book tickets online well in advance through the official website; professional days are less crowded than public days."
            },
            {
                "name": "Spring Seafood Tasting",
                "type": "Food & Drink",
                "description": "Sample Genoa's finest seasonal seafood as new spring catches arrive at the Mercato Orientale and local trattorias.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings fresh catches like sea bream, red mullet, and spring vegetables to Genoa's best seafood restaurants.",
                "booking_tips": "Self-guided tours are possible, but several companies offer guided seafood tours with market visits and tastings."
            },
            {
                "name": "Spring Day Trip to Camogli",
                "type": "Excursion",
                "description": "Visit this picturesque fishing village when wildflowers bloom and visibility is excellent for panoramic views of the Ligurian coast.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers ideal weather for exploring Camogli's colorful houses, historic church, and beautiful harbor.",
                "booking_tips": "No booking needed; take a train from Genoa's Piazza Principe station for a 30-minute journey."
            },
            {
                "name": "Mostra dell'Artigianato (Artisan Fair)",
                "type": "Market",
                "description": "Explore Italy's most important crafts fair showcasing artisanal products from throughout Italy and beyond.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in late April/early May at the Fiera di Genova, this large fair celebrates Italy's finest artisanal traditions.",
                "booking_tips": "Tickets can be purchased online in advance or at the entrance; weekdays are less crowded than weekends."
            },
            {
                "name": "Nervi Park in Bloom",
                "type": "Garden",
                "description": "Visit this extensive public park when spring flowers create a colorful display along the coastal promenade.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "May and June are peak blooming months, offering a fragrant retreat with spectacular views of the Mediterranean.",
                "booking_tips": "No booking required; open year-round but best visited in late spring when flowers are at their peak."
            },
            {
                "name": "Wisteria at Villa Durazzo",
                "type": "Garden",
                "description": "Marvel at the spectacular purple wisteria in the historic Villa Durazzo Pallavicini Gardens, one of Genoa's most Instagram-worthy spring sights.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "The famous wisteria typically blooms in April, creating a magical purple canopy along the garden's pergola.",
                "booking_tips": "Purchase tickets online or at the entrance; combined tickets available with other Nervi attractions."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Aperitivo at Porto Antico",
                "type": "Food & Drink",
                "description": "Enjoy pre-dinner drinks and snacks while taking in panoramic views of Genoa's historic harbor during sunset.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings offer extended daylight hours and warm temperatures perfect for outdoor drinks with harbor views.",
                "booking_tips": "Arrive early to secure a spot at the waterfront bars or bring your own picnic to enjoy on the harbor promenade."
            },
            {
                "name": "Estate Genovese Festival",
                "type": "Festival",
                "description": "Experience Genoa's summer cultural program featuring outdoor concerts, cinema, dance performances, and art events throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "This summer-long festival transforms piazzas, cloisters, and parks into cultural venues from June through September.",
                "booking_tips": "Check the official Estate Genovese website for the schedule; popular events may require advance booking."
            },
            {
                "name": "Cinema all'Aperto (Outdoor Cinema)",
                "type": "Entertainment",
                "description": "Watch films under the stars in historic settings like Piazza San Lorenzo or the courtyard of Palazzo Ducale.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Numerous outdoor cinema events run throughout summer, offering both Italian and international films, often in original language.",
                "booking_tips": "Some screenings require advance tickets while others are free; bring a cushion for more comfort."
            },
            {
                "name": "Palio Marinaro (Maritime Regatta)",
                "type": "Cultural",
                "description": "Witness Genoa's historic maritime regatta, a traditional rowing competition between the city's historic neighborhoods.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This traditional maritime sport is held during June, celebrating Genoa's seafaring heritage with colorful boats and local pride.",
                "booking_tips": "No booking required; arrive early to secure a good viewing spot along the harbor or at Porto Antico."
            },
            {
                "name": "Genoa Dance Festival",
                "type": "Performance",
                "description": "Enjoy contemporary dance performances in the stunning cloister of San Lorenzo and other historic venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Running from late June through July, this festival brings international dance companies to unique Genoese settings.",
                "booking_tips": "Book tickets online in advance through the festival website."
            },
            {
                "name": "Beach Day at Boccadasse",
                "type": "Beach",
                "description": "Escape the city heat with a day at this charming pebble beach, easily accessible by bus from Genoa center.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "The perfect summer respite from Genoa's heat, with a small pebble beach and excellent seafood restaurants nearby.",
                "booking_tips": "Buses run regularly from Genoa center; arrive early to secure a good spot on the beach during peak season."
            },
            {
                "name": "Nervi Summer Festival",
                "type": "Performance",
                "description": "Experience concerts and performances in the beautiful gardens and coastal settings of Nervi.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The festival runs from June to August, offering classical music, jazz, and dance in spectacular coastal settings.",
                "booking_tips": "Purchase tickets online in advance; performances often sell out. Bring a light jacket as evenings can be cool by the sea."
            },
            {
                "name": "San Lorenzo Night",
                "type": "Festival",
                "description": "Join Genoa's celebration of the Feast of San Lorenzo on August 10th, with local celebrations and stargazing for the night of shooting stars.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This local celebration coincides with the Perseid meteor shower, known in Italy as 'the tears of San Lorenzo.'",
                "booking_tips": "No booking required; join the celebrations in Piazza San Lorenzo and around the cathedral."
            },
            {
                "name": "Ferragosto Fireworks",
                "type": "Festival",
                "description": "Experience the August 15th holiday (Ferragosto) celebrations with special events and evening fireworks displays over the harbor.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This Italian national holiday sees Genoa at its quietest as locals leave for vacation, but the city organizes special events for tourists.",
                "booking_tips": "No booking needed; find a spot along the harbor or at Porto Antico for the best views of fireworks."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Grape Harvest in Liguria",
                "type": "Excursion",
                "description": "Take a day trip to the Ligurian wine region for vineyard tours, tastings, and harvest celebrations.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "September and October are grape harvest months, when the countryside is alive with activity and vibrant fall colors.",
                "booking_tips": "Book a guided tour from Genoa or rent a car; many wineries require reservations, especially during harvest season."
            },
            {
                "name": "Genoa Biennale",
                "type": "Art",
                "description": "Explore this international contemporary art exhibition showcasing artists from around the world in multiple disciplines.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Held in odd-numbered years during October at the historic Fiera di Genova, this event features thousands of works from international artists.",
                "booking_tips": "Tickets can be purchased online or at the entrance; allow several hours to explore the extensive exhibitions."
            },
            {
                "name": "Truffle Season in Liguria",
                "type": "Food & Drink",
                "description": "Savor autumn's prized white truffles in Genoa's restaurants or take a truffle hunting tour in the nearby countryside.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Expensive",
                "seasonal_notes": "October through December is white truffle season, when this precious ingredient features prominently on Ligurian menus.",
                "booking_tips": "Make reservations at restaurants featuring seasonal truffle menus; for truffle hunting excursions, book at least a week in advance."
            },
            {
                "name": "Autumn Exhibits at Palazzo Ducale",
                "type": "Museum",
                "description": "Visit Genoa's premier exhibition space for contemporary and modern art shows that typically open in autumn.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Fall brings major new exhibitions to this Renaissance palace turned modern art venue, often featuring internationally acclaimed artists.",
                "booking_tips": "Book tickets online to avoid lines; check the website for special events and guided tours related to current exhibitions."
            },
            {
                "name": "Olive Harvest Experience",
                "type": "Excursion",
                "description": "Participate in the traditional olive harvest and oil pressing in the Ligurian countryside surrounding Genoa.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Late October through November is olive harvesting season, with many farms offering visitor experiences and fresh oil tastings.",
                "booking_tips": "Book a guided tour that includes transportation from Genoa, or rent a car to visit oil producers independently."
            },
            {
                "name": "Genoa Marathon",
                "type": "Sport",
                "description": "Watch or participate in the annual Genoa Marathon, which takes runners past the city's most iconic monuments and along the coast.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "Usually held in late November, the marathon offers a unique way to experience Genoa's historic center when streets are closed to traffic.",
                "booking_tips": "Register well in advance if participating; spectators can watch for free along the route."
            },
            {
                "name": "Football Match at Stadio Luigi Ferraris",
                "type": "Sport",
                "description": "Experience the passion of Italian football by attending a Genoa CFC or Sampdoria match at their historic shared stadium.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The football season is in full swing during autumn, with pleasant temperatures for outdoor matches.",
                "booking_tips": "Purchase tickets through the official Genoa CFC or Sampdoria websites or authorized vendors; bring ID as it's required to match the name on your ticket."
            },
            {
                "name": "Autumn in Villa Durazzo Gardens",
                "type": "Park",
                "description": "Explore the historic gardens when fall colors transform this romantic landscape.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October and November bring golden colors to the deciduous plants, creating a magical autumn atmosphere.",
                "booking_tips": "Tickets can be purchased online or at the entrance; morning visits offer the best light for photography."
            },
            {
                "name": "Genoa Chocolate Festival",
                "type": "Food & Drink",
                "description": "Indulge in fine chocolates from across Italy and Europe at this annual autumn festival.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Usually held in October in Piazza San Lorenzo, this festival features artisanal chocolate makers with tastings and demonstrations.",
                "booking_tips": "No booking required; entrance is free but bring cash for purchasing chocolates from vendors."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets in Genoa",
                "type": "Market",
                "description": "Experience the German-inspired Christmas market in Piazza San Lorenzo and the smaller Genoese markets throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Running from late November through Christmas, the markets are especially charming when illuminated at night.",
                "booking_tips": "No booking required; weekday visits are less crowded than weekends."
            },
            {
                "name": "G-Light Festival (Genoa Light Festival)",
                "type": "Festival",
                "description": "Marvel at the artistic light projections that transform Genoa's monuments and harbor during the holiday season.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Typically running from December 8th (Immaculate Conception) through Epiphany (January 6th), illuminating the city during the darkest month.",
                "booking_tips": "No booking needed; a self-guided walk along the harbor and through the historic center covers most installations."
            },
            {
                "name": "New Year's Eve Concert in Piazza San Lorenzo",
                "type": "Performance",
                "description": "Welcome the New Year with live music and celebrations in Genoa's most famous square.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "The city organizes public celebrations with concerts, often with multiple music stages in different piazzas.",
                "booking_tips": "No booking needed for public celebrations; for restaurant dinners or club parties, reserve well in advance."
            },
            {
                "name": "Epiphany Celebration and Cavalcade of the Magi",
                "type": "Cultural",
                "description": "Experience the historic recreation of the Three Kings' procession through the center of Genoa on January 6th.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "This Renaissance-inspired procession features participants in period costumes, flag throwers, and musicians.",
                "booking_tips": "No booking required; find a spot along Via Garibaldi or in Piazza San Lorenzo for the best views."
            },
            {
                "name": "Winter Sales Shopping",
                "type": "Shopping",
                "description": "Take advantage of Italy's regulated winter sales season with significant discounts at Genoa's luxury boutiques and artisan shops.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "Winter sales typically begin in early January and last about six weeks, offering substantial discounts on fashion and local products.",
                "booking_tips": "No booking required; shop early in the sale period for the best selection."
            },
            {
                "name": "Opera at Teatro Carlo Felice",
                "type": "Performance",
                "description": "Attend a world-class opera performance during the winter season at Genoa's historic opera house.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter brings the main opera season with premier productions and internationally renowned performers.",
                "booking_tips": "Book tickets online well in advance, especially for popular performances; dress code is generally formal."
            },
            {
                "name": "Hot Chocolate at Historic Cafés",
                "type": "Food & Drink",
                "description": "Warm up with Genoa's famous thick hot chocolate at historic establishments like Caffè degli Specchi or Caffè Rivoire.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season to enjoy this rich Genoese specialty, served with whipped cream and often accompanied by pastries.",
                "booking_tips": "No reservations needed; counter service is less expensive than table service."
            },
            {
                "name": "Winter Day Trip to Portofino",
                "type": "Excursion",
                "description": "Visit the glamorous village of Portofino when tourist crowds are minimal and winter light casts a golden glow on its colorful harbor.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers a more authentic experience in this popular Ligurian destination, with local life more visible and minimal wait times at attractions.",
                "booking_tips": "Buses run regularly from Genoa's bus station; no advance booking needed except for guided tours."
            },
            {
                "name": "Genoa Fashion Week",
                "type": "Fashion",
                "description": "Experience one of Italy's important fashion events, attracting fashion professionals and street style photographers to Genoa.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Varies",
                "seasonal_notes": "Held twice yearly with the winter edition in January, bringing fashion energy to the city during the low tourist season.",
                "booking_tips": "Industry events require professional accreditation, but the street style scene around the fashion venues is free to observe."
            }
        ]
    }
}