{
  "sites": [
    {
      "name": "Aquarium of Genoa",
      "type": "Aquarium",
      "description": "The Aquarium of Genoa is the largest aquarium in Italy and one of the largest in Europe. Built for Expo '92, it houses over 12,000 animals from 600 species in 70 tanks. The aquarium features marine life from the Mediterranean, tropical seas, and polar regions, including dolphins, sharks, penguins, and tropical fish. The facility also includes a tropical forest area and offers educational programs about marine conservation.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Expensive",
      "seasonal_notes": "Extremely crowded during summer months and school holidays. Winter offers lighter crowds. Consider visiting on weekdays for a less crowded experience.",
      "booking_tips": "Advance online booking recommended to avoid long lines. Early morning entry times recommended. Combined tickets available with other attractions in the Porto Antico area.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 44.4108,
      "longitude": 8.9325
    },
    {
      "name": "Genoa Cathedral (San Lorenzo)",
      "type": "Church",
      "description": "The Cathedral of San Lorenzo is Genoa's main church, built between the 12th and 14th centuries. The Romanesque-Gothic structure features a distinctive black and white striped façade made of local stone. The interior houses important artworks including the ashes of John the Baptist, brought from the Holy Land during the Crusades. The cathedral's treasury contains valuable religious artifacts and the famous Sacro Catino, believed to be the Holy Grail.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The cathedral itself is free, but the museum and treasury require tickets. Dress modestly (covered shoulders and knees).",
      "booking_tips": "No booking required for the cathedral. Treasury visits require separate tickets. Guided tours available through the tourist office.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4060,
      "longitude": 8.9308
    },
    {
      "name": "Palazzo Ducale",
      "type": "Palace/Museum",
      "description": "The Doge's Palace was the seat of Genoa's government for over 600 years, from the 13th to the 18th century. This magnificent palace combines medieval, Renaissance, and Baroque architecture, featuring grand halls, frescoed ceilings, and the famous Hall of the Great Council. Today it hosts major art exhibitions and cultural events. The palace's architecture reflects Genoa's wealth and power during its golden age as a maritime republic.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with special exhibitions. Summer brings major art shows. The palace offers a cool retreat during summer heat.",
      "booking_tips": "Online booking recommended for special exhibitions. Regular admission includes access to permanent collections. Check website for current exhibition schedules.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 44.4070,
      "longitude": 8.9300
    },
    {
      "name": "Via Garibaldi (Strade Nuove)",
      "type": "Street",
      "description": "Via Garibaldi is a UNESCO World Heritage site featuring some of Genoa's most magnificent Renaissance and Baroque palaces. Built between the 16th and 18th centuries, this street showcases the wealth of Genoa's noble families through their opulent residences. Notable palaces include Palazzo Rosso, Palazzo Bianco, and Palazzo Doria-Tursi, which now house museums with important art collections. The street represents the height of Genoa's architectural and cultural achievement.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, with spring and fall offering pleasant walking weather. Summer can be hot but the palaces provide cool respite. Winter offers fewer crowds.",
      "booking_tips": "No booking required for walking the street. Individual palace museums require separate tickets. Consider a combined ticket for multiple palaces.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 44.4080,
      "longitude": 8.9310
    },
    {
      "name": "Porto Antico (Old Port)",
      "type": "Port Area",
      "description": "The Old Port of Genoa has been transformed from a working harbor into a vibrant cultural and entertainment district. The area features the Aquarium, the Bigo panoramic elevator, the Biosphere tropical garden, and numerous restaurants and shops. The port's maritime heritage is preserved through historic ships and the Galata Maritime Museum. The area is perfect for leisurely strolls, dining, and enjoying views of the harbor and city skyline.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Lively year-round with seasonal events and festivals. Summer brings outdoor dining and entertainment. Winter offers quieter exploration with indoor attractions.",
      "booking_tips": "No booking required for the port area. Individual attractions require separate tickets. Consider evening visits for beautiful harbor lighting.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 44.4100,
      "longitude": 8.9300
    },
    {
      "name": "Boccadasse",
      "type": "Neighborhood",
      "description": "Boccadasse is a charming fishing village that has been absorbed into Genoa, located along the eastern coast. This picturesque neighborhood features colorful houses built into the cliffs, a small pebble beach, and traditional fishing boats. The area is famous for its authentic Ligurian restaurants serving fresh seafood and pesto alla genovese. Boccadasse offers a glimpse into traditional Genoese life and is perfect for sunset walks and romantic dinners.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful at sunset year-round. Summer brings beach activities and outdoor dining. Winter offers atmospheric walks with fewer crowds.",
      "booking_tips": "No booking required for exploring. Restaurant reservations recommended, especially on weekends. Accessible by bus or pleasant coastal walk from the city center.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 44.4000,
      "longitude": 8.9700
    },
    {
      "name": "Piazza de Ferrari",
      "type": "Square",
      "description": "Piazza de Ferrari is Genoa's main square and the heart of the city. The square is dominated by the impressive fountain of the same name and surrounded by important buildings including the Palazzo Ducale, Teatro Carlo Felice, and the headquarters of major banks. The square serves as a meeting point for locals and visitors, hosting events, demonstrations, and celebrations throughout the year. The architecture reflects Genoa's historical importance as a financial and cultural center.",
      "indoor": false,
      "best_time": "Any time",
      "price_range": "Free",
      "seasonal_notes": "Busy throughout the day in all seasons. Evening lighting creates a magical atmosphere. Cafes around the square offer atmospheric dining with views of surrounding monuments.",
      "booking_tips": "No booking required for the square. Teatro Carlo Felice requires separate tickets for performances. Consider guided walking tours for historical context.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 44.4070,
      "longitude": 8.9300
    },
    {
      "name": "Galata Maritime Museum",
      "type": "Museum",
      "description": "The Galata Maritime Museum is Italy's largest maritime museum, housed in a former shipyard building. The museum tells the story of Genoa's maritime history through interactive exhibits, ship models, and authentic vessels including a full-scale reconstruction of a 17th-century galley. Visitors can explore the submarine Nazario Sauro and learn about Genoa's role in maritime exploration, trade, and naval history. The museum offers spectacular views of the harbor from its rooftop terrace.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. The museum offers a cool retreat during summer heat. Interactive exhibits appeal to children and adults alike.",
      "booking_tips": "Online booking available but rarely necessary. Combined tickets available with the Aquarium. Audio guides recommended for detailed information.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 44.4100,
      "longitude": 8.9300
    },
    {
      "name": "San Lorenzo and Treasury",
      "type": "Church/Museum",
      "description": "The Basilica of San Lorenzo houses one of the most important religious treasures in Italy - the ashes of John the Baptist and the famous Sacro Catino, believed to be the Holy Grail. The church's treasury contains valuable religious artifacts, precious metals, and historical documents that reflect Genoa's wealth and religious importance. The basilica itself features stunning architecture and artwork spanning from the medieval period to the present day.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. The treasury maintains consistent temperatures for artifact preservation. Less crowded in winter months.",
      "booking_tips": "Separate tickets required for the treasury. Online booking recommended. Guided tours available through the tourist office.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4060,
      "longitude": 8.9308
    },
    {
      "name": "Spianata Castelletto",
      "type": "Scenic Viewpoint",
      "description": "This elevated terrace offers the most spectacular panoramic view of Genoa's historic center and harbor. Reached by elevator from the city center, the Spianata provides a bird's-eye view of the city's medieval towers, Renaissance palaces, and the Mediterranean Sea. The viewpoint is particularly beautiful at sunset and offers excellent photo opportunities. The area also features cafes and restaurants where visitors can enjoy the view while dining.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Spectacular at sunset year-round. Summer evenings feature outdoor cafes and occasional live music. Winter offers crisp, clear views on sunny days.",
      "booking_tips": "No booking required. Accessible by elevator from Via Garibaldi or by walking up the hill. Arrive early for sunset to secure good viewing spots.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Basilica di Santa Maria di Castello",
      "type": "Church",
      "description": "This ancient church, built in the 12th century on the site of a Roman temple, is one of Genoa's oldest religious buildings. The church features a mix of Romanesque and Gothic architecture and houses important artworks including frescoes, sculptures, and religious artifacts. The adjacent convent and museum contain additional treasures and offer insight into Genoa's religious and cultural history. The church's elevated position provides beautiful views of the city.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The church may close occasionally for religious ceremonies. The museum has limited hours and may close on certain days.",
      "booking_tips": "No booking required for the church. Museum visits may require advance notice. Modest dress required (shoulders and knees covered).",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 44.4060,
      "longitude": 8.9300
    },
    {
      "name": "Museo di Palazzo Reale",
      "type": "Museum",
      "description": "The Royal Palace Museum showcases Genoa's aristocratic heritage through its lavishly decorated rooms, art collections, and historical furnishings. Built in the 17th century for the Balbi family, the palace later became a royal residence. The museum features period rooms with original furniture, paintings, and decorative arts, providing a glimpse into the luxurious lifestyle of Genoa's nobility during the city's golden age.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. The palace offers a cool retreat during summer heat. Guided tours available in multiple languages.",
      "booking_tips": "Online booking recommended. Guided tours available for additional fee. Photography restrictions may apply in certain areas.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Mercato Orientale (Eastern Market)",
      "type": "Market",
      "description": "This historic covered market offers an authentic Genoese shopping experience with vendors selling fresh produce, meats, cheeses, bread, and specialty foods. The market is famous for its fresh fish, local cheeses, and Ligurian specialties like pesto, focaccia, and fresh pasta. The surrounding area features traditional food shops and restaurants where visitors can sample authentic Genoese cuisine. The market provides insight into everyday Genoese life and culinary traditions.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited weekday mornings when most vendors are open. Saturday mornings particularly lively. Some vendors close by early afternoon. Seasonal produce reflects genuine Ligurian agricultural traditions.",
      "booking_tips": "No booking required for browsing. Simple eateries inside serve authentic, inexpensive Ligurian cuisine. Vendors appreciate basic Italian phrases. Bring cash as many smaller vendors don't accept cards.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "San Matteo Church",
      "type": "Church",
      "description": "This medieval church, built in the 12th century, is closely associated with the Doria family, one of Genoa's most powerful noble families. The church features Romanesque architecture and houses the tombs of several Doria family members. The church's simple exterior belies its historical importance and the valuable artworks and artifacts contained within. The surrounding square and neighborhood offer a glimpse into medieval Genoa.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The church may close occasionally for religious ceremonies. The surrounding neighborhood is particularly atmospheric in the evening.",
      "booking_tips": "No booking required. Located in a quiet neighborhood away from main tourist areas. Modest dress required (shoulders and knees covered).",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 44.4060,
      "longitude": 8.9300
    },
    {
      "name": "Museo di Storia Naturale",
      "type": "Museum",
      "description": "The Natural History Museum houses extensive collections of zoology, botany, geology, and paleontology. The museum's exhibits include dinosaur fossils, mineral specimens, and preserved animals from around the world. The museum is particularly strong in its collection of Ligurian natural history, reflecting the region's diverse ecosystems. Interactive exhibits and educational programs make it appealing to visitors of all ages.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round and generally less crowded than art museums. Interactive exhibits appeal to children and adults alike. Air-conditioned interior provides relief during summer heat.",
      "booking_tips": "Online booking available but rarely necessary. Audio guides recommended. Located near the university, making for convenient combination visits.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Museo del Risorgimento",
      "type": "Museum",
      "description": "This museum documents Italy's unification movement (Risorgimento) with particular focus on Genoa's role in the process. The collection includes historical documents, weapons, uniforms, and memorabilia from the 19th century. The museum is housed in a historic building and provides insight into a crucial period of Italian history. Exhibits are arranged chronologically, making it easy to follow the complex political and military events of the era.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded than other major museums. Air-conditioned galleries provide relief during summer heat. Regular temporary exhibitions complement the permanent collection.",
      "booking_tips": "Online booking available but rarely necessary. Audio guides available. Free entry on the first Sunday of each month.",
      "ratings": {
        "cost_estimate": 6,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Pestos alla Genovese",
      "type": "Cultural Experience",
      "description": "Pesto alla Genovese is Genoa's most famous culinary contribution to world cuisine. This vibrant green sauce is made from fresh basil, pine nuts, garlic, Parmigiano-Reggiano, Pecorino Romano, and extra virgin olive oil, traditionally ground together in a marble mortar with a wooden pestle. Authentic pesto is served with trofie pasta, a traditional Ligurian pasta shape. The dish exemplifies Ligurian cuisine's focus on fresh, local ingredients and simple preparation.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Available year-round at traditional Genoese restaurants. Quality and prices vary significantly between establishments. Best enjoyed with local Ligurian wines like Vermentino or Pigato.",
      "booking_tips": "Reservations recommended for renowned restaurants. Prices typically €12-20 per dish. Authentic versions use only the finest ingredients—be prepared to pay for quality.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Biblioteca Berio",
      "type": "Library",
      "description": "The Berio Library is Genoa's main public library, housed in a historic building in the city center. The library contains extensive collections of books, manuscripts, and historical documents related to Genoa and Liguria. The reading rooms offer a peaceful environment for study and research, while the library's exhibitions showcase rare books and historical materials. The building itself is architecturally significant and worth visiting for its design.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round with limited hours. Climate-controlled environment preserves ancient manuscripts. Less frequented by tourists despite its significance.",
      "booking_tips": "Check opening hours as they may vary. Located in the city center. Special exhibitions of rare manuscripts occur periodically.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Mercato del Carmine",
      "type": "Market",
      "description": "This local market offers a genuine Genoese shopping experience away from the tourist crowds. Food vendors sell fresh produce, meats, cheeses, bread, and prepared foods, while the surrounding streets host clothing and household goods. More frequented by locals than visitors, it provides insight into everyday Genoese life and cuisine. The market is particularly known for its fresh fish and local specialties.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited weekday mornings when most vendors are open. Saturday mornings particularly lively. Some vendors close by early afternoon. Seasonal produce reflects genuine Ligurian agricultural traditions.",
      "booking_tips": "No booking required. Simple eateries inside serve authentic, inexpensive Ligurian cuisine. Vendors appreciate basic Italian phrases. Bring cash as many smaller vendors don't accept cards.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Cappella di San Giovanni",
      "type": "Chapel/Museum",
      "description": "This small chapel, located near the cathedral, contains important religious artifacts and artwork. The chapel's intimate size and historical significance make it a peaceful place for reflection. The artwork and architecture reflect Genoa's religious heritage and the city's connections to the Holy Land. The chapel is less visited than major attractions, offering a quiet alternative for those interested in religious history.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Temperature controlled environment year-round. May have varying seasonal hours. Less crowded than major Genoa attractions.",
      "booking_tips": "No booking required. Located near the cathedral. Modest dress required (shoulders and knees covered).",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 44.4060,
      "longitude": 8.9308
    },
    {
      "name": "Giardino di Villa Durazzo Pallavicini",
      "type": "Garden",
      "description": "These restored 19th-century gardens offer spectacular views of Genoa and the sea in a less crowded setting than the city center. Featuring a romantic landscape design with winding paths, artificial lakes, and exotic plants, the gardens surround Villa Durazzo Pallavicini, which houses a museum. The carefully designed landscape blends Italian formal garden traditions with English romantic style, creating a unique horticultural experience.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Most beautiful in spring when flowers bloom. Rose gardens peak in May and June. Fall foliage creates dramatic colors in October and November. The garden cafe offers seasonal refreshments with panoramic views.",
      "booking_tips": "Combined ticket available with the villa museum. Often overlooked by tourists, providing a peaceful alternative to more famous attractions. Comfortable shoes recommended for hillside paths.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    },
    {
      "name": "Museo d'Arte Orientale",
      "type": "Museum",
      "description": "Dedicated to Asian art and culture, this museum houses an impressive collection of artifacts from China, Japan, Korea, and other Asian countries. The collection includes ceramics, textiles, paintings, sculptures, and decorative arts spanning several centuries. The museum provides insight into Genoa's historical trade connections with Asia and offers a fascinating contrast to the city's European cultural heritage.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded than other major museums. Air-conditioned galleries provide relief during summer heat. Regular temporary exhibitions complement the permanent collection.",
      "booking_tips": "Online booking available but rarely necessary. Audio guides recommended. Free entry on the first Sunday of each month.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 44.4080,
      "longitude": 8.9300
    }
  ]
}