{
    "Spring": {
        "activities": [
            {
                "name": "Easter Markets at Great Square",
                "type": "Market",
                "description": "Experience traditional Czech Easter markets in the Great Square, featuring hand-painted eggs, local crafts, and seasonal treats like mazanec (Easter bread).",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the city to life with Easter traditions and blooming flowers throughout the city.",
                "booking_tips": "Visit early morning for the best selection of traditional Easter decorations and fewer crowds."
            },
            {
                "name": "Jirásek Gardens Spring Bloom",
                "type": "Park",
                "description": "Witness the beautiful spring bloom in Jirásek Gardens, where cherry blossoms, tulips, and other spring flowers create a colorful display.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring is the perfect time to enjoy the gardens as they come alive with new growth and blooming flowers.",
                "booking_tips": "Bring a picnic and enjoy the peaceful atmosphere away from the city center."
            },
            {
                "name": "University Cultural Festival",
                "type": "Cultural Event",
                "description": "Attend the annual University Cultural Festival featuring student performances, art exhibitions, and academic events throughout the university district.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring marks the end of the academic year with vibrant cultural celebrations.",
                "booking_tips": "Check the university calendar for specific event schedules and locations."
            },
            {
                "name": "East Bohemian Museum Spring Exhibitions",
                "type": "Museum",
                "description": "Explore special spring exhibitions at the East Bohemian Museum, featuring local history, archaeology, and rotating cultural displays.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring exhibitions often focus on local traditions and seasonal themes.",
                "booking_tips": "Visit on weekdays for a quieter experience and check for guided tours."
            },
            {
                "name": "White Tower Spring Views",
                "type": "Historic Site",
                "description": "Climb the White Tower for panoramic spring views of the city and surrounding countryside, with the landscape coming alive with new growth.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers clear views and comfortable temperatures for the 233-step climb.",
                "booking_tips": "Visit early morning for the best lighting and fewer crowds."
            },
            {
                "name": "Local Beer Garden Opening",
                "type": "Food & Drink",
                "description": "Enjoy the opening of outdoor beer gardens throughout the city, serving local Czech beers and traditional pub food.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Spring evenings are perfect for outdoor beer garden experiences with mild temperatures.",
                "booking_tips": "Try local craft beers and traditional Czech pub snacks."
            },
            {
                "name": "Spring Walking Tours",
                "type": "Walking Tour",
                "description": "Join guided walking tours of the historic center, learning about the city's rich history while enjoying the pleasant spring weather.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring weather is ideal for walking tours with comfortable temperatures and blooming gardens.",
                "booking_tips": "Book tours in advance and wear comfortable walking shoes."
            },
            {
                "name": "Student Art Exhibitions",
                "type": "Art Gallery",
                "description": "Visit student art exhibitions at the university and local galleries, showcasing emerging talent and contemporary Czech art.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring showcases student work and new artistic developments in the city.",
                "booking_tips": "Check university and gallery websites for exhibition schedules and opening hours."
            },
            {
                "name": "Spring Market Shopping",
                "type": "Market",
                "description": "Explore the Great Square market for fresh spring produce, local crafts, and seasonal specialties from East Bohemia.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature fresh local produce and traditional Czech goods.",
                "booking_tips": "Visit early for the best selection of fresh produce and local specialties."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Hradec Kralove Summer Festival",
                "type": "Music Festival",
                "description": "Experience the annual summer music festival featuring classical concerts, jazz performances, and cultural events throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor concerts and cultural performances.",
                "booking_tips": "Purchase tickets in advance for popular performances and check the festival schedule."
            },
            {
                "name": "Outdoor Beer Gardens",
                "type": "Food & Drink",
                "description": "Enjoy traditional Czech beer in beautiful outdoor beer gardens throughout the city, with local brews and pub food.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer is the peak season for outdoor beer garden experiences with warm evenings.",
                "booking_tips": "Try local craft beers and traditional Czech pub snacks like pickled cheese."
            },
            {
                "name": "Jirásek Gardens Summer Concerts",
                "type": "Concert",
                "description": "Attend open-air concerts in the beautiful Jirásek Gardens, featuring local musicians and classical performances.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings provide the perfect setting for outdoor musical performances.",
                "booking_tips": "Bring a blanket or chair and arrive early to secure a good spot."
            },
            {
                "name": "City Center Walking Tours",
                "type": "Walking Tour",
                "description": "Explore the historic city center on guided walking tours, learning about the city's architecture and history in pleasant summer weather.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers long daylight hours perfect for comprehensive city exploration.",
                "booking_tips": "Book tours in advance and wear comfortable walking shoes and sun protection."
            },
            {
                "name": "Local Craft Beer Tasting",
                "type": "Food & Drink",
                "description": "Sample local craft beers from East Bohemian breweries at various pubs and beer gardens throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer is ideal for beer tasting with refreshing local brews and outdoor seating.",
                "booking_tips": "Visit multiple pubs to compare different local craft beers and traditional Czech lagers."
            },
            {
                "name": "University Campus Tours",
                "type": "Educational Tour",
                "description": "Explore the modern university campus and its beautiful architecture, learning about the city's academic heritage.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer offers pleasant weather for campus exploration with fewer students present.",
                "booking_tips": "Contact the university for guided tours or explore independently during summer break."
            },
            {
                "name": "East Bohemian Museum Special Exhibitions",
                "type": "Museum",
                "description": "Visit special summer exhibitions at the East Bohemian Museum, featuring local history and cultural displays.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Summer exhibitions often focus on local traditions and seasonal themes.",
                "booking_tips": "Check for special summer programs and guided tours."
            },
            {
                "name": "Great Square Evening Markets",
                "type": "Market",
                "description": "Experience evening markets in the Great Square, featuring local crafts, food stalls, and live entertainment.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings create a vibrant atmosphere for market shopping and socializing.",
                "booking_tips": "Visit on weekends for the most lively atmosphere and entertainment."
            },
            {
                "name": "Cultural District Art Walks",
                "type": "Art Gallery",
                "description": "Explore the cultural district's galleries and art spaces, featuring contemporary Czech art and rotating exhibitions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer offers extended gallery hours and special art events.",
                "booking_tips": "Check gallery websites for current exhibitions and special events."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Autumn Foliage in Jirásek Gardens",
                "type": "Park",
                "description": "Experience the beautiful autumn colors in Jirásek Gardens, with golden leaves creating a picturesque setting for peaceful walks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers stunning fall colors and comfortable temperatures for outdoor activities.",
                "booking_tips": "Visit in the afternoon for the best lighting for photography of the autumn foliage."
            },
            {
                "name": "Hradec Kralove Autumn Festival",
                "type": "Cultural Event",
                "description": "Attend the annual autumn festival featuring traditional Czech music, dance performances, and cultural celebrations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Autumn festivals celebrate Czech culture and traditions with seasonal themes.",
                "booking_tips": "Check the festival schedule for specific events and performances."
            },
            {
                "name": "East Bohemian Museum Autumn Exhibitions",
                "type": "Museum",
                "description": "Explore autumn-themed exhibitions at the East Bohemian Museum, featuring local history and seasonal cultural displays.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn exhibitions often focus on harvest traditions and local history.",
                "booking_tips": "Visit on weekdays for a quieter experience and check for special autumn programs."
            },
            {
                "name": "Traditional Czech Cooking Classes",
                "type": "Workshop",
                "description": "Learn to cook traditional Czech autumn dishes like goulash, svíčková, and seasonal pastries with local ingredients.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn provides a bounty of local ingredients for traditional Czech cooking.",
                "booking_tips": "Book classes in advance, especially for popular traditional cooking workshops."
            },
            {
                "name": "University Cultural Events",
                "type": "Cultural Event",
                "description": "Attend university cultural events and performances, featuring student talent and academic celebrations.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Autumn marks the beginning of the academic year with cultural events and performances.",
                "booking_tips": "Check the university calendar for specific events and performance schedules."
            },
            {
                "name": "Local Wine Tasting",
                "type": "Food & Drink",
                "description": "Sample local wines from the nearby Moravian region at wine bars and restaurants throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, making it an ideal time for wine tasting and appreciation.",
                "booking_tips": "Visit wine bars in the evening and ask for recommendations of local Moravian wines."
            },
            {
                "name": "Historic Walking Tours",
                "type": "Walking Tour",
                "description": "Join guided walking tours of the historic center, learning about the city's rich history in pleasant autumn weather.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers comfortable temperatures and beautiful scenery for walking tours.",
                "booking_tips": "Book tours in advance and wear comfortable walking shoes for autumn weather."
            },
            {
                "name": "Autumn Market Shopping",
                "type": "Market",
                "description": "Explore the Great Square market for autumn produce, local crafts, and seasonal specialties from East Bohemia.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn markets feature harvest produce and traditional Czech goods.",
                "booking_tips": "Visit early for the best selection of fresh autumn produce and local specialties."
            },
            {
                "name": "Klicper Theatre Performances",
                "type": "Theater",
                "description": "Attend performances at the historic Klicper Theatre, featuring drama, opera, and ballet in a beautiful historic venue.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn evenings are perfect for indoor cultural performances and theater experiences.",
                "booking_tips": "Book tickets in advance for popular performances and check the theater schedule."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets at Great Square",
                "type": "Market",
                "description": "Experience magical Christmas markets in the Great Square, featuring traditional Czech crafts, mulled wine, and festive decorations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter Christmas markets create a magical atmosphere with festive lights and traditional Czech treats.",
                "booking_tips": "Visit in the evening for the best atmosphere and to see the festive lights and decorations."
            },
            {
                "name": "White Tower Winter Views",
                "type": "Historic Site",
                "description": "Climb the White Tower for panoramic winter views of the snow-covered city and surrounding countryside.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Winter offers unique snowy views and fewer crowds for the tower climb.",
                "booking_tips": "Dress warmly for the climb and visit early for the best winter lighting."
            },
            {
                "name": "East Bohemian Museum Winter Exhibitions",
                "type": "Museum",
                "description": "Explore winter-themed exhibitions at the East Bohemian Museum, featuring local history and seasonal cultural displays.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter exhibitions often focus on local traditions and seasonal themes.",
                "booking_tips": "Visit on weekdays for a quieter experience and check for special winter programs."
            },
            {
                "name": "Traditional Czech Christmas Dinner",
                "type": "Dining",
                "description": "Enjoy traditional Czech Christmas dinner at local restaurants, featuring dishes like carp, potato salad, and Christmas cookies.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect time to experience traditional Czech Christmas cuisine and customs.",
                "booking_tips": "Reserve tables in advance for Christmas dinner, especially on Christmas Eve and Christmas Day."
            },
            {
                "name": "Klicper Theatre Christmas Performances",
                "type": "Theater",
                "description": "Attend special Christmas performances at the historic Klicper Theatre, featuring traditional Czech plays and seasonal entertainment.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter evenings are perfect for indoor cultural performances and Christmas entertainment.",
                "booking_tips": "Book tickets well in advance for popular Christmas performances and special events."
            },
            {
                "name": "Hot Chocolate at Local Cafés",
                "type": "Café",
                "description": "Warm up with traditional Czech hot chocolate and pastries at local cafés throughout the city.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is the perfect season for enjoying warm beverages and traditional Czech pastries.",
                "booking_tips": "Visit cafés during off-peak times to avoid crowds, especially on weekends."
            },
            {
                "name": "Indoor Art Gallery Visits",
                "type": "Art Gallery",
                "description": "Explore local art galleries and the Galerie moderního umění, featuring contemporary Czech art and rotating exhibitions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter offers a cozy retreat for indoor art appreciation and cultural enrichment.",
                "booking_tips": "Check gallery websites for current exhibitions and special winter events."
            },
            {
                "name": "Traditional Czech Beer Tasting",
                "type": "Food & Drink",
                "description": "Sample traditional Czech beers and seasonal brews at local pubs and beer halls throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter is ideal for cozy pub experiences with traditional Czech beer and hearty pub food.",
                "booking_tips": "Visit multiple pubs to compare different Czech beers and try seasonal winter brews."
            },
            {
                "name": "New Year's Eve Celebrations",
                "type": "Festival",
                "description": "Celebrate New Year's Eve in the Great Square with fireworks, live music, and festive celebrations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter New Year's celebrations create a magical atmosphere with fireworks and festive events.",
                "booking_tips": "Arrive early to secure a good spot for fireworks and dress warmly for outdoor celebrations."
            }
        ]
    }
} 