{
    "sites": [
        {
            "name": "White Tower",
            "type": "Tower",
            "description": "The iconic 72-meter high White Tower is the symbol of Hradec Kralove and the tallest building in the city. Built in the 16th century as a bell tower, it offers panoramic views of the city and surrounding countryside. The tower houses the city's largest bell, Augustin, and features an exhibition about the tower's history.",
            "indoor": false,
            "best_time": "Morning/Afternoon",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round; beautiful views in all seasons. Summer offers longer opening hours.",
            "booking_tips": "Tickets available at the entrance. Climbing the 233 steps is required - not suitable for those with mobility issues.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Holy Spirit Cathedral",
            "type": "Cathedral",
            "description": "A magnificent Gothic cathedral dating from the 14th century, featuring stunning architecture and beautiful stained glass windows. The cathedral is the seat of the Hradec Kralove diocese and contains valuable religious artifacts and artwork.",
            "indoor": true,
            "best_time": "Morning/Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open year-round for services and visitors. Christmas and Easter services are particularly atmospheric.",
            "booking_tips": "Free entry. Check service times before visiting. Photography may be restricted during services.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 50.2097,
            "longitude": 15.8328
        },
        {
            "name": "Great Square (Velké náměstí)",
            "type": "Square",
            "description": "The historic heart of Hradec Kralove, featuring beautiful Renaissance and Baroque architecture. The square is surrounded by colorful historic buildings and is the site of the city's main market and cultural events throughout the year.",
            "indoor": false,
            "best_time": "Any time",
            "price_range": "Free",
            "seasonal_notes": "Christmas markets in winter; outdoor cafes and events in summer. Beautiful architecture visible year-round.",
            "booking_tips": "No booking required. Visit early morning for photos without crowds.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "East Bohemian Museum",
            "type": "Museum",
            "description": "Comprehensive museum showcasing the history and culture of East Bohemia. Features archaeological finds, historical artifacts, and rotating exhibitions about the region's rich heritage from prehistoric times to the present.",
            "indoor": true,
            "best_time": "Any time",
            "price_range": "Budget",
            "seasonal_notes": "Perfect for rainy days. Special exhibitions change seasonally.",
            "booking_tips": "Tickets available at entrance. Student discounts available. Check website for current exhibitions.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Galerie moderního umění",
            "type": "Museum",
            "description": "Gallery of Modern Art featuring contemporary Czech and international artwork. The gallery hosts temporary exhibitions and has a permanent collection of 20th and 21st century art, including works by prominent Czech artists.",
            "indoor": true,
            "best_time": "Any time",
            "price_range": "Budget",
            "seasonal_notes": "Indoor attraction perfect for any weather. Exhibition schedule varies throughout the year.",
            "booking_tips": "Check website for current exhibitions. Student discounts available.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Jirásek Gardens",
            "type": "Park",
            "description": "Beautiful public gardens named after Czech writer Alois Jirásek. The gardens feature walking paths, flower beds, and a peaceful atmosphere perfect for relaxation. Popular spot for locals and visitors alike.",
            "indoor": false,
            "best_time": "Morning/Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Most beautiful in spring and summer when flowers are in bloom. Autumn offers colorful foliage.",
            "booking_tips": "No booking required. Perfect for a peaceful stroll or picnic.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Klicper Theatre",
            "type": "Theater",
            "description": "Historic theater building dating from the 19th century, named after Czech playwright Václav Kliment Klicpera. The theater hosts performances of drama, opera, and ballet, and is an important cultural venue in the city.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Performance schedule varies throughout the year. Book tickets in advance for popular shows.",
            "booking_tips": "Tickets available online or at box office. Check performance schedule in advance.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Orlické Mountains Viewpoint",
            "type": "Viewpoint",
            "description": "Scenic viewpoint offering panoramic views of the Orlické Mountains and the surrounding countryside. Located on the outskirts of the city, it's a popular spot for photography and enjoying the natural beauty of the region.",
            "indoor": false,
            "best_time": "Sunrise/Sunset",
            "price_range": "Free",
            "seasonal_notes": "Best views on clear days. Beautiful in all seasons, especially autumn when mountains are colorful.",
            "booking_tips": "No booking required. Accessible by car or hiking trails.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Brewery Museum",
            "type": "Museum",
            "description": "Interactive museum showcasing the history of brewing in the region. Features historical brewing equipment, exhibits on beer production, and tastings of local craft beers. Learn about the traditional brewing methods and modern craft beer scene.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Indoor attraction perfect for any weather. Beer tastings available year-round.",
            "booking_tips": "Book guided tours in advance. Tasting sessions require separate tickets.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        },
        {
            "name": "Adalbertinum",
            "type": "Cultural Center",
            "description": "Historic cultural center housed in a beautiful Art Nouveau building. Hosts concerts, exhibitions, and cultural events throughout the year. The building itself is an architectural gem worth admiring.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Varies",
            "seasonal_notes": "Event schedule varies throughout the year. Check calendar for current offerings.",
            "booking_tips": "Tickets for events available online or at box office. Building tours available by appointment.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 50.2094,
            "longitude": 15.8325
        }
    ]
} 