{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Dia de Ano Novo)",
          "notes": "New Year's Day is a public holiday throughout Portugal. Most attractions, shops, and restaurants in Porto are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. Most museums and attractions typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout Porto, particularly on Santa Catarina shopping street, Rua de Cedofeita, and in shopping centers like NorteShopping. Christmas decorations gradually come down. The city's traditional tascas and cafés offer warm refuge from winter weather."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is the off-season with fewer tourists and excellent hotel value. Mild but frequently rainy winter weather. Limited daylight hours. Winter sales continue throughout January in the main shopping districts. Porto's wine cellars in Vila Nova de Gaia offer excellent indoor experiences during this quiet season. Casa da Música and Serralves Museum provide cultural respite from winter conditions."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 5,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Winter conditions continue but with occasional clear, crisp days. Tourism remains low, making it an excellent time to explore Porto's museums and wine cellars without crowds. The historic Livraria Lello bookstore and Majestic Café are particularly atmospheric during this quiet season."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "Carnival (Carnaval)",
          "notes": "While Porto's Carnival is less elaborate than in other Portuguese cities, the days leading up to Carnival Tuesday feature parades and festivities, particularly in downtown areas. Some locals travel to nearby towns like Ovar for larger celebrations. Restaurants and cafés serve traditional Carnival sweets like sonhos and malassadas."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Late February brings hints of spring to Porto with camellia blooms appearing in Crystal Palace Gardens and other city parks. Evening events at Casa da Música offer cultural entertainment during the cooler season. The city's famous port wine lodges provide cozy tasting experiences that are less crowded than during high season."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 6,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. The city's gardens like Crystal Palace Gardens and Serralves Park begin to bloom with camellias and magnolias. Porto's famous miradouros (viewpoints) like Serra do Pilar become more pleasant for sunset viewing. The cultural calendar becomes more active with various events across the city."
        },
        {
          "days": [17, 18, 19],
          "score": 4,
          "special": true,
          "event": "Feast of St. Joseph (Dia de São José)",
          "notes": "The Feast of St. Joseph on March 19 is celebrated particularly in Porto's traditional neighborhoods. While not a national holiday, it's a cultural celebration with special bread and sweets available at local bakeries. Foz do Douro district may host small processions related to this day."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Início da Primavera)",
          "notes": "Spring officially begins, bringing blooms to Crystal Palace Gardens and Serralves Park. Perfect time for exploring Ribeira and Foz do Douro as café life begins to move outdoors on warmer days. Easter markets appear in late March if Easter falls then. River cruises on the Douro begin to operate more regularly."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 7,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Páscoa)",
          "notes": "Easter celebrations typically fall in April, with Good Friday and Easter Sunday as significant days. Porto Cathedral hosts important religious ceremonies, and special Easter markets operate in the city center. Spring blooms peak throughout the city's parks and along the Douro River. Outdoor cafés in Ribeira and Foz become increasingly popular."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Freedom Day (Dia da Liberdade)",
          "notes": "April 25th is a national holiday commemorating the 1974 Carnation Revolution that ended the Estado Novo dictatorship. Celebrations and parades take place along Avenida dos Aliados, and political speeches are given in prominent squares. Museums and cultural institutions often offer special exhibitions related to Portuguese democracy and freedom."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Mid-to-late April brings reliable spring weather to Porto. Perfect time for exploring the city's historic neighborhoods, wine cellars, and green spaces like City Park. The Soares dos Reis National Museum and Serralves Museum offer excellent cultural experiences. Douro River cruises operate regularly as weather improves. The Bolhão Market and other food markets become especially vibrant with seasonal local produce."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 9,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Dia do Trabalhador)",
          "notes": "May Day is a national holiday in Portugal. Many businesses are closed, but museums and cultural attractions remain open. Traditional labor celebrations may take place in major squares. Workers' organizations traditionally gather in the Praça da Liberdade for speeches, music, and food."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "May brings perfect spring weather with longer days (approximately 14 hours of daylight). The outdoor café scene in Ribeira and Foz do Douro is in full swing. The riverside areas become popular evening spots for locals and visitors alike. Tourism begins to increase but the city isn't yet at peak season crowds."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "Serralves em Festa preparations",
          "notes": "Late May sees preparations for Serralves em Festa, the largest contemporary arts festival in Portugal, which typically begins in late May or early June. The Serralves Foundation grounds and contemporary art museum become especially active. The festival offers 40 consecutive hours of free artistic activities across multiple disciplines."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "NOS Primavera Sound",
          "notes": "Early June typically features the NOS Primavera Sound music festival in Porto's City Park, bringing international music acts to the city. The festival attracts music lovers from across Europe and beyond. Early summer brings warm weather and extended daylight hours to Porto. Tourism increases but the city remains less crowded than July and August."
        },
        {
          "days": [23, 24],
          "score": 5,
          "special": true,
          "event": "São João Festival (Festa de São João)",
          "notes": "The night of June 23-24 is Porto's biggest annual celebration, the São João Festival. The entire city becomes a massive street party with outdoor grills serving sardines, live music, and the unique tradition of hitting strangers lightly on the head with plastic hammers or leeks. Spectacular midnight fireworks over the Douro River mark the highlight of the festival. This is arguably the most important date in Porto's cultural calendar."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late June sees increasing temperatures following the São João festivities. The summer tourism season begins to pick up. Douro River activities increase, with sailing tours and sunset cruises becoming regular offerings. Perfect time for exploring both the city and daytrips to the Douro Valley wine region, Guimarães, and Braga."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 14,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "MEO Marés Vivas Festival",
          "notes": "July features the MEO Marés Vivas music festival in Vila Nova de Gaia, attracting major international and Portuguese artists. High summer with warmer temperatures and long daylight hours. Tourism increases significantly as European summer holidays begin. Excellent time for visits to nearby beaches like Matosinhos and Espinho. The Douro Valley becomes particularly busy but remains a must-visit day trip. The city's outdoor dining scene is at its most vibrant in Ribeira and Cais de Gaia across the river. FC Porto's museum and stadium tours attract football fans during the off-season."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 15,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Assumption Day (Assunção de Nossa Senhora)",
          "notes": "August 15th is a national holiday celebrating the Assumption of Mary. Religious processions may take place in certain neighborhoods, particularly around Porto Cathedral. Many Porto locals leave the city for their own holidays in August, giving parts of the city a quieter feel despite high tourist numbers. Some small family-run restaurants may close for summer holidays."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Peak summer with warm temperatures, occasionally exceeding 30°C (86°F). High tourism season with visitors from around the world. Clerigos Tower and the port wine lodges of Vila Nova de Gaia are particularly popular attractions. The Bolhão Market bustles with food offerings. Beach areas like Foz and Matosinhos become crowded, especially on weekends. Many locals are away on vacation, especially in the first two weeks, giving the city a more tourist-oriented atmosphere."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 15,
      "tourismLevel": 9
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "notes": "Perfect late summer weather for outdoor activities and exploring the city without the peak season crowds. Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather but fewer crowds. The University of Porto welcomes back students, bringing a renewed energy to the city. Riverside walks along the Douro remain popular in the mild weather."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Douro Valley Harvest & Porto Design Biennale",
          "notes": "September is harvest season in the nearby Douro Valley wine region, with special tours available to witness the grape harvest and traditional wine production methods. In biennale years, the Porto Design Biennale brings exhibitions and events focused on design to various venues across the city. The main tourist sites become more accessible with shorter queues. Perfect weather for exploring Porto's historic center and taking river cruises."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 14,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4],
          "score": 5,
          "special": true,
          "event": "Republic Day (Implantação da República)",
          "notes": "October 5th is a national holiday commemorating the overthrow of the monarchy and establishment of the Portuguese Republic in 1910. Official ceremonies take place at city hall and other governmental buildings. Many museums and cultural sites remain open but with holiday schedules."
        },
        {
          "days": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Porto/Post/Doc Film Festival",
          "notes": "October often features the Porto/Post/Doc film festival, showcasing documentary and experimental cinema from around the world at venues like Teatro Rivoli and Passos Manuel. Autumn weather brings cooler temperatures to Porto, but remains pleasant for city exploration. Perfect time for visiting both indoor and outdoor attractions like the Clerigos Tower, Porto Cathedral, and Crystal Palace Gardens. The university areas show beautiful autumn colors. Good month for experiencing Porto's diverse culinary scene and port wine tastings in Vila Nova de Gaia."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "Halloween (Dia das Bruxas)",
          "notes": "While not a traditional Portuguese celebration, Halloween has gained popularity in recent years, especially among younger people. Some bars and clubs in Baixa and Ribeira host Halloween-themed parties. Shopping centers and some restaurants may have Halloween decorations or special events."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 6
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "All Saints' Day (Dia de Todos os Santos)",
          "notes": "November 1st is a national holiday when Portuguese families traditionally visit cemeteries to honor deceased relatives. Some businesses may be closed, but many tourist attractions remain open. Traditional sweets associated with this time include Bolo Rei (King Cake), which begins appearing in bakeries."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "notes": "Full autumn with cooler, frequently rainy weather. Excellent time for museum visits and indoor cultural activities. The Bolhão Market and other food markets become particularly appealing with seasonal produce on weekends. Traditional tascas with hearty Portuguese dishes like Tripas à Moda do Porto (tripe stew) offer cozy retreats from the weather. Port wine cellar tours in Vila Nova de Gaia provide authentic indoor entertainment during this quieter tourism period. Porto's famous coffee houses like Majestic Café and Café Guarany become especially inviting during cooler weather."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Christmas Season Begins",
          "notes": "Porto's Christmas celebrations begin in late November with the lighting of the city's Christmas lights. The main Christmas tree is usually placed in Avenida dos Aliados. Christmas markets open in various locations including Praça da Liberdade, featuring craft stalls, food vendors, and seasonal activities. Christmas shopping begins in earnest on Santa Catarina, Rua de Cedofeita, and in the city's shopping centers like NorteShopping and El Corte Inglés."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 8,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "special": true,
          "event": "Constitution Day & Immaculate Conception (Dia da Constituição & Imaculada Conceição)",
          "notes": "December 1st (Constitution Day) and December 8th (Immaculate Conception) are public holidays. The December 8th holiday traditionally marks the beginning of the Christmas season for many Portuguese families, when Christmas trees and Nativity scenes are set up in homes. Christmas markets and festivities are in full swing by this time."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Porto Christmas Village",
          "notes": "The Porto Christmas Village runs throughout December. Avenida dos Aliados hosts festive market stalls, Santa's Grotto, and seasonal activities. The city center is beautifully decorated with Christmas lights. Santa Catarina shopping street and Baixa are bustling with Christmas shoppers. Casa da Música and Teatro Nacional São João offer seasonal performances and Christmas concerts. The Clérigos Tower and Church feature special Christmas illuminations."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Véspera de Natal)",
          "notes": "Christmas Eve is the main celebration day for most Portuguese families. Most businesses close by early afternoon. The Christmas Markets end. Porto Cathedral and other churches hold special Midnight Mass services. Restaurants that remain open often require advance reservations for special Christmas Eve dinners, which traditionally feature bacalhau (salt cod) and other fish dishes."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Day & St. Stephen's Day",
          "notes": "December 25 (Christmas Day) is a public holiday. Most businesses, restaurants, and attractions are closed or operate with limited hours. December 26 is not a public holiday in Portugal, unlike in some other European countries, so many businesses reopen. Traditional Christmas lunch often features roast turkey or goat with Portuguese stuffing."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year is typically busy with both Portuguese and international visitors. Major museums and attractions are open. Good time for winter sales shopping along Santa Catarina and Rua de Cedofeita. Port wine lodges continue tours and tastings, providing a welcome indoor activity during the cooler weather."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "New Year's Eve (Véspera de Ano Novo)",
          "notes": "New Year's Eve celebrations center around Avenida dos Aliados with midnight countdown events and fireworks over the Douro River. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), and hotels host celebration events. Bars and clubs throughout Baixa and Ribeira offer special New Year's parties. The riverside provides a spectacular backdrop for fireworks displays, with many people gathering along the Ribeira district and on Dom Luís I Bridge."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 7,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Crystal Palace Gardens Spring Blooms (March through May)",
      "Serralves em Festa Cultural Festival (Late May/Early June)",
      "April 25th Freedom Day Celebrations",
      "Porto Wine Tours & Tastings",
      "Clerigos Tower & Church Historical Tours",
      "Douro Valley Day Trips (less crowded than summer)",
      "NOS Primavera Sound Music Festival (June)",
      "Outdoor café culture begins in Ribeira and Foz do Douro"
    ],
    "summer": [
      "São João Festival (June 23-24)",
      "MEO Marés Vivas Music Festival (July)",
      "Douro River Cruises",
      "Porto Beaches (Matosinhos and Foz)",
      "Guimarães and Braga Day Trips",
      "Evening walks along the riverside in Ribeira",
      "Outdoor dining in Ribeira and Gaia's riverside restaurants",
      "FC Porto stadium tours and museum"
    ],
    "autumn": [
      "Porto/Post/Doc Film Festival (October/November)",
      "Douro Valley Harvest Tours (September/October)",
      "Wine tasting events throughout Vila Nova de Gaia",
      "Autumn Colors at Crystal Palace Gardens",
      "Porto Design Biennale (biennale years)",
      "Porto Marathon (typically November)",
      "Surfing at nearby beaches (autumn swells)",
      "FC Porto football matches at Estádio do Dragão"
    ],
    "winter": [
      "Porto Christmas Village (late November to December 23)",
      "Christmas lights throughout Avenida dos Aliados and downtown",
      "New Year's Eve Celebration in Avenida dos Aliados",
      "Winter Shopping on Santa Catarina and Rua de Cedofeita",
      "Port Wine Cellar Tours in Vila Nova de Gaia",
      "Cozy café culture in historic establishments like Majestic Café",
      "Warming up with Francesinha (Porto's signature sandwich)",
      "Casa da Música winter concerts and performances"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or cool, wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}