{
    "Spring": {
        "activities": [
            {
                "name": "Serralves em Festa",
                "type": "Cultural Festival",
                "description": "Annual 40-hour non-stop cultural festival held at Serralves Foundation featuring hundreds of activities including music, dance, theater, circus, and visual arts performances.",
                "indoor": false,
                "best_time": "Varies (Check program)",
                "price_range": "Free",
                "seasonal_notes": "Usually held in late May/early June, taking advantage of the pleasant spring weather to utilize the beautiful Serralves gardens.",
                "booking_tips": "No booking needed for most activities, but arrive early for popular performances as venues can fill up quickly."
            },
            {
                "name": "Porto Wine Fest",
                "type": "Food & Wine Festival",
                "description": "Celebration of Porto's wine culture focusing on Port wine and the Douro region, featuring tastings, workshops, and presentations by winemakers.",
                "indoor": true,
                "best_time": "Afternoon/Evening",
                "price_range": "Moderate (Entry + Tastings)",
                "seasonal_notes": "Typically held in May, showcasing new vintages and wine innovations.",
                "booking_tips": "Purchase tickets online in advance. Special masterclasses require separate booking and fill quickly."
            },
            {
                "name": "Indie Music Fest",
                "type": "Music Festival",
                "description": "Alternative music festival featuring independent Portuguese and international artists across various venues in the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget-Moderate (Per show/Pass)",
                "seasonal_notes": "Usually takes place in April/May.",
                "booking_tips": "Check the festival website for venue details and purchase passes or individual show tickets in advance."
            },
            {
                "name": "Holy Week Processions in Porto",
                "type": "Religious/Cultural Event",
                "description": "Traditional processions through Porto's historic streets, especially around the Cathedral and downtown area.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Week before Easter, offering a glimpse into centuries-old traditions.",
                "booking_tips": "Be respectful during the processions. The Cathedral area offers good viewing spots."
            },
            {
                "name": "Explore Crystal Palace Gardens",
                "type": "Park/Nature",
                "description": "Wander through Porto's romantic gardens with themed areas, peacocks, and panoramic views of the Douro River, particularly beautiful during spring blooming season.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings magnificent blooms, particularly camellias, for which Porto is famous.",
                "booking_tips": "No booking required. Combine with a visit to the nearby Romantic Museum of Quinta da Macieirinha."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "São João Festival",
                "type": "Cultural Festival/Street Party",
                "description": "Porto's biggest annual celebration honoring St. John the Baptist, featuring street parties, concerts, grilled sardines, sky lanterns, and the tradition of hitting others lightly on the head with plastic hammers or leeks.",
                "indoor": false,
                "best_time": "Evening/Night (Peaks June 23-24)",
                "price_range": "Free (Street parties) / Varies (Food & Drink)",
                "seasonal_notes": "The highlight of Porto's summer, culminating in massive fireworks over the Douro River at midnight on June 23rd.",
                "booking_tips": "No booking needed, but downtown and Ribeira get extremely crowded. Stay near Ribeira or Gaia riverside for the best fireworks views."
            },
            {
                "name": "NOS Primavera Sound",
                "type": "Music Festival",
                "description": "Major international music festival featuring alternative, rock, electronic, and indie artists in the scenic Parque da Cidade (City Park) near the Atlantic.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Typically held in early June, taking advantage of Porto's summer evenings.",
                "booking_tips": "Buy tickets well in advance as they sell out quickly. Consider the 3-day pass for better value."
            },
            {
                "name": "MEO Marés Vivas",
                "type": "Music Festival",
                "description": "Large-scale music festival held in Vila Nova de Gaia (across the river from Porto) featuring international and Portuguese artists across multiple genres.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Usually held in July with a diverse lineup.",
                "booking_tips": "Purchase tickets early. The venue in Gaia is accessible by public transport from Porto."
            },
            {
                "name": "Douro River Cruises",
                "type": "Leisure/Sightseeing",
                "description": "Take advantage of summer weather for river cruises ranging from 1-hour 'Six Bridges' tours to full-day excursions into the stunning Douro Valley wine region.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "Summer offers ideal conditions for river cruising with calm waters and beautiful weather.",
                "booking_tips": "Book cruises a few days in advance during peak season. Full-day Douro Valley cruises are popular and often sell out."
            },
            {
                "name": "Beach Day at Matosinhos or Foz",
                "type": "Beach/Leisure",
                "description": "Enjoy Porto's nearest beaches either at Matosinhos (larger, popular with surfers) or the smaller beaches around Foz do Douro where the river meets the Atlantic.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Beach access) / Budget (Transport)",
                "seasonal_notes": "Summer temperatures make beach days pleasant, though Atlantic waters remain relatively cool.",
                "booking_tips": "Easily accessible via bus, metro (Matosinhos), or historic tram (Foz). Weekends get crowded; weekdays offer more space."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Porto Fashion Week",
                "type": "Fashion Event",
                "description": "Showcases collections from Portuguese designers with runway shows and industry events at various venues around the city.",
                "indoor": true,
                "best_time": "Varies (Check schedule)",
                "price_range": "Varies (Some public events, some invite-only)",
                "seasonal_notes": "Usually held in October, following the international fashion calendar.",
                "booking_tips": "Check the official website for public events and ticket availability."
            },
            {
                "name": "Porto/Post/Doc Film Festival",
                "type": "Film Festival",
                "description": "Documentary and experimental film festival screening international works across various theaters in Porto.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget (Per screening/Pass)",
                "seasonal_notes": "Typically held in November/December.",
                "booking_tips": "Review the program online and purchase tickets for specific screenings or consider a festival pass."
            },
            {
                "name": "Douro Valley Harvest Tours",
                "type": "Food & Wine/Cultural Experience",
                "description": "Special tours to the Douro Valley wine region during harvest season, sometimes including opportunities to participate in grape picking and traditional foot treading of grapes.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Expensive",
                "seasonal_notes": "September/October is harvest season, when the Douro Valley is at its most vibrant.",
                "booking_tips": "Book well in advance as harvest experiences are popular. Tours depart from Porto to various quintas (wine estates)."
            },
            {
                "name": "Enjoying Castanhas Assadas (Roasted Chestnuts)",
                "type": "Food/Cultural Experience",
                "description": "Sample freshly roasted chestnuts from street vendors that appear throughout the city as temperatures cool, a classic autumn tradition.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Budget",
                "seasonal_notes": "Chestnut season runs from mid-October through winter.",
                "booking_tips": "Look for vendors in busy areas like Aliados, Clérigos, or Santa Catarina shopping street."
            },
            {
                "name": "Porto Marathon",
                "type": "Sporting Event",
                "description": "International marathon race through the scenic streets of Porto and along the Douro River, with additional half-marathon and family run options.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate (Participation) / Free (Spectating)",
                "seasonal_notes": "Held in November when temperatures are ideal for long-distance running.",
                "booking_tips": "Register well in advance to participate. As a spectator, find spots along the riverside for the best views."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Porto Christmas Village",
                "type": "Market/Festival",
                "description": "Festive market in Avenida dos Aliados featuring handicrafts, food stalls, musical performances, and a large Christmas tree.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (Entry) / Varies (Purchases)",
                "seasonal_notes": "Runs throughout December, transforming Porto's main avenue into a winter wonderland.",
                "booking_tips": "No booking required. Evening visits offer the best atmosphere with the Christmas lights."
            },
            {
                "name": "New Year's Eve on the Douro",
                "type": "Celebration/Fireworks",
                "description": "Spectacular midnight fireworks display over the Douro River, best viewed from the Ribeira district, Dom Luís I Bridge, or Vila Nova de Gaia riverside.",
                "indoor": false,
                "best_time": "Late Evening (Dec 31st)",
                "price_range": "Free (Public areas) / Expensive (Restaurant packages)",
                "seasonal_notes": "Porto's main NYE celebration, often complemented by concerts in public squares.",
                "booking_tips": "Riverside restaurants offer special dinner packages but book months in advance. Public viewing areas get very crowded; arrive early."
            },
            {
                "name": "Port Wine Cellar Tours",
                "type": "Wine/Cultural Experience",
                "description": "Discover the world of port wine through guided tours and tastings in the historic cellars of Vila Nova de Gaia, an ideal indoor activity during cooler months.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "Winter offers a more relaxed experience with fewer tourists than summer months.",
                "booking_tips": "Major cellars like Taylor's, Graham's, and Sandeman offer regular tours in multiple languages. Some premium tastings require advance booking."
            },
            {
                "name": "Bolhão Market Culinary Experience",
                "type": "Food/Cultural",
                "description": "Explore Porto's recently renovated historic market, sample local specialties, and perhaps join a cooking class focusing on winter Portuguese cuisine.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free (Browsing) / Moderate (Cooking classes)",
                "seasonal_notes": "Winter brings seasonal specialties like caldo verde (kale soup) and hearty meat dishes.",
                "booking_tips": "The market is most active in mornings. Cooking classes should be booked several days in advance."
            },
            {
                "name": "Warming Up with Francesinha",
                "type": "Food/Cultural Experience",
                "description": "Savor Porto's iconic sandwich - layers of meat covered with melted cheese and a spicy tomato-beer sauce - perfect for cold winter days.",
                "indoor": true,
                "best_time": "Lunch/Dinner",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This hearty dish is particularly satisfying during winter months.",
                "booking_tips": "Try renowned spots like Café Santiago, Brasão, or Yuko, which may require waiting during peak hours."
            }
        ]
    }
}