{
    "July": {
        "reasons_to_visit": [
            {
                "reason": "Warmest Summer Weather & Long Days",
                "details": "July typically offers Cork's best chance of warm, sunny weather (average highs 19-21°C) and very long daylight hours (sunset after 9:30 PM), perfect for extensive exploration."
            },
            {
                "reason": "Cork City Marathon (Usually June, sometimes early July)",
                "details": "Check dates - if the marathon falls in early July, the city buzzes with participants and supporters, creating a vibrant atmosphere (and road closures!)."
            },
            {
                "reason": "Outdoor Festivals & Events",
                "details": "July often sees major outdoor events like the 'Live at the Marquee' concert series concluding, plus potential street performance festivals or events in Fitzgerald's Park. Check local listings."
            },
            {
                "reason": "Ideal for Coastal Day Trips",
                "details": "The pleasant weather makes July perfect for exploring the stunning West Cork coastline, visiting towns like Kinsale, Clonakilty, or Schull, and enjoying beaches or boat trips."
            },
            {
                "reason": "Lively Pub Gardens & Outdoor Dining",
                "details": "Make the most of the summer weather by enjoying drinks in pub gardens or dining outdoors at Cork's many restaurants and cafes with sidewalk seating."
            },
            {
                "reason": "Kayaking & Water Activities",
                "details": "Enjoy kayaking tours on the River Lee through the city centre or explore coastal kayaking opportunities in nearby areas like Kinsale or Lough Hyne."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Peak Tourist Season Crowds & Prices",
                "details": "July is the absolute peak of the tourist season. Expect significant crowds at Blarney Castle, the English Market, and popular coastal towns. Accommodation prices are at their highest; booking far in advance is essential."
            },
            {
                "reason": "'Soft Days' Still Possible",
                "details": "Even in July, Irish weather is unpredictable. Be prepared for occasional rain showers or cooler, overcast days ('soft days'). Packing layers and a waterproof jacket is still wise."
            },
            {
                "reason": "Traffic & Parking Challenges",
                "details": "Driving and parking in Cork city centre and popular coastal towns like Kinsale can be challenging during peak season."
            },
            {
                "reason": "Local Summer Holidays",
                "details": "While major tourist services operate fully, some smaller local businesses might have reduced hours or close for annual holidays, especially later in July."
            }
        ],
        "first_half": {
            "date_range": "July 1–15",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "12°C"
                },
                "precipitation": "Moderate chance of showers (average rainfall 60-70mm for the month), but often interspersed with warm, sunny periods. Long daylight hours.",
                "general_tips": "Pack light summer clothing (shorts, t-shirts), but also layers like a fleece or light jacket, and definitely a waterproof jacket. Sunscreen and sunglasses are essential."
            },
            "tourism_level": {
                "crowds": "Very High. City centre, English Market, Blarney Castle, and coastal towns are busy. Expect queues.",
                "pricing": "Peak season pricing for flights and accommodation. Book well in advance.",
                "overall_atmosphere": "Vibrant, lively summer atmosphere. Lots of activity outdoors, in parks, and pub gardens. Buzzing with tourists and locals enjoying the weather."
            },
            "events_holidays": [
                {
                    "name": "Live at the Marquee (Conclusion)",
                    "date": "Often concludes early July (check annual schedule)",
                    "description": "Final concerts of the popular series held in a large marquee by the River Lee, featuring major Irish and international acts.",
                    "notes": "Requires pre-booked tickets. Check lineup and dates well in advance."
                },
                {
                    "name": "Cork City Marathon (Potential Date)",
                    "date": "Usually June Bank Holiday weekend, but check specific year",
                    "description": "If held in early July, expect road closures and a major buzz around the city.",
                    "notes": "Verify exact date if planning travel around this time."
                },
                {
                    "name": "Summer Festivals in County Cork",
                    "date": "Various weekends",
                    "description": "Check listings for smaller town festivals or regattas in coastal areas like Kinsale, Glandore, or Schull.",
                    "notes": "Requires travel outside the city centre."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Kinsale & Charles Fort",
                    "where": "Kinsale (Bus/Drive South)",
                    "description": "Visit the picturesque harbour town, known for its colourful streets, gourmet food, and the impressive 17th-century Charles Fort overlooking the sea.",
                    "practical_tips": "Allow a full day. Bus Eireann 226 runs regularly. Can be very busy; go early or on a weekday if possible.",
                    "best_time": "Full Day Trip",
                    "estimated_cost": "Budget (transport) + Food/Attractions",
                    "weather_dependent": true
                },
                {
                    "activity": "Kayak the River Lee through Cork City",
                    "where": "Departs from City Centre locations",
                    "description": "Take a guided kayaking tour along the river, seeing landmarks like St Fin Barre's Cathedral and the city quays from water level.",
                    "practical_tips": "Several tour operators available (e.g., Atlantic Sea Kayaking). Book in advance. Suitable for beginners.",
                    "best_time": "Check tour times (often afternoon/evening)",
                    "estimated_cost": "Moderate/High",
                    "weather_dependent": true
                },
                {
                    "activity": "Enjoy a Drink in a Pub Garden",
                    "where": "Various Pubs (e.g., Franciscan Well, Clancy's Rooftop)",
                    "description": "Make the most of the summer weather by enjoying a pint or a meal outdoors in one of Cork's many pub gardens or rooftop bars.",
                    "practical_tips": "Popular spots get busy on sunny evenings. Franciscan Well Brewery has a large popular garden.",
                    "best_time": "Sunny Afternoon / Evening",
                    "estimated_cost": "Budget/Moderate (drinks/food)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Fota Wildlife Park & Gardens",
                    "where": "Fota Island (Train ride)",
                    "description": "See free-roaming animals in a spacious park setting and explore the adjacent Fota House and formal gardens.",
                    "practical_tips": "Book tickets online. Allow several hours. Easily accessible by train from Cork Kent station.",
                    "best_time": "All Day",
                    "estimated_cost": "Moderate/High",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "July 16–31",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "13°C"
                },
                "precipitation": "Similar conditions, warm with potential for sunshine and showers. Long evenings perfect for late activities.",
                "general_tips": "Continue with summer attire but always have a rain jacket handy. Stay hydrated."
            },
            "tourism_level": {
                "crowds": "Peak season continues. Expect maximum crowds at all major tourist sites and popular areas.",
                "pricing": "High season pricing remains firm. Last-minute accommodation can be very difficult to find.",
                "overall_atmosphere": "Full summer holiday mode. Lively, busy, and generally optimistic weather-wise. Ideal for those who enjoy a bustling atmosphere."
            },
            "events_holidays": [
                {
                    "name": "Cork Pride Festival (Potential Start)",
                    "date": "Usually starts late July/early August",
                    "description": "Check dates - the vibrant LGBTQ+ Pride festival might begin its events towards the very end of July.",
                    "notes": "Consult the official Cork Pride website for exact dates and schedule."
                },
                {
                    "name": "Outdoor Cinema / Theatre",
                    "date": "Check listings",
                    "description": "Occasional outdoor film screenings or theatre performances might take place in parks or unique venues.",
                    "notes": "Check local event guides like Yay Cork or Cork Beo."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to West Cork (e.g., Clonakilty, Skibbereen)",
                    "where": "West Cork (requires car or limited bus service)",
                    "description": "Explore the beautiful scenery, charming towns, beaches, and artisan food producers of West Cork.",
                    "practical_tips": "Car rental offers most flexibility. Allow a full day. Research specific towns or routes (e.g., Mizen Head).",
                    "best_time": "Full Day Trip",
                    "estimated_cost": "Moderate (transport + food/activities)",
                    "weather_dependent": true
                },
                {
                    "activity": "Blarney Castle & Gardens",
                    "where": "Blarney (Bus/Drive)",
                    "description": "Visit the world-famous castle, kiss the Blarney Stone (if you dare face the queue!), and explore the extensive and varied gardens.",
                    "practical_tips": "Go as early as possible to minimize wait times for the stone. Book tickets online. Allow several hours.",
                    "best_time": "Early Morning",
                    "estimated_cost": "Moderate/High",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk or Cycle the Cork Harbour Greenway (Section)",
                    "where": "Starts near Páirc Uí Chaoimh, Mahon",
                    "description": "Enjoy a walk or cycle along a section of the traffic-free path offering views of Lough Mahon and the harbour.",
                    "practical_tips": "Rent bikes in the city or access via bus routes. Path is flat and suitable for all abilities.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking) / Budget (bike rental)",
                    "weather_dependent": true
                },
                {
                    "activity": "Evening Stroll & Ice Cream",
                    "where": "City Centre Quays / Grand Parade",
                    "description": "Take advantage of the long daylight hours with an evening walk along the river quays or through the city centre, stopping for an ice cream.",
                    "practical_tips": "Many ice cream shops stay open late in summer. Enjoy the city lights as dusk falls slowly.",
                    "best_time": "Evening",
                    "estimated_cost": "Budget",
                    "weather_dependent": true
                }
            ]
        }
    }
}
