{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Long Daylight Hours & Improving Weather",
                "details": "June offers some of the longest days of the year (sunset after 9:30 PM) and generally mild, pleasant weather (average highs 17-19°C), often one of the drier months, ideal for sightseeing."
            },
            {
                "reason": "Cork Midsummer Festival",
                "details": "A major highlight, typically held in the latter half of June. This vibrant arts festival features Irish and international theatre, music, dance, visual arts, and circus performances at various venues across the city."
            },
            {
                "reason": "Live at the Marquee Concerts",
                "details": "A series of big-name concerts held in a large marquee by the River Lee, often spanning throughout June. Features major Irish and international music acts across various genres."
            },
            {
                "reason": "Start of Summer Buzz & Outdoor Life",
                "details": "The city comes alive with the start of summer. Pub gardens, outdoor restaurant seating, parks like Fitzgerald's Park, and the River Lee banks are popular spots."
            },
            {
                "reason": "Ideal for Coastal Exploration",
                "details": "June's weather is perfect for day trips to Kinsale, Cobh, exploring the beaches and cliffs of West Cork, or taking boat trips (e.g., whale watching starts becoming more consistent)."
            },
            {
                "reason": "Cork City Marathon",
                "details": "Usually held on the June Bank Holiday weekend (first weekend). A major event creating a fantastic buzz around the city, even for non-runners (expect road closures)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Beginning of Peak Tourist Season",
                "details": "Visitor numbers significantly increase, especially around the Bank Holiday weekend and later in the month. Attractions get busier, and queues start forming."
            },
            {
                "reason": "Rising Accommodation Prices",
                "details": "Prices for hotels and B&Bs increase as peak season approaches. Availability can become tight, especially during festival dates or the marathon weekend. Booking well in advance is crucial."
            },
            {
                "reason": "Unpredictable Irish Weather",
                "details": "While often pleasant, June can still bring rain showers and cooler, windy days ('soft days'). Packing layers and waterproofs is still necessary."
            },
            {
                "reason": "Marathon/Festival Disruption",
                "details": "If visiting during the Cork City Marathon or major festival dates (Cork Midsummer, Live at the Marquee), expect road closures, traffic disruption, and potentially inflated prices."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "10°C"
                },
                "precipitation": "Moderate, often less rainy than spring months, but showers are still common (average 60-70mm for the month). Good chance of sunny spells. Very long days.",
                "general_tips": "Pack layers: t-shirts, light sweater/fleece, waterproof jacket. Comfortable walking shoes essential. Sunscreen needed for sunny days. Umbrella still useful."
            },
            "tourism_level": {
                "crowds": "Moderate to High, significantly boosted by the June Bank Holiday weekend (first Monday) and potentially the Cork City Marathon. Attractions are busier.",
                "pricing": "Shoulder to peak season prices. Bank Holiday weekend sees peak rates. Book accommodation far in advance, especially for this weekend.",
                "overall_atmosphere": "Lively start to summer. City feels energetic, especially around the Bank Holiday. Outdoor spaces are popular."
            },
            "events_holidays": [
                {
                    "name": "June Bank Holiday",
                    "date": "First Monday in June",
                    "description": "Public holiday marking the unofficial start of summer for many. Expect busy roads, attractions, and coastal towns.",
                    "notes": "Plan travel and activities considering the crowds. Some smaller shops might close, but most tourist services operate."
                },
                {
                    "name": "Cork City Marathon",
                    "date": "Usually June Bank Holiday Sunday (check exact date)",
                    "description": "Full marathon, half marathon, and relay races through the city streets. Great atmosphere but major road closures.",
                    "notes": "Check route and closure times if travelling around the city. Spectator spots along the route."
                },
                {
                    "name": "Live at the Marquee Concerts Start",
                    "date": "Typically starts early/mid-June (check schedule)",
                    "description": "Major concerts begin in the riverside marquee, featuring well-known Irish and international artists.",
                    "notes": "Requires tickets booked well in advance. Check lineup and dates."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Marathon Day Buzz (or avoid closures!)",
                    "where": "City Centre & Route",
                    "description": "Soak up the atmosphere supporting the runners, or plan activities away from the route if you want to avoid disruption.",
                    "practical_tips": "Check the official marathon website for route maps and timings. Pubs along the route can be lively.",
                    "best_time": "Marathon Day (usually Sunday of Bank Holiday weekend)",
                    "estimated_cost": "Free (spectating)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Blarney Castle & Gardens",
                    "where": "Blarney (Bus/Drive)",
                    "description": "Explore the famous castle, kiss the stone (expect queues), and wander the extensive gardens blooming in early summer.",
                    "practical_tips": "Go early in the day or on a weekday to avoid the biggest crowds. Book tickets online.",
                    "best_time": "Morning",
                    "estimated_cost": "Moderate/High",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore the English Market",
                    "where": "City Centre",
                    "description": "Browse the stalls overflowing with fresh local produce, artisan foods, fish, and meats in this historic covered market.",
                    "practical_tips": "Try local cheeses or grab lunch upstairs at the Farmgate Café. Gets busy around lunchtime.",
                    "best_time": "Mid-morning / Lunchtime",
                    "estimated_cost": "Free (browsing) / Budget-Moderate (food)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Relax in Fitzgerald's Park",
                    "where": "Western Road",
                    "description": "Enjoy the summer blooms in this lovely Victorian park by the River Lee. Visit the Cork Public Museum (free entry) located within the park.",
                    "practical_tips": "Good spot for a picnic. Check museum opening times.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "11°C"
                },
                "precipitation": "Similar to early June, mix of sunshine and showers possible. Evenings remain bright until late.",
                "general_tips": "Continue with layered clothing and waterproofs. Enjoy the long evenings outdoors when weather permits."
            },
            "tourism_level": {
                "crowds": "High. Peak season approaches. Expect significant crowds at major attractions and during festival dates.",
                "pricing": "Peak summer prices are now standard. Accommodation availability tightens, especially during Cork Midsummer Festival.",
                "overall_atmosphere": "Full summer swing. Busy, lively, and plenty of events happening. Outdoor dining and pub gardens are very popular."
            },
            "events_holidays": [
                {
                    "name": "Cork Midsummer Festival",
                    "date": "Typically mid-to-late June (check exact dates)",
                    "description": "Cork's premier international arts festival. Features a diverse program of theatre, music, dance, circus, and visual arts across various city venues.",
                    "notes": "Check the festival program online and book tickets for specific events in advance. Some free events may occur."
                },
                {
                    "name": "Live at the Marquee Concerts Continue",
                    "date": "Throughout late June",
                    "description": "Ongoing concerts in the riverside marquee.",
                    "notes": "Check lineup and book tickets well ahead."
                },
                {
                    "name": "Bloomsday (Local Events Potential)",
                    "date": "June 16",
                    "description": "While the main celebration of James Joyce's Ulysses is in Dublin, check local listings for potential readings or small events in Cork.",
                    "notes": "Likely minor observances if any."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend a Cork Midsummer Festival Event",
                    "where": "Various Venues (Cork Opera House, Everyman, galleries, streets)",
                    "description": "Experience cutting-edge theatre, music, or art as part of this internationally renowned festival.",
                    "practical_tips": "Browse the festival program online. Book tickets early for popular shows. Embrace diverse art forms.",
                    "best_time": "Check Festival Schedule",
                    "estimated_cost": "Varies (some free, most ticketed)",
                    "weather_dependent": "Varies (indoor/outdoor events)"
                },
                {
                    "activity": "Day Trip to Cobh",
                    "where": "Cobh (Train ride)",
                    "description": "Visit the historic port town, the last port of call for the Titanic. Explore the Titanic Experience, St Colman's Cathedral, and enjoy the colourful harbourfront.",
                    "practical_tips": "Easy train ride from Cork Kent station. Allow at least half a day.",
                    "best_time": "Day Trip",
                    "estimated_cost": "Budget (transport) + Moderate (attractions)",
                    "weather_dependent": true
                },
                {
                    "activity": "Climb St Anne's Church, Shandon",
                    "where": "Shandon area",
                    "description": "Climb the tower for panoramic views of Cork city and ring the famous Shandon Bells.",
                    "practical_tips": "Check opening hours. Steep climb. Offers great city perspectives.",
                    "best_time": "Daytime",
                    "estimated_cost": "Budget",
                    "weather_dependent": false
                },
                {
                    "activity": "Evening Walk Along the Lee Fields",
                    "where": "West of Fitzgerald's Park",
                    "description": "Take advantage of the late sunset with a walk along the pathways by the River Lee, popular with local walkers and runners.",
                    "practical_tips": "Flat, easy walking paths. Enjoy the long twilight hours.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}