{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather & Lush Greenery",
                "details": "May often brings milder temperatures (average 15-17°C) and increased sunshine to Cork. The countryside and city parks become lush green, and gardens are vibrant with spring blooms."
            },
            {
                "reason": "Cork International Choral Festival (Usually Late April/Early May)",
                "details": "Check dates - if it falls in early May, experience this prestigious international festival featuring choirs from around the world performing in concerts and competitions across the city."
            },
            {
                "reason": "Gardens in Full Bloom",
                "details": "Visit Blarney Castle Gardens, Fota House Arboretum & Gardens, or Bantry House Gardens (West Cork) to see rhododendrons, azaleas, and other spring flowers at their peak."
            },
            {
                "reason": "Ideal Time for Coastal Drives & Walks",
                "details": "With longer days and improving weather, May is perfect for exploring the Wild Atlantic Way near Cork, visiting coastal towns like Kinsale or Clonakilty, and enjoying scenic walks before peak summer crowds."
            },
            {
                "reason": "Shoulder Season Advantages",
                "details": "Enjoy relatively fewer crowds at major attractions compared to summer (outside Bank Holiday weekend). Accommodation prices may be slightly lower than July/August."
            },
            {
                "reason": "Whale Watching Opportunities",
                "details": "May is a good month for potential whale and dolphin sightings off the West Cork coast as migratory species return. Consider booking a boat tour from Courtmacsherry or Baltimore."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Unpredictable 'May Showers'",
                "details": "Irish weather remains changeable. Expect a mix of sunshine and potentially heavy showers or windy days. Packing layers and waterproofs is still essential."
            },
            {
                "reason": "May Bank Holiday Crowds & Prices",
                "details": "The first Monday in May is a public holiday. Expect increased traffic, busier attractions, and potentially higher accommodation prices over this long weekend."
            },
            {
                "reason": "Pollen Season",
                "details": "Grass and tree pollen levels can be high, potentially affecting allergy sufferers."
            },
            {
                "reason": "Increasing Visitor Numbers",
                "details": "Tourist season picks up noticeably in May. While not as busy as summer, don't expect attractions to be empty, especially on weekends."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "7°C"
                },
                "precipitation": "Moderate chance of rain showers (average 70-80mm for month), but often interspersed with bright, sunny spells. Days are significantly longer.",
                "general_tips": "Pack layers including t-shirts, sweaters/fleeces, and a waterproof/windproof jacket. Comfortable walking shoes are vital. Sunscreen needed for sunny days."
            },
            "tourism_level": {
                "crowds": "Moderate, significantly higher during the May Bank Holiday weekend (first Monday). Choral Festival (if early May) also brings visitors.",
                "pricing": "Shoulder season prices, but expect spikes for the Bank Holiday. Book accommodation well in advance for this period.",
                "overall_atmosphere": "Vibrant spring feel. City parks are beautiful. Buzz around Bank Holiday weekend and potential Choral Festival events."
            },
            "events_holidays": [
                {
                    "name": "May Bank Holiday",
                    "date": "First Monday in May",
                    "description": "Public holiday. Popular weekend for domestic travel. Expect busy roads, attractions, and coastal towns.",
                    "notes": "Plan activities and travel considering crowds. Some smaller shops may close, tourist services usually operate."
                },
                {
                    "name": "Cork International Choral Festival (Potential Dates)",
                    "date": "Usually late April/early May (check exact dates)",
                    "description": "Major international choral festival with concerts, competitions, and free performances in churches, galleries, and on the streets.",
                    "notes": "Check the official festival website for schedule and ticket information. City Hall hosts main gala concerts."
                },
                {
                    "name": "Start of Summer Music Season",
                    "date": "Throughout May",
                    "description": "Check listings for venues like Cyprus Avenue, Cork Opera House, The Everyman for concerts and theatre shows as the summer season begins.",
                    "notes": "Live at the Marquee might announce lineups/start dates."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend a Choral Festival Performance (if applicable)",
                    "where": "Various Venues (City Hall, Churches, Galleries)",
                    "description": "Experience world-class choral music in beautiful settings during this renowned festival.",
                    "practical_tips": "Check the schedule for free fringe events or book tickets for gala concerts. Offers diverse musical styles.",
                    "best_time": "During Festival Dates",
                    "estimated_cost": "Varies (Free - High)",
                    "weather_dependent": "Mostly False (indoor venues)"
                },
                {
                    "activity": "Visit Blarney Castle & Gardens",
                    "where": "Blarney (Bus/Drive)",
                    "description": "See the castle grounds burst into colour with spring blooms, especially rhododendrons and azaleas. Kiss the stone with potentially shorter queues than summer.",
                    "practical_tips": "Allow several hours to explore the extensive gardens (Poison Garden, Fern Dell etc). Wear comfortable shoes.",
                    "best_time": "Weekday Morning",
                    "estimated_cost": "Moderate/High",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Kinsale",
                    "where": "Kinsale (Bus/Drive South)",
                    "description": "Wander the charming streets of this colourful harbour town, visit Desmond Castle (Wine Museum), and walk to Charles Fort for stunning views.",
                    "practical_tips": "Bus Eireann 226. Can get busy on Bank Holiday weekend. Enjoy fresh seafood for lunch.",
                    "best_time": "Day Trip",
                    "estimated_cost": "Budget (transport) + Food/Attractions",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk in Fitzgerald's Park",
                    "where": "Western Road, Cork City",
                    "description": "Enjoy the vibrant spring flowers, manicured lawns, sculptures, and the River Lee flowing alongside this beautiful Victorian park.",
                    "practical_tips": "Visit Cork Public Museum within the park. Cross Daly's 'Shakey' Bridge. Perfect for a relaxing afternoon.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "9°C"
                },
                "precipitation": "Still a mix of sun and showers, but often feeling warmer and more settled than early May. Evenings stay light quite late.",
                "general_tips": "Layers remain key. Be prepared for both sunshine (sunscreen!) and rain. Enjoy the long daylight hours for evening activities."
            },
            "tourism_level": {
                "crowds": "Moderate but steadily increasing towards summer levels. Attractions are noticeably busier than early spring.",
                "pricing": "Shoulder season prices continue, potentially creeping up towards the end of the month. Booking ahead is advisable.",
                "overall_atmosphere": "Pleasant late spring/early summer feeling. City is lively, outdoor seating is popular on good days. Great time for exploring before peak crowds."
            },
            "events_holidays": [
                {
                    "name": "Ocean to City Race - An Rás Mór (Potential Date)",
                    "date": "Usually early June, sometimes late May (check dates)",
                    "description": "Ireland's largest multi-craft rowing and paddling race, finishing in Cork city centre. Creates a spectacle along the harbour and river.",
                    "notes": "Check exact date. Good viewing spots along the harbour/riverbanks."
                },
                {
                    "name": "Local Festivals & Events",
                    "date": "Check listings",
                    "description": "Look out for smaller community festivals, food markets, or agricultural shows starting up in the city or county.",
                    "notes": "Check local guides like Yay Cork or Cork County Council Arts listings."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Whale Watching Tour",
                    "where": "Departing from West Cork (e.g., Courtmacsherry, Baltimore)",
                    "description": "Take a boat trip for a chance to see minke whales, dolphins, seals, and seabirds along the scenic coastline.",
                    "practical_tips": "Requires a day trip/travel to West Cork. Book tours in advance (e.g., Atlantic Whale & Wildlife Tours, Cork Whale Watch). Sightings not guaranteed. Dress warmly.",
                    "best_time": "Day Trip (check tour times)",
                    "estimated_cost": "High",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Fota House, Arboretum & Gardens",
                    "where": "Fota Island (Train ride)",
                    "description": "Explore the magnificent Regency house, wander through the world-renowned arboretum, and enjoy the Victorian working garden.",
                    "practical_tips": "Separate attraction from Fota Wildlife Park but adjacent. Check opening hours for house tours. Gardens lovely in May.",
                    "best_time": "Day Trip",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": true
                },
                {
                    "activity": "Climb St Anne's Church, Shandon",
                    "where": "Shandon area",
                    "description": "Ring the famous bells and enjoy panoramic views over Cork city as it greens up for summer.",
                    "practical_tips": "Check opening hours. Offers a unique interactive experience and viewpoint.",
                    "best_time": "Daytime",
                    "estimated_cost": "Budget",
                    "weather_dependent": false
                },
                {
                    "activity": "Enjoy an Evening Pint Outdoors",
                    "where": "Various Pubs with Outdoor Seating",
                    "description": "Take advantage of the longer, milder evenings to enjoy a drink outside at a city pub.",
                    "practical_tips": "Many pubs along Oliver Plunkett Street or near the river have outdoor areas. Bring a layer for when the sun dips.",
                    "best_time": "Early Evening",
                    "estimated_cost": "Budget/Moderate (drinks)",
                    "weather_dependent": true
                }
            ]
        }
    }
}