{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day",
          "notes": "New Year's Day is a public holiday. Celebrations in city center and along the waterfront."
        },
        {
          "days": [2, 3, 4],
          "score": 3,
          "notes": "Off-season with fewer tourists and good hotel value. Mild winter climate with daytime temperatures often reaching 16-18°C, making outdoor activities pleasant."
        },
        {
          "days": [5, 6],
          "score": 4,
          "special": true,
          "event": "Three Kings Celebration",
          "notes": "Three Kings celebration features a spectacular parade through central Malaga and marks the main gift-giving tradition in Spain. January 6 is a public holiday."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Winter sales begin mid-January in all shops and department stores. Museums and cultural venues are less crowded than other times of year."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 8,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 3,
          "notes": "Winter continues with mild temperatures. Good time for cultural visits and enjoying the city without crowds."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28],
          "score": 4,
          "special": true,
          "event": "Carnival",
          "notes": "Colorful celebration with street parades, costume contests, musical performances, and the traditional 'burial of the anchovy' ceremony at the end. Most activity centered in the historic center. Usually falls in late February but occasionally in early March depending on the Easter calendar."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 9,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "notes": "Early spring with warming temperatures. Excellent time for hiking in natural parks like El Torcal or the Montes de Malaga."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "special": true,
          "event": "Malaga Film Festival",
          "notes": "Prestigious Spanish film festival featuring premieres, celebrities, and events at the Cervantes Theater and other venues throughout the city. Red carpet events and public screenings create a festive atmosphere."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Spring officially begins with almond blossoms in the countryside. Botanical Garden La Concepción starts to show impressive flowering displays."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 10,
      "tourismLevel": 5
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 5,
          "notes": "Perfect spring weather with warm days and cool evenings. Spring flowers bloom in parks and gardens throughout the city."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14],
          "score": 5,
          "special": true,
          "event": "Semana Santa (Holy Week - varies by year)",
          "notes": "Malaga's Holy Week processions are among the most famous in Spain, featuring elaborate thrones carried through the city by brotherhoods. Spectacular evening processions draw huge crowds, especially on Holy Thursday and Good Friday."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Ideal time to visit before summer crowds arrive. The Botanical Garden La Concepción is particularly beautiful with full spring blooms."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 12,
      "tourismLevel": 7
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day",
          "notes": "Public holiday with events throughout the city, many locals head to the beach or countryside for picnics."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "notes": "Excellent time to visit with perfect temperatures. Beaches beginning to warm up but not yet crowded with summer tourists."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "Outdoor dining becomes especially pleasant with all restaurant terraces open. Perfect time for beach activities with comfortable sea temperatures."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 14,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "notes": "Early summer brings consistent warm weather ideal for beach activities and outdoor dining. Crowds build gradually but not yet at peak season levels."
        },
        {
          "days": [23, 24],
          "score": 5,
          "special": true,
          "event": "San Juan Festival",
          "notes": "Midsummer celebration featuring bonfires and midnight swimming on beaches throughout Malaga province. La Malagueta Beach hosts major celebrations with music and fireworks."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Summer tourism season begins in earnest. All beach facilities fully operational with lifeguards, water sports, and beach restaurants."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 18,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "notes": "Peak summer season with hot temperatures. Beaches become crowded, especially on weekends. Early morning and evening activities recommended."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Terral Music Festival",
          "notes": "Summer music festival at the Cervantes Theater featuring diverse international artists across multiple genres. Outdoor concerts also take place in various city locations during the latter half of July."
        }
      ],
      "weatherHighC": 30,
      "weatherLowC": 20,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Peak summer season with very hot temperatures and maximum tourist numbers. Beaches at full capacity, especially in mornings and evenings."
        },
        {
          "days": [15],
          "score": 3,
          "special": true,
          "event": "Virgen de la Asunción",
          "notes": "Public holiday with religious observances and processions in some districts."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "Feria de Málaga",
          "notes": "Malaga's biggest annual festival featuring daytime celebrations in the historic center and evening festivities at the fairgrounds. Flamenco, traditional music, dancing, food stalls, and attractions throughout the city for a full week."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Post-Feria period with continued summer conditions. Some locals return to work while tourists remain. Beach conditions remain excellent."
        }
      ],
      "weatherHighC": 31,
      "weatherLowC": 21,
      "tourismLevel": 10
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 5,
          "notes": "Excellent time to visit as summer crowds diminish but weather remains warm and perfect for beach activities. Sea temperatures reach their highest of the year."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "Vendimia (Wine Harvest)",
          "notes": "Wine harvest season in nearby regions like Ronda and Axarquía, with special events and wine tourism opportunities. Perfect time for day trips to wine country."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Early autumn with continued warm temperatures and excellent conditions for both beach and cultural activities. Fewer tourists as children return to school."
        }
      ],
      "weatherHighC": 28,
      "weatherLowC": 19,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
          "score": 5,
          "notes": "Excellent autumn weather with warm days perfect for sightseeing. Beaches still usable but less crowded than summer months."
        },
        {
          "days": [12],
          "score": 4,
          "special": true,
          "event": "Hispanic Day",
          "notes": "National holiday commemorating Columbus's arrival in the Americas, with military parades and events in some areas."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Mild autumn with fewer tourists, excellent time for cultural activities and museum visits. Hiking in natural parks particularly pleasant with autumn colors beginning to appear."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 15,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day",
          "notes": "Public holiday with traditional cemetery visits and special services. Many businesses closed."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Mild autumn continues with good conditions for city exploration. Lower tourist numbers mean better access to popular attractions."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Malaga Jazz Festival",
          "notes": "Prestigious international jazz festival featuring performances at the Cervantes Theater and various venues throughout the city. European and American jazz artists performing during the second half of November."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "notes": "Early winter with mild temperatures. Christmas preparations begin with decorations appearing throughout the city."
        },
        {
          "days": [6],
          "score": 3,
          "special": true,
          "event": "Constitution Day",
          "notes": "Public holiday commemorating the Spanish Constitution. Many businesses closed."
        },
        {
          "days": [7],
          "score": 3,
          "notes": "'Puente' (bridge) holiday period between Constitution Day and Immaculate Conception."
        },
        {
          "days": [8],
          "score": 3,
          "special": true,
          "event": "Immaculate Conception",
          "notes": "Public holiday with special religious services. Many businesses closed."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "special": true,
          "event": "Christmas Lights Display",
          "notes": "Malaga's famous Christmas lights on Calle Larios and surrounding streets are considered among the most spectacular in Spain. Regular light shows with music draw crowds each evening."
        },
        {
          "days": [25],
          "score": 3,
          "special": true,
          "event": "Christmas Day",
          "notes": "Public holiday with limited opening hours. Family celebration day."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Post-Christmas period with continued holiday atmosphere, festive decorations throughout the city, and pleasant winter temperatures."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve",
          "notes": "Celebrations throughout the city, particularly in Plaza de la Constitución, with the tradition of eating 12 grapes at midnight. Many restaurants offer special New Year's dinners."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 9,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Semana Santa Processions in Historic Center",
      "Hiking in El Torcal's Unique Limestone Landscape",
      "Caminito del Rey Walkway Experience",
      "Botanical Garden La Concepción Spring Blooms",
      "Malaga Film Festival Events and Screenings",
      "Day Trips to White Villages of Axarquía",
      "Bird Watching at Guadalhorce Nature Reserve",
      "Spring Cuisine Featuring Fresh Anchovies and Artichokes"
    ],
    "summer": [
      "Feria de Málaga Festival Participation",
      "Beaches at La Malagueta, Pedregalejo and El Palo",
      "Evening Visits to the Illuminated Alcazaba",
      "Boat Tours of Malaga Bay and Coast",
      "Outdoor Dining on Plaza de la Constitución",
      "Catamaran Cruises with Swimming Stops",
      "Rooftop Bar Experiences with City Views",
      "San Juan Beach Bonfires and Celebrations"
    ],
    "autumn": [
      "Wine Tasting Tours in Ronda Mountains",
      "Malaga Jazz Festival Performances",
      "Hiking in Montes de Málaga Natural Park",
      "Museum Visits Without Summer Crowds",
      "Day Trip to Caminito del Rey",
      "Specialty Coffee Shops in Soho District",
      "Flamingo Watching at Fuente de Piedra",
      "Autumn Seafood Specialties at Beach Restaurants"
    ],
    "winter": [
      "Christmas Lights Display on Calle Larios",
      "Three Kings Parade Through City Center",
      "Day Trips to Sierra Nevada for Skiing",
      "Hammam Al Ándalus Arab Bath Experience",
      "Picasso Museum Without Summer Crowds",
      "Traditional Winter Cuisine Including Gazpachuelo Soup",
      "Shopping at El Corte Inglés During Winter Sales",
      "New Year's Eve Celebrations in Plaza de la Constitución"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to high tourism",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}