{
    "neighborhoods": [
        {
            "name": "Centro Histórico",
            "alternate_names": [
                "Old Town",
                "Historic Center",
                "Casco Antiguo"
            ],
            "character": "Malaga's ancient heart with narrow, winding streets, historic monuments, bustling plazas, and a rich tapestry of architectural styles from Roman to Moorish to Renaissance.",
            "location": {
                "central": true,
                "description": "Located in the heart of Malaga, bordered by the Mediterranean Sea to the south, with the Alcazaba and Gibralfaro hill creating a natural boundary to the east.",
                "borders": [
                    "El Ejido",
                    "La Malagueta",
                    "Soho",
                    "El Perchel"
                ],
                "landmarks": [
                    "Malaga Cathedral",
                    "Alcazaba",
                    "Plaza de la Constitución"
                ]
            },
            "history": {
                "overview": "Founded by the Phoenicians around 770 BCE, later occupied by Romans, Visigoths, and Moors before being conquered by the Catholic Monarchs in 1487.",
                "significance": "The historical core of Malaga that reveals its layered past as a Phoenician, Roman, Moorish, and Spanish city.",
                "notable_events": [
                    "Phoenician foundation around 770 BCE",
                    "Roman period (3rd century BCE to 5th century CE)",
                    "Moorish rule (711-1487)",
                    "Reconquest by the Catholic Monarchs in 1487",
                    "Major restoration and pedestrianization in the 1990s-2000s"
                ]
            },
            "practical_info": {
                "transit": [
                    "Alameda Principal bus hub",
                    "Maria Zambrano train station (20-minute walk)",
                    "Multiple bus lines connecting to all parts of the city"
                ],
                "safety": "Very safe during day and evening; normal precautions regarding pickpockets in tourist areas.",
                "best_time_to_visit": "Morning for monuments and museums; evening for dining and atmosphere.",
                "walkability": "Excellent - predominantly pedestrianized with limited vehicle access."
            },
            "appeal": {
                "known_for": [
                    "Historic monuments",
                    "Tapas bars and restaurants",
                    "Museums and cultural sites"
                ],
                "atmosphere": [
                    "Vibrant",
                    "Historic",
                    "Cultural"
                ],
                "best_for": [
                    "First-time visitors",
                    "History enthusiasts",
                    "Culture seekers"
                ]
            },
            "categories": {
                "touristy": 5,
                "residential": 3,
                "green_spaces": 2,
                "shopping": 4,
                "dining": 5,
                "nightlife": 4,
                "cultural": 5,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Alcazaba",
                        "type": "Historic Fortress",
                        "description": "11th-century Moorish fortress with beautiful gardens, fountains, and sweeping views of the city and port.",
                        "appeal": "Experience one of the best-preserved Moorish fortresses in Spain, with atmospheric courtyards and impressive architectural details."
                    },
                    {
                        "name": "Malaga Cathedral",
                        "type": "Religious Site",
                        "description": "Renaissance masterpiece known as 'La Manquita' (One-Armed Lady) due to its unfinished second tower, built between 1528-1782.",
                        "appeal": "Admire the impressive architecture, ornate choir stalls, and chapels while learning about the cathedral's complex construction history."
                    },
                    {
                        "name": "Museo Picasso",
                        "type": "Art Museum",
                        "description": "Museum dedicated to Malaga's most famous son, housed in the 16th-century Buenavista Palace with a collection of 285 works donated by Picasso's family.",
                        "appeal": "View works spanning Picasso's revolutionary artistic career in a beautiful historic building with Andalusian courtyards."
                    }
                ],
                "dining": [
                    {
                        "name": "El Pimpi",
                        "cuisine": "Traditional Andalusian",
                        "price_range": "€€",
                        "known_for": "Historic bodega frequented by celebrities with wine barrels signed by famous visitors",
                        "atmosphere": "Historic wine bar with multiple levels, Alcazaba views, and authentic Malaga ambiance."
                    },
                    {
                        "name": "Uvedoble",
                        "cuisine": "Modern Spanish",
                        "price_range": "€€",
                        "known_for": "Creative tapas and modern interpretations of traditional dishes",
                        "atmosphere": "Contemporary, stylish space with a lively vibe in a historic building."
                    },
                    {
                        "name": "Casa Lola",
                        "cuisine": "Traditional Tapas",
                        "price_range": "€€",
                        "known_for": "Extensive tapas menu with classics and local specialties",
                        "atmosphere": "Bustling, energetic tapas bar popular with locals and visitors alike."
                    }
                ],
                "activities": [
                    {
                        "name": "Historic Walking Tour",
                        "type": "Cultural",
                        "description": "Guided or self-guided tour through the historic streets revealing Malaga's Phoenician, Roman, Moorish, and Spanish heritage.",
                        "suitable_for": [
                            "History enthusiasts",
                            "First-time visitors",
                            "Culture seekers"
                        ]
                    },
                    {
                        "name": "Museum Hopping",
                        "type": "Cultural",
                        "description": "Visit multiple museums within walking distance, including the Picasso Museum, Carmen Thyssen Museum, and Malaga Museum.",
                        "suitable_for": [
                            "Art lovers",
                            "Culture enthusiasts",
                            "Rainy day activity"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to be within walking distance of main attractions.",
                "You enjoy vibrant streets, historic surroundings, and lively dining scenes.",
                "You prefer to immerse yourself in the cultural and historical heart of the city."
            ],
            "avoid_if": [
                "You're sensitive to noise (streets can be busy, especially in summer and during festivals).",
                "You prefer modern accommodations with spacious rooms (historic buildings often have smaller rooms).",
                "You're looking for a quiet, relaxed neighborhood experience."
            ],
            "insider_tips": [
                "Visit Mercado Atarazanas in the morning to see locals shopping and stop for fresh seafood tapas at the market bars.",
                "The rooftop of the AC Hotel Malaga Palacio offers one of the best views of the Cathedral and port.",
                "Many museums offer free entry on Sunday afternoons - plan accordingly for significant savings."
            ]
        },
        {
            "name": "La Malagueta",
            "alternate_names": [
                "East Malaga",
                "Beachfront District"
            ],
            "character": "Upscale beach neighborhood that blends urban living with Mediterranean seaside atmosphere, featuring a long sandy beach, palm-lined promenade, and mix of traditional chiringuitos and modern high-rises.",
            "location": {
                "central": true,
                "description": "Located east of the historic center, stretching along Malaga's main urban beach between the port and the eastern beaches.",
                "borders": [
                    "Centro Histórico",
                    "Limonar",
                    "Mediterranean Sea",
                    "Port of Malaga"
                ],
                "landmarks": [
                    "La Malagueta Beach",
                    "Plaza de Toros (Bullring)",
                    "Paseo Marítimo"
                ]
            },
            "history": {
                "overview": "Developed primarily in the late 19th and early 20th centuries as Malaga expanded eastward along the coast.",
                "significance": "Represents Malaga's evolution from a port city to a seaside resort destination combining residential areas with tourism.",
                "notable_events": [
                    "Initial development in the late 19th century",
                    "Construction of the bullring in 1874",
                    "Development of the Paseo Marítimo (seafront promenade) in the mid-20th century",
                    "Modernization and high-rise construction in the 1960s-1980s",
                    "Recent enhancements to beach facilities and promenade"
                ]
            },
            "practical_info": {
                "transit": [
                    "Bus lines 3, 11, 14 connect to city center",
                    "15-minute walk from Historic Center",
                    "Bicycle lanes along the seafront"
                ],
                "safety": "Very safe area with good lighting and regular police presence.",
                "best_time_to_visit": "Morning for beach activities; evening for sunset dining and promenade strolls.",
                "walkability": "Excellent with wide seafront promenade and good pedestrian infrastructure."
            },
            "appeal": {
                "known_for": [
                    "Urban beach lifestyle",
                    "Seafood restaurants and chiringuitos",
                    "Blend of residential and tourist amenities"
                ],
                "atmosphere": [
                    "Relaxed",
                    "Cosmopolitan",
                    "Breezy"
                ],
                "best_for": [
                    "Beach lovers",
                    "Seafood enthusiasts",
                    "Those seeking balance between beach and city"
                ]
            },
            "categories": {
                "touristy": 4,
                "residential": 4,
                "green_spaces": 3,
                "shopping": 2,
                "dining": 4,
                "nightlife": 3,
                "cultural": 2,
                "historic": 2
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "La Malagueta Beach",
                        "type": "Urban Beach",
                        "description": "Blue Flag urban beach stretching 1,200 meters with dark golden sand, complete with facilities and services.",
                        "appeal": "Enjoy a proper beach experience just steps from the city center with clear Mediterranean waters and excellent amenities."
                    },
                    {
                        "name": "Plaza de Toros",
                        "type": "Historic Building",
                        "description": "Neo-Mudéjar style bullring dating from 1874, still hosting occasional bullfights and cultural events.",
                        "appeal": "Visit this architectural landmark with its distinctive style and attached bullfighting museum to understand this controversial Spanish tradition."
                    },
                    {
                        "name": "Paseo Marítimo",
                        "type": "Seafront Promenade",
                        "description": "Palm-lined promenade running along the beach with views of the Mediterranean and scattered with sculptures.",
                        "appeal": "Take a leisurely stroll, cycle, or jog along this picturesque seafront with mountain views to the north and sea views to the south."
                    }
                ],
                "dining": [
                    {
                        "name": "El Cabra",
                        "cuisine": "Seafood",
                        "price_range": "€€",
                        "known_for": "Traditional espetos (grilled sardines on skewers) and fresh local seafood",
                        "atmosphere": "Authentic beach chiringuito with sand-floor sections and Mediterranean views."
                    },
                    {
                        "name": "El Merendero de Antonio Martín",
                        "cuisine": "Mediterranean/Seafood",
                        "price_range": "€€€",
                        "known_for": "Upscale seafood with beach views and traditional Malaga fish dishes",
                        "atmosphere": "Elegant restaurant with terrace overlooking the Mediterranean, merging traditional style with modern service."
                    },
                    {
                        "name": "La Moraga",
                        "cuisine": "Modern Spanish",
                        "price_range": "€€€",
                        "known_for": "Creative tapas designed by Michelin-starred chef Dani García",
                        "atmosphere": "Contemporary, stylish space with sleek design and sophisticated vibe."
                    }
                ],
                "activities": [
                    {
                        "name": "Beach Day",
                        "type": "Leisure",
                        "description": "Enjoy swimming, sunbathing, and beach sports with full facilities including sunbed rentals, showers, and lifeguards.",
                        "suitable_for": [
                            "Beach lovers",
                            "Families",
                            "Sunbathers"
                        ]
                    },
                    {
                        "name": "Seafront Cycling",
                        "type": "Active",
                        "description": "Rent bicycles to explore the extensive seafront bike path connecting central Malaga beaches to eastern districts.",
                        "suitable_for": [
                            "Active travelers",
                            "Families",
                            "Photography enthusiasts"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to combine beach access with proximity to city attractions.",
                "You prefer sea views and a more resort-like atmosphere.",
                "You enjoy seafood dining and sea breezes."
            ],
            "avoid_if": [
                "You're looking for the most authentic local experience.",
                "You prefer historical surroundings over modern developments.",
                "You want to avoid higher prices for accommodations with sea views."
            ],
            "insider_tips": [
                "Visit the beach early morning to watch local fishermen preparing traditional espeto boats for the day's grilling.",
                "The western end of the beach near the port is usually less crowded than the central areas.",
                "For the best seafood experience, look for chiringuitos where locals are dining, often further east along the promenade."
            ]
        },
        {
            "name": "Soho",
            "alternate_names": [
                "Barrio de las Artes",
                "Arts District",
                "Ensanche Centro"
            ],
            "character": "Revitalized urban district between the port and city center that has transformed from a neglected area into Malaga's creative and artistic hub, featuring street art, independent galleries, and alternative culture.",
            "location": {
                "central": true,
                "description": "Located south of the historic center between the Alameda Principal and the port, a formerly residential area now transforming into a cultural district.",
                "borders": [
                    "Centro Histórico",
                    "Port of Malaga",
                    "El Perchel",
                    "Alameda"
                ],
                "landmarks": [
                    "CAC Málaga (Contemporary Art Center)",
                    "Teatro Alameda",
                    "MAUS Street Art Murals"
                ]
            },
            "history": {
                "overview": "Originally a middle-class residential expansion in the late 19th century that experienced decline in the late 20th century before being revitalized through arts initiatives beginning in 2009.",
                "significance": "Represents Malaga's contemporary cultural renaissance and creative identity beyond its traditional historical attractions.",
                "notable_events": [
                    "Initial development as Ensanche neighborhood in late 19th century",
                    "Period of decline in late 20th century as port activities changed",
                    "Launch of the MAUS (Malaga Arte Urbano Soho) project in 2009",
                    "Continuing revitalization through street art, creative businesses, and cultural initiatives"
                ]
            },
            "practical_info": {
                "transit": [
                    "Alameda Principal transit hub (north edge)",
                    "Bus lines to city center and beaches",
                    "20-minute walk from Maria Zambrano train station"
                ],
                "safety": "Generally safe but still in transition; normal urban precautions advised especially at night.",
                "best_time_to_visit": "Daytime for street art viewing; evenings for gallery events and dining.",
                "walkability": "Very walkable with grid street pattern and improved pedestrian areas."
            },
            "appeal": {
                "known_for": [
                    "Street art and murals",
                    "Creative enterprises",
                    "Alternative culture"
                ],
                "atmosphere": [
                    "Bohemian",
                    "Emerging",
                    "Artistic"
                ],
                "best_for": [
                    "Art enthusiasts",
                    "Urban explorers",
                    "Cultural creatives"
                ]
            },
            "categories": {
                "touristy": 2,
                "residential": 3,
                "green_spaces": 1,
                "shopping": 3,
                "dining": 4,
                "nightlife": 3,
                "cultural": 5,
                "historic": 2
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "CAC Málaga",
                        "type": "Contemporary Art Museum",
                        "description": "Leading contemporary art center housed in a former market building, featuring rotating exhibitions of Spanish and international artists.",
                        "appeal": "Experience cutting-edge contemporary art exhibitions in a spacious industrial setting with free admission."
                    },
                    {
                        "name": "MAUS Street Art Route",
                        "type": "Urban Art",
                        "description": "Collection of large-scale murals by international and local artists transforming building facades throughout the district.",
                        "appeal": "Discover impressive artworks by renowned street artists like D*Face, Obey, and ROA through a self-guided tour of the neighborhood."
                    },
                    {
                        "name": "La Térmica",
                        "type": "Cultural Center",
                        "description": "Multidisciplinary cultural space hosting exhibitions, performances, workshops, and creative events.",
                        "appeal": "Engage with Malaga's contemporary cultural scene through diverse programming in a vibrant creative space."
                    }
                ],
                "dining": [
                    {
                        "name": "Óleo",
                        "cuisine": "Mediterranean Fusion",
                        "price_range": "€€",
                        "known_for": "Innovative cuisine in the CAC Málaga with artistic presentation",
                        "atmosphere": "Stylish, contemporary space with art-focused design and terrace."
                    },
                    {
                        "name": "Casa de Botes",
                        "cuisine": "Creative Spanish",
                        "price_range": "€€",
                        "known_for": "Updated traditional dishes with contemporary touches",
                        "atmosphere": "Converted boathouse with industrial-chic design and artistic elements."
                    },
                    {
                        "name": "Mamuchis",
                        "cuisine": "International",
                        "price_range": "€€",
                        "known_for": "Global street food influences with vegetarian options",
                        "atmosphere": "Casual, artistic cafe with bohemian touches and creative vibe."
                    }
                ],
                "activities": [
                    {
                        "name": "Street Art Tour",
                        "type": "Cultural",
                        "description": "Self-guided or organized tour of the district's impressive collection of murals and street art installations.",
                        "suitable_for": [
                            "Art lovers",
                            "Photographers",
                            "Urban culture enthusiasts"
                        ]
                    },
                    {
                        "name": "Gallery Hopping",
                        "type": "Art",
                        "description": "Visit independent galleries and creative spaces showcasing emerging and established contemporary artists.",
                        "suitable_for": [
                            "Art collectors",
                            "Cultural explorers",
                            "Creative professionals"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You're interested in contemporary art and creative culture.",
                "You prefer emerging neighborhoods with an alternative vibe.",
                "You want central location with more affordable accommodation options."
            ],
            "avoid_if": [
                "You prefer fully established, polished neighborhoods.",
                "You're looking for traditional Spanish atmosphere and architecture.",
                "You're uncomfortable in areas still undergoing transition."
            ],
            "insider_tips": [
                "Download the MAUS street art map app for a self-guided tour of the district's murals with artist information.",
                "Check the CAC Málaga schedule as they host frequent free exhibition openings with refreshments.",
                "Many of the area's creative businesses and galleries have irregular hours - afternoons and evenings are most reliable."
            ]
        },
        {
            "name": "El Perchel-Trinidad",
            "alternate_names": [
                "Traditional Malaga",
                "Working-Class Malaga"
            ],
            "character": "Authentic working-class neighborhood that preserves traditional Malaga character with religious traditions, local markets, and genuine Andalusian atmosphere away from tourist areas.",
            "location": {
                "central": true,
                "description": "Located west of the historic center across the Guadalmedina River, a traditional area that was once outside the city walls.",
                "borders": [
                    "Centro Histórico",
                    "Soho",
                    "Cruz del Humilladero",
                    "Carretera de Cádiz"
                ],
                "landmarks": [
                    "Mercado de Atarazanas (on border with Centro)",
                    "María Zambrano Train Station",
                    "El Corte Inglés Department Store"
                ]
            },
            "history": {
                "overview": "Historically working-class neighborhoods outside the city walls that housed fishermen (El Perchel) and craftsmen (Trinidad), partially affected by modern development but retaining authentic character in many streets.",
                "significance": "Represents the traditional, everyday Malaga untouched by tourist-focused development and preserving local customs.",
                "notable_events": [
                    "Development as workers' districts outside city walls in medieval period",
                    "Growth during industrial period of 19th century",
                    "Partial redevelopment in mid-20th century",
                    "Construction of María Zambrano station revitalized parts of the area"
                ]
            },
            "practical_info": {
                "transit": [
                    "María Zambrano train and bus station",
                    "Multiple local bus connections",
                    "10-15 minute walk to historic center"
                ],
                "safety": "Generally safe in main areas and daylight; normal urban precautions advised at night.",
                "best_time_to_visit": "Mornings for markets; during local festivals for authentic atmosphere.",
                "walkability": "Walkable with grid pattern streets, though less pedestrianized than tourist areas."
            },
            "appeal": {
                "known_for": [
                    "Authentic local atmosphere",
                    "Religious processions and traditions",
                    "Traditional markets and shops"
                ],
                "atmosphere": [
                    "Genuine",
                    "Working-class",
                    "Traditional"
                ],
                "best_for": [
                    "Cultural immersion seekers",
                    "Off-the-beaten-path travelers",
                    "Budget travelers"
                ]
            },
            "categories": {
                "touristy": 1,
                "residential": 5,
                "green_spaces": 2,
                "shopping": 3,
                "dining": 3,
                "nightlife": 2,
                "cultural": 3,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Iglesia de Santo Domingo",
                        "type": "Religious Site",
                        "description": "Historic church home to some of Malaga's most important religious brotherhoods and Easter processions.",
                        "appeal": "Experience authentic religious traditions and admire processional treasures important to Malaga's cultural identity."
                    },
                    {
                        "name": "Mercado de Atarazanas",
                        "type": "Market",
                        "description": "19th-century iron market with stunning stained glass window featuring fresh local produce, meat, and seafood (on border with Centro).",
                        "appeal": "Shop alongside locals for fresh ingredients and enjoy authentic tapas at market bars away from tourist prices."
                    },
                    {
                        "name": "Antiquarium",
                        "type": "Archaeological Site",
                        "description": "Roman and Moorish remains preserved beneath modern buildings, showing the ancient history of this area.",
                        "appeal": "Discover lesser-known historical layers of Malaga predating the current neighborhoods."
                    }
                ],
                "dining": [
                    {
                        "name": "Los Caracoles",
                        "cuisine": "Traditional Andalusian",
                        "price_range": "€",
                        "known_for": "Authentic local cuisine including the namesake snail dishes",
                        "atmosphere": "No-frills, authentic local bar with traditional decor and regular clientele."
                    },
                    {
                        "name": "Bar Orellana",
                        "cuisine": "Traditional Tapas",
                        "price_range": "€",
                        "known_for": "Classic tapas at local prices without tourist markup",
                        "atmosphere": "Traditional neighborhood bar frequented by residents rather than visitors."
                    },
                    {
                        "name": "Casa Lola",
                        "cuisine": "Home-style Andalusian",
                        "price_range": "€€",
                        "known_for": "Family recipes and traditional Malaga specialties",
                        "atmosphere": "Welcoming, traditional restaurant with unpretentious service and local atmosphere."
                    }
                ],
                "activities": [
                    {
                        "name": "Holy Week Processions",
                        "type": "Cultural/Religious",
                        "description": "Experience authentic Semana Santa traditions from local brotherhoods with deep neighborhood connections.",
                        "suitable_for": [
                            "Cultural enthusiasts",
                            "Photographers",
                            "Religious tradition observers"
                        ]
                    },
                    {
                        "name": "Local Malaga Tour",
                        "type": "Cultural",
                        "description": "Guided walks through traditional streets revealing everyday life, local customs, and working-class history.",
                        "suitable_for": [
                            "Off-the-beaten-path travelers",
                            "Cultural immersion seekers",
                            "Social history enthusiasts"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want an authentic local experience away from tourist areas.",
                "You're looking for more affordable accommodation with good transport links.",
                "You prefer to experience everyday Spanish life rather than tourist attractions."
            ],
            "avoid_if": [
                "You want to be surrounded by historic monuments and attractions.",
                "You prefer polished, tourist-friendly environments.",
                "You're uncomfortable in authentic working-class neighborhoods."
            ],
            "insider_tips": [
                "Visit during Holy Week to see passionate, neighborhood-based processions without the extreme crowds of the city center.",
                "The area around Mercado Atarazanas offers the most authentic and affordable tapas bars in the city.",
                "For the best experience, explore these neighborhoods in the morning when local life is most active."
            ]
        },
        {
            "name": "El Limonar",
            "alternate_names": [
                "Malaga East",
                "Upscale Residential District"
            ],
            "character": "Elegant residential area east of the center featuring impressive mansions, diplomatic residences, and tree-lined avenues set against the backdrop of Gibralfaro hill.",
            "location": {
                "central": false,
                "description": "Located east of La Malagueta along the coast, an exclusive residential neighborhood developed in the late 19th and early 20th centuries.",
                "borders": [
                    "La Malagueta",
                    "Gibralfaro",
                    "Mediterranean Sea",
                    "Pedregalejo"
                ],
                "landmarks": [
                    "Historic Villas and Mansions",
                    "Baños del Carmen",
                    "English Cemetery"
                ]
            },
            "history": {
                "overview": "Developed in the late 19th century as wealthy merchants and industrialists built summer villas and permanent residences outside the city center.",
                "significance": "Represents Malaga's historical bourgeoisie and the city's prosperous period during the industrial age.",
                "notable_events": [
                    "Initial development in the 1870s-1920s with elegant villas",
                    "Establishment as Malaga's most prestigious address in early 20th century",
                    "Conversion of many properties to diplomatic residences and institutions",
                    "Preservation as a protected historic zone in recent decades"
                ]
            },
            "practical_info": {
                "transit": [
                    "Bus lines 3, 11, 34 connect to city center",
                    "30-minute walk from Historic Center",
                    "Limited parking available"
                ],
                "safety": "Very safe residential area with security presence.",
                "best_time_to_visit": "Daytime for architecture viewing; sunset at Baños del Carmen.",
                "walkability": "Walkable but hilly in parts; pleasant for strolling."
            },
            "appeal": {
                "known_for": [
                    "Historic mansions and architecture",
                    "Elegant residential streets",
                    "Proximity to beaches and sea views"
                ],
                "atmosphere": [
                    "Refined",
                    "Peaceful",
                    "Prestigious"
                ],
                "best_for": [
                    "Architecture enthusiasts",
                    "Quiet-seeking visitors",
                    "History buffs"
                ]
            },
            "categories": {
                "touristy": 1,
                "residential": 5,
                "green_spaces": 3,
                "shopping": 1,
                "dining": 2,
                "nightlife": 1,
                "cultural": 2,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Baños del Carmen",
                        "type": "Historic Beach Club",
                        "description": "1920s bathing pavilion and restaurant complex with Mediterranean views, once the social center for Malaga's elite.",
                        "appeal": "Experience the faded elegance of this historic beach club while enjoying spectacular sunset views and coastal atmosphere."
                    },
                    {
                        "name": "English Cemetery",
                        "type": "Historic Site",
                        "description": "First Protestant cemetery in Spain (1831) featuring impressive monuments and the grave of writer Gerald Brenan.",
                        "appeal": "Explore this peaceful historic site with beautiful gardens and monuments that tells the story of Malaga's foreign communities."
                    },
                    {
                        "name": "Villa Fernanda",
                        "type": "Architectural Landmark",
                        "description": "Impressive 1920s mansion exemplifying the eclectic architectural style favored by Malaga's industrial elite.",
                        "appeal": "Admire the exterior of this architectural gem representing the wealth and tastes of early 20th century Malaga society."
                    }
                ],
                "dining": [
                    {
                        "name": "El Balneario",
                        "cuisine": "Mediterranean",
                        "price_range": "€€€",
                        "known_for": "Seafood and rice dishes with spectacular sea views",
                        "atmosphere": "Elegant restaurant in the historic Baños del Carmen complex with terrace dining."
                    },
                    {
                        "name": "Café de Paris",
                        "cuisine": "French-Mediterranean",
                        "price_range": "€€€",
                        "known_for": "Refined dining with French influences and local ingredients",
                        "atmosphere": "Sophisticated restaurant with elegant interior and professional service."
                    },
                    {
                        "name": "Limonar 40",
                        "cuisine": "Contemporary Spanish",
                        "price_range": "€€€",
                        "known_for": "Modern interpretations of classic dishes in an elegant setting",
                        "atmosphere": "Stylish restaurant housed in a converted villa with garden dining."
                    }
                ],
                "activities": [
                    {
                        "name": "Architectural Walking Tour",
                        "type": "Cultural",
                        "description": "Self-guided tour of the neighborhood's impressive villas and mansions representing various architectural styles.",
                        "suitable_for": [
                            "Architecture enthusiasts",
                            "History buffs",
                            "Photography lovers"
                        ]
                    },
                    {
                        "name": "Sunset at Baños del Carmen",
                        "type": "Leisure",
                        "description": "Enjoy spectacular Mediterranean sunsets from this historic seaside venue with drinks or dinner.",
                        "suitable_for": [
                            "Couples",
                            "Photographers",
                            "Relaxation seekers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You seek a quiet, upscale residential experience.",
                "You appreciate architectural history and elegant surroundings.",
                "You prefer to be near the sea but away from tourist crowds."
            ],
            "avoid_if": [
                "You want to be in the center of tourist activities and nightlife.",
                "You're traveling on a budget (accommodation is limited and upscale).",
                "You prefer easy access to shopping and dining options."
            ],
            "insider_tips": [
                "The coastal path provides a beautiful walk from La Malagueta through El Limonar to the eastern beaches.",
                "Many of the impressive villas are now private businesses or institutions but can be admired from outside.",
                "Baños del Carmen is one of the best spots in the city to watch the sunset with a drink."
            ]
        },
        {
            "name": "Pedregalejo",
            "alternate_names": [
                "Fishermen's District",
                "Eastern Beaches"
            ],
            "character": "Former fishing village now integrated into Malaga city, featuring a string of small beaches, authentic chiringuitos (beach restaurants), and a relaxed coastal lifestyle.",
            "location": {
                "central": false,
                "description": "Located about 4km east of the city center along the coast, a charming area that maintains its village-like atmosphere.",
                "borders": [
                    "El Limonar",
                    "El Palo",
                    "Mediterranean Sea",
                    "Cerrado de Calderón"
                ],
                "landmarks": [
                    "Pedregalejo Beaches",
                    "Paseo Marítimo Antonio Banderas",
                    "Traditional Fishing Boats"
                ]
            },
            "history": {
                "overview": "Originally a separate fishing village that was gradually absorbed by Malaga's eastward expansion while maintaining its distinct character and traditions.",
                "significance": "Preserves Malaga's maritime heritage and traditional espeto (grilled sardine) culture in an authentic setting.",
                "notable_events": [
                    "Established as a fishing settlement in the 18th-19th centuries",
                    "Development of first chiringuitos (beach restaurants) in the early 20th century",
                    "Integration into Malaga city in the mid-20th century",
                    "Renovation of the seafront promenade in recent decades while preserving character"
                ]
            },
            "practical_info": {
                "transit": [
                    "Bus lines 3, 11, 34 from city center",
                    "20-minute drive from Historic Center",
                    "Bicycle rental available along seafront"
                ],
                "safety": "Very safe area day and night.",
                "best_time_to_visit": "Lunch for authentic chiringuito experience; early evening for promenade atmosphere.",
                "walkability": "Excellent with continuous seafront promenade."
            },
            "appeal": {
                "known_for": [
                    "Authentic beach restaurants",
                    "Traditional espetos (grilled sardines)",
                    "Local beach atmosphere"
                ],
                "atmosphere": [
                    "Relaxed",
                    "Authentic",
                    "Maritime"
                ],
                "best_for": [
                    "Seafood lovers",
                    "Beach enthusiasts",
                    "Those seeking local atmosphere"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 5,
                "green_spaces": 2,
                "shopping": 2,
                "dining": 5,
                "nightlife": 3,
                "cultural": 3,
                "historic": 3
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Pedregalejo Beaches",
                        "type": "Urban Beaches",
                        "description": "Series of small, sheltered cove beaches with calm waters separated by rocky outcrops.",
                        "appeal": "Enjoy a more intimate beach experience with primarily local atmosphere and excellent facilities."
                    },
                    {
                        "name": "Traditional Fishing Boats",
                        "type": "Cultural Heritage",
                        "description": "Colorful fishing boats (jábegas) still used by local fishermen and for espeto grilling.",
                        "appeal": "Observe traditional fishing boats that have become the symbol of Malaga's coastal culture and cuisine."
                    },
                    {
                        "name": "Paseo Marítimo",
                        "type": "Seafront Promenade",
                        "description": "Lively beachfront walkway lined with restaurants, featuring blue-and-white decorative elements.",
                        "appeal": "Stroll along this vibrant promenade connecting beaches and restaurants with views of fishing boats and Mediterranean scenes."
                    }
                ],
                "dining": [
                    {
                        "name": "El Cabra",
                        "cuisine": "Seafood",
                        "price_range": "€€",
                        "known_for": "Traditional espetos and fresh local seafood grilled over olive wood",
                        "atmosphere": "Authentic chiringuito with beach location and maritime decor."
                    },
                    {
                        "name": "El Palo",
                        "cuisine": "Traditional Malagueño",
                        "price_range": "€€",
                        "known_for": "Wide variety of freshly caught fish and shellfish",
                        "atmosphere": "Family-run beach restaurant with decades of history and local clientele."
                    },
                    {
                        "name": "La Galerna",
                        "cuisine": "Modern Mediterranean",
                        "price_range": "€€€",
                        "known_for": "Contemporary approach to seafood with creative presentations",
                        "atmosphere": "Stylish beachfront restaurant with updated chiringuito concept."
                    }
                ],
                "activities": [
                    {
                        "name": "Beach Hopping",
                        "type": "Leisure",
                        "description": "Explore the series of small beaches, each with slightly different character and facilities.",
                        "suitable_for": [
                            "Beach lovers",
                            "Families",
                            "Swimmers"
                        ]
                    },
                    {
                        "name": "Espeto Experience",
                        "type": "Culinary",
                        "description": "Watch traditional sardine skewers being grilled on boats filled with sand, then enjoy this local delicacy.",
                        "suitable_for": [
                            "Food enthusiasts",
                            "Cultural experience seekers",
                            "Seafood lovers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You prefer authentic local atmosphere over tourist amenities.",
                "You want direct beach access and seafood dining options.",
                "You don't mind being a short bus ride from the city center."
            ],
            "avoid_if": [
                "You want to be within walking distance of major tourist attractions.",
                "You're seeking luxury accommodations and facilities.",
                "You prioritize nightlife and shopping over beach atmosphere."
            ],
            "insider_tips": [
                "Look for chiringuitos where locals are dining, often indicated by families and older residents rather than tourists.",
                "Best espetos are usually served between May and September when sardines are in prime season.",
                "The small cove beaches are perfect for children as they're sheltered with calm, shallow water."
            ]
        }
    ]
}