{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Spring Blooms",
                "details": "April is when Tirana truly comes alive with spring blossoms in Grand Park, colorful flowers in Skanderbeg Square, and cherry blossoms throughout the city's green spaces. The city transforms into a vibrant, colorful landscape."
            },
            {
                "reason": "Perfect Weather",
                "details": "April offers ideal weather in Tirana with temperatures ranging from 8-18°C, making it perfect for outdoor activities, hiking Mount Dajti, and exploring the city on foot without the summer heat or winter cold."
            },
            {
                "reason": "Cultural Festivals",
                "details": "April hosts various cultural events and festivals, including spring celebrations, art exhibitions at the National Gallery, and traditional Albanian cultural performances throughout the city."
            },
            {
                "reason": "Outdoor Dining Returns",
                "details": "With the arrival of spring, outdoor café culture returns to Blloku district and throughout the city. Enjoy traditional Albanian coffee and cuisine in beautiful outdoor settings."
            },
            {
                "reason": "Mount Dajti Access",
                "details": "April is perfect for visiting Mount Dajti via cable car or hiking trails, with clear views of the city below and comfortable temperatures for outdoor activities."
            },
            {
                "reason": "Historical Sites",
                "details": "Visit Tirana's historical sites like the Clock Tower, Et'hem Bey Mosque, and Skanderbeg Square in pleasant weather with fewer crowds than summer months."
            },
            {
                "reason": "Local Markets",
                "details": "Spring brings fresh produce to the New Bazaar and traditional markets, offering visitors a chance to experience authentic Albanian food culture and local life."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "April Showers",
                "details": "April in Tirana can bring occasional rain showers, though they're usually brief. Visitors should carry a light raincoat or umbrella and be prepared for variable weather conditions."
            },
            {
                "reason": "Spring Festivals",
                "details": "Spring festivals and celebrations can attract more visitors to popular sites, potentially leading to slightly higher crowds at major attractions and restaurants."
            },
            {
                "reason": "Variable Temperatures",
                "details": "While generally pleasant, temperatures can fluctuate between morning and evening, requiring visitors to dress in layers and be prepared for changing conditions throughout the day."
            }
        ],
        "first_half": {
            "date_range": "2025-04-01/2025-04-15",
            "weather": {
                "average_temperature": {
                    "high_celsius": 16,
                    "low_celsius": 8
                },
                "humidity_percent": 68,
                "wind_speed_kmh": 9,
                "precipitation": "April in Tirana sees moderate rainfall with about 8 rainy days. Showers are usually light and brief, with plenty of sunny intervals.",
                "general_tips": "Pack a lightweight raincoat or umbrella and wear layers to adjust to morning and evening temperature changes. Comfortable walking shoes are essential.",
                "sunrise": "06:00",
                "sunset": "19:00"
            },
            "tourism_level": {
                "crowds": "Tourist numbers are moderate, with locals and visitors enjoying the spring atmosphere. Popular sites like Mount Dajti and Skanderbeg Square see increased activity.",
                "pricing": "Prices for accommodations and activities are moderate, with good value compared to peak summer months. Spring deals are often available.",
                "overall_atmosphere": "The city feels vibrant and welcoming, with locals and tourists enjoying outdoor spaces, café culture, and spring celebrations.",
                "wait_time_minutes": {
                    "national_museum": 10,
                    "ethem_bey_mosque": 15,
                    "mount_dajti_cable_car": 20
                },
                "public_transport_crowding": "Moderate, with increased activity during spring festivals"
            },
            "events_holidays": [
                {
                    "name": "Spring Festival",
                    "date": "Throughout April",
                    "description": "City-wide spring celebrations with cultural performances, outdoor concerts in parks, and special exhibitions at museums and galleries.",
                    "notes": "Check local event calendars for specific dates and locations. Many events are free and family-friendly.",
                    "website": "https://tirana.al/en/events",
                    "category": "Cultural Festival",
                    "accessibility": "Most events are family-friendly and accessible."
                },
                {
                    "name": "Nowruz Celebrations",
                    "date": "March 21st (continues into April)",
                    "description": "Persian New Year celebrations, particularly vibrant in the Blloku district with special cultural events, traditional music, and festive atmosphere.",
                    "notes": "Experience unique cultural traditions and enjoy special spring-themed menus at local restaurants.",
                    "website": "https://tirana.al/en/culture",
                    "category": "Cultural Celebration",
                    "accessibility": "Family-friendly celebrations with cultural activities."
                }
            ],
            "local_foods_in_season": ["Fresh Spring Vegetables", "Local Herbs", "Spring Lamb", "Fresh Cheese", "Wild Greens", "Local Honey"]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "10°C"
                },
                "precipitation": "Rain becomes less frequent, with more sunny days and pleasant spring weather perfect for outdoor activities.",
                "general_tips": "Continue to dress in layers as temperatures can vary. Perfect weather for extended sightseeing and outdoor dining."
            },
            "tourism_level": {
                "crowds": "Tourist numbers increase as spring progresses, but it's still less crowded than peak summer months. Popular outdoor areas become more active.",
                "pricing": "Prices remain moderate, with some seasonal increases as spring tourism picks up. Good value compared to summer peak season.",
                "overall_atmosphere": "The atmosphere is vibrant and energetic, with outdoor markets, street performers, and spring celebrations creating a lively city environment."
            },
            "events_holidays": [
                {
                    "name": "Outdoor Art Exhibitions",
                    "date": "Late April",
                    "description": "Spring art exhibitions and installations appear throughout the city, particularly in Grand Park and around Skanderbeg Square.",
                    "notes": "Many exhibitions are free and offer unique perspectives on Albanian contemporary art and culture."
                },
                {
                    "name": "Spring Market Season",
                    "date": "Throughout April",
                    "description": "Traditional markets and bazaars come alive with spring produce, local crafts, and seasonal specialties.",
                    "notes": "Visit the New Bazaar for authentic local experiences and fresh seasonal foods. Perfect for cultural immersion."
                }
            ]
        }
    }
}