{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing in Kungsträdgården",
                "type": "Nature/Social",
                "description": "Witness the stunning bloom of dozens of Japanese cherry trees in Kungsträdgården park. A beloved sign of spring, attracting many locals and tourists for photos and relaxation under the pink canopy.",
                "indoor": false,
                "best_time": "Mid-late April (daytime)",
                "price_range": "Free",
                "seasonal_notes": "The blooming period is short (1-2 weeks) and weather-dependent. Check local reports or webcams for peak bloom. Other spots include Bysistorget and Luma Hammarby Sjöstad.",
                "booking_tips": "No booking needed. The park gets very crowded during peak bloom, especially on sunny weekends. Visit on a weekday or early/late for a calmer experience. Grab a coffee from a nearby cafe."
            },
            {
                "name": "Walpurgis Night (Valborgsmässoafton) Celebrations",
                "type": "Cultural Festival/Community Event",
                "description": "Welcome spring with traditional celebrations on April 30th. Includes large bonfires ('majbrasor'), choral singing (traditional spring songs), speeches, and often fireworks or student festivities.",
                "indoor": false,
                "best_time": "Evening (April 30th)",
                "price_range": "Free (Public events)",
                "seasonal_notes": "A major Swedish tradition marking the end of winter. Skansen offers one of the largest and most traditional celebrations with views over Stockholm.",
                "booking_tips": "Check local listings for bonfire locations (Skansen, Riddarholmen, local parks). Arrive early for good viewing spots, especially at Skansen. Dress warmly as evenings can still be chilly."
            },
            {
                "name": "Explore Djurgården Parks and Museums",
                "type": "Nature/Cultural",
                "description": "Stroll or cycle through the Royal Djurgården park as nature awakens. Visit museums like the Vasa Museum, Skansen Open-Air Museum, or ABBA The Museum before the peak summer crowds arrive.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Park)/Moderate-Expensive (Museums)",
                "seasonal_notes": "Spring offers pleasant weather for walking/cycling. See blooming flowers in Rosendals Trädgård. Check museum opening hours.",
                "booking_tips": "Rent a bike near Djurgården bridge. Consider purchasing museum tickets online in advance, especially for ABBA The Museum. Cafes in the park start opening their outdoor seating."
            },
            {
                "name": "Outdoor 'Fika' Season Begins",
                "type": "Leisure/Social",
                "description": "Enjoy the quintessential Swedish coffee break ('fika') outdoors as cafes across the city reopen their terraces ('uteserveringar'). Soak up the spring sun with coffee and pastries.",
                "indoor": false,
                "best_time": "Daytime (when sunny)",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "A cherished sign of spring. Popular spots can get busy on sunny afternoons and weekends. Blankets are often provided if it's still a bit cool.",
                "booking_tips": "Explore different neighborhoods (Gamla Stan, Södermalm, Östermalm) for various cafe vibes. No booking usually needed, just find a free table."
            },
            {
                "name": "Stockholm Culture Night (Kulturnatt)",
                "type": "Cultural Event",
                "description": "Experience a night of free cultural events across Stockholm. Museums, galleries, theaters, libraries, and other venues open their doors late with special programs, workshops, music, and performances.",
                "indoor": true,
                "best_time": "Evening (One specific Saturday in late April)",
                "price_range": "Free",
                "seasonal_notes": "A very popular event showcasing Stockholm's diverse cultural scene. Expect crowds at major venues.",
                "booking_tips": "Check the official Kulturnatt website for the program and map closer to the date. Plan your route in advance as there's a lot to see. Public transport often runs later."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Midsummer Celebrations",
                "type": "Cultural Festival/Holiday",
                "description": "Experience one of Sweden's most important traditions around the summer solstice (closest Friday). Involves dancing around a maypole ('midsommarstång'), wearing flower wreaths, eating pickled herring, strawberries, and new potatoes, singing drinking songs ('snapsvisor').",
                "indoor": false,
                "best_time": "Midsummer's Eve (Friday between June 19-25)",
                "price_range": "Free (Public events)/Moderate (Organized events/Transport)",
                "seasonal_notes": "Most Swedes leave the city for the countryside or archipelago. Skansen offers the most traditional public celebration in Stockholm.",
                "booking_tips": "Book accommodation/transport well in advance if traveling to the archipelago (e.g., Vaxholm, Grinda, Sandhamn). For Skansen, arrive early. Note that many shops and some attractions in central Stockholm close for Midsummer's Eve/Day."
            },
            {
                "name": "Archipelago Exploration (Skärgården)",
                "type": "Nature/Boating/Leisure",
                "description": "Discover Stockholm's unique archipelago with its 30,000 islands. Take ferries (Waxholmsbolaget, Cinderella Båtar) to islands like Fjäderholmarna (closest), Vaxholm (historic town), Grinda (family-friendly), or Sandhamn (outer archipelago vibe). Swim, hike, kayak, sunbathe, or enjoy seafood.",
                "indoor": false,
                "best_time": "Daytime (June-August)",
                "price_range": "Moderate (Ferry tickets + activities/food)",
                "seasonal_notes": "Peak season for the archipelago. Ferries run frequently. Water is warmest for swimming in July/August.",
                "booking_tips": "Check ferry timetables (Waxholmsbolaget, Strömma/Cinderella). Pre-booking recommended for Cinderella boats. Buy Waxholmsbolaget tickets onboard or use SL period pass during off-peak months. Consider overnight stays on islands like Utö or Finnhamn."
            },
            {
                "name": "Outdoor Swimming and Sunbathing",
                "type": "Leisure/Recreation",
                "description": "Cool off and enjoy the long summer days at Stockholm's numerous swimming spots ('badplatser'). Options range from city-center spots like Långholmen beach to lake beaches (Hellasgården) or rocky archipelago cliffs.",
                "indoor": false,
                "best_time": "Daytime (Warm sunny days, June-August)",
                "price_range": "Free",
                "seasonal_notes": "Water temperatures vary but are usually pleasant for swimming in July/August. Can get crowded on hot days.",
                "booking_tips": "Check water quality reports if concerned. Popular spots include Smedsuddsbadet, Fredhällsbadet (cliffs), Brunnsviksbadet. Bring your own towel and snacks."
            },
            {
                "name": "Park Life and Picnics",
                "type": "Leisure/Social",
                "description": "Join Stockholmers in relaxing, picnicking, playing games (like 'kubb'), and socializing in the city's many parks, such as Djurgården, Hagaparken, Tantolunden, or Vasaparken.",
                "indoor": false,
                "best_time": "Daytime/Early Evening (May-August)",
                "price_range": "Free (Budget for picnic supplies)",
                "seasonal_notes": "Long daylight hours allow for extended park enjoyment. Disposable grills ('engångsgrill') are popular but check park regulations.",
                "booking_tips": "Grab picnic items from local supermarkets or food halls (like Östermalms Saluhall). Find a spot away from the main paths for more peace. Enjoy the relaxed summer atmosphere."
            },
            {
                "name": "Outdoor Concerts and Festivals",
                "type": "Music/Entertainment",
                "description": "Enjoy Stockholm's vibrant summer music scene with numerous outdoor concerts and festivals. Venues like Gröna Lund amusement park host regular concerts, and various festivals pop up in parks or dedicated areas.",
                "indoor": false,
                "best_time": "Evenings (June-August)",
                "price_range": "Moderate/Expensive (Depending on event)",
                "seasonal_notes": "Check specific event calendars (e.g., Visit Stockholm, Live Nation Sweden) for schedules and lineups.",
                "booking_tips": "Book tickets well in advance for popular artists or festivals. Consider transport options as venues might be outside the immediate center."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Admire Autumn Colors (Höstfärger)",
                "type": "Nature/Walking",
                "description": "Experience the beauty of Stockholm as the leaves change color. Stroll through parks like Djurgården, Hagaparken, or the Woodland Cemetery (Skogskyrkogården - UNESCO site) to see vibrant yellow, orange, and red foliage.",
                "indoor": false,
                "best_time": "Daytime (Late September - October)",
                "price_range": "Free",
                "seasonal_notes": "Peak color intensity varies each year depending on weather. Air is crisp and pleasant for walking before winter arrives.",
                "booking_tips": "Wear comfortable shoes. Bring a camera. Combine with a 'fika' stop at a cozy cafe."
            },
            {
                "name": "Visit Museums Comfortably",
                "type": "Cultural/Historical",
                "description": "Explore Stockholm's world-class museums like the Vasa Museum, Fotografiska (Photography), Nationalmuseum (Art & Design), Nordiska Museet (Cultural History), or Historiska Museet (History) with fewer crowds than summer.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Ideal season for indoor cultural activities as the weather cools. Check opening hours as winter schedules might start late autumn.",
                "booking_tips": "Consider purchasing tickets online. Allocate ample time for larger museums. Fotografiska often has popular temporary exhibitions and great views from its cafe/restaurant."
            },
            {
                "name": "Archipelago Trips in Calmer Season",
                "type": "Nature/Boating",
                "description": "Experience the archipelago's different character in autumn. Enjoy brisk air, dramatic scenery, and fewer visitors. Ferries run less frequently than summer but still serve main islands like Vaxholm or Grinda.",
                "indoor": false,
                "best_time": "Daytime (September - early October)",
                "price_range": "Moderate (Ferry tickets)",
                "seasonal_notes": "Bring warm clothing and waterproofs. Some island restaurants/shops may have reduced hours or be closed.",
                "booking_tips": "Check Waxholmsbolaget timetables carefully for autumn schedules. Consider shorter trips or islands closer to the city. Enjoy the tranquility."
            },
            {
                "name": "Mushroom and Berry Foraging (with caution)",
                "type": "Nature/Food",
                "description": "Head into the forests around Stockholm (like Tyresta National Park or Nacka Nature Reserve) to forage for wild mushrooms (chanterelles, porcini) and berries (lingonberries, blueberries).",
                "indoor": false,
                "best_time": "Daytime (Late August - October)",
                "price_range": "Free (if going alone)/Moderate (Guided tours)",
                "seasonal_notes": "Requires expert knowledge to distinguish edible from poisonous mushrooms. Berries are easier but respect nature.",
                "booking_tips": "HIGHLY recommend joining a guided foraging tour if you lack expertise, especially for mushrooms. Wear sturdy boots and appropriate clothing. Bring baskets/containers."
            },
            {
                "name": "Stockholm International Film Festival",
                "type": "Film/Cultural Event",
                "description": "Attend screenings and events during one of Europe's leading film festivals, showcasing innovative films from around the world across various cinemas in Stockholm.",
                "indoor": true,
                "best_time": "Evenings (Typically early-mid November)",
                "price_range": "Moderate (Tickets per screening/Festival pass)",
                "seasonal_notes": "A major cultural event attracting film lovers. Features premieres, director Q&As, and special programs.",
                "booking_tips": "Check the official festival website for the program schedule and ticket sales. Book tickets for popular films in advance online. Consider a festival pass if attending multiple screenings."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Visit Christmas Markets (Julmarknader)",
                "type": "Shopping/Cultural/Festive",
                "description": "Get into the festive spirit at traditional Christmas markets. Popular options include Gamla Stan (Old Town - historic, crafts, food), Skansen (traditional, family-friendly, includes park entry), and Kungsträdgården (often student-run JA market). Enjoy 'glögg' (mulled wine) and 'pepparkakor' (gingerbread).",
                "indoor": false,
                "best_time": "Late November - December (Check specific dates/hours)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases)",
                "seasonal_notes": "Atmospheric way to experience Swedish Christmas traditions and buy unique gifts. Can get crowded, especially weekends.",
                "booking_tips": "Dress warmly! Check opening dates and times for each market as they vary. Bring cash as not all stalls may accept cards."
            },
            {
                "name": "Ice Skating",
                "type": "Sport/Recreation",
                "description": "Enjoy ice skating at outdoor rinks like Kungsträdgården (central, skate rental available) or Vasaparken. If conditions permit and you have experience/guidance, try skating on natural ice on lakes like Trekanten or in the archipelago.",
                "indoor": false,
                "best_time": "Daytime/Evening (December - March, weather permitting)",
                "price_range": "Free (Entry to public rinks)/Budget (Skate rental)",
                "seasonal_notes": "Natural ice skating requires safety precautions and knowledge; joining guided tours (e.g., Green Trails, Stockholm Adventures) is highly recommended for beginners.",
                "booking_tips": "Check if rinks are open (weather dependent). Skate rental available at Kungsträdgården. For natural ice, always check ice conditions ('isr rapporter') and never skate alone unless experienced."
            },
            {
                "name": "Lucia Celebrations",
                "type": "Cultural/Music/Religious",
                "description": "Witness the beautiful Lucia tradition on December 13th. Features processions led by 'Lucia' wearing a crown of candles, accompanied by attendants singing traditional songs. Concerts held in churches (like Storkyrkan, Seglora Kyrka at Skansen) and other venues.",
                "indoor": true,
                "best_time": "Morning/Evening (December 13th, some concerts on nearby dates)",
                "price_range": "Moderate/Expensive (Concert tickets)",
                "seasonal_notes": "A cherished Swedish tradition symbolizing light in the winter darkness. Often accompanied by 'lussekatter' (saffron buns) and 'glögg'.",
                "booking_tips": "Book tickets for popular church concerts well in advance as they sell out quickly. Smaller, free processions might occur in schools or workplaces, but public concerts are the main way for visitors to experience it."
            },
            {
                "name": "Enjoy Cozy Cafes and 'Fika'",
                "type": "Leisure/Social/Food",
                "description": "Escape the cold and embrace Swedish 'mys' (coziness) with a 'fika' in a warm cafe. Enjoy coffee, tea, hot chocolate, and traditional pastries like cinnamon buns ('kanelbullar') or cardamom buns ('kardemummabullar').",
                "indoor": true,
                "best_time": "Anytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Perfect way to warm up and relax during darker winter days. Look for cafes with candles and comfortable seating.",
                "booking_tips": "Classic spots include Vete-Katten (traditional), Drop Coffee (specialty), Fabrique (buns). Many cafes in Gamla Stan offer historic ambiance."
            },
            {
                "name": "Winter Bathing and Sauna (Kallbad & Bastu)",
                "type": "Wellness/Recreation",
                "description": "Experience the invigorating Swedish tradition of winter swimming followed by a hot sauna. Several facilities around Stockholm offer this, like Hellasgården or dedicated sauna rafts ('bastuflotte').",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate (Entry fees/booking)",
                "seasonal_notes": "Said to have health benefits. Not for the faint-hearted! Requires quick immersion in icy water.",
                "booking_tips": "Book sauna sessions in advance, especially for popular spots or sauna rafts (e.g., Stockholmsbastuflotte). Bring swimwear and two towels. Follow local etiquette."
            }
        ]
    }
}