{
    "sites": [
      {
        "name": "Vasa Museum",
        "type": "Museum",
        "description": "Houses the remarkably preserved 17th-century warship Vasa, which sank on its maiden voyage in 1628. It's the world's best-preserved ship from this era, adorned with intricate sculptures. Exhibitions detail its history, salvage, and life aboard.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round. Can get very busy, especially during summer. Consider visiting early or late. Indoor, climate-controlled.",
        "booking_tips": "Buy tickets online in advance to potentially skip lines, especially during peak season. Allow 2-3 hours. Audio guides available in many languages. Located on Djurgården island.",
        "ratings": {
          "cost_estimate": 20,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 5
        },
        "latitude": 59.3280,
        "longitude": 18.0910
      },
      {
        "name": "Gamla Stan (Old Town)",
        "type": "Historic District",
        "description": "Stockholm's well-preserved medieval city center, dating back to the 13th century. Features cobblestone streets, narrow alleys, colorful buildings, the Royal Palace, Stockholm Cathedral (Storkyrkan), and the Nobel Prize Museum. Full of cafes, restaurants, tourist shops, and boutiques.",
        "indoor": false,
        "best_time": "Anytime",
        "price_range": "Free",
        "seasonal_notes": "Beautiful year-round. Lively atmosphere, especially in summer. Christmas markets in winter are popular. Can be very crowded.",
        "booking_tips": "Free to wander. Best explored on foot. Wear comfortable shoes. Ideal for soaking up history, shopping for souvenirs, and 'fika' (Swedish coffee break). Be aware of tourist prices in some establishments.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3.0,
          "cultural_significance": 5
        },
        "latitude": 59.3256,
        "longitude": 18.0719
      },
      {
        "name": "Skansen",
        "type": "Museum",
        "description": "The world's oldest open-air museum, showcasing Swedish life, traditions, and architecture from different parts of the country across five centuries. Includes historical buildings, workshops with craftspeople, a zoo featuring Nordic animals (bears, wolves, elk), and an aquarium.",
        "indoor": false,
        "best_time": "Daytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round, but some attractions/buildings might have reduced hours in winter. Offers seasonal events like Midsummer celebrations and Christmas markets. Requires significant walking.",
        "booking_tips": "Buy tickets online. Allow at least 3-4 hours, potentially a full day. Check the daily schedule for demonstrations and activities. Located on Djurgården island.",
        "ratings": {
          "cost_estimate": 25,
          "suggested_duration_hours": 4.0,
          "cultural_significance": 4
        },
        "latitude": 59.3275,
        "longitude": 18.1040
      },
      {
        "name": "Royal Palace (Kungliga slottet)",
        "type": "Government Building",
        "description": "The official residence of the Swedish monarch, located in Gamla Stan. One of Europe's largest palaces, with over 600 rooms. Visitors can explore the Royal Apartments, the Treasury (housing crown jewels), the Tre Kronor Museum (medieval palace history), and Gustav III's Museum of Antiquities. Witness the daily Changing of the Guard ceremony.",
        "indoor": true,
        "best_time": "Daytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round, though parts may close for official functions. Changing of the Guard happens daily (more elaborate parade in summer).",
        "booking_tips": "Purchase tickets covering desired sections (combination tickets available). Allow 2-3 hours for main areas. Check timings for Changing of the Guard online. Located at the edge of Gamla Stan.",
        "ratings": {
          "cost_estimate": 18,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 59.3268,
        "longitude": 18.0717
      },
      {
        "name": "ABBA The Museum",
        "type": "Museum",
        "description": "An interactive museum dedicated to the iconic Swedish pop group ABBA. Features their costumes, gold records, memorabilia, and immersive exhibits where visitors can sing, dance, mix music, and virtually try on costumes. Part of the Pop House complex.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "High",
        "seasonal_notes": "Open year-round. Consistently popular.",
        "booking_tips": "Booking timed-entry tickets online is highly recommended, often essential. Allow 1.5-2 hours. Located on Djurgården island.",
        "ratings": {
          "cost_estimate": 28,
          "suggested_duration_hours": 2.0,
          "cultural_significance": 3
        },
        "latitude": 59.3250,
        "longitude": 18.0964
      },
      {
        "name": "Fotografiska",
        "type": "Museum",
        "description": "One of the world's largest centers for contemporary photography, housed in a former customs building. Features rotating exhibitions by renowned international and Swedish photographers, covering various genres. Also includes a top-floor restaurant/bar with stunning city views, a cafe, and a shop.",
        "indoor": true,
        "best_time": "Anytime (Evening for bar)",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round, often with late evening hours.",
        "booking_tips": "Buy tickets online or at the door. Check current exhibitions online. Allow 2-3 hours for exhibits. Restaurant booking is often necessary. Located on Södermalm's waterfront.",
        "ratings": {
          "cost_estimate": 19,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 59.3199,
        "longitude": 18.0775
      },
      {
        "name": "Stockholm City Hall (Stadshuset)",
        "type": "Government Building",
        "description": "Iconic red-brick building known for hosting the Nobel Prize banquet in its Blue Hall (Blå hallen) and Golden Hall (Gyllene Salen) adorned with mosaics. Features a distinctive tower offering panoramic city views (seasonal access). Guided tours are the primary way to see the main halls.",
        "indoor": true,
        "best_time": "Daytime (Tower in Summer)",
        "price_range": "Moderate",
        "seasonal_notes": "Tours run year-round. Tower climb is usually available May-September and requires a separate ticket (limited availability, no elevator).",
        "booking_tips": "Access to main halls is typically by guided tour only; check tour times and languages online. Book tower tickets in advance during peak season. Allow 1 hour for the tour, plus extra for the tower.",
        "ratings": {
          "cost_estimate": 14,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 59.3275,
        "longitude": 18.0547
      },
      {
        "name": "Djurgården Island",
        "type": "Park",
        "description": "A tranquil green island oasis in central Stockholm, easily accessible by ferry, tram, or bus. Home to many top attractions including the Vasa Museum, Skansen, ABBA The Museum, Gröna Lund amusement park, and Nordiska museet. Offers beautiful walking paths, gardens, and waterfront views.",
        "indoor": false,
        "best_time": "Daytime",
        "price_range": "Free",
        "seasonal_notes": "Beautiful year-round, busiest in summer. Ideal for walking and cycling. Some attractions are seasonal (e.g., Gröna Lund).",
        "booking_tips": "Free to access the island itself. Plan transportation (ferry from Slussen/Gamla Stan or tram #7). Can easily spend a full day visiting multiple attractions here. Renting bikes is a popular option.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 4.0,
          "cultural_significance": 3
        },
        "latitude": 59.3260,
        "longitude": 18.1000
      },
      {
        "name": "Nordiska museet (Nordic Museum)",
        "type": "Museum",
        "description": "Sweden's largest museum of cultural history, dedicated to Swedish life and traditions from the 16th century to the present day. Covers fashion, textiles, furniture, homes, folk art, and Sami culture within an impressive building.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round. Impressive building, often less crowded than Vasa Museum. Good restaurant and shop.",
        "booking_tips": "Buy tickets online or at entrance. Allow 2-3 hours. Audio guides available. Located on Djurgården island, near Vasa Museum.",
        "ratings": {
          "cost_estimate": 17,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 59.3292,
        "longitude": 18.0933
      },
      {
        "name": "Gröna Lund",
        "type": "Entertainment District",
        "description": "Stockholm's central amusement park, offering a mix of roller coasters, thrill rides, family attractions, games, and concerts. Located on the waterfront of Djurgården.",
        "indoor": false,
        "best_time": "Afternoon/Evening",
        "price_range": "High",
        "seasonal_notes": "Open seasonally (approx. late April to September, plus special events like Halloween). Check opening hours and concert schedule online. Can be very busy, especially on concert nights and weekends.",
        "booking_tips": "Buy entrance tickets and ride passes online in advance, especially for specific dates or concerts. Ride passes ('Åkband') are separate from entrance. Expect queues for popular rides.",
        "ratings": {
          "cost_estimate": 35,
          "suggested_duration_hours": 4.0,
          "cultural_significance": 2
        },
        "latitude": 59.3233,
        "longitude": 18.0967
      },
      {
        "name": "Stockholm Cathedral (Storkyrkan)",
        "type": "Cathedral",
        "description": "Stockholm's oldest church, located in Gamla Stan next to the Royal Palace. Site of royal coronations, weddings, and christenings. Features notable artworks including the St. George and the Dragon sculpture.",
        "indoor": true,
        "best_time": "Daytime",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round, but may close for services or events. Check website for visitor hours.",
        "booking_tips": "Small entrance fee often applies (sometimes free). Allow 30-60 minutes. Check for organ concerts or special services.",
        "ratings": {
          "cost_estimate": 6,
          "suggested_duration_hours": 0.75,
          "cultural_significance": 4
        },
        "latitude": 59.3258,
        "longitude": 18.0704
      },
      {
        "name": "Nobel Prize Museum",
        "type": "Museum",
        "description": "Located in Gamla Stan's Stortorget square, this museum showcases the Nobel Prize, its laureates, and founder Alfred Nobel. Features exhibitions on groundbreaking discoveries and contributions to humanity.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round, check website for hours (often closed Mondays). Offers guided tours and Friday night events.",
        "booking_tips": "Buy tickets online or at entrance. Allow 1.5-2 hours. Audio guides available. Bistro Nobel serves the famous Nobel ice cream.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 59.3246,
        "longitude": 18.0714
      },
      {
        "name": "Moderna Museet",
        "type": "Museum",
        "description": "Sweden's premier museum of modern and contemporary art, located on the island of Skeppsholmen. Houses an extensive collection of works by artists like Picasso, Dalí, Matisse, and Warhol, along with Swedish artists. The museum building itself, designed by Spanish architect Rafael Moneo, is also noteworthy.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round. The museum restaurant offers beautiful views over Djurgården and Stockholm harbor.",
        "booking_tips": "Allow 2-3 hours. Check website for current exhibitions. Located a short walk from Kungsträdgården, across a bridge to Skeppsholmen island.",
        "ratings": {
          "cost_estimate": 16,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 59.3263,
        "longitude": 18.0840
      },
      {
        "name": "Drottningholm Palace",
        "type": "Landmark",
        "description": "The private residence of the Swedish royal family and a UNESCO World Heritage site. Built in the late 17th century, it's often called the 'Versailles of Sweden'. Features magnificent gardens, a unique court theater from the 18th century, and a Chinese Pavilion. Located on Lovön island in Lake Mälaren.",
        "indoor": true,
        "best_time": "Daytime",
        "price_range": "Moderate",
        "seasonal_notes": "Palace and gardens open year-round, but theater and pavilion have seasonal hours (typically May-September). Gardens particularly beautiful in summer.",
        "booking_tips": "Allow at least half a day, ideally a full day including travel time from central Stockholm. Boat trips available in summer (most scenic option), or bus year-round. Guided tours available for the palace.",
        "ratings": {
          "cost_estimate": 18,
          "suggested_duration_hours": 4.0,
          "cultural_significance": 5
        },
        "latitude": 59.3217,
        "longitude": 17.8865
      },
      {
        "name": "Monteliusvägen",
        "type": "Landmark",
        "description": "A scenic walking path along the northern edge of Södermalm offering spectacular panoramic views of central Stockholm, including Gamla Stan, City Hall, and Lake Mälaren. This 500-meter pathway is one of the most popular viewpoints for photography, especially during sunset.",
        "indoor": false,
        "best_time": "Sunset/Golden Hour",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round. Especially beautiful during sunset. Nearby Ivar Los Park offers additional viewpoints and picnic spots.",
        "booking_tips": "No booking required. Easily accessible from Slussen metro station with a short walk. Combine with other Södermalm attractions like Fotografiska or SoFo neighborhood.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 2
        },
        "latitude": 59.3236,
        "longitude": 18.0593
      },
      {
        "name": "Östermalms Saluhall",
        "type": "Market",
        "description": "Historic food hall from 1888 extensively renovated in 2020. Features high-quality food vendors selling fresh produce, meat, fish, cheese, baked goods, and delicacies. Several restaurants and cafes offer Swedish and international cuisine in a beautiful interior with red brick architecture and cast-iron details.",
        "indoor": true,
        "best_time": "Lunchtime",
        "price_range": "High",
        "seasonal_notes": "Open year-round. Food stalls open during daytime, restaurants often stay open into the evening.",
        "booking_tips": "Located in the upscale Östermalm district. No booking required for browsing, but restaurant reservations recommended for popular eateries. Combine with shopping on nearby Biblioteksgatan.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3
        },
        "latitude": 59.3353,
        "longitude": 18.0738
      },
      {
        "name": "Historiska Museet (Swedish History Museum)",
        "type": "Museum",
        "description": "Sweden's national historical museum covering the country's cultural history from prehistoric times to the present, with a particularly strong collection of Viking artifacts. Features the Gold Room with its treasure of gold objects, extensive medieval art, and exhibitions on Swedish cultural development.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round. Less crowded than many other Stockholm museums.",
        "booking_tips": "Located in Östermalm district. Allow 2-3 hours for a thorough visit. Good for families with interactive exhibits for children.",
        "ratings": {
          "cost_estimate": 14,
          "suggested_duration_hours": 2.0,
          "cultural_significance": 4
        },
        "latitude": 59.3344,
        "longitude": 18.0903
      },
      {
        "name": "Fjällgatan Viewpoint",
        "type": "Landmark",
        "description": "Historic street located on a cliff edge in Södermalm offering panoramic views of Stockholm, including Gamla Stan, Skeppsholmen, and Djurgården. The area around Fjällgatan features well-preserved wooden houses from the 1700s and several cafes and restaurants.",
        "indoor": false,
        "best_time": "Daytime",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round. Each season offers different views - summer for greenery, winter for snow-covered landscapes.",
        "booking_tips": "No booking required. Can be combined with Katarina Church or other Södermalm attractions. Several bus tours stop here.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 2
        },
        "latitude": 59.3184,
        "longitude": 18.0874
      },
      {
        "name": "Nationalmuseum",
        "type": "Museum",
        "description": "Sweden's premier art and design museum housing the country's largest collection of paintings, sculptures, and decorative arts from the Middle Ages to the early 20th century. Extensively renovated and reopened in 2018. Notable for its collection of Swedish and European masterpieces.",
        "indoor": true,
        "best_time": "Anytime",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round. Beautiful views from the museum restaurant overlooking the Royal Palace.",
        "booking_tips": "Located on Blasieholmen peninsula. Allow 2-3 hours. Check website for temporary exhibitions. Audio guides available in multiple languages.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 59.3290,
        "longitude": 18.0782
      },
      {
        "name": "Skeppsholmen Island",
        "type": "District",
        "description": "Small island in central Stockholm known for its cultural institutions and maritime history. Home to Moderna Museet, the Swedish Centre for Architecture and Design, and the af Chapman ship hostel. Offers lovely walking paths with views of the surrounding water and city.",
        "indoor": false,
        "best_time": "Daytime",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round. Summer offers outdoor cafes and events, including Stockholm Jazz Festival.",
        "booking_tips": "No booking required for island access. Easily walkable from Kungsträdgården across a bridge. Can be combined with visits to museums on the island.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2.0,
          "cultural_significance": 3
        },
        "latitude": 59.3261,
        "longitude": 18.0843
      },
      {
        "name": "Södermalm District",
        "type": "District",
        "description": "Trendy, bohemian island district south of Gamla Stan known for its alternative scene, vintage shops, hip cafes, and panoramic viewpoints. Areas like SoFo (South of Folkungagatan) are particularly known for independent boutiques, while streets like Götgatan offer mainstream shopping and entertainment.",
        "indoor": false,
        "best_time": "Daytime/Evening",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round. Summer brings lively outdoor seating at restaurants and cafes.",
        "booking_tips": "No booking required. Easily accessible via metro (stations include Slussen, Medborgarplatsen, and Mariatorget). Best explored on foot. Combine shopping with viewpoints like Monteliusvägen and Fjällgatan.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 4.0,
          "cultural_significance": 3
        },
        "latitude": 59.3150,
        "longitude": 18.0720
      }
    ]
  }