{
    "sites": [
      {
        "name": "Colosseum",
        "type": "Ancient Amphitheater",
        "description": "The Colosseum is an oval amphitheater in the center of Rome, built of travertine limestone, tuff, and brick-faced concrete. Completed in 80 AD, it could hold between 50,000-80,000 spectators and was used for gladiatorial contests, public spectacles, mock sea battles, animal hunts, executions, re-enactments of famous battles, and dramas based on Classical mythology. Today it stands as an iconic symbol of Imperial Rome and Roman engineering.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Less crowded during winter months except around Christmas and New Year. Early morning or late afternoon visits recommended during summer to avoid intense heat. Spring and fall offer pleasant temperatures and moderate crowds.",
        "booking_tips": "Online booking essential to avoid long lines. Consider combo tickets with Roman Forum and Palatine Hill. Book guided tours for better historical context.",
        "ratings": {
          "cost_estimate": 16,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 41.8902,
        "longitude": 12.4922
      },
      {
        "name": "Vatican Museums",
        "type": "Museum",
        "description": "The Vatican Museums contain one of the world's greatest art collections amassed by popes throughout the centuries. The museums include several masterpiece-filled exhibition halls leading to the Sistine Chapel with Michelangelo's famous ceiling frescoes. Notable collections include Egyptian antiquities, Etruscan artifacts, Renaissance paintings, and classical sculptures including the Apollo Belvedere and Laocoön Group.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Expensive",
        "seasonal_notes": "Extremely crowded during summer months and Catholic holidays. Winter offers lighter crowds except around Christmas. The museums are closed on Sundays except the last Sunday of each month when entry is free but exceptionally crowded.",
        "booking_tips": "Advance online booking essential. Early morning or late afternoon entry times recommended. Wednesday mornings can be busy due to papal audiences.",
        "ratings": {
          "cost_estimate": 25,
          "suggested_duration_hours": 3.5,
          "cultural_significance": 5
        },
        "latitude": 41.9065,
        "longitude": 12.4534
      },
      {
        "name": "St. Peter's Basilica",
        "type": "Church",
        "description": "The largest church in the world and the center of Catholicism, St. Peter's Basilica stands on the traditional site where Peter, the apostle and first pope, was buried. The current Renaissance structure was designed by Bramante, Michelangelo, Maderno, and Bernini. Highlights include Michelangelo's Pietà, Bernini's baldachin and Cathedra Petri, and the opportunity to climb to the dome for panoramic views of Rome.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Extremely crowded during major religious festivals and summer months. Closed Wednesday mornings during papal audiences. Dome climb not recommended during hot summer afternoons.",
        "booking_tips": "No booking required for basilica entry but security lines can be long. Modest dress required (no shorts, bare shoulders). Dome climb requires tickets purchased on-site.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 41.9022,
        "longitude": 12.4539
      },
      {
        "name": "Roman Forum",
        "type": "Archaeological Site",
        "description": "Once the heart of ancient Rome, the Forum was the center of Roman public life: the site of triumphal processions, elections, public speeches, criminal trials, and commercial affairs. Today, visitors can walk through the sprawling ruins of temples, basilicas, and government buildings where the empire was run, including the Temple of Saturn, Arch of Septimius Severus, and the Curia (senate house).",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Minimal shade makes summer visits challenging during midday heat. Spring and fall offer ideal conditions. Winter provides a more solitary experience with dramatic lighting for photography.",
        "booking_tips": "Included in combo ticket with Colosseum and Palatine Hill. Valid for 24 hours (sometimes extended to 48 hours). Audio guides or guided tours strongly recommended to understand the complex site.",
        "ratings": {
          "cost_estimate": 16,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 5
        },
        "latitude": 41.8925,
        "longitude": 12.4853
      },
      {
        "name": "Pantheon",
        "type": "Ancient Temple",
        "description": "This remarkably preserved ancient Roman temple, later converted to a church, was built by Emperor Hadrian around 126 AD. Its perfect proportions feature a rotunda with a magnificent concrete dome—still the world's largest unreinforced concrete dome. The oculus, a 30-foot opening at the dome's center, is the building's only light source and creates a moving spotlight effect throughout the day.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Especially magical during rainfall when water falls through the oculus to the slightly convex floor below. Pentecost Sunday features a spectacular 'rose petal shower' when red rose petals are dropped through the oculus, symbolizing the Holy Spirit's descent.",
        "booking_tips": "No booking required. Early morning visits recommended to avoid crowds. Now requires free weekend reservations during peak times.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 41.8986,
        "longitude": 12.4768
      },
      {
        "name": "Trevi Fountain",
        "type": "Fountain",
        "description": "Rome's largest and most famous Baroque fountain was designed by Nicola Salvi and completed in 1762. The dramatic 86-foot-high sculpture depicts Neptune's chariot being led by Tritons with sea horses. The tradition of throwing a coin into the fountain—right hand over left shoulder—is said to ensure a return to Rome. Approximately €3,000 is thrown into the fountain each day, collected for charity.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Beautifully illuminated at night year-round. Extremely crowded during daytime hours, especially in summer months. Early morning (before 8am) offers the best chance for less crowded photos.",
        "booking_tips": "No booking required. Visit late at night or early morning to avoid the largest crowds.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4
        },
        "latitude": 41.9009,
        "longitude": 12.4833
      },
      {
        "name": "Palatine Hill",
        "type": "Archaeological Site",
        "description": "The centermost of Rome's seven hills and one of the most ancient parts of the city. According to Roman mythology, the Palatine Hill was where Romulus and Remus were found by the she-wolf, and where Romulus founded the city. Later, it became the exclusive neighborhood where emperors and aristocrats built luxurious palaces. The ruins offer insights into imperial life and spectacular views over the Forum and Circus Maximus.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Offers more shade than the Forum, making it more comfortable for summer midday visits. The site's elevated position provides cooling breezes on hot days. Rose gardens are particularly beautiful in late spring.",
        "booking_tips": "Included in combo ticket with Colosseum and Roman Forum. Enter from Via di San Gregorio for potentially shorter lines than the main Forum entrance.",
        "ratings": {
          "cost_estimate": 16,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 41.8874,
        "longitude": 12.4886
      },
      {
        "name": "Spanish Steps",
        "type": "Landmark",
        "description": "This monumental stairway of 135 steps was built in the 18th century to connect the Bourbon Spanish Embassy to the Holy See with the Trinità dei Monti church above. At the base sits the early Baroque fountain, Fontana della Barcaccia ('Fountain of the Boat') by Pietro Bernini. The elegant staircase has inspired artists, poets, and filmmakers and remains a popular meeting place and people-watching spot.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Spectacular in spring when azaleas decorate the steps with pink and white blooms. Evening offers best lighting for photography and atmosphere. Sitting on the steps is now prohibited to preserve the monument.",
        "booking_tips": "No booking required. The area is surrounded by luxury shopping streets and is particularly busy on weekends and during sales seasons.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4
        },
        "latitude": 41.9058,
        "longitude": 12.4823
      },
      {
        "name": "Galleria Borghese",
        "type": "Museum",
        "description": "Housed in the former Villa Borghese Pinciana, this art gallery contains a substantial part of the Borghese collection of paintings, sculpture, and antiquities. Highlights include major works by Bernini, Caravaggio, Titian, and Raphael. The collection was assembled by Cardinal Scipione Borghese, nephew of Pope Paul V, in the early 17th century. The building itself is a masterpiece of Renaissance architecture set in beautiful gardens.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Temperature-controlled environment makes this a perfect retreat during summer heat or winter rain. The surrounding gardens are particularly beautiful in spring and fall.",
        "booking_tips": "Advance booking mandatory as entry is strictly limited to 360 people at a time with 2-hour time slots. Book weeks in advance during high season.",
        "ratings": {
          "cost_estimate": 20,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 41.9144,
        "longitude": 12.4924
      },
      {
        "name": "Piazza Navona",
        "type": "Square",
        "description": "Built on the site of the ancient Stadium of Domitian, this elongated square retains the oval shape of the original Roman arena. The Baroque showcase features three fountains, including Bernini's masterpiece Fontana dei Quattro Fiumi (Fountain of the Four Rivers) with its dramatic central obelisk. The square is surrounded by restaurants and Baroque palaces, including the Church of Sant'Agnese in Agone.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Lively throughout the year with street performers and artists. Christmas market fills the square in December. Outdoor dining is pleasant from spring through fall.",
        "booking_tips": "No booking required for the square. Restaurants on the piazza require reservations and charge premium prices; better value found on side streets.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 41.8992,
        "longitude": 12.4731
      },
      {
        "name": "Catacombs of San Callisto",
        "type": "Archaeological Site",
        "description": "The Catacombs of St. Callixtus are among the greatest and most important of Rome's underground cemeteries. Founded in the middle of the 2nd century and part of a burial complex covering 90 acres, they feature a network of galleries about 12 miles long on four levels. The burial chambers contain artistic pagan and Christian wall paintings, sculptures, and epigraphs that document the early centuries of Christianity.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Maintain a constant cool temperature year-round, making them a refreshing retreat during summer. Closed on Wednesdays and through part of January each year.",
        "booking_tips": "Tours run regularly throughout opening hours in multiple languages. No advance booking required for individuals, though larger groups should reserve. Not recommended for those with claustrophobia or mobility issues.",
        "ratings": {
          "cost_estimate": 10,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 41.8619,
        "longitude": 12.5132
      },
      {
        "name": "Castel Sant'Angelo",
        "type": "Castle",
        "description": "Originally built as a mausoleum for Emperor Hadrian in the 2nd century AD, this towering cylindrical building later served as a fortress, papal residence, and prison. Connected to the Vatican by the Passetto di Borgo, an elevated passageway that provided an escape route for popes during sieges. Today, the castle houses a museum with Renaissance apartments, military memorabilia, and superb views from its terrace.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "The rooftop terrace offers spectacular sunset views over Rome, especially in summer when the terrace café is open. The castle sometimes hosts special evening openings with concerts during summer months.",
        "booking_tips": "Online booking recommended to avoid lines. Last entry 1 hour before closing. Consider the Roma Pass for entry.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 41.9031,
        "longitude": 12.4663
      },
      {
        "name": "Capitoline Museums",
        "type": "Museum",
        "description": "Housed in two palaces designed by Michelangelo on the Capitoline Hill, these museums contain one of the world's oldest public collections of art and artifacts. Highlights include the original bronze statue of Marcus Aurelius, the Capitoline Wolf, the Dying Gaul, and an extensive collection of ancient Roman statuary and Renaissance art.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "The museums' central location makes them an ideal refuge during sudden rain showers. The square between the two palaces (Piazza del Campidoglio) offers panoramic views especially beautiful at sunset.",
        "booking_tips": "Online booking available to avoid ticket lines. The museums are often less crowded than other major Rome attractions. Free entry on the first Sunday of each month.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 41.8933,
        "longitude": 12.4829
      },
      {
        "name": "Trastevere",
        "type": "District",
        "description": "This charming medieval neighborhood across the Tiber river retains much of its working-class authenticity despite growing popularity. Narrow cobblestone streets are lined with ancient houses, traditional trattorias, craft shops, and lively squares. The district contains several important churches, including Santa Maria in Trastevere with its extraordinary golden mosaics, and was historically home to a large Jewish community.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Vibrant nightlife throughout the year, especially in summer when locals and visitors fill outdoor restaurants and bars. Sunday morning brings a large flea market at Porta Portese. Less crowded during winter months except around holidays.",
        "booking_tips": "No booking required for exploring. Restaurants require reservations for dinner, especially on weekends. Food tours and cooking classes in the area should be booked well in advance.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 4
        },
        "latitude": 41.8898,
        "longitude": 12.4673
      },
      {
        "name": "Galleria Nazionale d'Arte Moderna",
        "type": "Museum",
        "description": "Italy's national gallery of modern art contains the country's most important collection of 19th and 20th century paintings and sculptures. Located in the beautiful Villa Borghese park, the museum features works by Italian artists alongside international masterpieces by Cézanne, Monet, Van Gogh, Pollock, and others. The collection is particularly strong in Futurism, Metaphysical painting, and Italian modernism.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Less crowded than ancient sites year-round. The museum occasionally hosts evening events and temporary exhibitions. The surrounding park provides a pleasant setting for pre or post-visit strolls.",
        "booking_tips": "No advance booking required. Closed on Mondays. Combined tickets available with other state museums.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 41.9169,
        "longitude": 12.4825
      },
      {
        "name": "Baths of Caracalla",
        "type": "Archaeological Site",
        "description": "These massive public baths, built between 212-216 AD during the reign of Emperor Caracalla, could accommodate 1,600 bathers at one time. The complex included olympic-sized swimming pools, hot and cold rooms, gymnasiums, libraries, shops, and gardens. Today, the impressive ruins demonstrate the engineering and architectural sophistication of imperial Rome and occasionally serve as a spectacular venue for opera performances in summer.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Limited shade makes morning visits preferable during summer months. The site sometimes hosts summer opera performances by Teatro dell'Opera di Roma. Virtual reality tours offer an immersive reconstruction of the original baths.",
        "booking_tips": "Online booking recommended. Less crowded than more famous ancient sites. Opera performances require separate advance tickets.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 41.8790,
        "longitude": 12.4924
      },
      {
        "name": "Appian Way",
        "type": "Historical Road",
        "description": "One of the earliest and most important Roman roads, the Appian Way was begun in 312 BC and connected Rome to Brindisi in southeast Italy. The preserved section near Rome features ancient tombs, catacombs, and monuments along original Roman paving stones. The archaeological park includes notable sites such as the Tomb of Cecilia Metella, the Villa of the Quintilii, and the Circus of Maxentius.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Sunday is car-free, making it ideal for walking or cycling. Spring and fall offer pleasant temperatures and wildflowers. Summer mornings or evenings recommended to avoid midday heat on the exposed ancient road.",
        "booking_tips": "No booking required for general access. Bicycle rentals available near the start of the archaeological park. Some monuments along the route charge separate entrance fees.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 5
        },
        "latitude": 41.8519,
        "longitude": 12.5222
      },
      {
        "name": "Campo de' Fiori",
        "type": "Square",
        "description": "This lively square hosts a colorful market by day and transforms into a vibrant nightlife center by evening. The name means 'field of flowers,' referring to its origins as a meadow. At the center stands a statue of philosopher Giordano Bruno, who was executed here for heresy in 1600. The square is surrounded by restaurants and maintains a distinctly local atmosphere despite its popularity with visitors.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "The morning market operates Monday through Saturday, with the best selection of fresh produce early in the day. Especially lively on weekends when both locals and tourists fill the restaurants and bars around the square.",
        "booking_tips": "No booking required for the square or market. Restaurants around the square require reservations for dinner, especially on weekends.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 41.8954,
        "longitude": 12.4722
      },
      {
        "name": "Palazzo Doria Pamphilj",
        "type": "Museum",
        "description": "This opulent private palace on Via del Corso houses one of Rome's richest art collections still in the hands of the original family. The gallery contains masterpieces by Caravaggio, Raphael, Titian, Velázquez (including the famous portrait of Pope Innocent X), and Bernini. Visitors can explore lavishly decorated state apartments while an audio guide narrated by a family member provides intimate historical context.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round with consistent temperature control. One of Rome's lesser-known museums despite its extraordinary collection, making it less crowded even during peak tourist season.",
        "booking_tips": "No advance booking required. Audio guide included with admission is highly recommended for historical context.",
        "ratings": {
          "cost_estimate": 14,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 41.8986,
        "longitude": 12.4804
      },
      {
        "name": "Pasta alla Carbonara",
        "type": "Cultural Experience",
        "description": "This quintessential Roman dish consists of spaghetti with a creamy sauce of eggs, pecorino romano cheese, guanciale (cured pork jowl), and black pepper. Though relatively modern, carbonara has become emblematic of Roman cuisine. The dish's origins are debated, with theories connecting it to coal workers (carbonari) or to American soldiers who brought bacon and eggs to Italy after WWII.",
        "indoor": true,
        "best_time": "Evening",
        "price_range": "Moderate",
        "seasonal_notes": "Available year-round at traditional Roman trattorias. Taste varies between establishments, with some adhering strictly to traditional ingredients while others offer variations.",
        "booking_tips": "Reservations recommended for renowned restaurants serving authentic Roman cuisine, particularly for dinner. Look for establishments in Testaccio or Trastevere neighborhoods for traditional versions.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 41.8902,
        "longitude": 12.4756
      },
      {
        "name": "MAXXI - National Museum of 21st Century Arts",
        "type": "Museum",
        "description": "Designed by Zaha Hadid and opened in 2010, this cutting-edge museum is dedicated to contemporary creativity in art and architecture. The innovative building features flowing curved walls, suspended stairs, and open spaces that form an architectural work of art themselves. The collection includes works by prominent contemporary Italian and international artists, with regularly rotating exhibitions and installations.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "The museum's courtyard hosts outdoor installations and events during warmer months. Special exhibitions and programming change seasonally.",
        "booking_tips": "Online booking available but not essential except for special exhibitions. Closed on Mondays. Free entry every first Sunday of the month.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 41.9287,
        "longitude": 12.4663
      },
      {
        "name": "Basilica di Santa Maria Maggiore",
        "type": "Church",
        "description": "One of Rome's four major basilicas, renowned for its stunning mosaics, sacred relics, and rich history dating back to the 5th century.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Crowded during religious holidays and weekends. Mornings provide a quieter experience.",
        "booking_tips": "No booking required. Consider a guided tour for in-depth historical insights.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 41.9411,
        "longitude": 12.5113
      },
      {
        "name": "Basilica di San Clemente",
        "type": "Church / Archaeological Site",
        "description": "A multi-layered historical monument where a 12th-century basilica is built atop a 4th-century church and ancient Roman structures, offering a unique glimpse into Rome's layered past.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Typically quieter during weekdays. Avoid peak tourist hours for a more reflective experience.",
        "booking_tips": "Advance tickets recommended, especially during the tourist season.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 41.8886,
        "longitude": 12.4950
      },
      {
        "name": "Villa Borghese Gardens",
        "type": "Park",
        "description": "A sprawling urban park offering lush gardens, scenic lakes, and cultural attractions including art museums and a zoo, perfect for leisurely walks, picnics, and outdoor activities.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Most vibrant during spring and early autumn when flowers are in bloom. Summer evenings are pleasant for strolls.",
        "booking_tips": "No booking required for the park. Specific attractions within the park may require separate tickets.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 41.9109,
        "longitude": 12.4848
      },
      {
        "name": "Basilica di San Giovanni in Laterano",
        "type": "Church",
        "description": "The cathedral of Rome and the oldest public church in the city, renowned for its magnificent architecture, historical relics, and status as the ecclesiastical seat of the Bishop of Rome.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Often busy during major religious events. Early morning visits are recommended to enjoy a quieter atmosphere.",
        "booking_tips": "No booking required for entry, though guided tours are available for enhanced understanding of its rich history.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 41.8863,
        "longitude": 12.5033
      },
      {
        "name": "The Janiculum (Gianicolo Hill)",
        "type": "Scenic Viewpoint",
        "description": "A picturesque hill offering breathtaking panoramic views of Rome's skyline, dotted with monuments, statues, and lush gardens. Ideal for sunset watching and leisurely walks.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most beautiful during spring and autumn evenings when the city is bathed in golden light.",
        "booking_tips": "No booking required. Bring a camera for unforgettable sunset photos.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 41.8881,
        "longitude": 12.4663
      }
    ]
  }
  