{
    "Spring": {
        "activities": [
            {
                "name": "Sechseläuten (Sächsilüüte)",
                "type": "Cultural Festival/Tradition",
                "description": "Zurich's unique spring festival, celebrating the end of winter. Features parades by the city's guilds in historical costumes (Monday), a children's parade (Sunday), and culminates in the burning of the 'Böögg' (a snowman effigy) at 6 pm on Sechseläutenplatz. The time it takes for the Böögg's head to explode supposedly predicts the summer weather.",
                "indoor": false,
                "best_time": "Third weekend/Monday in April (check exact dates)",
                "price_range": "Free (Street viewing)",
                "seasonal_notes": "A major Zurich tradition. The city center, especially around Bahnhofstrasse, Limmatquai, and Sechseläutenplatz, gets very crowded, particularly on Monday afternoon/evening. Public transport is adjusted.",
                "booking_tips": "Arrive very early for good viewing spots for the parades and Böögg burning. No booking needed for street viewing. Some guild events might be private. Check the official Sechseläuten website for schedules and routes."
            },
            {
                "name": "Cherry Blossom Viewing",
                "type": "Nature/Social",
                "description": "Enjoy the arrival of spring with blooming cherry trees and magnolias in various parks and streets across Zurich, such as Rieterpark, Belvoirpark, or specific streets in residential areas like Kreis 6.",
                "indoor": false,
                "best_time": "Late March - April (daytime)",
                "price_range": "Free",
                "seasonal_notes": "Blooming period is short and weather-dependent. Local blogs or social media often share current blooming spots.",
                "booking_tips": "Explore different parks and neighborhoods. Ideal for photography and enjoying the pleasant spring weather."
            },
            {
                "name": "Zurich Marathon",
                "type": "Sporting Event",
                "description": "Cheer on runners or participate in the Zurich Marathon, which takes participants through the city center and along Lake Zurich.",
                "indoor": false,
                "best_time": "Mid-April (Specific date, morning)",
                "price_range": "Free (Spectating)/High (Participation fee)",
                "seasonal_notes": "Major running event causing some road closures in the city center and along the lake.",
                "booking_tips": "Check the official marathon website for route details, timings, and registration if participating. Find a good spot along the route to spectate."
            },
            {
                "name": "Outdoor Cafés and Lakeside Strolls",
                "type": "Leisure/Social",
                "description": "As the weather warms up, enjoy sitting outside at cafes in the Old Town (Altstadt) or along the lake promenade. Take relaxing walks along Lake Zurich, enjoying the views and budding nature.",
                "indoor": false,
                "best_time": "Daytime (sunny days)",
                "price_range": "Free (Strolling)/Budget-Moderate (Cafe)",
                "seasonal_notes": "Terraces ('Gartensitzplätze') start opening up. Lake promenades become popular again.",
                "booking_tips": "Explore areas like Niederdorf, Schipfe, or the lakefront near Bellevue or Bürkliplatz. No booking usually needed, but popular spots fill quickly."
            },
            {
                "name": "Easter Traditions ('Zwänzgerle')",
                "type": "Cultural Tradition/Family Event",
                "description": "Experience local Easter traditions, particularly 'Zwänzgerle' on Easter Monday in the Rüdenplatz (Old Town). Children challenge adults to break their decorated eggs with a 20 Rappen coin (Zwänzger); if the coin sticks, the adult wins the egg, otherwise, the child keeps the coin.",
                "indoor": false,
                "best_time": "Easter Monday morning",
                "price_range": "Free (Spectating)/Budget (Participation)",
                "seasonal_notes": "A charming, traditional game primarily for families. Public holiday, many shops closed.",
                "booking_tips": "Head to Rüdenplatz on Easter Monday morning to watch or participate. Bring hard-boiled eggs and coins if joining in."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Swimming in Lake Zurich & River Limmat ('Badis')",
                "type": "Leisure/Recreation",
                "description": "Cool off in designated swimming areas ('Badis') along Lake Zurich (e.g., Tiefenbrunnen, Mythenquai, Utoquai) or designated river swimming spots in the Limmat (e.g., Oberer Letten, Unterer Letten). Many offer sunbathing lawns, cafes, and changing facilities.",
                "indoor": false,
                "best_time": "Daytime (June-August, warm sunny days)",
                "price_range": "Free (Some river spots)/Budget-Moderate (Lake Badis entry)",
                "seasonal_notes": "Very popular local activity. Water quality is generally excellent. Lake Badis often have entry fees and specific opening hours.",
                "booking_tips": "Check opening hours and potential entry fees for specific Badis. Arrive early on hot weekends. River swimming requires caution due to currents."
            },
            {
                "name": "Street Parade",
                "type": "Music Festival/Parade",
                "description": "One of the world's largest techno and electronic music festivals. Features dozens of 'Love Mobiles' (decorated trucks with DJs), stages around the lake basin, and hundreds of thousands of colorfully dressed attendees dancing through the streets.",
                "indoor": false,
                "best_time": "Second Saturday in August (afternoon/evening)",
                "price_range": "Free (Street access)",
                "seasonal_notes": "Massive event attracting huge crowds. Expect loud music, packed streets, and adjusted public transport. City center around the lake is transformed.",
                "booking_tips": "Free to attend. Check the official Street Parade website for route, stage locations, and lineup. Plan transport carefully. Consider ear protection. Accommodation books up far in advance."
            },
            {
                "name": "Zürcher Theater Spektakel",
                "type": "Performing Arts Festival",
                "description": "An international festival for contemporary performing arts held at Landiwiese, a park on the shores of Lake Zurich. Features theatre, dance, circus, music performances, and installations from around the world in various tents and open-air stages.",
                "indoor": false,
                "best_time": "Mid-August to early September (Check specific dates/schedule)",
                "price_range": "Free (Festival grounds)/Moderate-High (Performance tickets)",
                "seasonal_notes": "Offers a relaxed, bohemian atmosphere with food stalls and bars alongside ticketed performances.",
                "booking_tips": "Book tickets for specific performances online in advance. The festival grounds are free to enter and enjoy the atmosphere. Accessible by public transport."
            },
            {
                "name": "Open-Air Cinemas (Openair Kinos)",
                "type": "Entertainment/Cinema",
                "description": "Enjoy movies under the stars at various open-air cinemas set up during the summer, often in scenic locations like by the lake (e.g., Allianz Cinema at Zürichhorn) or in courtyards.",
                "indoor": false,
                "best_time": "Evenings (July-August)",
                "price_range": "Moderate",
                "seasonal_notes": "Screenings usually start after sunset. Bring a blanket or jacket as evenings can cool down.",
                "booking_tips": "Check schedules and book tickets online in advance as popular movies sell out. Locations and specific cinemas vary yearly (Allianz Cinema is a staple)."
            },
            {
                "name": "Lake Zurich Boat Trips",
                "type": "Leisure/Sightseeing",
                "description": "Take a relaxing boat trip on Lake Zurich. Options range from short round trips near the city to longer cruises towards Rapperswil. Offers great views of the city skyline, shoreline villas, and the Alps.",
                "indoor": false,
                "best_time": "Daytime (May-September)",
                "price_range": "Moderate",
                "seasonal_notes": "Peak season for boat services (ZSG). Check timetables. Special evening or themed cruises might be available.",
                "booking_tips": "Tickets can be bought at the Bürkliplatz pier or sometimes covered by certain ZVV public transport passes (check zones). Choose trip length based on available time."
            },
            {
                "name": "Hiking on Uetliberg",
                "type": "Nature/Recreation",
                "description": "Take the S10 train up Zurich's local mountain, Uetliberg, for hiking and panoramic views. Various trails lead down towards the city or along the ridge (e.g., Planet Trail towards Felsenegg).",
                "indoor": false,
                "best_time": "Daytime (Clear weather)",
                "price_range": "Budget (Train ticket)",
                "seasonal_notes": "Forest trails offer shade. Cooler temperatures than in the city. Restaurants available at the top.",
                "booking_tips": "Wear appropriate footwear. Check train schedules (S10 from Hauptbahnhof). Combine with lunch or drinks at the top."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Zurich Film Festival (ZFF)",
                "type": "Film Festival/Cultural Event",
                "description": "An international film festival showcasing a wide range of debut films, documentaries, and gala premieres with appearances by filmmakers and actors. Screenings take place in various cinemas around the city center.",
                "indoor": true,
                "best_time": "Late September - Early October (Check exact dates)",
                "price_range": "Moderate-High (Per film ticket/Passes)",
                "seasonal_notes": "Major cultural event attracting international attention. Green carpet events often held at Sechseläutenplatz.",
                "booking_tips": "Check the festival program online and book tickets for desired screenings in advance. Passes might be available for multiple films."
            },
            {
                "name": "Expovina Wine Fair",
                "type": "Food & Drink Event",
                "description": "A unique wine fair held aboard multiple ships moored at Bürkliplatz on Lake Zurich. Offers the chance to taste hundreds of wines from Switzerland and around the world.",
                "indoor": true,
                "best_time": "Late October - Early November (Check exact dates/hours)",
                "price_range": "Moderate (Entry fee includes tasting)",
                "seasonal_notes": "Popular event, can get crowded, especially on evenings/weekends.",
                "booking_tips": "Buy tickets online or at the entrance. Plan your visit, perhaps focusing on specific regions or types of wine. Spittoons are available and encouraged for extensive tasting."
            },
            {
                "name": "'Knabenschiessen' Festival",
                "type": "Cultural Festival/Fair",
                "description": "Zurich's oldest public festival, held at Albisgütli shooting range. Originally a shooting contest for boys (now open to girls too), it features a large funfair ('Chilbi') with rides, food stalls, and market stands, attracting crowds of all ages.",
                "indoor": false,
                "best_time": "Second weekend in September (Saturday-Monday)",
                "price_range": "Free (Entry to grounds)/Moderate (Rides/Food)",
                "seasonal_notes": "The Monday is a local half-holiday. The shooting competition itself is the historical core, but the funfair is the main public draw.",
                "booking_tips": "Easily accessible by public transport (tram to Albisgütli). Can be very crowded, especially in the evenings. Enjoy the funfair atmosphere."
            },
            {
                "name": "Autumn Colors and Forest Walks",
                "type": "Nature/Walking",
                "description": "Enjoy the changing autumn leaves in Zurich's parks (Rieterpark, Belvoirpark) or take walks in nearby forests like on the slopes of Uetliberg or Zürichberg.",
                "indoor": false,
                "best_time": "Daytime (October)",
                "price_range": "Free",
                "seasonal_notes": "Peak foliage varies but is typically in October. Enjoy the crisp air and quieter trails.",
                "booking_tips": "Wear comfortable shoes. Check local forest trails maps. Combine with a visit to a viewpoint like Waid or Käferberg."
            },
            {
                "name": "Visit Museums",
                "type": "Cultural/Historical",
                "description": "As the weather cools, explore Zurich's diverse museums, such as the Kunsthaus (Art Museum), Landesmuseum (Swiss National Museum), Rietberg Museum (Non-European cultures), or FIFA Museum.",
                "indoor": true,
                "best_time": "Anytime (check opening hours)",
                "price_range": "Moderate",
                "seasonal_notes": "Good indoor activity for cooler or rainy days. Check for special autumn exhibitions.",
                "booking_tips": "Consider buying tickets online. Check opening hours as some museums close on Mondays. The Zurich Pass might offer discounts."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets (Weihnachtsmärkte)",
                "type": "Shopping/Cultural/Festive",
                "description": "Explore Zurich's various charming Christmas markets. Key locations include the large indoor market at the Main Train Station (Hauptbahnhof) with its Swarovski tree, the 'Wienachtsdorf' village market at Sechseläutenplatz (near Opera House), the romantic market in the Old Town (Niederdorf), and the market at Werdmühleplatz featuring the 'Singing Christmas Tree'.",
                "indoor": false,
                "best_time": "Late November - December 23/24 (Check specific dates/hours)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases/Food/Drinks)",
                "seasonal_notes": "Atmospheric with lights, decorations, stalls selling gifts, crafts, food (raclette, fondue), and mulled wine ('Glühwein'). Can be crowded, especially evenings/weekends.",
                "booking_tips": "Visit multiple markets as they have different vibes. Dress warmly. Weekday visits are less crowded. Check opening hours as they vary."
            },
            {
                "name": "'Singing Christmas Tree' Concerts",
                "type": "Music/Festive",
                "description": "Listen to various local choirs perform Christmas carols from a unique, tree-shaped tiered stage at the Werdmühleplatz Christmas market.",
                "indoor": false,
                "best_time": "Evenings during market season (Check specific performance times)",
                "price_range": "Free",
                "seasonal_notes": "A popular and charming part of the Werdmühleplatz market experience.",
                "booking_tips": "Check the performance schedule online or at the market. Arrive a bit early to get a good standing spot. Grab a Glühwein from a nearby stall."
            },
            {
                "name": "New Year's Eve Magic (Silvesterzauber)",
                "type": "Festival/Celebration",
                "description": "Zurich's large New Year's Eve celebration around the lake basin. Features food stalls, bars, music stages, and culminates in a spectacular fireworks display over Lake Zurich at midnight.",
                "indoor": false,
                "best_time": "Evening/Night (December 31st)",
                "price_range": "Free (Street access)",
                "seasonal_notes": "Major public event attracting hundreds of thousands. Expect very large crowds, especially near Bürkliplatz and Quaibrücke for the fireworks.",
                "booking_tips": "Arrive early for good fireworks viewing spots. Dress very warmly. Public transport runs on a special schedule. Book restaurants or parties well in advance if not celebrating outdoors."
            },
            {
                "name": "Ice Skating Rinks",
                "type": "Sport/Recreation",
                "description": "Enjoy ice skating at temporary rinks set up for the season, such as the one at the Dolder Sports complex (large outdoor rink) or potentially smaller rinks associated with Christmas markets or events.",
                "indoor": false,
                "best_time": "Daytime/Evening (Check opening hours, typically Nov-Feb/Mar)",
                "price_range": "Moderate (Entry + skate rental)",
                "seasonal_notes": "Opening depends on weather and specific venue schedules. Dolder rink offers scenic views.",
                "booking_tips": "Check opening times and prices for specific rinks. Wear warm clothing. Lessons might be available."
            },
            {
                "name": "Fondue Tram or Restaurants",
                "type": "Food/Cultural Experience",
                "description": "Indulge in a Swiss winter classic: cheese fondue. Enjoy it in a traditional restaurant in the Old Town or experience the unique Fondue Tram, which tours the city while you dine.",
                "indoor": true,
                "best_time": "Evening (October-March)",
                "price_range": "Moderate-High",
                "seasonal_notes": "Peak fondue season. Many restaurants offer it, some specializing in it.",
                "booking_tips": "Book the Fondue Tram well in advance as it's very popular. Reserve tables at desired fondue restaurants, especially on weekends."
            }
        ]
    }
}