{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather",
                "details": "April in Coimbra offers mild temperatures (averaging 18-20°C highs) ideal for exploring the historic university city, its gardens, and the riverside without the intense summer heat."
            },
            {
                "reason": "Blooming Gardens",
                "details": "Witness the stunning Botanical Garden of the University of Coimbra and the romantic Quinta das Lágrimas gardens come alive with spring blossoms."
            },
            {
                "reason": "Academic Atmosphere",
                "details": "Experience the unique atmosphere of one of the world's oldest universities. Students are back, adding vibrancy, but the major end-of-year stress hasn't fully set in yet."
            },
            {
                "reason": "Fewer Crowds & Shoulder Season Value",
                "details": "Enjoy Coimbra's main attractions like the University library and museums with fewer tourists compared to peak summer months. Accommodation prices may be more moderate."
            },
            {
                "reason": "Gateway to Central Portugal",
                "details": "Coimbra serves as an excellent base for exploring nearby historical sites like the Roman ruins of Conímbriga or the Schist Villages (Aldeias do Xisto)."
            },
            {
                "reason": "Easter & Freedom Day",
                "details": "Experience local Easter traditions if they fall in April, and observe Freedom Day (Dia da Liberdade) on April 25th, a national holiday with potential local events."
            },
            {
                "reason": "Start of 'Queima das Fitas' Buzz",
                "details": "While the main student festival 'Queima das Fitas' is typically in May, you might start seeing preparations and feel the anticipation building towards the end of April."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Weather & Rain Potential",
                "details": "April can be unpredictable. While often pleasant, expect a higher chance of rain showers compared to southern Portugal. Pack layers and waterproof gear."
            },
            {
                "reason": "Cooler Evenings",
                "details": "Evenings and nights can still be quite cool (8-10°C), requiring warmer clothing than daytime."
            },
            {
                "reason": "Easter Holiday Crowds & Potential Closures",
                "details": "If Easter falls in April, expect more visitors (especially domestic tourists), potentially higher prices, and some closures on Good Friday and Easter Sunday."
            },
            {
                "reason": "Freedom Day Closures",
                "details": "April 25th (Freedom Day) is a public holiday. Banks, post offices, and many non-tourist shops will close. Major attractions usually remain open; public transport runs on a holiday schedule."
            },
            {
                "reason": "University Schedule Variations",
                "details": "Depending on the academic calendar and potential Easter breaks, some university facilities might have altered visiting hours."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "8°C"
                },
                "precipitation": "Moderate chance of rain showers, interspersed with sunny periods. Spring is in the air.",
                "general_tips": "Pack layers: t-shirts, sweaters, a waterproof jacket. Comfortable walking shoes are crucial for Coimbra's hilly terrain. Umbrella is advisable."
            },
            "tourism_level": {
                "crowds": "Moderate shoulder season crowds. Increases significantly if Easter falls during this period.",
                "pricing": "Mid-range, potential increase around Easter.",
                "overall_atmosphere": "Pleasant spring awakening in a historic city. Good time for unhurried exploration."
            },
            "events_holidays": [
                {
                    "name": "Easter Celebrations (Semana Santa)",
                    "date": "Varies (can fall in early April)",
                    "description": "Religious processions (like the Ecce Homo procession, if scheduled), special church services, and traditional foods. Coimbra Cathedral (Sé Velha and Sé Nova) are central points.",
                    "notes": "Good Friday may see some business closures. Check local schedules for specific event times."
                },
                {
                    "name": "Local Markets",
                    "date": "Various days",
                    "description": "Explore local markets like the Mercado Municipal D. Pedro V for fresh produce, regional cheeses, and a glimpse into daily life.",
                    "notes": "Good opportunity for authentic local experience."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the University of Coimbra Alta & Sofia (UNESCO)",
                    "where": "Upper City (Alta)",
                    "description": "Wander through the historic Paço das Escolas courtyard, visit the stunning Biblioteca Joanina (Baroque Library), the Royal Palace, St. Michael's Chapel, and the academic prison.",
                    "practical_tips": "Purchase tickets online or at the ticket office; Biblioteca Joanina requires timed entry; wear comfortable shoes for hills/cobblestones.",
                    "best_time": "Morning or early afternoon",
                    "estimated_cost": "Moderate (entry fees for specific buildings)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Coimbra's Cathedrals (Sé Velha & Sé Nova)",
                    "where": "Alta (Sé Velha) & near University (Sé Nova)",
                    "description": "Explore the Romanesque Old Cathedral (Sé Velha), a fortress-like church, and the Mannerist/Baroque New Cathedral (Sé Nova).",
                    "practical_tips": "Small entry fees may apply; check opening hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll through the Botanical Garden",
                    "where": "Near the University Arches",
                    "description": "Enjoy the tranquility and diverse plant collections of this historic garden, especially beautiful with spring blooms.",
                    "practical_tips": "Free entry to most areas; allow ample time to wander.",
                    "best_time": "Sunny afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Wander the Baixa (Downtown)",
                    "where": "Lower city area near the river",
                    "description": "Explore the commercial heart of Coimbra with its narrow streets, traditional shops, cafes, and the Santa Cruz Church (containing tombs of Portugal's first kings).",
                    "practical_tips": "Relatively flat compared to the Alta; stop for a coffee at Cafe Santa Cruz.",
                    "best_time": "Anytime",
                    "estimated_cost": "Low (shopping/food extra)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "10°C"
                },
                "precipitation": "Slightly lower chance of rain compared to early April, more consistent sunshine likely.",
                "general_tips": "Continue with layers, but daytime can feel quite warm in the sun. Sunscreen is recommended."
            },
            "tourism_level": {
                "crowds": "Moderate, potentially building towards May. Busier around Freedom Day.",
                "pricing": "Mid-range, generally stable.",
                "overall_atmosphere": "Vibrant spring, city feels lively. Good balance before the main tourist season and student festivities."
            },
            "events_holidays": [
                {
                    "name": "Freedom Day (Dia da Liberdade)",
                    "date": "April 25",
                    "description": "National holiday commemorating the 1974 Carnation Revolution. Look for official ceremonies, potentially concerts or cultural events in city squares (check local listings closer to the date).",
                    "notes": "Public holiday: banks, schools, many shops closed. Main attractions usually open. Public transport on holiday schedule."
                },
                {
                    "name": "Build-up to Queima das Fitas",
                    "date": "Late April",
                    "description": "You might start seeing students preparing floats or decorations for the upcoming 'Burning of the Ribbons' festival, offering a glimpse of the city's unique student traditions.",
                    "notes": "Main events are in May, but anticipation builds."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Visit Quinta das Lágrimas",
                    "where": "Santa Clara side, across the river",
                    "description": "Explore the gardens famous for the tragic love story of Prince Pedro and Inês de Castro. See the 'Fonte dos Amores' and 'Fonte das Lágrimas'.",
                    "practical_tips": "Accessible by walking across the Santa Clara bridge; involves some uphill walking; small entrance fee for the gardens.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Experience Fado de Coimbra",
                    "where": "Various venues, often cafes or cultural centers",
                    "description": "Listen to the distinct Coimbra style of Fado, traditionally sung only by male university students or alumni, often accompanied by classical guitars.",
                    "practical_tips": "Look for venues like 'aCapella' (a converted chapel) or Café Santa Cruz; check performance schedules; book ahead if possible.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate (often includes drink minimum or entrance fee)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Explore the Machado de Castro National Museum",
                    "where": "Near the Sé Nova, in the former Bishop's Palace",
                    "description": "Discover one of Portugal's most important fine arts museums, built over the Roman cryptoporticus (which can also be visited). Houses extensive collections of sculpture, painting, and decorative arts.",
                    "practical_tips": "Allow several hours; the cryptoporticus visit is included.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Conímbriga Roman Ruins",
                    "where": "Approx. 16km south of Coimbra",
                    "description": "Visit one of the largest and best-preserved Roman settlements in Portugal, featuring impressive mosaics, foundations of houses, baths, and a museum.",
                    "practical_tips": "Accessible by bus (check schedules) or taxi/car; wear comfortable shoes; plan for half a day.",
                    "best_time": "Morning or early afternoon",
                    "estimated_cost": "Moderate (transport + entry fee)",
                    "weather_dependent": true
                }
            ]
        }
    }
}