{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Low Season Calm & Indoor Exploration",
                "details": "February is deep low season in Coimbra. Explore the historic University buildings, Machado de Castro Museum, and churches without the crowds. Ideal for appreciating indoor heritage."
            },
            {
                "reason": "Lowest Prices",
                "details": "Benefit from some of the lowest prices of the year for accommodation and potentially travel, offering great value."
            },
            {
                "reason": "Academic Term Resumes",
                "details": "Students return after the winter break, bringing some life back to the city's cafes and streets compared to the quietest holiday periods, though it's not peak vibrancy."
            },
            {
                "reason": "Potential Carnival Festivities",
                "details": "Depending on the year, Carnival may fall in February. While Coimbra's city events are usually modest, nearby towns like Mealhada or Figueira da Foz have notable parades. Some student festivities might occur."
            },
            {
                "reason": "Atmospheric Fado Experiences",
                "details": "The cool, often damp winter evenings provide an atmospheric backdrop for experiencing the unique Coimbra Fado in intimate venues."
            },
             {
                "reason": "Cozy Cafe Culture",
                "details": "Enjoy warming up in Coimbra's traditional cafes (like Café Santa Cruz) with coffee and pastries, observing local life."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cold and Potentially Wet Weather",
                "details": "February remains one of Coimbra's coldest months (avg. 14-15°C high, 5-6°C low) with a significant chance of rain, dampness, and overcast days. Pack warm and waterproof clothing."
            },
            {
                "reason": "Short Daylight Hours",
                "details": "Days are still relatively short (sunset around 6:30 PM by month's end), limiting time for outdoor exploration in daylight, though key indoor sites are accessible."
            },
            {
                "reason": "Chilly Evenings & Need for Heating",
                "details": "Evenings and nights are cold. Proper heating in accommodation is essential for comfort, especially in older buildings."
            },
            {
                "reason": "Limited Outdoor Appeal",
                "details": "Gardens (Botanical, Quinta das Lágrimas) will be in their winter state. River activities are generally not appealing due to weather."
            },
            {
                "reason": "Carnival Closures (if applicable)",
                "details": "If Carnival occurs, Shrove Tuesday (Tuesday before Ash Wednesday) is an optional holiday; some local businesses or offices might close."
            },
             {
                "reason": "Quieter Atmosphere",
                "details": "While students return, the overall atmosphere is much quieter than spring or summer, especially regarding nightlife and major events."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "14°C",
                    "low": "5°C"
                },
                "precipitation": "Still a high probability of rain (average ~110mm/month over 10-12 days). Overcast skies common, but occasional crisp, sunny (but cold) days possible.",
                "general_tips": "Pack warm layers (thermal base layer useful), sweaters, fleece, waterproof/windproof jacket, warm waterproof footwear, scarf, gloves, hat, umbrella."
            },
            "tourism_level": {
                "crowds": "Very low. One of the quietest times to visit attractions.",
                "pricing": "Generally the lowest prices of the year for accommodation.",
                "overall_atmosphere": "Quiet, academic feel as the semester restarts. Good for unhurried indoor sightseeing and enjoying local cafes."
            },
            "events_holidays": [
                {                    "name": "Valentine's Day (Dia dos Namorados)",
                    "date": "February 14",
                    "description": "Observed locally. Restaurants might be busier or offer special menus.",
                    "notes": "Book dinner reservations in advance if planning a special meal. Not a public holiday."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the University of Coimbra (Indoor Focus)",
                    "where": "Alta Cidade",
                    "description": "Dedicate time to the indoor marvels: Biblioteca Joanina, St. Michael's Chapel, the Royal Palace (Sala dos Capelos), and the Science Museum (Museu da Ciência).",
                    "practical_tips": "Book Library slot online. Check opening hours. Dress warmly.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (University tickets)",
                    "weather_dependent": false
                },
                {
                    "activity": "Deep Dive into Machado de Castro National Museum",
                    "where": "Largo Dr. José Rodrigues",
                    "description": "Spend a significant portion of a day exploring the extensive collections of art and sculpture, and descending into the Roman Cryptoporticus.",
                    "practical_tips": "Excellent rainy day activity. Allow 2-3 hours minimum.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                 {
                    "activity": "Visit Santa Cruz Church & Cafe Santa Cruz",
                    "where": "Praça 8 de Maio, Baixa",
                    "description": "Admire the historic church containing the tombs of Portugal's first kings, then warm up with coffee and pastries in the unique adjoining cafe located in a former chapel.",
                    "practical_tips": "Church entry is free. Cafe provides a cozy, atmospheric break.",
                    "best_time": "Anytime",
                    "estimated_cost": "Low (cafe purchase extra)",
                    "weather_dependent": false
                },
                {
                    "activity": "Wander the Covered Municipal Market (Mercado Municipal D. Pedro V)",
                    "where": "Near the Baixa",
                    "description": "Explore the bustling indoor market halls, seeing fresh produce, fish, meats, cheeses, and flowers. Offers a slice of local life.",
                    "practical_tips": "Best experienced in the morning (closes early afternoon, closed Sundays).",
                    "best_time": "Morning",
                    "estimated_cost": "Free (purchases extra)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "6°C"
                },
                "precipitation": "Rain probability remains similar, perhaps slightly decreasing towards March. Daylight hours noticeably lengthen by the end of the month.",
                "general_tips": "Continue with warm, waterproof layers. Be prepared for changeable conditions."
            },
            "tourism_level": {
                "crowds": "Remains very low, unless Carnival falls in this period, which might bring slight increase from regional visitors or specific student events.",
                "pricing": "Still low season pricing.",
                "overall_atmosphere": "Quiet academic city life continues. Potential for some pre-Lenten festivities if Carnival dates align."
            },
            "events_holidays": [
                {
                    "name": "Carnival (Carnaval)",
                    "date": "Varies (can fall late Feb - check dates)",
                    "description": "Coimbra itself has minor celebrations, perhaps some student parties or small local parades. Major traditional parades are in nearby Mealhada (famous for Samba schools) or Figueira da Foz.",
                    "notes": "Check local Coimbra listings for minor events. Day trip needed for major parades nearby. Shrove Tuesday may see some local closures."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend an Evening Coimbra Fado Performance",
                    "where": "Venues like 'aCapella' or Fado ao Centro",
                    "description": "Experience the unique melancholic Fado specific to Coimbra, traditionally sung by male students/alumni, in a cozy indoor setting.",
                    "practical_tips": "Check schedules and book in advance, especially weekends. Dress smart-casual.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore the Sé Velha (Old Cathedral)",
                    "where": "Alta Cidade",
                    "description": "Visit the imposing Romanesque Old Cathedral, a landmark of Portuguese history. Its austere interior feels particularly resonant in winter.",
                    "practical_tips": "Check opening times. Modest entrance fee. Can be cold inside.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit the Science Museum of the University of Coimbra",
                    "where": "Largo Marquês de Pombal (part of University)",
                    "description": "Explore the interactive exhibits and historical scientific collections housed in the impressive Colégio de Jesus building.",
                    "practical_tips": "Engaging indoor activity for several hours. Check opening times.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (often included in University ticket options)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Along the Mondego River (Weather Permitting)",
                    "where": "Parque Verde do Mondego",
                    "description": "On a crisp, dry day, take an invigorating walk along the river paths, crossing the Pedro e Inês footbridge for views of the city.",
                    "practical_tips": "Dress warmly. Best enjoyed during dry spells. Cafes along the park offer spots for a break.",
                    "best_time": "Dry daytime hours",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}