{
    "July": {
        "reasons_to_visit": [
            {
                "reason": "Hot, Sunny Weather for River Activities",
                "details": "July brings reliably hot and sunny weather to Coimbra (often low-mid 30s°C), perfect for enjoying the Mondego River – kayaking, paddleboarding, or visiting nearby river beaches (praias fluviais)."
            },
            {
                "reason": "Festas da Cidade da Rainha Santa Isabel",
                "details": "Coimbra's major city festival honouring Queen Saint Isabel usually takes place in early July in even-numbered years, featuring religious processions, concerts, fireworks, and fairs."
            },
            {
                "reason": "Lively Evening Atmosphere",
                "details": "While students are mostly away, the city enjoys a pleasant summer evening buzz, with outdoor cafes and restaurants busy in the Baixa and along the riverfront park (Parque Verde)."
            },
             {
                "reason": "Base for Central Portugal Exploration",
                "details": "Use Coimbra as a hub to explore nearby attractions like the Castle of Montemor-o-Velho, the coastal town of Figueira da Foz (though beaches there will be packed), or mountain villages."
            },
            {
                "reason": "Long Daylight Hours",
                "details": "Maximize sightseeing time with long summer days, allowing for exploration of the city's historic sites and enjoying the warm evenings outdoors."
            },
             {
                "reason": "Outdoor Concerts & Cultural Events",
                "details": "July often sees various outdoor concerts, cultural performances, or cinema screenings organized in city parks or squares."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Intense Inland Heat",
                "details": "July is very hot in Coimbra, often exceeding 35°C. Midday sightseeing can be draining and uncomfortable. Air conditioning is highly advisable, almost essential."
            },
            {
                "reason": "Peak Tourist Season & Crowds",
                "details": "July is peak season. Expect significant crowds at major attractions like the University (especially Biblioteca Joanina), museums, and popular viewpoints. Queues are likely."
            },
            {
                "reason": "Highest Prices",
                "details": "Accommodation, flights (if applicable), and even some popular tours or activities will be at their most expensive. Book everything well in advance."
            },
            {
                "reason": "Lack of Student Atmosphere",
                "details": "The characteristic student buzz of Coimbra is absent in July as most students are on summer break."
            },
            {
                "reason": "Accommodation Quality & Availability",
                "details": "Finding well-located accommodation with effective air conditioning can be challenging and expensive without booking far ahead."
            },
            {
                "reason": "Busy River Beaches",
                "details": "Accessible river beaches near Coimbra will likely be very crowded, especially on weekends."
            }
        ],
        "first_half": {
            "date_range": "July 1–15",
            "weather": {
                "average_temperature": {
                    "high": "31°C",
                    "low": "17°C"
                },
                "precipitation": "Very low chance of rain. Consistently hot, sunny, and dry. High UV index.",
                "general_tips": "Pack very light summer clothes (natural fibres best), high SPF sunscreen, sun hat, sunglasses. Drink plenty of water. Plan strenuous activities for early morning/late evening. Seek shade/AC midday."
            },
            "tourism_level": {
                "crowds": "Peak season high. Very busy at University sites, museums, viewpoints. Festas da Cidade (if occurring) brings huge crowds.",
                "pricing": "Peak season high. Book everything months ahead, especially if Festas da Cidade is on.",
                "overall_atmosphere": "Hot summer days, lively evenings. Tourist-focused atmosphere. Can be very crowded and festive during Festas da Cidade."
            },
            "events_holidays": [
                {
                    "name": "Festas da Cidade e da Rainha Santa Isabel",
                    "date": "Early July (even-numbered years, check dates)",
                    "description": "Major city festival celebrating Coimbra and its patron saint. Includes religious processions (Procession of Penance is notable), concerts, fairs, exhibitions, and fireworks over the Mondego.",
                    "notes": "Massive event transforming the city. Book accommodation/travel extremely far in advance. Expect crowds and road closures."
                },
                {
                    "name": "Summer Concerts/Cultural Agenda",
                    "date": "Various dates",
                    "description": "Check local listings ('agenda cultural Coimbra') for outdoor concerts, performances, or events in parks and squares.",
                    "notes": "Often free events organized by the municipality."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Festas da Cidade (if applicable)",
                    "where": "Various locations, esp. Baixa, Santa Clara, riverside",
                    "description": "Immerse yourself in Coimbra's biggest festival: witness the processions, enjoy the street food and fairgrounds, catch free concerts, and see the fireworks.",
                    "practical_tips": "Consult the official program. Be prepared for huge crowds, noise, and limited mobility. Stay hydrated. Book accommodation months/year+ ahead.",
                    "best_time": "Festival days/evenings",
                    "estimated_cost": "Mostly free (food/rides extra)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit University & Library (Early Morning)",
                    "where": "Alta Cidade",
                    "description": "Beat the worst heat and crowds by visiting the Paço das Escolas, Biblioteca Joanina (book timed slot!), Chapel, and Palace first thing in the morning.",
                    "practical_tips": "Book tickets online in advance. Arrive before opening if possible. Carry water.",
                    "best_time": "Early Morning",
                    "estimated_cost": "Moderate (University ticket)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Kayaking/Paddleboarding on the Mondego",
                    "where": "Rentals available near Parque Verde do Mondego",
                    "description": "Enjoy the river and city views from the water with a refreshing kayak or stand-up paddleboard session.",
                    "practical_tips": "Go early or late afternoon to avoid strongest sun. Wear sunscreen/hat, swimsuit. Guided tours might be available.",
                    "best_time": "Morning or Late Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Evening Drinks & Dinner in Praça 8 de Maio / Baixa",
                    "where": "Downtown Coimbra",
                    "description": "Enjoy the lively summer evening atmosphere with drinks at an outdoor cafe, followed by dinner in the bustling Baixa area or near the Santa Cruz church.",
                    "practical_tips": "Many restaurant choices. Book popular spots, especially on weekends or during festivals.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "July 16–31",
            "weather": {
                "average_temperature": {
                    "high": "32°C",
                    "low": "18°C"
                },
                "precipitation": "Extremely rare. Heat persists, often peaking in late July.",
                "general_tips": "Aggressively manage heat exposure. Utilize air-conditioned museums (Machado de Castro) or shopping centers during peak hours. Consider trips to river beaches."
            },
            "tourism_level": {
                "crowds": "Remains peak season high. Very busy at all major tourist points.",
                "pricing": "Persistently high peak season prices.",
                "overall_atmosphere": "Hot, sunny, tourist-filled summer days. Evenings remain the most pleasant time for activity."
            },
            "events_holidays": [
                 {
                    "name": "Continuing Summer Cultural Agenda",
                    "date": "Various dates",
                    "description": "Look for ongoing concerts, outdoor cinema, or other events scheduled by the city.",
                    "notes": "Check local event calendars."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Cool Off at a River Beach (Praia Fluvial)",
                    "where": "Nearby options like Praia Fluvial de Palheiros e Zorro, or further afield requires transport",
                    "description": "Escape the city heat with a trip to a designated river swimming spot. Often have cafes and basic facilities.",
                    "practical_tips": "Requires bus/car. Will be crowded, especially weekends. Check water quality if possible. Bring essentials.",
                    "best_time": "Full Day (go early)",
                    "estimated_cost": "Low to Moderate (transport/food)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Machado de Castro National Museum (Midday Escape)",
                    "where": "Alta Cidade",
                    "description": "Use the air-conditioned museum as a refuge during the hottest part of the day while exploring its significant art and archaeological collections, including the Cryptoporticus.",
                    "practical_tips": "Allow several hours. Check opening times.",
                    "best_time": "Midday / Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll through Parque Verde do Mondego in the Evening",
                    "where": "Riverside park",
                    "description": "Enjoy a pleasant evening walk along the river, crossing the Pedro e Inês bridge, as temperatures cool down. Many people gather here.",
                    "practical_tips": "Cafes in the park offer refreshments. Popular spot for locals.",
                    "best_time": "Evening",
                    "estimated_cost": "Free (refreshments extra)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Explore Portugal dos Pequenitos (Early/Late)",
                    "where": "Santa Clara side, across the river",
                    "description": "Visit the theme park with miniature Portuguese houses and monuments. More pleasant outside peak heat.",
                    "practical_tips": "Can be combined with Quinta das Lágrimas nearby. Allow a couple of hours.",
                    "best_time": "Morning or Late Afternoon",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": true
                }
            ]
        }
    }
}