{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Warm Weather",
                "details": "June offers reliably warm and sunny weather in Coimbra (avg. high 25-28°C), ideal for exploring the historic city, university grounds, and riverside before the intense heat of July/August."
            },
            {
                "reason": "Long Daylight Hours",
                "details": "Enjoy the longest days of the year, providing ample daylight from early morning until late evening for sightseeing, enjoying parks, and dining outdoors."
            },
            {
                "reason": "Festas dos Santos Populares (Popular Saints)",
                "details": "Experience local celebrations, particularly around St. Anthony's Day (June 13th). Look for 'arraiais' (street parties) with music, dancing, grilled sardines, and festive decorations in neighborhoods."
            },
            {
                "reason": "Grilled Sardines Season",
                "details": "June marks the peak season for delicious grilled sardines ('sardinhas assadas'), a highlight of the Santos Populares festivities and readily available in restaurants and at parties."
            },
            {
                "reason": "Mondego River Activities Begin",
                "details": "The pleasant weather makes June a great time to start enjoying activities on the Mondego River, such as kayaking, paddleboarding, or taking a scenic boat trip ('Basófias')."
            },
            {
                "reason": "Lively Atmosphere Before Peak Crowds",
                "details": "Coimbra feels vibrant as summer begins, but crowds are generally more manageable than in July or August. University might still have some end-of-year buzz early in the month."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Increasing Crowds & Prices",
                "details": "June is the start of the high season. Tourist numbers rise noticeably, especially at University sites. Accommodation and travel prices increase significantly from spring."
            },
            {
                "reason": "Rising Temperatures & Strong Sun",
                "details": "While generally pleasant, temperatures climb, and the midday sun can be strong, especially later in the month. Plan accordingly and use sun protection."
            },
            {
                "reason": "Booking Becomes Advisable",
                "details": "It's wise to book accommodation, popular tours (like Biblioteca Joanina timed entry), and restaurants (especially for weekend evenings) in advance."
            },
            {
                "reason": "Portugal Day Holiday Weekend",
                "details": "The period around Portugal Day (June 10th) can see increased domestic tourism, making the city busier."
            },
            {
                "reason": "End of Academic Year Transition",
                "details": "Depending on exam schedules, the unique student atmosphere might be winding down or replaced by end-of-term stress/celebrations, differing from the main academic term buzz."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "26°C",
                    "low": "15°C"
                },
                "precipitation": "Low chance of rain, mostly sunny and warm days. Evenings are pleasant.",
                "general_tips": "Pack light summer clothing, but include a light jacket or sweater for evenings. Comfortable walking shoes are essential for Coimbra's hills. Sunscreen and sunglasses needed."
            },
            "tourism_level": {
                "crowds": "Moderate to High. Increases around Portugal Day (June 10th) and towards mid-month.",
                "pricing": "High season prices take effect. Booking accommodation is recommended.",
                "overall_atmosphere": "Pleasantly warm and sunny. City feels alive with early summer energy and anticipation for Santos Populares."
            },
            "events_holidays": [
                {
                    "name": "Portugal Day (Dia de Portugal)",
                    "date": "June 10",
                    "description": "National holiday. May involve official ceremonies. Generally a leisure day, possibly busier with local tourists.",
                    "notes": "Public holiday: Banks, offices closed. Most shops and attractions open. Holiday transport schedule."
                },
                {
                    "name": "Festas de Santo António (St. Anthony)",
                    "date": "Around June 12th-13th",
                    "description": "Main Popular Saint celebration in many parts of Portugal. Look for local 'arraiais' (street parties) in Coimbra neighborhoods featuring music, dancing, grilled sardines, and basil pots ('manjericos').",
                    "notes": "Check local posters or ask locals about specific neighborhood parties."
                },
                 {
                    "name": "Peak Sardine Season Begins",
                    "date": "Throughout June",
                    "description": "Restaurants and festival stalls proudly serve freshly grilled sardines. The aroma often fills the air, especially in the evenings.",
                    "notes": "A must-try Portuguese summer delicacy."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore University & Botanical Garden",
                    "where": "Alta Cidade & adjacent garden",
                    "description": "Visit the historic University grounds (Paço das Escolas, Library) and wander through the lush Botanical Garden, enjoying the pleasant weather.",
                    "practical_tips": "Book Library slot online. Allow ample time for both. Wear comfortable shoes. Gardens offer shade.",
                    "best_time": "Morning or Late Afternoon",
                    "estimated_cost": "Moderate (University ticket) + Free (Garden)",
                    "weather_dependent": false
                },
                {
                    "activity": "Mondego River Boat Trip ('Basófias')",
                    "where": "Departs from Parque Dr. Manuel Braga / riverside",
                    "description": "Take a relaxing sightseeing cruise on the Mondego River, enjoying views of the city and university from the water as temperatures warm up.",
                    "practical_tips": "Check schedules. Evening cruises can be particularly pleasant.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Enjoy Outdoor Cafes in the Baixa",
                    "where": "Downtown Coimbra (e.g., Praça do Comércio, Praça 8 de Maio)",
                    "description": "Sit at an outdoor cafe table, enjoy a coffee or drink, and watch the city life go by in the historic downtown area.",
                    "practical_tips": "Praça 8 de Maio offers views of Santa Cruz church. Praça do Comércio is pedestrianized.",
                    "best_time": "Anytime, especially pleasant late afternoon/evening",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Quinta das Lágrimas Gardens",
                    "where": "Santa Clara side, across the river",
                    "description": "Explore the romantic gardens associated with the tragic love story of Pedro and Inês, enjoying the shade and historic atmosphere.",
                    "practical_tips": "Small entrance fee. Combine with Portugal dos Pequenitos nearby. Involves some walking.",
                    "best_time": "Morning or Late Afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "28°C",
                    "low": "16°C"
                },
                "precipitation": "Very rare. Expect consistently sunny and hot days. Long evenings remain warm.",
                "general_tips": "Sunscreen, hat, and sunglasses are essential. Stay hydrated. Seek shade during peak afternoon hours. Air conditioning becomes more desirable."
            },
            "tourism_level": {
                "crowds": "High. Tourist numbers continue to build towards July peak. Busy, especially on weekends.",
                "pricing": "High season prices fully established.",
                "overall_atmosphere": "Full summer atmosphere. Lively evenings, pleasant for outdoor dining. Focus shifts towards tourism as academic year ends."
            },
            "events_holidays": [
                {
                    "name": "Festa de São João (St. John's)",
                    "date": "Around Night of June 23rd to 24th",
                    "description": "While less intense than Porto's celebration, Coimbra may have neighborhood 'arraiais' with music, sardines, and possibly bonfires. Check local listings.",
                    "notes": "More subdued than St. Anthony generally, but still part of the Santos Populares tradition."
                },
                 {
                    "name": "Festas de São Pedro (St. Peter)",
                    "date": "Around June 29th",
                    "description": "End of the main Popular Saints period. Possible smaller local events or celebrations, perhaps linked to the river.",
                    "notes": "Check for specific local announcements."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend a Local 'Arraial' (Street Party)",
                    "where": "Check local neighborhood posters/listings",
                    "description": "Experience an authentic Portuguese summer celebration with popular music, dancing, grilled sardines, beer, and a lively community atmosphere.",
                    "practical_tips": "Usually free entry, pay for food/drink. Embrace the noise and crowds. Fun, informal atmosphere.",
                    "best_time": "Evenings around Santos Populares dates (13th, 23rd, 29th)",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                },
                 {
                    "activity": "Kayaking or Paddleboarding on the Mondego",
                    "where": "Rentals/tours near Parque Verde",
                    "description": "Cool off and get some exercise by renting a kayak or SUP board to explore the Mondego River flanking the city center.",
                    "practical_tips": "Best done morning or late afternoon to avoid strongest sun. Wear swimwear/quick-dry clothes.",
                    "best_time": "Morning / Late Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Machado de Castro National Museum",
                    "where": "Alta Cidade",
                    "description": "Explore Coimbra's premier art and archaeology museum, including the Roman Cryptoporticus. Good escape from potential midday heat.",
                    "practical_tips": "Air-conditioned galleries. Allow several hours.",
                    "best_time": "Anytime, especially midday",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Evening Walk & Dinner by the River",
                    "where": "Parque Verde do Mondego & adjacent restaurants",
                    "description": "Enjoy a pleasant evening stroll through the riverside park as it cools down, followed by dinner at one of the restaurants with river views.",
                    "practical_tips": "Park is popular in the evenings. Some restaurants are located right by the park/river.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High (dinner)",
                    "weather_dependent": false
                }
            ]
        }
    }
}