{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Emerging Spring & Awakening Gardens",
                "details": "March signals the start of spring in Coimbra. Witness the Botanical Garden and Quinta das Lágrimas begin to bloom, offering pleasant walks as days get warmer (avg. 17-18°C high)."
            },
            {
                "reason": "Shoulder Season Value & Moderate Crowds",
                "details": "Enjoy Coimbra's main attractions like the University library and museums with fewer tourists than peak summer or spring festival times. Accommodation prices are generally moderate."
            },
            {
                "reason": "Active Academic Atmosphere",
                "details": "Experience the lively buzz of the University city with students back in full swing after winter break, filling cafes and streets, especially during weekdays."
            },
            {
                "reason": "Comfortable Temperatures for Exploration",
                "details": "The milder temperatures are ideal for exploring Coimbra's hilly terrain, wandering through the Alta and Baixa districts without the intense summer heat."
            },
            {
                "reason": "Potential Early Easter Traditions",
                "details": "If Easter falls in late March, you might witness local religious processions or traditions associated with Semana Santa (Holy Week)."
            },
             {
                "reason": "Good Base for Exploring Central Portugal",
                "details": "Use Coimbra as a base to visit nearby historical sites like Conímbriga Roman ruins or the Batalha Monastery as the weather improves for day trips."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Unpredictable Spring Weather",
                "details": "March weather can be highly variable. Expect a mix of sunny days, but also potential for significant rain showers and cooler, windy periods. Pack for all conditions."
            },
            {
                "reason": "Cool Evenings",
                "details": "Evenings and nights remain quite cool (avg. low 7-8°C), requiring warm jackets or sweaters."
            },
            {
                "reason": "Gardens Not Yet at Peak Bloom",
                "details": "While starting to awaken, the gardens won't be as lush or colorful as later in spring (April/May)."
            },
             {
                "reason": "Easter Holiday Crowds/Prices (if applicable)",
                "details": "If Easter falls in March, expect a surge in visitors (especially domestic/Spanish tourists), higher accommodation prices, and busier attractions."
            },
            {
                "reason": "Potential for Dampness",
                "details": "Following winter rains, some older buildings or less sunny spots can still feel damp, even if daytime temperatures are mild."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "7°C"
                },
                "precipitation": "Moderate chance of rain continues from winter (around 90-100mm over 9-11 days), but increasing chance of sunny spells.",
                "general_tips": "Pack layers: t-shirts, sweaters, a waterproof jacket. Comfortable, possibly waterproof, walking shoes essential for hills and potential rain. Umbrella useful."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. Quieter period before spring season fully kicks in.",
                "pricing": "Good shoulder season value generally available.",
                "overall_atmosphere": "City feels academic and local. Pleasant for exploring on clearer days, quiet evenings."
            },
            "events_holidays": [
                  {
                    "name": "University Life in Session",
                    "date": "Weekdays",
                    "description": "Experience the normal rhythm of the academic city, with students attending classes and frequenting cafes.",
                    "notes": "Provides an authentic Coimbra atmosphere."
                  }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the University of Coimbra (Alta & Sofia)",
                    "where": "Upper City",
                    "description": "Visit the historic University complex including the Biblioteca Joanina, Royal Palace, Chapel, and Science Museum with relatively fewer crowds.",
                    "practical_tips": "Book Library slot online. Wear comfortable shoes. Check opening hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (University tickets)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Machado de Castro National Museum",
                    "where": "Near Sé Nova",
                    "description": "Explore one of Portugal's most important museums, built over a Roman cryptoporticus. Excellent indoor option for cooler or wetter days.",
                    "practical_tips": "Allow several hours. Check opening times.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Wander the Baixa (Downtown)",
                    "where": "Lower city area",
                    "description": "Explore the main commercial streets, discover traditional shops, visit the Santa Cruz Church/Monastery, and enjoy coffee at Café Santa Cruz.",
                    "practical_tips": "Relatively flat area. Good for experiencing daily city life.",
                    "best_time": "Anytime",
                    "estimated_cost": "Low (shopping/food extra)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Stroll Through the Botanical Garden",
                    "where": "Near University Arches",
                    "description": "See the early signs of spring as the historic Botanical Garden begins to awaken. Enjoy the peaceful paths and glasshouses.",
                    "practical_tips": "Free entry to most areas. Wear comfortable shoes. Might be damp underfoot after rain.",
                    "best_time": "Dry afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "8°C"
                },
                "precipitation": "Rain becomes less frequent, sunny days more common. Feels more consistently like spring.",
                "general_tips": "Continue layering, but might need lighter options more often. Sunscreen advised for clear days. Umbrella still worth carrying."
            },
            "tourism_level": {
                "crowds": "Moderate, noticeably increasing towards April, especially if Easter falls late March.",
                "pricing": "Still shoulder season, but book ahead if traveling during Easter week as prices surge.",
                "overall_atmosphere": "Pleasant spring awakening. City feels lively. Busy and festive if Easter occurs."
            },
            "events_holidays": [
                 {
                    "name": "Easter Week (Semana Santa) Celebrations (if applicable)",
                    "date": "Late March (varies with Easter date)",
                    "description": "If Easter falls in this period, look for religious processions (like the Ecce Homo procession), special services in the Cathedrals (Sé Velha, Sé Nova), and traditional Easter foods.",
                    "notes": "Coimbra has significant Holy Week traditions. Expect crowds and higher prices if Easter occurs."
                 },
                 {
                    "name": "St. Patrick's Day (Observed minimally)",
                    "date": "March 17",
                    "description": "Very minor observance, perhaps some promotions in Irish-themed pubs, if any exist and are open.",
                    "notes": "Not a local tradition."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Conímbriga Roman Ruins",
                    "where": "Approx. 16km south of Coimbra",
                    "description": "Explore one of Portugal's largest and best-preserved Roman settlements, including impressive mosaics and foundations, as the weather becomes more suitable for outdoor sites.",
                    "practical_tips": "Accessible by bus or car. Allow half a day. Wear comfortable walking shoes.",
                    "best_time": "Dry Day, Daytime",
                    "estimated_cost": "Moderate (transport + entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk Along the Mondego River",
                    "where": "Parque Verde do Mondego",
                    "description": "Enjoy a walk or relax in the riverside park as spring arrives. Cross the Pedro e Inês footbridge for city views.",
                    "practical_tips": "Pleasant on sunny days. Cafes offer outdoor seating.",
                    "best_time": "Sunny Afternoon",
                    "estimated_cost": "Free (refreshments extra)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Quinta das Lágrimas Gardens",
                    "where": "Santa Clara side, across the river",
                    "description": "Visit the romantic gardens linked to Pedro and Inês, enjoying the emerging spring blooms and historical setting.",
                    "practical_tips": "Small entrance fee. Wear comfortable shoes.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                },
                {
                    "activity": "Attend a Coimbra Fado Performance",
                    "where": "Venues like 'aCapella' or Fado ao Centro",
                    "description": "Experience the unique Coimbra Fado in an intimate setting as evenings remain cool.",
                    "practical_tips": "Check schedules and book ahead if possible, especially weekends.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        }
    }
}