{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Queima das Fitas Student Festival",
                "details": "May is dominated by Coimbra's legendary week-long student festival, Queima das Fitas (Burning of the Ribbons). Experience parades, concerts, serenades, and unparalleled festive energy (usually early May)."
            },
            {
                "reason": "Beautiful Spring Weather",
                "details": "Enjoy warm, sunny spring days (avg. 21-23°C high), perfect for exploring the city, university grounds, and riverside before summer heat intensifies."
            },
            {
                "reason": "Gardens in Full Bloom",
                "details": "Coimbra's Botanical Garden and the romantic Quinta das Lágrimas gardens are at their most beautiful, lush, and colourful in May."
            },
            {
                "reason": "Lively (Student) Atmosphere",
                "details": "Outside of Queima das Fitas week, the city still buzzes with end-of-academic-year energy, although it winds down later in the month."
            },
            {
                "reason": "Ideal for Outdoor Exploration & River Activities",
                "details": "Pleasant temperatures are great for walking tours, visiting Conímbriga ruins, kayaking on the Mondego, or enjoying outdoor cafes."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Queima das Fitas Crowds, Noise & Prices",
                "details": "During Queima week (usually early May), Coimbra is extremely crowded, noisy (especially at night), and accommodation prices skyrocket. Book *many* months, even a year, ahead. Some sites may have restricted access."
            },
            {
                "reason": "Booking Essential During Queima",
                "details": "Finding accommodation during Queima das Fitas without booking extremely far in advance is practically impossible."
            },
            {
                "reason": "Higher Prices Generally",
                "details": "May marks the start of higher tourist season pricing, even outside the festival week, compared to earlier spring months."
            },
            {
                "reason": "Increasing Temperatures & Sun Intensity",
                "details": "While generally pleasant, the sun gets stronger, and later May can bring early heatwaves. Sun protection needed."
            },
            {
                "reason": "Focus on Student Festival (Early May)",
                "details": "If visiting specifically for Queima das Fitas, be aware it's a very student-centric, often rowdy, celebration. If not interested, avoid this period."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "11°C"
                },
                "precipitation": "Low chance of rain (around 50-60mm over 6-8 days), mostly sunny and pleasant spring weather.",
                "general_tips": "Pack layers for warm days and cooler evenings (t-shirts, light trousers, sweater/light jacket). Comfortable shoes vital. Sunscreen/sunglasses needed. Earplugs essential if visiting during Queima week!"
            },
            "tourism_level": {
                "crowds": "EXTREMELY HIGH during Queima das Fitas week (usually early May). Moderate otherwise, but increasing.",
                "pricing": "Astronomical during Queima week. High season prices otherwise. Book Queima accommodation/travel a year+ in advance.",
                "overall_atmosphere": "Insane festive energy during Queima - concerts, parades, street drinking. Otherwise, pleasant late spring academic city vibe."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Dia do Trabalhador)",
                    "date": "May 1",
                    "description": "Public holiday. Quiet day, potentially some union marches. City may be preparing for Queima.",
                    "notes": "Public holiday: Banks, schools, some shops closed. Tourist attractions usually open. Transport on holiday schedule."
                },
                {
                    "name": "Queima das Fitas (Burning of the Ribbons)",
                    "date": "Typically starts first Friday of May, lasts ~8 days",
                    "description": "Massive student festival marking end of academic year. Key events include: Serenata Monumental (Fado serenade at Old Cathedral steps), Cortejo Académico (huge themed float parade), concerts every night ('Noites do Parque'), balls, sports events.",
                    "notes": "Check official dates annually. Transforms the city. Expect huge crowds, noise, difficulty moving around, high prices."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Witness the Serenata Monumental",
                    "where": "Steps of the Sé Velha (Old Cathedral)",
                    "description": "Experience the deeply emotional opening of Queima das Fitas, where thousands gather in silence to hear Coimbra Fado sung by students at midnight.",
                    "practical_tips": "Arrive *hours* early to get a spot with any view. Extremely crowded and atmospheric. Respect the silence during performance.",
                    "best_time": "Evening/Midnight on the opening Friday of Queima",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Watch the Cortejo Académico",
                    "where": "Parades through the Baixa (downtown)",
                    "description": "See the massive, colourful, and satirical student parade with themed floats representing different university faculties, involving lots of water and drink!",
                    "practical_tips": "Takes hours. Find a spot along the route early. Be prepared to get wet/sprayed. Very lively and chaotic.",
                    "best_time": "Afternoon of the first Sunday of Queima",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Blooming Botanical Garden (Outside Queima Week)",
                    "where": "Near University Arches",
                    "description": "If visiting before or after the main Queima events, enjoy the Botanical Garden at its peak spring bloom.",
                    "practical_tips": "Check if access is affected during Queima. Free entry to most areas.",
                    "best_time": "Daytime (avoiding Queima peak days)",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit University Sites (Carefully timed during Queima)",
                    "where": "Alta Cidade",
                    "description": "Attempt to visit Biblioteca Joanina, Palace, Chapel outside of major Queima events, but expect crowds and potential access issues.",
                    "practical_tips": "Book Library slot far in advance regardless. Check accessibility during festival week. Might be less chaotic very early morning.",
                    "best_time": "Early morning, non-parade days",
                    "estimated_cost": "Moderate (University tickets)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "13°C"
                },
                "precipitation": "Very low chance of rain. Consistently sunny and warm, feeling like early summer.",
                "general_tips": "Pack light summer clothing, comfortable shoes, sunscreen, hat, sunglasses. Evenings still pleasant but might need a light layer."
            },
            "tourism_level": {
                "crowds": "Moderate to High. City recovers from Queima, tourism builds towards summer peak. Still busy but manageable.",
                "pricing": "High season pricing generally applies. Book ahead.",
                "overall_atmosphere": "Pleasant late spring/early summer. City returns to a more normal rhythm. Great weather for sightseeing and gardens."
            },
            "events_holidays": [
                 {
                    "name": "Post-Queima Calm",
                    "date": "Mid-late May",
                    "description": "The city returns to a more relaxed state after the intensity of the student festival.",
                    "notes": "Good time to explore if you avoided the Queima week."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Quinta das Lágrimas Gardens",
                    "where": "Santa Clara side",
                    "description": "Explore the beautiful and romantic gardens in their full spring glory, enjoying the story of Pedro and Inês.",
                    "practical_tips": "Small entrance fee. Combine with Portugal dos Pequenitos. Wear comfortable shoes.",
                    "best_time": "Morning or Afternoon",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                },
                {
                    "activity": "Kayaking or Mondego River Cruise",
                    "where": "Rentals/Tours from Parque Verde area",
                    "description": "Enjoy the pleasant weather with activities on the river – rent kayaks or take a relaxing 'Basófias' boat trip.",
                    "practical_tips": "Good way to see the city from a different perspective. Check schedules/availability.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Conímbriga Roman Ruins",
                    "where": "Near Condeixa-a-Nova (south of Coimbra)",
                    "description": "Take a day trip to see the extensive and well-preserved Roman ruins, including stunning mosaics.",
                    "practical_tips": "Accessible by bus/car. Allow several hours. Bring sun protection.",
                    "best_time": "Daytime (avoid peak midday heat)",
                    "estimated_cost": "Moderate (transport + entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Enjoy Evening Fado Performance",
                    "where": "'aCapella', Fado ao Centro, etc.",
                    "description": "Experience Coimbra's unique Fado tradition in an atmospheric setting.",
                    "practical_tips": "Book ahead, especially weekends. Performances often nightly.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        }
    }
}