{
  "overview_paragraph": "Catania is at its best in spring (April–June) and early fall (September–October), when university students return to enliven the historic center, porticoes provide perfect shelter for exploration, and the culinary scene buzzes with fresh seasonal ingredients. July brings warm evenings perfect for dining in piazzas and cultural festivals—though some university areas quiet down; August offers a more relaxed atmosphere with fewer crowds. Winter (November–February) is cozy and atmospheric—ideal for museum visits, portico walks, and enjoying the city's famous cuisine in warm trattorias—while March begins to warm with spring blossoms and the return of vibrant student life to the university quarter.",
  "January": [
    "Castello Ursino without the crowds, steaming Sicilian hot chocolate in historic cafés, and misty portico walks between cozy local shops in the historic center.",
    "Winter light on the Cathedral of Sant'Agata, snug trattorias in the historic center, and vintage hunts in the covered markets."
  ],
  "February": [
    "Piazza del Duomo at golden hour, romantic views from the porticoes, and traditional Sicilian music nights in local venues.",
    "Shared local pastries, candlelit trattorias, and strolls past secret courtyards in the Old Town."
  ],
  "March": [
    "First spring blossoms along the porticoes, terrace tables returning around Piazza del Duomo, and university quarter bookshop wanders.",
    "Morning cornetto, museum afternoons, and blue-hour portico walks welcoming spring back to Catania."
  ],
  "April": [
    "Wildflowers in bloom around Piazza del Duomo, flaky Sicilian pastries, and walks from the university to the historic center.",
    "Spring light on the Cathedral of Sant'Agata, gallery-hopping in the university quarter, sunset views from Mount Etna."
  ],
  "May": [
    "Picnics in Giardino Bellini, markets brimming with local color, and twilight strolls along the porticoes.",
    "Flowered courtyards, open-air café moments around Piazza del Duomo, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, piazza aperitivos around the historic center, and the city humming with university graduation celebrations.",
    "Sun-splashed porticoes, university garden picnics, and late sunsets that turn every viewpoint into a postcard."
  ],
  "July": [
    "Summer festival fireworks over Piazza del Duomo, lazy afternoons in the porticoes, and moonlit walks through the historic center.",
    "Summer markets, piazza terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet university areas, easy museum days, and Mediterranean evenings with breezes through the porticoes.",
    "Shaded porticoes, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh university exhibits, lively piazza terraces, and vineyard-tinted evenings in the historic center.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering irresistible."
  ],
  "October": [
    "Autumn colors along the porticoes, restaurants aglow, and the local food harvest festival in the historic center.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the historic center."
  ],
  "November": [
    "Local wine toasts, cozy trattorias, and Palazzo degli Elefanti afternoons while the city slows to a hush.",
    "Foggy portico mornings, Sicilian academic antiquities indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Historic center lights, Christmas markets at Piazza del Duomo, and strolling beneath grand Baroque façades.",
    "Vin brulé in hand, Cathedral bells, and winter sparkle from portico to boutique passage."
  ]
}

