{
    "Spring": {
        "activities": [
            {
                "name": "Mole Movie Week",
                "type": "Cultural Festival",
                "description": "A week of special film screenings, events, and exhibitions at the National Cinema Museum inside the iconic Mole Antonelliana, celebrating Italian and international cinema.",
                "indoor": true,
                "best_time": "Evening (screenings)",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in late April or May. Schedule announced on the museum's official website.",
                "booking_tips": "Book tickets online in advance for popular screenings or events."
            },
            {
                "name": "Cherry Blossom Viewing in Parco del Valentino",
                "type": "Outdoor Activity/Leisure",
                "description": "Enjoy the beautiful cherry blossoms and spring flowers throughout Turin's largest park along the Po River.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Blossoms usually peak in April, depending on weather. The park becomes increasingly lively as temperatures rise.",
                "booking_tips": "No booking needed. Consider renting a bicycle to explore more of the park."
            },
            {
                "name": "Superga Bike Climb",
                "type": "Outdoor Activity/Sports",
                "description": "Challenge yourself with the scenic bike climb up to the Basilica of Superga, famous in cycling lore. Enjoy panoramic views of Turin and the Alps from the top.",
                "indoor": false,
                "best_time": "Morning (less traffic)",
                "price_range": "Free (own bike) / Low (rental)",
                "seasonal_notes": "Spring offers comfortable temperatures for the climb and clearer views of the Alps.",
                "booking_tips": "Bike rentals available in the city center. Visitor information and basilica opening hours available online."
            },
            {
                "name": "Salone Internazionale del Libro (Turin International Book Fair)",
                "type": "Cultural Festival",
                "description": "Italy's largest book fair featuring publishers, authors, and literary events. A major cultural event with readings, discussions, and book presentations.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Low-Moderate (entry)",
                "seasonal_notes": "Held annually in May at the Lingotto exhibition center. Very popular with both industry professionals and the public.",
                "booking_tips": "Purchase tickets online in advance. Check the program for specific author events you might want to attend."
            },
            {
                "name": "Aperitivo al Fresco",
                "type": "Food & Drink/Social",
                "description": "Experience Turin's aperitivo tradition at outdoor terraces and piazzas as the weather warms up, enjoying pre-dinner drinks and snacks in social settings.",
                "indoor": false,
                "best_time": "Early Evening (6-8pm)",
                "price_range": "Moderate",
                "seasonal_notes": "Spring evenings are ideal for outdoor aperitivo. Many venues set up expanded outdoor seating.",
                "booking_tips": "Reservations recommended for popular spots, especially on weekends. Try Piazza Vittorio Veneto or San Salvario district."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Kappa FuturFestival",
                "type": "Music Festival",
                "description": "One of Europe's premier electronic music festivals, held in Parco Dora, featuring world-famous DJs and artists across multiple stages in a post-industrial setting.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "High",
                "seasonal_notes": "Typically held in early July. Can be very hot during the day, with cooler evenings.",
                "booking_tips": "Buy tickets well in advance as they often sell out. Consider multi-day passes. Prepare for the heat with water and sun protection."
            },
            {
                "name": "Turin Summer Music Festivals (e.g., TODAYS)",
                "type": "Music Festival",
                "description": "Various music festivals and concert series held in outdoor venues throughout the city featuring rock, indie, jazz, and classical performances.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to High",
                "seasonal_notes": "Multiple festivals throughout summer, with TODAYS typically in August. Check current schedules on the city's official tourism website.",
                "booking_tips": "Purchase tickets online in advance. Venues range from Parco della Pellerina to Spazio 211."
            },
            {
                "name": "Cinema a Palazzo Reale",
                "type": "Entertainment/Cultural",
                "description": "Open-air film screenings in the magnificent gardens of the Royal Palace, featuring classic and contemporary Italian and international films.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "Typically runs through July and August on select evenings. Magical setting under the stars.",
                "booking_tips": "Check program and purchase tickets online. Bring something to sit on if not provided."
            },
            {
                "name": "River Po Rowing & Canoeing",
                "type": "Outdoor Activity/Sports",
                "description": "Explore Turin from the water by renting a canoe, kayak, or rowing boat on the Po River, offering unique views of the city's landmarks.",
                "indoor": false,
                "best_time": "Morning or Late Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "The river is typically calmest in the early morning or evening. Avoid the midday heat.",
                "booking_tips": "Rentals available at various points along the river, including near Parco del Valentino. Some basic instruction may be provided."
            },
            {
                "name": "Alps Day Trips",
                "type": "Outdoor Activity/Sightseeing",
                "description": "Escape the summer heat with day trips to nearby Alpine valleys, enjoying hiking, mountain villages, and cooler temperatures.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate (transport/activities)",
                "seasonal_notes": "Summer is ideal for Alpine exploration with clear trails and accessible mountain passes.",
                "booking_tips": "Consider destinations like Val di Susa, Bardonecchia, or Sestriere. Public transport options available, but a car offers more flexibility."
            },
            {
                "name": "Evening Passeggiata & Gelato",
                "type": "Leisure/Cultural",
                "description": "Join locals for the traditional evening stroll through Turin's elegant center, stopping for artisanal gelato at one of the city's renowned gelaterie.",
                "indoor": false,
                "best_time": "Evening (after dinner)",
                "price_range": "Low (gelato)",
                "seasonal_notes": "A quintessential Italian summer evening ritual. Most lively on weekends.",
                "booking_tips": "No booking needed. Try Via Po, Via Roma, or Piazza Castello for strolling. Notable gelaterias include Fiorio, Pepino, and Grom."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Salone del Gusto / Terra Madre",
                "type": "Food Festival",
                "description": "Slow Food's international biennial festival celebrating food culture, sustainability, and biodiversity, featuring tastings, workshops, and food producers from around the world.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate (entry + tastings)",
                "seasonal_notes": "Held in even-numbered years, typically in September or October. One of the world's premier food events.",
                "booking_tips": "Purchase tickets and book specific workshops online in advance, as popular events sell out quickly."
            },
            {
                "name": "Alba White Truffle Fair Day Trip",
                "type": "Food & Drink/Excursion",
                "description": "Take a day trip to Alba (about 1.5 hours from Turin) for the famous International White Truffle Fair, featuring the prized Piedmontese delicacy at its seasonal peak.",
                "indoor": true,
                "best_time": "All Day (weekends best)",
                "price_range": "High (transport, entry, tastings)",
                "seasonal_notes": "Runs from early October to early December. Weekends are busiest but most atmospheric.",
                "booking_tips": "Consider a guided tour with transportation from Turin. Book restaurants in Alba well in advance if planning to dine there."
            },
            {
                "name": "Torino Film Festival",
                "type": "Cultural Festival",
                "description": "One of Italy's most important film festivals, featuring international premieres, retrospectives, and special events throughout the city.",
                "indoor": true,
                "best_time": "Evening (main screenings)",
                "price_range": "Moderate",
                "seasonal_notes": "Usually held in late November. Attracts film enthusiasts and industry professionals.",
                "booking_tips": "Check the festival website for program and ticket information. Book popular screenings in advance."
            },
            {
                "name": "Artissima Contemporary Art Fair",
                "type": "Cultural Festival",
                "description": "Italy's most important contemporary art fair, showcasing galleries, artists, and special exhibitions at Lingotto Fiere.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate (entry)",
                "seasonal_notes": "Typically held in early November. A major event in the international art calendar.",
                "booking_tips": "Purchase tickets online. Plan to spend several hours exploring. Often coincides with gallery openings throughout the city."
            },
            {
                "name": "Hiking in the Turin Hills",
                "type": "Outdoor Activity",
                "description": "Explore the colorful autumn foliage on trails in the hills surrounding Turin (Collina Torinese), enjoying panoramic views of the city against the backdrop of the Alps.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Fall colors typically peak in October. Weather is usually mild and pleasant for hiking.",
                "booking_tips": "No booking needed. Popular routes include paths to Basilica di Superga and around Parco Naturale della Collina di Superga."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets",
                "type": "Shopping/Festival",
                "description": "Browse traditional Christmas markets set up in Piazza Castello, Piazza Solferino, and other locations around the city, featuring crafts, decorations, and seasonal food.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Free (to browse) / Low-Moderate (purchases)",
                "seasonal_notes": "Markets typically run from late November through Epiphany (January 6). Most festive after dark when lights are on.",
                "booking_tips": "No booking required. Weekdays are less crowded than weekends."
            },
            {
                "name": "Luci d'Artista (Artist Lights)",
                "type": "Art/Festival",
                "description": "Experience Turin's famous light art installations that transform the city center into an open-air contemporary art gallery during the winter months.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Installations are typically displayed from late October/early November through January. Most impressive after dark.",
                "booking_tips": "Free walking maps available at tourist offices. Consider joining a guided tour for context about the artists and installations."
            },
            {
                "name": "Alpine Skiing Day Trip",
                "type": "Outdoor Activity/Sports",
                "description": "Take advantage of Turin's proximity to the Alps with a day trip to nearby ski resorts like Sestriere, Bardonecchia, or Sauze d'Oulx, all within 1-2 hours of the city.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "High (transport, lift pass, equipment)",
                "seasonal_notes": "Ski season typically runs December through March, with best conditions usually in January-February.",
                "booking_tips": "Consider the ski bus services from Turin. Book equipment rental and ski passes in advance, especially during peak periods."
            },
            {
                "name": "Hot Chocolate & Bicerin Tour",
                "type": "Food & Drink/Cultural",
                "description": "Warm up with Turin's famous hot chocolate and traditional Bicerin (layered coffee, chocolate, and cream) at historic cafes like Caffè Al Bicerin, Baratti & Milano, and Caffè Torino.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "A perfect winter activity when it's cold outside. Historic cafes are particularly atmospheric during the holiday season.",
                "booking_tips": "No reservations needed, though Caffè Al Bicerin can have queues. Prices are higher sitting at a table versus standing at the bar."
            },
            {
                "name": "Museo Egizio on Snowy Days",
                "type": "Cultural/Museum",
                "description": "Take advantage of colder days to explore the Egyptian Museum (second largest in the world after Cairo) without the summer crowds.",
                "indoor": true,
                "best_time": "Morning (fewer crowds)",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is low season for tourism, offering a more relaxed museum experience. Special exhibitions often run during this period.",
                "booking_tips": "Book tickets online to skip the line. Consider the Torino+Piemonte Card for museum discounts."
            },
            {
                "name": "Carnevale Celebrations",
                "type": "Festival",
                "description": "Experience local carnival festivities, including the historical Carnevale di Ivrea (about 1 hour from Turin), famous for its spectacular Battle of the Oranges.",
                "indoor": false,
                "best_time": "All Day (varies by event)",
                "price_range": "Free (to watch) / Low (for traditional sweets)",
                "seasonal_notes": "Celebrations occur in the period before Lent (typically February). Dates vary each year based on Easter calendar.",
                "booking_tips": "For Ivrea's orange battle, book transportation and accommodations well in advance. Wear old clothes and protective gear if participating!"
            }
        ]
    }
} 