{
  "sites": [
    {
      "name": "Royal Palace of Turin (Palazzo Reale)",
      "type": "Palace/Museum Complex",
      "description": "16th-century main residence of the House of Savoy, Italy's former ruling family. Part of a UNESCO World Heritage site. Includes Royal Apartments, Armoury, Library, Chapel of the Holy Shroud, Sabauda Gallery, Archaeology Museum, and Royal Gardens.",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Closed on Mondays. Gardens offer views of Mole Antonelliana. Part of the Musei Reali complex.",
      "booking_tips": "Book tickets online via the official Musei Reali website to avoid lines. Allow several hours to visit the entire complex. Included in Torino+Piemonte Card.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 45.0728,
      "longitude": 7.6849
    },
    {
      "name": "Mole Antonelliana & National Cinema Museum (Museo Nazionale del Cinema)",
      "type": "Monument/Museum",
      "description": "Turin's iconic landmark building, originally designed as a synagogue. Houses the National Cinema Museum, one of the most important of its kind in the world. Features a panoramic lift to the top for stunning city views.",
      "indoor": true,
      "best_time": "Anytime (Museum), Clear Day (Lift)",
      "price_range": "Moderate",
      "seasonal_notes": "Lift access depends on weather. Views are best on clear days. Museum is extensive and engaging.",
      "booking_tips": "Book tickets online, especially for the lift, to avoid queues. Combined tickets available for museum and lift. Discounted lift ticket with Torino+Piemonte Card.",
      "ratings": {
        "cost_estimate": 17,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 45.0690,
      "longitude": 7.6926
    },
    {
      "name": "Egyptian Museum (Museo Egizio)",
      "type": "Museum",
      "description": "The world's oldest museum dedicated entirely to Egyptian culture, and considered the second most important collection of Egyptian antiquities outside of Egypt. Features extensive artifacts, statues, mummies, and papyri.",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Excellent indoor activity year-round. Can be very busy, especially during peak season.",
      "booking_tips": "Booking tickets online well in advance is highly recommended due to popularity. Included in Torino+Piemonte Card. Allow ample time (at least 3 hours).",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 3.5,
        "cultural_significance": 5
      },
      "latitude": 45.0684,
      "longitude": 7.6841
    },
    {
      "name": "National Automobile Museum (MAUTO - Museo dell'Automobile di Torino)",
      "type": "Museum",
      "description": "One of the world's most famous technical-scientific museums dedicated to automobiles. Features a vast collection of over 200 original cars from 80 different brands, tracing the history of the automobile.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Great indoor activity, especially for car enthusiasts. Located slightly outside the immediate city center.",
      "booking_tips": "Tickets available online. Included in Torino+Piemonte Card. Consider transport options to reach the museum.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 45.0329,
      "longitude": 7.6885
    },
    {
      "name": "Monte dei Cappuccini",
      "type": "Viewpoint/Church",
      "description": "Hilltop location featuring the Church of Santa Maria del Monte dei Cappuccini. Offers arguably the best panoramic views of Turin, the Po River, and the Alps, especially stunning on clear days and at sunset.",
      "indoor": false,
      "best_time": "Afternoon/Sunset (Clear Day)",
      "price_range": "Free",
      "seasonal_notes": "Views heavily dependent on weather clarity. Reachable by a ~20-minute walk uphill from Piazza Vittorio Veneto.",
      "booking_tips": "No booking required for the viewpoint or church entrance. Wear comfortable shoes for the walk up. Church has limited opening hours.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 45.0606,
      "longitude": 7.7008
    },
    {
      "name": "Parco del Valentino & Borgo Medievale",
      "type": "Park/Historical Recreation",
      "description": "Turin's popular public park along the Po River, featuring botanical gardens, fountains, Valentino Castle (university faculty), and the Borgo Medievale - a faithful recreation of a 15th-century Piedmontese village built for the 1884 Italian General Exhibition.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free (Park) / Low (Borgo Fortress)",
      "seasonal_notes": "Beautiful year-round, great for walks and relaxation. Borgo Medievale fortress entry included in Torino+Piemonte Card.",
      "booking_tips": "No booking needed for the park. Check hours and specific entry fees for the Borgo fortress (Rocca).",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 45.0550,
      "longitude": 7.6897
    },
    {
       "name": "Piazza San Carlo",
       "type": "Square",
       "description": "One of Turin's main city squares, known as Turin's 'drawing room'. Features elegant Baroque architecture, twin churches (Santa Cristina and San Carlo Borromeo), an equestrian statue of Emanuele Filiberto, and historic cafes.",
       "indoor": false,
       "best_time": "Anytime",
       "price_range": "Free",
       "seasonal_notes": "A central hub year-round. Hosts events and markets occasionally. Beautifully lit at night.",
       "booking_tips": "No booking required. Great place for a stroll, coffee at a historic cafe (like Caffè Torino or Caffè San Carlo), and people-watching.",
       "ratings": {
         "cost_estimate": 0,
         "suggested_duration_hours": 0.75,
         "cultural_significance": 4
      },
       "latitude": 45.0677,
       "longitude": 7.6825
    },
    {
      "name": "Porta Palazzo Market (Mercato di Porta Palazzo)",
      "type": "Market",
      "description": "One of the largest open-air markets in Europe, located in Piazza della Repubblica. Offers a vast array of goods including fresh produce, meat, fish, cheese, clothing, household items, and more. Known for its vibrant and multicultural atmosphere.",
      "indoor": false,
      "best_time": "Morning (Weekdays & Saturday)",
      "price_range": "Low-Moderate (depending on purchases)",
      "seasonal_notes": "Most active in the mornings, especially Saturday. Quieter on Sundays. Offers seasonal produce.",
      "booking_tips": "No booking required. Best explored on foot. Be prepared for crowds. Great place for fresh food and local experience. Be aware of your surroundings.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 45.0772,
      "longitude": 7.6810
    },
    {
      "name": "La Venaria Reale",
      "type": "Palace/Gardens",
      "description": "Magnificent 17th-century royal palace and gardens, one of the largest royal residences in the world. Part of the Residences of the Royal House of Savoy UNESCO World Heritage Site. Features stunning baroque architecture, extensive gardens, and rotating exhibitions.",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Gardens are especially beautiful in spring and summer. Located in the town of Venaria, about 10km from Turin center.",
      "booking_tips": "Book tickets online to avoid queues. Accessible by shuttle bus from Turin or by car. Allow at least half a day for a visit. Included in Torino+Piemonte Card.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 4,
        "cultural_significance": 5
      },
      "latitude": 45.1359,
      "longitude": 7.6266
    },
    {
      "name": "Palazzo Madama",
      "type": "Palace/Museum",
      "description": "Historic palace in the center of Turin with a medieval castle and baroque facade. Houses the Museo Civico d'Arte Antica (Civic Museum of Ancient Art) with an extensive collection of decorative arts, paintings, and sculptures from the Middle Ages to the 18th century.",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Located in Piazza Castello. The rooftop offers good views of the historic center. Part of Musei Torino network.",
      "booking_tips": "Tickets available online. Included in Torino+Piemonte Card. Combined tickets available with other city museums.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 45.0714,
      "longitude": 7.6859
    },
    {
      "name": "Cathedral of Saint John the Baptist (Duomo di Torino)",
      "type": "Religious Site",
      "description": "Turin's main cathedral dating from the late 15th century, known for housing the famous Turin Shroud (only displayed on rare occasions). Features Renaissance architecture and an adjacent bell tower (Torre Campanaria).",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Free (Cathedral) / Low (Royal Chapel)",
      "seasonal_notes": "Adjacent Holy Shroud Chapel (Cappella della Sacra Sindone) has been restored and reopened to the public. The actual Shroud is rarely displayed.",
      "booking_tips": "No booking required for the cathedral. Dress modestly. Photography restrictions apply in some areas. Check in advance if interested in the Shroud Museum.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 45.0734,
      "longitude": 7.6851
    },
    {
      "name": "Museum of Oriental Art (MAO - Museo d'Arte Orientale)",
      "type": "Museum",
      "description": "Specialized museum housed in the historic Palazzo Mazzonis, featuring one of Italy's most important collections of Asian art. Five sections cover different regions: South Asia, China, Japan, the Himalayan Region, and Islamic countries.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Excellent year-round activity. Located in the historic center near Quadrilatero Romano district.",
      "booking_tips": "Tickets available at entrance or online. Included in Torino+Piemonte Card. Less crowded than other major Turin museums.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 45.0730,
      "longitude": 7.6783
    },
    {
      "name": "Basilica of Superga (Basilica di Superga)",
      "type": "Religious Site/Viewpoint",
      "description": "18th-century basilica located on a hill overlooking Turin, commissioned by Duke Victor Amadeus II. Features baroque architecture, royal tombs of the House of Savoy, and panoramic views of Turin and the Alps.",
      "indoor": false,
      "best_time": "Morning/Early Afternoon (Clear Day)",
      "price_range": "Free (Basilica) / Low (Royal Tombs & Dome)",
      "seasonal_notes": "Best visited on clear days for the views. Site of the 1949 Superga air disaster that killed the entire Torino football team. Memorial present.",
      "booking_tips": "Accessible by car or the historic rack tramway (Dentiera di Superga). Check tramway schedule in advance. Wear comfortable shoes.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 45.0788,
      "longitude": 7.7652
    },
    {
      "name": "Piazza Castello",
      "type": "Square",
      "description": "Turin's central square and the heart of the historic center. Surrounded by important buildings including Palazzo Reale, Palazzo Madama, Teatro Regio (Royal Theater), and Royal Library. Main hub for pedestrian streets and shopping avenues.",
      "indoor": false,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Active throughout the year. Often hosts events and installations. Central hub for exploring Turin's historic center.",
      "booking_tips": "No booking required. Great starting point for Turin walking tours. Near several main museums and attractions.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 45.0709,
      "longitude": 7.6856
    },
    {
      "name": "Museum of Modern and Contemporary Art (GAM - Galleria Civica d'Arte Moderna e Contemporanea)",
      "type": "Museum",
      "description": "Turin's premier museum of modern and contemporary art, housing one of Italy's most important collections. Features works from the 19th century to present day, including paintings, sculptures, photographs, and installations.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Located slightly northwest of the city center. Hosts temporary exhibitions alongside permanent collection.",
      "booking_tips": "Tickets available online or at entrance. Included in Torino+Piemonte Card. Check website for current exhibitions.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 45.0773,
      "longitude": 7.6599
    },
    {
      "name": "Quadrilatero Romano",
      "type": "Historic District",
      "description": "Turin's ancient Roman quarter with a grid layout dating back to the Roman colony of Julia Augusta Taurinorum. Now a vibrant area with narrow streets, shops, restaurants, bars, and historical buildings. Popular for evening aperitivo.",
      "indoor": false,
      "best_time": "Afternoon/Evening",
      "price_range": "Low-High (depending on activities)",
      "seasonal_notes": "Lively year-round, especially in evenings. Many historic buildings, small squares, and churches to discover. Great for food and nightlife.",
      "booking_tips": "No booking required for general exploration. Reservation recommended for popular restaurants. Best explored on foot.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 45.0745,
      "longitude": 7.6785
    },
    {
      "name": "Villa della Regina",
      "type": "Historic Residence/Gardens",
      "description": "17th-century royal residence on the hills east of Turin, built for Prince Maurice of Savoy. Features baroque architecture, frescoed interiors, formal Italian gardens, and historic vineyard producing wine since the 17th century.",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Gardens particularly beautiful in spring and summer. Good views of the city. Less crowded than other royal residences.",
      "booking_tips": "Check opening days as it has limited opening times. Included in Torino+Piemonte Card. Accessible by bus or car from city center.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 45.0572,
      "longitude": 7.7140
    },
    {
      "name": "Juventus Stadium & Museum",
      "type": "Sports Venue/Museum",
      "description": "Home stadium of Juventus Football Club, one of Italy's most successful teams. Features the J-Museum chronicling the club's history, trophy room, and interactive exhibits. Stadium tours include access to team areas.",
      "indoor": true,
      "best_time": "Non-Match Days",
      "price_range": "Moderate-High",
      "seasonal_notes": "Located in the northwest outskirts of Turin. Museum open year-round, but stadium tours unavailable on match days and the day before matches.",
      "booking_tips": "Book stadium tour and museum tickets online in advance. Combined tickets available. Check Juventus schedule for match days. Accessible by public transport.",
      "ratings": {
        "cost_estimate": 22,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 45.1092,
      "longitude": 7.6414
    },
    {
      "name": "Piazza Vittorio Veneto",
      "type": "Square",
      "description": "One of Europe's largest porticoed squares, located at the eastern edge of Turin's historic center, bordering the Po River. Features uniform Neoclassical buildings, many cafes and restaurants, and views of the Gran Madre church and hills.",
      "indoor": false,
      "best_time": "Anytime/Evening",
      "price_range": "Free",
      "seasonal_notes": "Lively especially in evenings when it becomes a nightlife hub. Starting point for walks along the Po River. Popular meeting place.",
      "booking_tips": "No booking required. Many dining options ranging from casual to upscale. Great for people-watching and aperitivo.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 45.0665,
      "longitude": 7.6941
    },
    {
      "name": "Museo Lavazza",
      "type": "Museum",
      "description": "Interactive museum dedicated to the history and culture of coffee, located in the innovative Lavazza headquarters (Nuvola Lavazza). Features multimedia exhibits on coffee production, history, and the Lavazza company story.",
      "indoor": true,
      "best_time": "Morning/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Opened in 2018. Located in the Aurora district, slightly north of the historic center. Includes a restaurant and coffee shop.",
      "booking_tips": "Booking online is recommended. Tours are guided and in timed slots. Ticket includes coffee tasting. Check website for languages available.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 45.0832,
      "longitude": 7.6909
    }
  ]
}