{
    "Spring": {
        "activities": [
            {
                "name": "Wilhelminapark Bloom",
                "type": "Park",
                "description": "Experience Utrecht's elegant urban park coming to life with spring flowers, blossoming trees, and locals enjoying picnics and outdoor activities.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Late March through May offers increasingly pleasant temperatures and beautiful flowering trees throughout this English landscape-style park.",
                "booking_tips": "No booking required; bring a blanket for picnicking and explore the historic villas surrounding the park."
            },
            {
                "name": "Utrecht Flower Market",
                "type": "Market",
                "description": "Discover Utrecht's vibrant flower market on Janskerkhof square, where local vendors offer tulips, bulbs, potted plants, and cut flowers in a historic setting.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free entry",
                "seasonal_notes": "Held every Saturday, the market is particularly spectacular from March through May when Dutch spring flowers are at their peak.",
                "booking_tips": "No booking required; arrive early for the best selection. Bring cash as some vendors don't accept cards."
            },
            {
                "name": "Blossoms in Utrecht Botanical Gardens",
                "type": "Garden",
                "description": "Explore Utrecht University's botanical gardens as they awaken in spring, featuring themed collections including rock garden, tropical greenhouses, and butterfly house.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Garden opens in March with different collections blooming throughout spring. The rock garden is particularly stunning in April and May.",
                "booking_tips": "No advance booking required; check the website for special spring exhibitions and guided tours focusing on seasonal highlights."
            },
            {
                "name": "King's Day (Koningsdag)",
                "type": "Festival",
                "description": "Join the Netherlands' biggest national celebration with street parties, orange outfits, free markets, and boat parties along Utrecht's unique canal system.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free entry",
                "seasonal_notes": "Celebrated on April 27th (or April 26th if the 27th falls on a Sunday), Utrecht hosts one of the country's most vibrant King's Day celebrations.",
                "booking_tips": "No reservation needed for general festivities; canal boat parties should be booked months in advance. The Utrecht vrijmarkt (free market) starts the evening before."
            },
            {
                "name": "Dutch Asparagus Season",
                "type": "Food & Drink",
                "description": "Experience the Netherlands' beloved white asparagus season by enjoying special menus featuring the 'white gold' at restaurants throughout Utrecht.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Moderate",
                "seasonal_notes": "Running from mid-April through June, asparagus season is celebrated with dedicated menus highlighting different preparations of this seasonal delicacy.",
                "booking_tips": "Make reservations at restaurants like Podium onder de Dom or Karel 5 for traditional asparagus dishes with a modern twist."
            },
            {
                "name": "Utrecht Canals Boat Tour",
                "type": "Excursion",
                "description": "Cruise Utrecht's unique medieval canal system with its distinctive two-level wharves, especially beautiful in spring with flowering plants along the water.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings pleasant temperatures and fewer tourists than summer months, while canal-side trees and plants begin to bloom.",
                "booking_tips": "Book tours through Schuttevaer or other local operators; smaller boats can access more of Utrecht's narrow canals for a more intimate experience."
            },
            {
                "name": "Keukenhof Day Trip",
                "type": "Excursion",
                "description": "Take a day trip to the world's largest flower garden showcasing millions of tulips, daffodils, and other spring bulbs in spectacular displays.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Open from late March to mid-May, with peak blooms usually in mid-April depending on the weather.",
                "booking_tips": "Purchase tickets online in advance; easily accessible via direct bus connections from Utrecht Central Station to Keukenhof."
            },
            {
                "name": "Utrecht Urban Trail",
                "type": "Sport",
                "description": "Participate in this unique running event that takes participants through buildings, museums, theaters, and other normally inaccessible locations throughout Utrecht.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Typically held in April or May, this fun run offers a completely different perspective on Utrecht's landmarks.",
                "booking_tips": "Register online well in advance as participation is limited and spots fill quickly."
            },
            {
                "name": "Spring Music Festival at TivoliVredenburg",
                "type": "Music",
                "description": "Experience classical and contemporary music performances at Utrecht's premier concert venue as they launch their spring season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Spring programming typically features both established artists and emerging talents across TivoliVredenburg's five acoustically specialized halls.",
                "booking_tips": "Purchase tickets online through the TivoliVredenburg website; popular performances sell out quickly."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Utrecht Canal Pride",
                "type": "Festival",
                "description": "Celebrate LGBTQ+ culture at Utrecht's colorful boat parade and festivities along the medieval canal system, with decorated boats and canalside parties.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held in June, this celebration brings rainbow colors to Utrecht's historic waterways with a more intimate atmosphere than Amsterdam's larger pride events.",
                "booking_tips": "No booking needed for watching the parade; special events and boat participation require advance registration."
            },
            {
                "name": "Cultural Sundays",
                "type": "Festival",
                "description": "Experience Utrecht's free cultural programming held on specific Sundays, with outdoor performances, exhibitions, and activities throughout the city center.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer editions feature extensive outdoor programming making use of Utrecht's squares, parks and historic buildings.",
                "booking_tips": "No booking required; check the Cultural Sundays website for specific themes and locations for each edition."
            },
            {
                "name": "Canal-side Dining",
                "type": "Food & Drink",
                "description": "Enjoy meals and drinks at the unique wharf-level restaurants and cafés along Utrecht's Oudegracht, directly at water level in medieval cellars with outdoor seating.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings extended evening hours and the most pleasant outdoor dining experience along Utrecht's distinctive dual-level canal system.",
                "booking_tips": "Reserve canal-side tables in advance, especially for dinner during weekends; request outdoor seating specifically."
            },
            {
                "name": "Utrecht Early Music Festival",
                "type": "Music",
                "description": "Attend the world's largest festival dedicated to medieval, renaissance, and baroque music, with performances in historic venues throughout Utrecht.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held in late August/early September, this prestigious festival attracts early music specialists and ensembles from around the world.",
                "booking_tips": "Purchase tickets well in advance, especially for headline performances in venues like medieval churches and TivoliVredenburg."
            },
            {
                "name": "Boat Rental on Utrecht Canals",
                "type": "Recreation",
                "description": "Rent your own small electric boat to navigate Utrecht's peaceful canals at your own pace, exploring the medieval center from water level.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the best weather for self-piloted canal exploration, with rental companies operating at full capacity from June through August.",
                "booking_tips": "Reserve boats in advance through companies like Kanoverhuur Utrecht or Sloep Huren Utrecht, especially for weekend rentals."
            },
            {
                "name": "City Beaches Utrecht",
                "type": "Recreation",
                "description": "Relax at urban beaches along the Singel canal and Leidsche Rijn, with sandy areas, lounge chairs, and pop-up food and drink venues.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free entry",
                "seasonal_notes": "Operating from June through August, these urban beaches create a holiday atmosphere within the city when temperatures rise.",
                "booking_tips": "No reservations needed for general access; arrive early on hot days to secure lounge spots. Beach bars may accept reservations for dining."
            },
            {
                "name": "Trajectum Lumen Evening Walk",
                "type": "Art",
                "description": "Experience Utrecht's light art walking route that illuminates historic buildings and sites throughout the medieval center after dark.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "While operational year-round, summer's late sunsets mean the installations activate later in the evening, around 10pm in June and July.",
                "booking_tips": "No booking required; download the free app or pick up a map from the tourist office to follow the self-guided route."
            },
            {
                "name": "Festival Oude Muziek",
                "type": "Music",
                "description": "Attend Europe's most important early music festival featuring performances on period instruments in historic venues throughout Utrecht.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held in late August/early September, this 10-day festival transforms Utrecht into the world capital of early music.",
                "booking_tips": "Purchase tickets months in advance for popular concerts; festival passes offer the best value for serious music lovers."
            },
            {
                "name": "Terrace Dining at Neude Square",
                "type": "Food & Drink",
                "description": "Enjoy outdoor dining and people-watching at the cafés surrounding Neude Square, one of Utrecht's most vibrant public spaces during summer.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings extended terrace hours, with the square bustling well into the evening with a mix of locals and visitors.",
                "booking_tips": "No reservations needed for most casual cafés; for restaurants like STAN & CO, book in advance for dinner hours."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Dutch Film Festival",
                "type": "Festival",
                "description": "Experience the Netherlands' premier film festival celebrating Dutch cinema with premieres, retrospectives, and the prestigious Golden Calf awards.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held annually in late September/early October, this festival showcases the best of Dutch filmmaking across multiple Utrecht venues.",
                "booking_tips": "Purchase tickets online as soon as the program is released; popular films and the awards ceremony sell out quickly."
            },
            {
                "name": "Utrecht Botanical Gardens Autumn Colors",
                "type": "Garden",
                "description": "Experience the university botanical gardens as fall foliage creates striking color contrasts among the diverse plant collections.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Mid-October to early November offers the most vibrant fall foliage, with Japanese maples and other specimen trees at their most colorful.",
                "booking_tips": "No booking required; photography enthusiasts should visit on clear days for the best light on autumn colors."
            },
            {
                "name": "IMPAKT Festival",
                "type": "Media Art",
                "description": "Explore this annual media art festival focusing on new developments in media, technology, and digital culture through exhibitions and symposiums.",
                "indoor": true,
                "best_time": "Varies",
                "price_range": "Moderate",
                "seasonal_notes": "Held in late October or early November, this festival presents critical perspectives on technology and media across multiple Utrecht venues.",
                "booking_tips": "Check the festival website for program details and purchase tickets online for popular talks and screenings."
            },
            {
                "name": "Singelloop Utrecht",
                "type": "Sport",
                "description": "Watch or participate in Utrecht's largest running event, with courses following the scenic canal ring around the historic city center.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget to participate, Free to watch",
                "seasonal_notes": "Held in early October, the race takes advantage of cooler autumn temperatures while showcasing Utrecht's historic canals and parks.",
                "booking_tips": "Register months in advance if participating; spectators can watch for free along the course with particularly scenic spots along the Singel canal."
            },
            {
                "name": "Le Guess Who? Festival",
                "type": "Music",
                "description": "Experience this acclaimed international festival dedicated to boundary-crossing music from across genres and global traditions.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held in November, this four-day festival brings experimental and innovative music to venues throughout Utrecht, including churches and historic buildings.",
                "booking_tips": "Purchase festival passes well in advance; individual show tickets become available closer to the event but sell quickly for popular acts."
            },
            {
                "name": "Game and Wild Season",
                "type": "Food & Drink",
                "description": "Enjoy autumn's harvest with seasonal specialties like wild game and forest mushrooms at Utrecht's fine dining restaurants.",
                "indoor": true,
                "best_time": "Dinner",
                "price_range": "Expensive",
                "seasonal_notes": "October through December is high season for venison, duck, and other game meats paired with seasonal Dutch ingredients.",
                "booking_tips": "Reserve tables at restaurants like Podium onder de Dom or Karel 5 to experience these seasonal specialties from local hunters and foragers."
            },
            {
                "name": "ILFU International Literature Festival Utrecht",
                "type": "Literary",
                "description": "Attend readings, interviews, and literary events featuring renowned international authors at venues throughout Utrecht.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Held in September, this festival celebrates international literature with both established and emerging writers presenting their work.",
                "booking_tips": "Purchase tickets through the festival website; events with famous authors sell out quickly."
            },
            {
                "name": "Autumn Walks in Amelisweerd Forest",
                "type": "Nature",
                "description": "Experience spectacular fall foliage in this historic forest estate just outside Utrecht, with centuries-old trees and walking paths along the Kromme Rijn river.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Mid-October through early November offers peak autumn colors in this protected woodland with manor houses and historic landscapes.",
                "booking_tips": "No booking required; easily accessible by bicycle from central Utrecht or by bus to Bunnik."
            },
            {
                "name": "St. Martin's Day Parade",
                "type": "Traditional",
                "description": "Experience the traditional children's lantern procession celebrating St. Martin, with songs, homemade lanterns, and treats throughout Utrecht neighborhoods.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Celebrated on November 11th, this Dutch tradition sees children walking with lanterns and singing traditional songs door-to-door.",
                "booking_tips": "No booking required; the main parade typically starts at the Dom Tower, but smaller processions occur in neighborhoods throughout the city."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Utrecht Winter Festival",
                "type": "Festival",
                "description": "Experience winter magic with this festival featuring illuminations, cultural events, and festive activities throughout Utrecht's historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Mostly Free",
                "seasonal_notes": "Running from mid-December through early January, the festival transforms Utrecht's medieval center with light installations and seasonal activities.",
                "booking_tips": "General access is free; special performances and workshops may require advance tickets through the festival website."
            },
            {
                "name": "Ice Skating at Neude Square",
                "type": "Recreation",
                "description": "Skate on the seasonal ice rink set up in Utrecht's historic Neude Square, surrounded by cafés and the impressive former post office building.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "From December to February, this outdoor ice rink offers winter recreation in a historic setting with skate rentals available.",
                "booking_tips": "No reservations needed; weekday afternoons are least crowded. Skate rental available onsite."
            },
            {
                "name": "Sinterklaas Arrival",
                "type": "Traditional",
                "description": "Experience the Dutch tradition of Sinterklaas as he arrives by boat along the Oudegracht canal, accompanied by a parade through the city center.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Sinterklaas arrives in mid-November, with celebrations continuing until December 5th (Sinterklaasavond) when Dutch children receive gifts.",
                "booking_tips": "No booking required; arrive early for good viewing spots along the Oudegracht or Weerdsluis where Sinterklaas typically arrives by boat."
            },
            {
                "name": "Christmas at Dom Square",
                "type": "Market",
                "description": "Experience the festive atmosphere of Utrecht's main square with holiday decorations, winter markets, and the illuminated Dom Tower as backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free entry",
                "seasonal_notes": "From late November through December, the historic Domplein transforms with holiday lights and seasonal activities.",
                "booking_tips": "No booking required; visit in the evening when illuminations are most impressive. Combine with a visit to nearby churches for holiday concerts."
            },
            {
                "name": "Canal Ice Skating",
                "type": "Recreation",
                "description": "When conditions allow, experience the Dutch tradition of ice skating on Utrecht's frozen canals, especially magical along the Oudegracht.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Dependent on sufficient freezing temperatures, usually possible in January or February during cold snaps.",
                "booking_tips": "No booking required; bring your own skates or rent them locally. Check Dutch weather reports for 'natuurijs' (natural ice) conditions."
            },
            {
                "name": "Whisky Festival Utrecht",
                "type": "Food & Drink",
                "description": "Warm up winter with tastings of hundreds of whiskies from around the world at this festival for enthusiasts and curious beginners alike.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Typically held in January or February, this festival brings warmth to the cold winter months with spirits tastings and masterclasses.",
                "booking_tips": "Purchase tickets well in advance through the festival website; sessions often sell out quickly."
            },
            {
                "name": "TivoliVredenburg Winter Concert Series",
                "type": "Music",
                "description": "Enjoy special winter programming at Utrecht's premier music venue, from classical Christmas concerts to contemporary winter festivals.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "December through February features seasonal programming across genres, with holiday specials in December and new year festivals in January.",
                "booking_tips": "Purchase tickets online through the TivoliVredenburg website; holiday concerts sell out weeks in advance."
            },
            {
                "name": "Oliebollen and Winter Treats",
                "type": "Food & Drink",
                "description": "Sample traditional Dutch winter treats like oliebollen (Dutch doughnuts) and appelbeignets (apple fritters) from seasonal stalls throughout Utrecht.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Available throughout December, culminating on December 31st when eating oliebollen is a Dutch New Year's Eve tradition.",
                "booking_tips": "No reservations needed; the most popular stands are usually found near the Vredenburg and along major shopping streets."
            },
            {
                "name": "Utrecht Winter Beer Festival",
                "type": "Food & Drink",
                "description": "Discover seasonal winter brews, barleywines, and strong ales from Dutch craft breweries at this cozy indoor beer festival.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in January or February, this festival features warming winter beers perfectly suited to the cold season.",
                "booking_tips": "Purchase tickets in advance through the festival website; sessions often sell out for this popular winter event."
            }
        ]
    }
}