{
    "December": {
        "reasons_to_visit": [
            {
                "reason": "Christmas Markets in Great Square",
                "details": "Traditional Czech Christmas markets in the Great Square feature handcrafted ornaments, local treats, and warm mulled wine (svařené víno)."
            },
            {
                "reason": "Winter Wonderland Atmosphere",
                "details": "Snow-covered historic architecture, especially the White Tower and Holy Spirit Cathedral, creates a magical winter atmosphere."
            },
            {
                "reason": "Cozy Indoor Culture",
                "details": "Perfect time to visit the East Bohemian Museum, Klicper Theatre, and warm cafés while enjoying traditional Czech Christmas atmosphere."
            },
            {
                "reason": "Authentic Czech Christmas",
                "details": "Experience genuine Czech Christmas traditions, including traditional Christmas markets and local holiday celebrations."
            },
            {
                "reason": "New Year's Eve Celebrations",
                "details": "December builds to festive New Year's Eve celebrations with fireworks and local festivities in the Great Square."
            }
        ],
        "reasons_to_avoid": [
            {
                "reason": "Cold Winter Weather",
                "details": "December temperatures often drop below freezing (-2 to 4°C), requiring heavy winter clothing and preparation for snow."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "Shortest days of the year with only 8 hours of daylight, limiting outdoor sightseeing opportunities."
            },
            {
                "reason": "Christmas Holiday Closures",
                "details": "Some attractions and restaurants may have limited hours during Christmas Eve, Christmas Day, and New Year's Day."
            },
            {
                "reason": "Higher Holiday Prices",
                "details": "Christmas and New Year's periods see increased prices for accommodations and dining, though still more affordable than Prague."
            }
        ],
        "weather": {
            "temperature_range": "-2°C to 4°C (28°F to 39°F)",
            "rainfall": "Low-Moderate (30mm average)",
            "snow": "Common (8 snow days average)",
            "daylight_hours": "8 hours",
            "sunshine_hours": "2 hours daily"
        },
        "activities": [
            "Christmas market shopping in Great Square",
            "Winter photography of historic architecture",
            "East Bohemian Museum winter exhibitions",
            "Klicper Theatre performances",
            "Traditional Czech Christmas experiences",
            "Indoor café culture with warm drinks",
            "White Tower winter views (weather permitting)",
            "Holiday shopping in local boutiques",
            "New Year's Eve celebrations",
            "Cozy restaurant dining experiences"
        ],
        "special_events": [
            {
                "event": "Christmas Markets",
                "location": "Great Square (Velké náměstí)",
                "description": "Traditional Czech Christmas markets with handcrafted ornaments, local treats, and mulled wine",
                "dates": "Throughout December",
                "crowd_level": "High during weekends and Christmas week"
            },
            {
                "event": "Christmas Concerts",
                "location": "Holy Spirit Cathedral",
                "description": "Traditional Christmas concerts and carol performances in the historic cathedral",
                "dates": "Mid-December",
                "crowd_level": "Moderate"
            },
            {
                "event": "New Year's Eve Celebrations",
                "location": "Great Square",
                "description": "Festive New Year's Eve celebrations with fireworks and local festivities",
                "dates": "December 31st",
                "crowd_level": "High"
            }
        ],
        "local_tips": [
            "Visit Christmas markets early morning for fewer crowds and better selection",
            "Dress warmly and wear proper winter footwear for snow and ice",
            "Book restaurants in advance, especially for Christmas Eve and New Year's Eve",
            "Visit indoor attractions like the East Bohemian Museum during cold weather",
            "Enjoy traditional Czech Christmas treats like vánočka (Christmas bread) and mulled wine",
            "Check opening hours for attractions during Christmas holidays",
            "Take advantage of shorter days for cozy indoor cultural experiences"
        ]
    }
}