{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Ideal Weather",
                "details": "May offers some of Bordeaux's most pleasant weather, with warm days, cool evenings, and abundant sunshine before the summer heat arrives."
            },
            {
                "reason": "Blooming Vineyards",
                "details": "The vineyard landscape is at its lush green peak in May, with vines growing rapidly and the countryside transformed into a verdant paradise."
            },
            {
                "reason": "European Museum Night",
                "details": "Mid-May brings the annual Night of Museums, when Bordeaux's cultural institutions open their doors late with special events and free admission."
            },
            {
                "reason": "Open Doors Weekends",
                "details": "Several wine appellations host 'Portes Ouvertes' (Open Doors) weekends in May, when normally private châteaux welcome visitors for tours and tastings."
            },
            {
                "reason": "Spring Markets",
                "details": "Farmers' markets overflow with spring produce, including local strawberries, asparagus, and early cherries, showcasing the region's seasonal bounty."
            },
            {
                "reason": "Pre-Season Value",
                "details": "May offers an excellent balance of lovely weather and pre-peak season prices, with good values still available before summer rates take effect."
            },
            {
                "reason": "Outdoor Culture",
                "details": "Bordeaux's café culture moves outdoors, with restaurant terraces and riverfront spaces filled with locals enjoying the spring sunshine."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Public Holidays",
                "details": "May has several French public holidays (May 1, 8, and sometimes Ascension), when some businesses close and domestic tourism increases for long weekends."
            },
            {
                "reason": "Increasing Tourism",
                "details": "Tourist numbers rise steadily throughout May, with the latter part of the month seeing significantly more visitors than early spring."
            },
            {
                "reason": "Occasional Rain Showers",
                "details": "While generally sunny, May can still experience brief rain showers, requiring some flexibility in outdoor planning."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "10°C"
                },
                "precipitation": "May averages 9 rainy days for the month, but showers are typically brief and followed by sunshine. Overall conditions are predominantly sunny.",
                "general_tips": "Pack layers for cool mornings and evenings, with lighter clothing for warm afternoons. A light rain jacket or compact umbrella is still useful."
            },
            "tourism_level": {
                "crowds": "Tourism increases after Easter, but early May remains relatively moderate outside of the holiday weekends.",
                "pricing": "Accommodation prices begin to increase but still offer better value than summer months.",
                "overall_atmosphere": "The city feels energetic and lively, with a good mix of tourists and locals enjoying the pleasant spring conditions."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (May 1)",
                    "date": "May 1",
                    "description": "National holiday when most businesses, shops, and some attractions are closed. Traditional day for lily-of-the-valley sales and workers' demonstrations.",
                    "notes": "Public transportation runs on a holiday schedule. Many museums and tourist sites remain open, but confirm in advance."
                },
                {
                    "name": "Victory in Europe Day (May 8)",
                    "date": "May 8",
                    "description": "Public holiday commemorating the end of WWII in Europe with ceremonies at war memorials throughout the city.",
                    "notes": "Government offices and many businesses close, but most tourism-oriented establishments remain open."
                },
                {
                    "name": "Portes Ouvertes en Médoc",
                    "date": "Early May (varies by year)",
                    "description": "Open doors weekend in the Médoc wine region, when many châteaux welcome visitors without appointment.",
                    "notes": "Check the specific dates on the Médoc wine route website. A rental car is useful, though some tour companies offer special itineraries for this event."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Bicycle Wine Tour",
                    "where": "Saint-Émilion or Entre-Deux-Mers wine regions",
                    "description": "Explore the vineyards by bicycle when the countryside is lush and green but not yet too hot for comfortable cycling.",
                    "practical_tips": "Several companies offer guided e-bike tours with château visits. Book in advance as May dates are popular.",
                    "best_time": "Morning to early afternoon",
                    "estimated_cost": "Moderate to high",
                    "weather_dependent": true
                },
                {
                    "activity": "Garonne River Cruise",
                    "where": "Bordeaux riverfront",
                    "description": "Take a guided boat tour along the Garonne to see Bordeaux's UNESCO-listed waterfront during the beautiful spring light.",
                    "practical_tips": "Late afternoon cruises offer the best lighting for photography. Wine-tasting cruises provide an extra dimension to the experience.",
                    "best_time": "Late afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Miroir d'Eau at Sunset",
                    "where": "Place de la Bourse",
                    "description": "Experience Bordeaux's famous water mirror during the golden hour of late spring, when the light creates stunning reflections of the historic buildings.",
                    "practical_tips": "Water cycles between mirror effect and mist every 15 minutes. Arrive 30 minutes before sunset for the best lighting conditions.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Spring Market Food Tour",
                    "where": "Various markets throughout Bordeaux",
                    "description": "Explore the seasonal bounty at Bordeaux's farmers' markets, with May offering strawberries, asparagus, and early cherries.",
                    "practical_tips": "Join a guided food tour for insights into local specialties or explore independently. Marché des Capucins is covered (good for rainy days) while Marché des Quais (Sunday mornings) is open-air along the river.",
                    "best_time": "Morning",
                    "estimated_cost": "Low to moderate (tour) or free (self-guided)",
                    "weather_dependent": true
                },
                {
                    "activity": "Picnic in Jardin Public",
                    "where": "Bordeaux's main public garden",
                    "description": "Enjoy the fully blooming French gardens and English-style park with a picnic of local specialties during May's perfect weather.",
                    "practical_tips": "Purchase supplies at nearby bakeries and cheese shops. The garden has plenty of benches and grassy areas perfect for picnicking.",
                    "best_time": "Lunch time",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit La Cité du Vin",
                    "where": "La Cité du Vin wine museum",
                    "description": "Explore this modern, interactive museum dedicated to wine cultures of the world, with spring views from its panoramic Belvedere.",
                    "practical_tips": "Purchase tickets online to avoid lines. Plan 2-3 hours for the visit and don't miss the included wine tasting with panoramic view.",
                    "best_time": "Morning (fewer crowds)",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Arcachon",
                    "where": "Arcachon Bay",
                    "description": "Visit this beautiful coastal town in the pleasant May weather, before the summer beach crowds arrive.",
                    "practical_tips": "Take the train from Bordeaux (50 minutes). Consider the Dune du Pilat (Europe's highest sand dune), oyster villages of Cap Ferret, and boat tours of the bay.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Shopping in Chartrons District",
                    "where": "Chartrons neighborhood",
                    "description": "Explore this historic wine merchant district, now known for its antique shops, boutiques, and cafés, particularly pleasant in spring weather.",
                    "practical_tips": "Visit on market day (Sunday morning) for the best atmosphere. Rue Notre Dame is the main street for antiques and design shops.",
                    "best_time": "Morning to afternoon",
                    "estimated_cost": "Free (excluding purchases)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "12°C"
                },
                "precipitation": "Weather becomes increasingly stable and sunny, with decreasing chances of rain as the month progresses.",
                "general_tips": "Sun protection becomes more important as UV levels increase. Light clothing is suitable for days, with a light jacket or sweater for evenings."
            },
            "tourism_level": {
                "crowds": "Tourism increases notably, approaching early summer levels, especially during the Ascension holiday period if it falls in late May.",
                "pricing": "Accommodation prices continue to rise, with premium rates for holiday weekends and festival periods.",
                "overall_atmosphere": "The city becomes increasingly vibrant and international, with outdoor spaces bustling with activity."
            },
            "events_holidays": [
                {
                    "name": "European Museum Night",
                    "date": "Mid-May (usually third Saturday)",
                    "description": "Annual event when museums and cultural institutions stay open late with special events, performances, and free admission.",
                    "notes": "Very popular with locals and visitors alike. Some venues may require advance registration for special activities."
                },
                {
                    "name": "Ascension Day",
                    "date": "Variable (May or early June)",
                    "description": "Public holiday that often creates a long weekend when many French people travel, potentially increasing domestic tourism.",
                    "notes": "If Ascension falls in May, book accommodations and restaurants well in advance for this period."
                },
                {
                    "name": "Printemps des Liqueurs",
                    "date": "Late May (varies by year)",
                    "description": "Festival celebrating the traditional liqueurs of the region with tastings, workshops, and themed events.",
                    "notes": "Check the Bordeaux tourism website for current dates and participating venues."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Saint-Émilion Day Trip",
                    "where": "Saint-Émilion village and vineyards",
                    "description": "Visit this UNESCO-listed medieval village and surrounding vineyards when the countryside is lush and green but not yet crowded with summer tourists.",
                    "practical_tips": "Take the train from Bordeaux (35 minutes) or join a guided tour. Wear comfortable shoes for walking on cobblestone streets and exploring the underground monuments.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Museum Night Experience",
                    "where": "Various museums throughout Bordeaux",
                    "description": "Take part in the European Museum Night, exploring Bordeaux's museums after hours with special events and illuminations.",
                    "practical_tips": "Plan your route in advance as museums are spread throughout the city. Some popular activities may require advance registration.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Bordeaux Wine School Workshop",
                    "where": "École du Vin de Bordeaux",
                    "description": "Participate in a structured educational workshop at Bordeaux's official wine school, particularly enjoyable in the pleasant May weather.",
                    "practical_tips": "Book in advance on their website. Sessions range from introductory to advanced and are available in multiple languages.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Evening Drinks at Rooftop Bar",
                    "where": "Various rooftop venues in Bordeaux",
                    "description": "Enjoy the mild May evenings at one of Bordeaux's rooftop bars with panoramic views over the city.",
                    "practical_tips": "Venues like the Night Beach at the Grand Hotel or Le Point Rouge offer excellent views. Make reservations for sunset hours.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to high",
                    "weather_dependent": true
                },
                {
                    "activity": "Urban Wine Trail",
                    "where": "Central Bordeaux",
                    "description": "Follow Bordeaux's self-guided urban wine trail connecting wine bars, shops, and tasting rooms throughout the city center.",
                    "practical_tips": "Get the map from the tourist office or download the route. The pleasant May weather makes this walking tour particularly enjoyable.",
                    "best_time": "Afternoon to evening",
                    "estimated_cost": "Variable (depending on tastings)",
                    "weather_dependent": true
                },
                {
                    "activity": "Darwin Ecosystem",
                    "where": "Right bank of the Garonne",
                    "description": "Explore this eco-friendly urban space with street art, organic market, skate park and trendy restaurants housed in former military barracks.",
                    "practical_tips": "Sunday is market day with organic farmers and food trucks, but it's very popular. The outdoor areas are particularly pleasant in May weather.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free (excluding food/drinks)",
                    "weather_dependent": true
                },
                {
                    "activity": "Pomerol or Saint-Estèphe Open Doors",
                    "where": "Various wine regions around Bordeaux",
                    "description": "Participate in the open doors weekends that various wine appellations host in May, when normally appointment-only châteaux welcome visitors.",
                    "practical_tips": "Check the Bordeaux tourism website for specific dates of each appellation's open doors weekend. Having a designated driver or joining a tour is essential.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate to high",
                    "weather_dependent": true
                },
                {
                    "activity": "Evening Concert at Grand Théâtre",
                    "where": "Grand Théâtre de Bordeaux",
                    "description": "Attend a performance at Bordeaux's magnificent 18th-century theater, with excellent late spring programming.",
                    "practical_tips": "Check the Opéra National de Bordeaux website for the current schedule. Book tickets in advance for popular performances.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to high",
                    "weather_dependent": false
                }
            ]
        }
    }
}