{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing in Malmö",
                "type": "Nature/Social",
                "description": "Witness the beautiful cherry blossoms, particularly stunning at Kungsträdgården in the city center. The rows of Japanese cherry trees create a pink canopy that attracts visitors for photos and picnics beneath the blooms.",
                "indoor": false,
                "best_time": "Mid-late April (daytime)",
                "price_range": "Free",
                "seasonal_notes": "The blooming period is weather-dependent and usually lasts 1-2 weeks. Check local updates for peak bloom.",
                "booking_tips": "No booking needed. Visit on a weekday for fewer crowds. The area can get very busy on sunny weekends during peak bloom."
            },
            {
                "name": "Walpurgis Night (Valborgsmässoafton) Celebrations",
                "type": "Cultural Festival/Community Event",
                "description": "Welcome spring on April 30th with traditional celebrations featuring large bonfires ('majbrasor'), choral singing, speeches, and student festivities. Major public events often held in parks like Pildammsparken or Folkets Park.",
                "indoor": false,
                "best_time": "Evening (April 30th)",
                "price_range": "Free (Public events)",
                "seasonal_notes": "A major Swedish tradition celebrating the arrival of spring. Check the City of Malmö website or local news for specific locations and times.",
                "booking_tips": "Arrive early for good viewing spots at popular locations like Pildammsparken. Dress warmly. Student areas like Malmö University often have lively celebrations."
            },
            {
                "name": "Explore Pildammsparken and Slottsträdgården",
                "type": "Nature/Recreation/Cultural",
                "description": "Stroll or cycle through Malmö's beautiful Pildammsparken as it comes alive with greenery. Visit the adjacent Slottsträdgården (Castle Garden) to see their spring flowers and organic garden displays.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Pleasant weather for enjoying Malmö's largest green spaces. Pildammsparken's ponds and woodlands are particularly beautiful in spring light.",
                "booking_tips": "The Slottsträdgården offers beautiful displays and has a café serving organic food. Pildammsparken is great for relaxation, walking, and picnics."
            },
            {
                "name": "Malmö Festival Season Begins",
                "type": "Entertainment/Cultural",
                "description": "Experience the beginning of Malmö's festival season with events like the Malmö Wine Festival or early cultural festivals. Various venues across the city host events as the weather improves.",
                "indoor": false,
                "best_time": "Daytime/Evening (Check specific events)",
                "price_range": "Varies by event (Free - Moderate)",
                "seasonal_notes": "Event dates vary each year. Check Visit Malmö website for exact dates, hours, and ticket information.",
                "booking_tips": "Buy tickets online in advance for popular events. Some outdoor events may be weather-dependent."
            },
            {
                "name": "Outdoor 'Fika' Season Begins",
                "type": "Leisure/Social",
                "description": "Enjoy the Swedish coffee break ('fika') outdoors as cafes in charming neighborhoods like Gamla Staden (Old Town), Möllevången, and around Lilla Torg open their terraces ('uteserveringar').",
                "indoor": false,
                "best_time": "Daytime (when sunny)",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "A welcome sign of warmer weather. Cafes around Lilla Torg and St. Gertrud's Square are particularly popular for outdoor seating.",
                "booking_tips": "Explore different neighborhoods to find your favorite spot. No booking usually needed, but popular terraces fill up quickly on sunny days."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Midsummer Celebrations (Midsommar)",
                "type": "Cultural Festival/Holiday",
                "description": "Celebrate Midsummer's Eve (closest Friday to summer solstice) with maypole dancing, flower wreaths, herring, strawberries, and schnapps. While many Swedes leave the city, public celebrations can often be found in Folkets Park or nearby community centers.",
                "indoor": false,
                "best_time": "Midsummer's Eve (Friday between June 19-25)",
                "price_range": "Free (Public events)/Moderate (Transport/Food)",
                "seasonal_notes": "A major holiday; expect many shops in the city center to be closed. Public transport may run on a reduced schedule.",
                "booking_tips": "Check local listings for public celebrations in parks like Folkets Park. For an authentic experience, consider a trip to the surrounding Skåne countryside if joining local festivities (requires planning/invitation)."
            },
            {
                "name": "Beach Life at Ribersborg",
                "type": "Nature/Swimming/Leisure",
                "description": "Enjoy Malmö's city beach, Ribersborg, a 2.5 km long sandy beach with shallow waters perfect for swimming. Visit the historic Ribersborgs Kallbadhus (sea bath house) for sauna and swimming in designated areas.",
                "indoor": false,
                "best_time": "Daytime (June-August)",
                "price_range": "Free (Beach)/Budget (Kallbadhus entry fee)",
                "seasonal_notes": "Peak season with warm days. Water is warmest in July/August. The beach has designated barbecue areas and beach volleyball courts.",
                "booking_tips": "Easily accessible by bike or bus from city center. For the kallbadhus, check opening hours as they have separate times for men and women. Bring your own food and drinks for a beach day."
            },
            {
                "name": "Swimming and Sunbathing at Malmö's Beaches",
                "type": "Leisure/Recreation",
                "description": "Cool off at Malmö's popular swimming spots. Options include Ribersborg (main city beach), Sibbarp (family-friendly with playground), Klagshamn (quieter option south of the city), or the Scaniabadet pier.",
                "indoor": false,
                "best_time": "Daytime (Warm sunny days, June-August)",
                "price_range": "Free",
                "seasonal_notes": "Can get very busy on hot days. Water temperatures vary but are generally best in July/August.",
                "booking_tips": "Easily reachable by bus or bike. Check water quality via city reports if desired. Bring picnic supplies or check for nearby kiosks/cafes."
            },
            {
                "name": "Park Life in Folkets Park",
                "type": "Leisure/Social/Entertainment",
                "description": "Relax, picnic, and enjoy Sweden's oldest public park, Folkets Park. Features include a small amusement area, dance pavilion (Far i Hatten), mini-golf, playgrounds, and frequent summer events and concerts.",
                "indoor": false,
                "best_time": "Daytime/Evening (May-August)",
                "price_range": "Free (Entry)/Budget (Activities)",
                "seasonal_notes": "Hub for summer activities and events. Long daylight hours make evenings pleasant for outdoor dining and entertainment.",
                "booking_tips": "Easy to reach by bus or walking from the city center. Check their website for scheduled events and performances. The park has several cafes and food options."
            },
            {
                "name": "Malmö Festival (Malmöfestivalen)",
                "type": "Music Festival/Cultural",
                "description": "Attend Scandinavia's largest city festival, held annually for about a week in August. Features hundreds of free events including music performances across multiple stages, food stalls, art installations, and activities throughout central Malmö.",
                "indoor": false,
                "best_time": "Mid-August (Check specific dates)",
                "price_range": "Free (Most events)",
                "seasonal_notes": "Major event transforming the entire city center. Attracts large crowds from across the region.",
                "booking_tips": "No tickets needed for most events. Some performances might have limited capacity. Check the festival program online to plan your visits."
            },
            {
                "name": "Day Trips to Copenhagen",
                "type": "Travel/Sightseeing",
                "description": "Take advantage of Malmö's proximity to Copenhagen with a quick trip across the Öresund Bridge. Explore Denmark's capital city with its canals, historic sites, Tivoli Gardens, and diverse shopping and dining options.",
                "indoor": false,
                "best_time": "Daytime (Year-round but especially pleasant in summer)",
                "price_range": "Moderate/Expensive (Transport + activities)",
                "seasonal_notes": "Perfect for a summer day trip. Trains run frequently from Malmö Central Station.",
                "booking_tips": "Purchase Öresund train tickets in advance for better rates. Consider a Copenhagen Card for attractions if planning to see multiple sites. Allow a full day for the experience."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Admire Autumn Colors in Parks and Gardens",
                "type": "Nature/Walking",
                "description": "Experience the fall foliage in Malmö's beautiful green spaces. Pildammsparken offers vast areas with beautiful beech forests turning golden, while Slottsträdgården provides a curated display of autumn plantings and harvests.",
                "indoor": false,
                "best_time": "Daytime (Late September - October)",
                "price_range": "Free",
                "seasonal_notes": "Peak foliage varies yearly. Enjoy the crisp air and quieter atmosphere compared to summer.",
                "booking_tips": "Wear comfortable walking shoes. The area around Malmöhus Castle and the canals is particularly scenic with fall colors."
            },
            {
                "name": "Visit Museums with Fewer Crowds",
                "type": "Cultural/Historical",
                "description": "Explore Malmö's excellent museums like the Malmö Art Museum (Malmö Konstmuseum), Moderna Museet Malmö, Technology and Maritime Museum (Teknikens och Sjöfartens Hus), or Malmö Museum (Malmöhus Slott) in a calmer season.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Good time for indoor activities as weather cools. Check specific museum opening hours.",
                "booking_tips": "Consider purchasing a Malmö Museums Pass if visiting multiple venues. Allocate sufficient time, especially for the castle complex."
            },
            {
                "name": "Skåne Food Festival",
                "type": "Food/Cultural",
                "description": "Indulge in Skåne's abundant food culture with seasonal specialties. Autumn brings apples (Skåne is Sweden's apple region), game, mushrooms, and other local delicacies featured in restaurants and markets throughout the city.",
                "indoor": true,
                "best_time": "Various (September-October)",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "Skåne is known as Sweden's breadbasket with rich agricultural traditions. Many restaurants feature special autumn menus.",
                "booking_tips": "Visit Malmö Saluhall food hall to sample various local products. Book tables at popular restaurants featuring seasonal menus well in advance."
            },
            {
                "name": "Malmö Gallery Night",
                "type": "Art/Cultural Event",
                "description": "Experience Malmö's vibrant art scene during Gallery Night when art galleries, museums, and exhibition spaces across the city stay open late with special events, openings, and activities.",
                "indoor": true,
                "best_time": "Late September (Specific evening)",
                "price_range": "Free (Most venues)",
                "seasonal_notes": "A major cultural event for art lovers, creating a festive atmosphere throughout the city.",
                "booking_tips": "Check the official map/program online beforehand to plan your route. Most venues are walkable in the city center, but consider bike or public transport for more distant locations."
            },
            {
                "name": "Cozy Café Culture",
                "type": "Leisure/Social",
                "description": "As evenings get darker and cooler, enjoy Malmö's flourishing café culture. The concept of 'hygge' (coziness) comes alive in the many cafés around Lilla Torg, Davidshall, and Möllevången neighborhoods.",
                "indoor": true,
                "best_time": "Afternoon/Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect way to experience local life and 'mys' (coziness) with Swedish pastries and coffee.",
                "booking_tips": "Explore different cafés for various atmospheres, from traditional spots to modern establishments. St. Jakobs Stenugnsbageri and Lilla Kafferosteriet are local favorites."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets in Malmö",
                "type": "Shopping/Cultural/Festive",
                "description": "Experience Malmö's charming Christmas markets, particularly at Gustav Adolfs Torg in the city center and around Malmöhus Castle. Browse stalls offering crafts, gifts, and traditional Swedish holiday foods and drinks.",
                "indoor": false,
                "best_time": "Late November - Late December (Check specific dates/hours)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases)",
                "seasonal_notes": "A festive Malmö tradition. Markets are atmospheric but not as large as some other Swedish cities. Snow is possible but not guaranteed.",
                "booking_tips": "No booking needed. Combine with a visit to nearby cafés for warming glögg (mulled wine) and pepparkakor (ginger cookies). Dress very warmly!"
            },
            {
                "name": "Ice Skating at Raoul Wallenbergs Park",
                "type": "Sport/Recreation",
                "description": "Enjoy outdoor ice skating at the public rink typically set up in Raoul Wallenbergs Park. A popular activity for families and visitors during the winter months.",
                "indoor": false,
                "best_time": "Daytime/Evening (Check opening hours, weather permitting)",
                "price_range": "Free (Entry)/Budget (Skate rental)",
                "seasonal_notes": "Opening depends on weather conditions allowing for ice maintenance.",
                "booking_tips": "Check if the rink is open before going. Wear warm clothes. Folkets Park sometimes also offers seasonal skating."
            },
            {
                "name": "Lucia Concerts",
                "type": "Cultural/Music/Religious",
                "description": "Witness the beautiful Lucia tradition (Dec 13th) with candlelit processions and singing in churches like St. Petri Church (Sankt Petri kyrka) or Malmö Cathedral (Sankt Johannes kyrka), as well as other venues.",
                "indoor": true,
                "best_time": "Morning/Evening (December 13th, some concerts on nearby dates)",
                "price_range": "Free (Some processions)/Moderate-Expensive (Church concerts)",
                "seasonal_notes": "A key Swedish winter tradition celebrating light during the darkest time of year. Enjoy with 'lussekatter' (saffron buns) and 'glögg' (mulled wine).",
                "booking_tips": "Book tickets for major church concerts well in advance as they are very popular and sell out quickly. Check local listings for times and venues."
            },
            {
                "name": "Winter Bathing at Ribersborgs Kallbadhus",
                "type": "Wellness/Recreation",
                "description": "Experience the invigorating tradition of a cold dip in the sea followed by a warm sauna at the historic Ribersborgs Kallbadhus (cold bath house), a wooden structure extending into the Öresund strait.",
                "indoor": true,
                "best_time": "Daytime (Check specific opening hours/days, often segregated times for men/women)",
                "price_range": "Moderate (Entry fee)",
                "seasonal_notes": "A bracing local experience with views of the Öresund Bridge and Copenhagen in the distance. More atmospheric in winter than summer.",
                "booking_tips": "Check their website for current opening hours, potential booking requirements, and rules/etiquette (e.g., regarding swimwear in sauna). Easily reached by bus or a walk along the beach promenade."
            },
            {
                "name": "Malmö Live Winter Concerts",
                "type": "Music/Cultural",
                "description": "Enjoy world-class performances at Malmö Live concert hall, home to the Malmö Symphony Orchestra. Winter season features both classical and contemporary programs in an impressive modern venue.",
                "indoor": true,
                "best_time": "Evening (Check concert schedule)",
                "price_range": "Moderate-Expensive (Ticket prices vary by performance)",
                "seasonal_notes": "The concert hall offers a rich program during the winter months when indoor cultural activities are at their peak.",
                "booking_tips": "Book tickets well in advance for popular performances. The venue also has excellent restaurants and bars for pre-concert dining."
            }
        ]
    }
}