{
  "sites": [
    {
      "name": "Malmöhus Castle",
      "type": "Castle",
      "description": "Scandinavia's oldest preserved Renaissance castle, built in 1434. Houses several museums including Malmö Art Museum, Natural History Museum, and an aquarium. Offers insights into Malmö's rich history and cultural heritage. Surrounded by a moat and parks.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Check individual museum opening hours within the complex. Surrounded by Kungsparken and Slottsträdgården.",
      "booking_tips": "Combination tickets for museums available. Allow 2-3 hours to explore the museums and grounds. Self-guided audio tours often available.",
      "ratings": {
        "cost_estimate": 15, 
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 55.6045,
      "longitude": 12.9900
    },
    {
      "name": "Turning Torso",
      "type": "Landmark",
      "description": "Iconic neo-futurist residential skyscraper designed by Santiago Calatrava, known for its twisting form. It was the tallest building in Scandinavia upon completion. Located in the modern Västra Hamnen district.",
      "indoor": false,
      "best_time": "Anytime (Exterior view)",
      "price_range": "Free",
      "seasonal_notes": "Exterior visible year-round. Primarily residential, interior access is generally not available to the public. Best viewed from the Västra Hamnen waterfront.",
      "booking_tips": "No booking needed for exterior viewing. Combine with a walk through the Västra Hamnen district to appreciate modern architecture and sea views.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5, 
        "cultural_significance": 4
      },
      "latitude": 55.6141,
      "longitude": 12.9754
    },
    {
      "name": "Gamla Väster (Old Town)",
      "type": "Historic District",
      "description": "Malmö's charming Old Town, featuring cobblestone streets, historic squares like Stortorget (Main Square) and Lilla Torg (Little Square), colorful half-timbered houses, Malmö City Hall (Rådhus), and St. Peter's Church. Full of cafes, restaurants, and shops.",
      "indoor": false,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Lively year-round, especially Lilla Torg in summer with outdoor seating. Stortorget hosts events and markets.",
      "booking_tips": "Free to wander. Explore on foot. Lilla Torg is great for 'fika' (Swedish coffee break). Look out for Jakob Nilsgatan for picturesque houses.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 55.6058, 
      "longitude": 13.0000 
    },
    {
      "name": "Västra Hamnen (Western Harbour)",
      "type": "District",
      "description": "A modern, sustainable district transformed from an industrial shipyard. Known for innovative architecture (including Turning Torso), waterfront promenades, bathing spots, restaurants, and views of the Öresund Bridge and Copenhagen.",
      "indoor": false,
      "best_time": "Daytime/Sunset",
      "price_range": "Free",
      "seasonal_notes": "Popular for walks and swimming in summer. Offers stunning sunset views over the Öresund.",
      "booking_tips": "Free to explore. Easily accessible by bus or a longer walk from the center. Ideal for architecture enthusiasts and enjoying the seaside.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 55.6130,
      "longitude": 12.9800
    },
    {
      "name": "Ribersborgs Kallbadhus & Beach",
      "type": "Recreation",
      "description": "Historic open-air bathhouse offering year-round sea bathing, saunas with sea views, and a cafe/restaurant. Located on a pier extending from Ribersborg Beach (\"Ribban\"), a long sandy beach popular with locals.",
      "indoor": true, 
      "best_time": "Anytime (Bathhouse), Summer (Beach)",
      "price_range": "Budget",
      "seasonal_notes": "Bathhouse open year-round for sauna and cold dips. Beach is popular for sunbathing and swimming in summer.",
      "booking_tips": "Pay entrance fee for the bathhouse. Check opening hours. Beach is free to access. Combine with a walk along the beach.",
      "ratings": {
        "cost_estimate": 8, 
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 55.6077,
      "longitude": 12.9655
    },
    {
      "name": "Möllevångstorget (\"Möllan\")",
      "type": "Market Square",
      "description": "A vibrant, multicultural square known for its lively atmosphere, daily fruit and vegetable market (Mon-Sat), diverse range of ethnic restaurants, pubs, and street food options. Hub of the Möllevången neighbourhood.",
      "indoor": false,
      "best_time": "Daytime (Market), Evening (Restaurants/Bars)",
      "price_range": "Budget",
      "seasonal_notes": "Market operates year-round, liveliest in the morning/early afternoon. Square is bustling in evenings, especially weekends.",
      "booking_tips": "Market is cash-friendly. Explore the surrounding streets for more food options. Popular spot for cheap eats, especially falafel.",
      "ratings": {
        "cost_estimate": 0, 
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 55.5930,
      "longitude": 13.0080
    },
    {
      "name": "Folkets Park",
      "type": "Park",
      "description": "The world's oldest \"people's park\" (public recreation park). Features playgrounds, green spaces, cafes, food stalls, a small amusement area, mini-golf, terrarium, skate park, and hosts events, markets, and concerts.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Park open year-round. Some attractions/stalls are seasonal (mainly summer). Hosts seasonal events like Christmas markets and Midsummer celebrations.",
      "booking_tips": "Free entry to the park. Some attractions within the park may have entrance fees. Check event schedules online.",
      "ratings": {
        "cost_estimate": 0, 
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 55.5945,
      "longitude": 13.0035
    },
    {
      "name": "St. Peter's Church (Sankt Petri Kyrka)",
      "type": "Church",
      "description": "Impressive Brick Gothic church dating back to the 14th century, the oldest building in Malmö. Features a tall tower, beautiful interior vaults, a large altarpiece, and the historic Krämarkapellet (Merchant's Chapel).",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round, but check visitor hours as it may close for services or events.",
      "booking_tips": "Free entry. Allow 30-60 minutes. Located near Stortorget in Gamla Väster.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.75,
        "cultural_significance": 4
      },
      "latitude": 55.6072,
      "longitude": 13.0036
    },
    {
      "name": "Malmö Saluhall",
      "type": "Market",
      "description": "Modern food hall housed in a converted railway depot. Offers a variety of food stalls selling local produce, cheese, meats, baked goods, and prepared meals, alongside several restaurants and cafes focusing on quality ingredients.",
      "indoor": true,
      "best_time": "Lunchtime/Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, generally daytime hours, some restaurants open later. Can get busy during peak lunch hours.",
      "booking_tips": "No entry fee. Good spot for lunch or buying local delicacies. Located near Malmö Live and the Central Station.",
      "ratings": {
        "cost_estimate": 0, 
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 55.6090,
      "longitude": 12.9955
    },
    {
      "name": "Kungsparken & Slottsträdgården",
      "type": "Park",
      "description": "Two adjacent central parks. Kungsparken (King's Park) is Malmö's oldest park, designed in English style with canals and mature trees. Slottsträdgården (Castle Garden) is an organic garden featuring themed sections, a windmill, and a popular cafe.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, especially Slottsträdgården in bloom (spring/summer). Ideal for walks, picnics, and relaxation.",
      "booking_tips": "Free access. Located next to Malmöhus Castle. Slottsträdgårdens Kafé is a popular spot.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 55.6025, 
      "longitude": 12.9915 
    },
    {
      "name": "Malmö Konsthall",
      "type": "Museum",
      "description": "One of Europe's largest exhibition halls for contemporary art, known for its functionalist architecture and use of light. Features temporary exhibitions of international and Swedish artists.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round, closed Mondays and during installations. Check website for current exhibitions.",
      "booking_tips": "Free entrance. Guided tours often available. Located near Triangeln station.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 55.5954,
      "longitude": 12.9991
    },
    {
      "name": "Moderna Museet Malmö",
      "type": "Museum",
      "description": "A branch of Stockholm's Moderna Museet, housed in a former electricity plant. Focuses on modern and contemporary international art, often with thought-provoking exhibitions.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round, check website for current exhibition details and opening hours (often closed Mondays).",
      "booking_tips": "Free entrance. Sometimes offers workshops or tours. Located in Gamla Väster.",
      "ratings": {
        "cost_estimate": 0, 
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 55.6046,
      "longitude": 13.0096
    },
    {
      "name": "Fiskehoddorna",
      "type": "Market",
      "description": "Charming, historic fish market operating out of colourful old fishing huts located near Malmöhus Castle. Local fishermen sell their fresh catch directly.",
      "indoor": false,
      "best_time": "Morning (Tue-Sat)",
      "price_range": "Free",
      "seasonal_notes": "Market open Tuesday to Saturday mornings. Best selection early. The huts themselves are picturesque year-round.",
      "booking_tips": "Free to browse. Bring cash for purchases. Ideal for experiencing local culture and buying fresh seafood.",
      "ratings": {
        "cost_estimate": 0, 
        "suggested_duration_hours": 0.5,
        "cultural_significance": 2
      },
      "latitude": 55.6059,
      "longitude": 12.9932
    },
    {
      "name": "Öresund Bridge Viewpoint",
      "type": "Landmark",
      "description": "Various points offer views of the impressive Öresund Bridge connecting Sweden and Denmark. Luftkastellet near the bridge's start offers a popular viewpoint.",
      "indoor": false,
      "best_time": "Clear Day/Sunset",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Views depend on weather. Sunset can be spectacular.",
      "booking_tips": "No booking needed. Luftkastellet viewpoint is easily accessible by car or bike. Combine with exploring the Limhamn area.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 55.5704, 
      "longitude": 12.8879 
    },
    {
      "name": "Malmö City Library (Stadsbiblioteket)",
      "type": "Library",
      "description": "Award-winning library known for its striking architecture, particularly the modern extension 'Calendar of Light' designed by Henning Larsen, connected to the original 1905 castle-like building.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Check website for opening hours.",
      "booking_tips": "Free entry. Explore both the old and new sections. Good place to relax or read.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 55.6005,
      "longitude": 12.9941
    },
    {
      "name": "Davidshall District",
      "type": "District",
      "description": "Trendy neighbourhood known for its independent boutiques, vintage stores, design shops, and numerous cozy cafes perfect for experiencing Swedish 'fika'. Centered around Davidshallstorg square.",
      "indoor": false,
      "best_time": "Daytime (Shopping/Cafes)",
      "price_range": "Free",
      "seasonal_notes": "Shops and cafes open year-round. Pleasant for strolling.",
      "booking_tips": "Free to explore. Allow time for browsing shops and relaxing at a cafe. Located south of the main canal.",
      "ratings": {
        "cost_estimate": 0, 
        "suggested_duration_hours": 2.0,
        "cultural_significance": 2
      },
      "latitude": 55.5980, 
      "longitude": 12.9960
    },
    {
      "name": "Rundan Canal Tour",
      "type": "Tour",
      "description": "Guided boat tour through Malmö's canals and under its bridges, offering views of parks, the harbour, Malmöhus Castle, and Turning Torso from the water.",
      "indoor": false,
      "best_time": "Daytime (Apr-Sep typically)",
      "price_range": "Moderate",
      "seasonal_notes": "Operates seasonally, typically April to September. Check schedule. Open boats, ponchos provided if rain.",
      "booking_tips": "Book tickets online or at the departure point (Norra Vallgatan near Central Station). Duration approx 50 mins. Live guides in English/Swedish.",
      "ratings": {
        "cost_estimate": 20, 
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 55.6094, 
      "longitude": 13.0011
    }
  ]
}