{
    "October": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Autumn Atmosphere",
                "details": "October in Stuttgart offers ideal temperatures averaging 6-15°C with good amounts of sunshine and moderate rainfall, perfect for exploring the Schlossplatz, Königstraße, and surrounding districts without summer's crowds or winter's chill, with the Neckar River and surrounding vineyards taking on a particularly atmospheric quality with morning mists and golden autumn light framing the city's mix of historic and modern architecture."
            },
            {
                "reason": "Cultural Season Beginning",
                "details": "October marks the start of Stuttgart's prestigious cultural season with new exhibitions at museums like the Staatsgalerie and Mercedes-Benz Museum, performances at the Stuttgart State Opera, the Stuttgart Philharmonic's new program at the Liederhalle, and special concerts in historic churches, bringing fresh artistic energy to this culturally significant city."
            },
            {
                "reason": "University Atmosphere Revival",
                "details": "As an important educational center, Stuttgart awakens in October when 28,000+ students return to the University of Stuttgart and other institutions, revitalizing districts like the West End and student areas with intellectual energy, filling neighborhood bars and cafés, creating vibrant street life, and adding youthful dynamics to the otherwise automotive and business-oriented city."
            },
            {
                "reason": "Stuttgart Literature Festival",
                "details": "October hosts the Stuttgart Literature Festival (Literaturherbst), an important international literary event, attracting authors, publishers, and literary enthusiasts with readings throughout the city's theaters, cultural centers, and alternative spaces, creating a culturally stimulating atmosphere that extends beyond the main festival venues."
            },
            {
                "reason": "Autumn Weinstube Last Call",
                "details": "October represents the final month to enjoy Stuttgart's charming wine taverns (Weinstuben) and outdoor café terraces along the Schlossplatz before winter weather sets in, with many establishments creating a cozy atmosphere with outdoor heaters, blankets, and seasonal decorations to extend the outdoor dining season."
            },
            {
                "reason": "Swabian Alb Colors",
                "details": "October brings spectacular autumn foliage to the nearby Swabian Alb region, with hiking trails through golden forests, scenic viewpoints overlooking the Neckar River valley, and charming historic towns all easily accessible within 30-45 minutes from the city for perfect day trips."
            },
            {
                "reason": "Swabian Autumn Cuisine",
                "details": "October highlights Stuttgart's distinctive Swabian gastronomy with seasonal specialties including wild game, pumpkin dishes, mushrooms from nearby forests, and traditional hearty fare like Spätzle, Maultaschen, and Schupfnudeln at historic restaurants and wine taverns throughout the city, with fewer summer tourists creating a more authentic dining atmosphere."
            },
            {
                "reason": "More Affordable Accommodations",
                "details": "After the summer tourist season and Cannstatter Volksfest, hotel prices often drop significantly (except during special events), making quality accommodations near the Königstraße, boutique hotels in the Bohnenviertel, and apartments in vibrant districts more accessible while still offering excellent weather conditions for exploration."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Weather Conditions",
                "details": "While generally pleasant, October weather in Stuttgart can include occasional rain showers and rapid temperature changes, particularly in the latter half of the month, requiring flexible itineraries and appropriate layered clothing for temperature variations typical of the continental climate in the Neckar valley."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "Daylight decreases throughout October, with sunset around 6:30pm at the beginning of the month and 4:30pm by month's end due to the end of daylight saving time, limiting the time available for outdoor activities, photography of Stuttgart's magnificent modern architecture, and evening Schlossplatz strolls."
            },
            {
                "reason": "Festival Congestion",
                "details": "During major cultural events like the Literature Festival or special performances at the Stuttgart State Opera, the city experiences higher visitor numbers in certain areas, causing accommodation prices to increase, restaurants in the historic center to require advance reservations, and public transportation to become more crowded, particularly around the Schlossplatz."
            },
            {
                "reason": "Reduced Outdoor Café Culture",
                "details": "Stuttgart's popular outdoor cafés in Schlossplatz and Marktplatz begin scaling back operations or closing entirely as temperatures drop, with fewer outdoor activities and limited outdoor seating at restaurants compared to summer months, particularly after mid-October."
            },
            {
                "reason": "Vineyard Tour Limitations",
                "details": "The Stuttgart vineyard tours and wine experiences begin operating reduced schedules in October, with some scenic routes or departure times no longer available and evening tours increasingly limited as daylight hours shorten, potentially restricting one of Stuttgart's signature visitor experiences."
            }
        ],
        "first_half": {
            "date_range": "October 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "6°C"
                },
                "precipitation": "Moderate rainfall with occasional brief showers possible. Stuttgart's continental climate creates clear, crisp days interspersed with overcast periods and generally comfortable humidity levels. Morning fog in the Neckar valley possible but typically clearing by midday.",
                "general_tips": "Layered clothing essential with medium-weight attire for daytime and jackets for cool evenings. Small umbrella useful for occasional showers. Temperature variations between day and night (often 8-10°C difference) require adaptable wardrobe."
            },
            "tourism_level": {
                "crowds": "Moderate, with a noticeable decrease from summer levels and post-Volksfest period, except during specific cultural events or festivals when domestic and international visitors may increase in certain areas.",
                "pricing": "Accommodation rates decreasing from summer peaks, with better deals becoming available, except during major cultural events when prices can temporarily increase.",
                "overall_atmosphere": "Pleasant mix of locals, cultural visitors, and travelers with a more relaxed vibe than during the summer high season, allowing for more authentic experiences in neighborhood restaurants and cultural venues."
            },
            "events_holidays": [
                {
                    "name": "German Unity Day (Tag der Deutschen Einheit)",
                    "date": "October 3",
                    "description": "National holiday celebrating German reunification with special events, exhibitions, and cultural programs throughout the city, particularly around the Schlossplatz and Altes Schloss area, which holds special significance for East-West reconciliation.",
                    "notes": "Public holiday; many businesses and some attractions closed; official ceremonies at historical sites; restaurants typically open but may have special hours; museums often have special programming relating to German history and reunification; particular significance in former West German cities like Stuttgart."
                },
                {
                    "name": "Stuttgart Wine Village Aftermath",
                    "date": "Early October",
                    "description": "While the main Wine Village ends in September, early October sees continued wine celebrations throughout Stuttgart's vineyard districts with special tastings, vineyard tours, and harvest-themed events celebrating Stuttgart's unique status as a city with urban vineyards.",
                    "notes": "Programs available online and at tourist information; mixture of free and ticketed events; emphasis on local wine varieties like Trollinger and Lemberger; events held in various venues across the city's vineyard areas; family-friendly atmosphere; opportunity to experience Stuttgart's winemaking tradition."
                },
                {
                    "name": "Stuttgart Literary Autumn",
                    "date": "Early to mid-October (varies annually)",
                    "description": "Literary festival featuring German and international authors with readings, discussions, and book presentations at venues throughout the city including the City Library, bookstores, and cultural centers.",
                    "notes": "Program available online and at tourist information; mixture of free and ticketed events; primarily German-language but some international author events in English; atmospheric readings often held in historic venues; advance booking recommended for popular authors; combines well with visits to Stuttgart's historic venues like the Market Hall."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Stiftskirche Morning Visit",
                    "where": "Schlossplatz Area",
                    "description": "Experience Stuttgart's magnificent Gothic church with more comfortable visiting conditions than summer months, allowing for appreciation of its soaring spire, ornate interior, and powerful symbolism of reconstruction following wartime damage.",
                    "practical_tips": "Early morning or late afternoon light best for interior illumination; tower climb offers city panorama and is less crowded than summer; noon organ recitals on certain days; prayer services less crowded than general visiting hours; dress respectfully and bring layers as church interior can be cool.",
                    "best_time": "Early morning for fewest visitors",
                    "estimated_cost": "Free for church entry; €4 for tower climb",
                    "weather_dependent": false
                },
                {
                    "activity": "Staatsgalerie Stuttgart",
                    "where": "Near Schlossplatz",
                    "description": "Explore one of Germany's most important art collections featuring masterpieces from the Middle Ages to contemporary art in the magnificent museum complex, with autumn bringing new exhibitions and a more contemplative visiting atmosphere.",
                    "practical_tips": "Weekday mornings offer quietest visiting experience; famous works include German Romantic paintings and contemporary art; audio guides available in multiple languages; less crowded during weekdays; combines well with visits to the Kunstmuseum Stuttgart in the same area; museum courtyard particularly beautiful in autumn light.",
                    "best_time": "Weekday morning",
                    "estimated_cost": "€12 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Stuttgart TV Tower (Fernsehturm)",
                    "where": "Degerloch",
                    "description": "Experience Stuttgart's iconic TV Tower, the world's first television tower built in concrete, offering panoramic views of the city, surrounding vineyards, and the Swabian Alps, with October offering unique perspectives with autumn colors, potential morning mist, and fewer tourist crowds.",
                    "practical_tips": "Dress warmly as higher elevation creates cooling effect; historic significance as world's first TV tower of this type; advance booking less necessary than summer months; upper observation deck offers best 360° views; restaurant available for meals or coffee; check reduced autumn schedule as some time slots may be limited.",
                    "best_time": "Mid-morning after potential fog lifts",
                    "estimated_cost": "€9 for observation deck",
                    "weather_dependent": true
                },
                {
                    "activity": "Bohnenviertel District Exploration",
                    "where": "East of city center",
                    "description": "Discover Stuttgart's historic 'Bean Quarter' with its half-timbered houses, independent boutiques, galleries, international restaurants, and local wine taverns—a perfect area for experiencing authentic Swabian culture away from the main tourist centers.",
                    "practical_tips": "Historic district dating to 15th century; narrow streets best explored on foot; numerous cafés provide warm retreats during exploration; less touristy than Schlossplatz area; historic wine taverns with seasonal menus; better food value than tourist areas; combines well with visits to nearby Market Hall; best explored on foot but bus connections available throughout.",
                    "best_time": "Afternoon into evening",
                    "estimated_cost": "Free for exploration; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Mercedes-Benz Museum",
                    "where": "Bad Cannstatt",
                    "description": "Discover one of the world's premier automotive museums showcasing the history of the automobile from its invention through spectacular architecture and interactive exhibits, with autumn bringing special exhibitions and a more contemplative visiting atmosphere.",
                    "practical_tips": "Spectacular building design by UNStudio; weekday mornings nearly empty compared to summer; excellent audio guide available in multiple languages; heating makes this comfortable regardless of weather; combine with Porsche Museum for comprehensive automotive experience; café on premises for warming refreshments.",
                    "best_time": "Morning, first entry slot",
                    "estimated_cost": "€12 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Traditional Swabian Restaurant Experience",
                    "where": "Bohnenviertel or Marktplatz area",
                    "description": "Discover Stuttgart's distinctive Swabian cuisine in a traditional restaurant with rustic interiors, hearty local fare, and convivial atmosphere, experiencing seasonal specialties like Maultaschen, Spätzle, and regional wines in an authentic setting.",
                    "practical_tips": "Weinstube am Stadtgraben offers historic atmosphere; Alte Kanzlei provides authentic local experience with views of Schlossplatz; try local specialties like Zwiebelrostbraten (onion roast beef) or Linsen mit Spätzle (lentils with noodles) with regional wine from Stuttgart's vineyards; reservations helpful but not essential for weeknights in October.",
                    "best_time": "Early evening",
                    "estimated_cost": "€25-35 for food and drinks",
                    "weather_dependent": false
                },
                {
                    "activity": "Wilhelma Zoological-Botanical Garden",
                    "where": "Bad Cannstatt",
                    "description": "Experience one of Europe's most impressive combined zoological and botanical gardens, uniquely set within historic 19th-century Moorish architecture, featuring over 11,500 animals and 6,000 plant species with magnificent autumn displays.",
                    "practical_tips": "Located in Bad Cannstatt, accessible via U-Bahn; combines historic architecture with modern animal enclosures; autumn brings spectacular foliage colors; fewer visitors than summer; greenhouse areas provide warm retreat if weather turns cool; special autumn botanical displays; historic buildings include both Moorish and classical designs; zoological areas less crowded in autumn; allow at least 3-4 hours for comprehensive visit.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€16 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Killesberg Park Autumn Colors",
                    "where": "North Stuttgart",
                    "description": "Enjoy Stuttgart's magnificent park when autumn transforms its extensive landscaped gardens, flower displays and mature tree groves with spectacular fall colors, offering peaceful walks and scenic photography opportunities.",
                    "practical_tips": "Easily accessible via U-Bahn from city center; Killesberg Tower offers panoramic views of autumn colors; miniature railway operates on weekends in October (weather permitting); relatively quiet on weekday mornings; excellent fall foliage photography location; small cafés available for warm retreats; historic site of garden exhibitions with distinctive landscaping.",
                    "best_time": "Late morning for best light",
                    "estimated_cost": "Free; €3 for Killesberg Tower; €4 for miniature railway",
                    "weather_dependent": true
                },
                {
                    "activity": "Porsche Museum",
                    "where": "Zuffenhausen",
                    "description": "Explore Stuttgart's modern masterpiece of automotive history and design, featuring iconic sports cars and racing vehicles displayed in a stunning architectural setting that appears to float above its foundation.",
                    "practical_tips": "Less visited than Mercedes-Benz Museum despite world-class collection; architecture itself worth visiting; excellent special exhibitions typically running in October; spacious galleries never feel crowded; good café with terrace; automotive counterbalance to Stuttgart's historic image; accessible via S-Bahn from central Stuttgart.",
                    "best_time": "Weekday morning or afternoon",
                    "estimated_cost": "€10 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Königstraße Stroll",
                    "where": "City Center",
                    "description": "Experience Germany's longest pedestrian shopping street with a walk along this elegant boulevard offering spectacular views of historic buildings, autumn colors in Schlossplatz, and the city's modern architecture in the crisp October light.",
                    "practical_tips": "Historic shopping boulevard connecting main station to Schlossplatz; several cafés provide warm retreats; less crowded than summer months; excellent photography location for architecture and autumn colors; connects major attractions including Schlossplatz and Market Hall; sunset timing increasingly earlier throughout month creating golden evening light on historic buildings.",
                    "best_time": "Late afternoon for best light",
                    "estimated_cost": "Free for walking; €10-15 for café stops",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "October 16–31",
            "weather": {
                "average_temperature": {
                    "high": "12°C",
                    "low": "4°C"
                },
                "precipitation": "Increased rainfall probability with occasional showers more likely than in early October, though still many clear, crisp days with beautiful autumn light. Morning fog in the Neckar valley more common, sometimes persisting longer into day.",
                "general_tips": "Increased need for warmer clothing with medium-weight jacket essential for evenings and potential rain showers. Daylight saving time ends late month, causing significantly earlier sunsets. Layered clothing with scarf recommended for variable conditions typical of continental climate."
            },
            "tourism_level": {
                "crowds": "Low to moderate tourist presence at most attractions, with comfortable visiting conditions at Stiftskirche, museums, and historic sites, though specific events may create localized busy periods.",
                "pricing": "Attractive shoulder season rates for accommodations with good availability and occasional promotions, particularly for longer stays and midweek visits.",
                "overall_atmosphere": "Authentically German as the city settles into autumn rhythm with university in full session, locals predominating at most venues, and a cozy, less hurried pace than summer months."
            },
            "events_holidays": [
                {
                    "name": "Stuttgart Jazz Festival",
                    "date": "Late October (varies annually)",
                    "description": "International jazz festival featuring musicians from around the world performing at venues throughout Stuttgart including the Liederhalle, BIX Jazz Club, and other cultural venues with a focus on contemporary jazz and experimental music.",
                    "notes": "Program available online and at tourist information; mixture of ticketed concerts and free events; international atmosphere with musicians from around the world; venues include historic theaters and modern concert halls throughout city; festival passes available for multiple concerts; brings jazz enthusiasts to Stuttgart."
                },
                {
                    "name": "Reformation Day (Reformationstag)",
                    "date": "October 31",
                    "description": "Commemoration of Martin Luther's Reformation, with special services in Protestant churches, particularly the Stiftskirche and other historic churches, and cultural events exploring this significant historical movement.",
                    "notes": "Not a public holiday in Baden-Württemberg but recognized with religious services; Stiftskirche holds special services with musical performances; museums typically maintain normal hours; sometimes combined with All Saints' Day (November 1) events which is a public holiday in the region."
                },
                {
                    "name": "Stuttgart Film Winter",
                    "date": "Late October into November",
                    "description": "Film festival focused on independent and experimental cinema, featuring screenings, workshops, and events at theaters and cultural venues throughout the city with emphasis on innovative filmmaking.",
                    "notes": "Various venues throughout city with main performances at Metropol Cinema and smaller venues; program spans documentary to experimental film; tickets for individual screenings or festival passes available; some free performances in cultural centers; advance booking recommended for popular screenings; atmospheric evening events in historic venues."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Autumn Neckar Valley Walk",
                    "where": "Multiple locations along river",
                    "description": "Experience the atmospheric Neckar riverfront with golden autumn light, potential morning mist, and colorful foliage, offering continually changing perspectives of Stuttgart's historic bridges and surrounding hills with fewer visitors than summer months.",
                    "practical_tips": "Several well-maintained walking paths along riverbanks; Max-Eyth-See area particularly scenic in autumn; several cafés along route though outdoor seating increasingly limited; morning fog can create magical photography conditions; dress warmly as river creates cooling effect; accessible via multiple public transportation points.",
                    "best_time": "Mid-morning after fog lifts or late afternoon",
                    "estimated_cost": "Free; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Swabian Alb",
                    "where": "Swabian Alb (40 minutes from Stuttgart)",
                    "description": "Experience the spectacular autumn colors in the nearby Swabian Alb region with well-marked hiking trails, dramatic landscapes, viewpoints over the Neckar River valley, and picturesque towns like Bad Urach and Tübingen.",
                    "practical_tips": "Accessible by regional train to various towns followed by local buses; famous viewpoints accessible without extensive hiking; trails well-marked with difficulty ratings; proper footwear recommended as trails can be slippery after rain; visitor centers provide maps and information; fewer visitors than summer months; dramatic lighting conditions perfect for photography.",
                    "best_time": "Morning start on clear day",
                    "estimated_cost": "€30-40 for transportation and entrance fees",
                    "weather_dependent": true
                },
                {
                    "activity": "Stuttgart City Museum",
                    "where": "Karlsplatz",
                    "description": "Visit Stuttgart's comprehensive city history museum featuring thoughtful exhibitions on the city's development from Roman times through its industrial and automotive heritage, housed in a historic building dramatically renovated with modern elements.",
                    "practical_tips": "Located in central Stuttgart near Marktplatz; never overcrowded; contemporary approach to city history focuses on industrial and cultural development; chronological and thematic exhibitions; multi-media experiences; café on premises; architecture itself worth visiting; excellent indoor activity during inclement weather.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€5 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Stuttgart State Opera Evening Performance",
                    "where": "Oberer Schlossgarten",
                    "description": "Attend a performance at Stuttgart's world-famous opera house, experiencing one of Europe's finest companies in a magnificent modern building that has been central to German musical culture for decades.",
                    "practical_tips": "Season in full swing by October; program available online; advance ticket purchase recommended for popular performances but typically available in shoulder season; guided tours also available during daytime; dress code relatively formal but not strict black tie; architecture spectacular both inside and out; performances typically start at 7PM; arrive early to enjoy the ornate interior.",
                    "best_time": "Evening performances (typically 7PM)",
                    "estimated_cost": "€40-120 depending on performance and seating",
                    "weather_dependent": false
                },
                {
                    "activity": "Stiftskirche Choir Performance",
                    "where": "City Center",
                    "description": "Experience one of Germany's oldest and most famous church choirs performing in their home church, continuing a musical tradition dating back centuries and offering an authentic cultural experience beyond typical tourism.",
                    "practical_tips": "Services typically held Sunday mornings and special concert performances throughout October; arrival 30-45 minutes early recommended for seating; acoustics particularly suited to choir's sound; church atmosphere rather than concert hall (bring layers for comfort); lesser-known alternative to major concerts but with exceptional musical quality.",
                    "best_time": "Sunday services or scheduled concerts",
                    "estimated_cost": "€10-25 depending on event type",
                    "weather_dependent": false
                },
                {
                    "activity": "Stuttgart Market Hall (Markthalle)",
                    "where": "City Center",
                    "description": "Visit this magnificent Art Nouveau food hall featuring merchants selling regional and international specialties under a spectacular iron and glass roof, showcasing autumn produce, regional specialties, and seasonal foods in an architectural gem from 1914.",
                    "practical_tips": "Central location near Schlossplatz; especially appealing for food enthusiasts; historic structure with ornate iron and glasswork; autumn brings special seasonal produce and game dishes; less crowded than summer months; good rainy day activity; multiple small eateries inside; combines well with nearby Schlossplatz; morning offers freshest selection but afternoon less crowded.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "Free for entry; €15-20 for tastings",
                    "weather_dependent": false
                },
                {
                    "activity": "Autumn Wine Tasting",
                    "where": "Wine taverns throughout the city",
                    "description": "Sample wines from Stuttgart's own urban vineyards and nearby regions, with a focus on autumn releases in cozy wine taverns (Weinstuben) throughout Stuttgart, providing warm retreats as evenings grow cooler.",
                    "practical_tips": "Stuttgart is one of few European capitals with urban vineyards; wine taverns in Bohnenviertel offer tastings; autumn brings new vintage releases; regional specialties include red Trollinger and Lemberger varieties; pair with local seasonal cheese and bread; indoor activity perfect for cooler evenings; opportunity to learn about Württemberg wine region.",
                    "best_time": "Evening",
                    "estimated_cost": "€20-30 for tasting session with small plates",
                    "weather_dependent": false
                },
                {
                    "activity": "Stuttgart Natural History Museum",
                    "where": "Schloss Rosenstein",
                    "description": "Visit Stuttgart's comprehensive natural history museum housed in a neoclassical palace, featuring excellent exhibitions on biology, geology, and paleontology with special focus on regional natural history and global environmental issues.",
                    "practical_tips": "Located in Rosenstein Park; excellent for adults and families; distinctive mixture of historic and modern displays; famous dinosaur and Ice Age mammal exhibits; accessible for non-German speakers; less crowded than major tourist attractions; short U-Bahn ride from city center; café on premises; combines well with park visit for autumn colors.",
                    "best_time": "Midday",
                    "estimated_cost": "€8 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Stuttgart City Library",
                    "where": "Mailänder Platz",
                    "description": "Tour Stuttgart's spectacular cube-shaped modern library featuring a striking minimalist white exterior and dramatic interior with a five-story reading room, offering both architectural interest and a warm retreat during cooler autumn days.",
                    "practical_tips": "Striking modern architecture completed in 2011; spectacular central reading room; photography permitted in most areas; rooftop terrace offers city views (weather permitting); multi-language collection; café on premises; architectural tours sometimes available; excellent rainy day activity; easily accessible via U-Bahn.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "Free admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Stuttgart Philharmonic Orchestra Concert",
                    "where": "Liederhalle, Cultural Center",
                    "description": "Attend a performance in Stuttgart's Liederhalle concert hall featuring perfect acoustics and the renowned Stuttgart Philharmonic Orchestra performing orchestral works, chamber music, and hosting international soloists as part of its active autumn season.",
                    "practical_tips": "Season in full swing by October; program available online; advance ticket purchase recommended for popular performances but often available last-minute in shoulder season; dress code relatively relaxed by European standards; central location easily accessible; numerous restaurants nearby for pre-concert dining.",
                    "best_time": "Evening performances (typically 7:30PM)",
                    "estimated_cost": "€30-70 depending on performance and seating",
                    "weather_dependent": false
                }
            ]
        }
    }
}