{
    "Spring": {
        "activities": [
            {
                "name": "Les Machines de l'Île",
                "type": "Cultural Attraction",
                "description": "Explore this unique artistic project featuring extraordinary mechanical animals and fantastical machines, including the famous Great Elephant that carries visitors through the former shipyards.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers pleasant weather with fewer crowds than summer months, making it ideal to enjoy the outdoor parts of this attraction.",
                "booking_tips": "Book tickets online in advance to avoid queues. Consider the combined ticket for the Elephant ride, Carrousel des Mondes Marins, and the Gallery visit."
            },
            {
                "name": "Jardin des Plantes",
                "type": "Outdoor Activity",
                "description": "Visit one of France's most important botanical gardens when spring flowers bloom, featuring 7 hectares of landscaped gardens, greenhouses, and extraordinary plant collections.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring is the ideal time to visit when magnolias, camellias, rhododendrons, and numerous bulbs create a spectacular display of colors.",
                "booking_tips": "No booking required. Free guided tours are available on Sunday afternoons during spring and summer months."
            },
            {
                "name": "Talensac Market",
                "type": "Market",
                "description": "Experience Nantes' largest and oldest covered market where over 100 vendors offer fresh local produce, seafood, cheeses, and regional specialties.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings seasonal delicacies like asparagus, strawberries from nearby Pornic, and early vegetables to this vibrant market.",
                "booking_tips": "Visit Tuesday through Sunday mornings, with Saturday being the busiest and most atmospheric day. Arrive before 11am for the best selection."
            },
            {
                "name": "Le Voyage à Nantes Preview Events",
                "type": "Cultural Event",
                "description": "Catch early installations and preview events of Nantes' famous art trail as the city prepares for its summer cultural festival.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Late spring sees the installation of new art pieces along the green line trail that guides visitors through the city's cultural highlights.",
                "booking_tips": "Pick up a map from the tourist office or download the Voyage à Nantes app to locate permanent installations throughout the city."
            },
            {
                "name": "Loire River Cruise",
                "type": "Boat Tour",
                "description": "Take a scenic boat trip on France's longest river, discovering Nantes' maritime heritage and the unique landscape of the Loire estuary.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers ideal cruising conditions with pleasant temperatures and lush riverside vegetation coming to life after winter.",
                "booking_tips": "Book with Navibus or Bateaux Nantais. The Estuaire cruise showcases contemporary art installations along the river between Nantes and Saint-Nazaire."
            },
            {
                "name": "Cycling the Loire à Vélo Route",
                "type": "Outdoor Activity",
                "description": "Rent bicycles and explore segments of the famous Loire à Vélo cycling route that connects Nantes to the Atlantic coast through scenic riverside paths.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "Spring provides perfect cycling weather with blooming wildflowers along the banks and fewer tourists than summer.",
                "booking_tips": "Rent bikes from Détours de Loire or use Bicloo, the city's bike-sharing system. The route to Trentemoult fishing village makes for a perfect day trip."
            },
            {
                "name": "Muscadet Wine Tasting",
                "type": "Food & Drink",
                "description": "Visit vineyards in the nearby Muscadet wine region when the vines begin their new growth cycle, tasting the crisp white wines perfectly matched with Nantes' seafood.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers beautiful vineyard landscapes and the opportunity to taste newly bottled vintages from the previous harvest.",
                "booking_tips": "Book a guided tour from Nantes to visit several wineries in the Sèvre-et-Maine area, or take the regional train to Clisson and arrange visits from there."
            },
            {
                "name": "Château des Ducs de Bretagne",
                "type": "Historical Site",
                "description": "Explore this restored medieval castle and its Nantes History Museum when its courtyard and moat gardens burst into spring bloom.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "The castle courtyard and rampart walks are particularly enjoyable in spring sunshine with fewer visitors than peak summer months.",
                "booking_tips": "Access to the courtyard is free, but purchase museum tickets online to avoid lines. The rooftop terrace offers spectacular views of the city."
            },
            {
                "name": "Cours Cambronne Walking Tour",
                "type": "Walking Tour",
                "description": "Join a guided stroll through the elegant Graslin district, centered on the neoclassical Cours Cambronne when its manicured gardens and lime trees are in fresh spring leaf.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings perfect walking weather to discover Nantes' 18th-century architecture and fashionable shopping streets.",
                "booking_tips": "Book tours through the Nantes Tourist Office or use the Nantes.Tourisme app for self-guided routes through this historic neighborhood."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Le Voyage à Nantes",
                "type": "Art Festival",
                "description": "Follow the green line painted on Nantes' streets to discover this unique summer-long art trail featuring temporary and permanent installations that transform the city into an open-air gallery.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This major cultural event runs from July through August, with dozens of artistic interventions throughout the urban landscape.",
                "booking_tips": "Collect a map from the tourist office or download the official app. Guided tours in English are available but should be booked several days in advance."
            },
            {
                "name": "Aux Heures d'Été Festival",
                "type": "Music Festival",
                "description": "Enjoy free outdoor concerts in Nantes' parks and public spaces, featuring world music, jazz, and folk in picturesque settings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This July-August festival brings musical performances to different neighborhoods throughout Nantes, with a focus on global cultural diversity.",
                "booking_tips": "No booking required, but arrive early with a picnic blanket to secure good spots. The concerts in Jardin des Plantes are particularly popular."
            },
            {
                "name": "Trentemoult Fishing Village",
                "type": "Day Trip",
                "description": "Visit this colorful former fishing village across the Loire River, now a bohemian neighborhood known for its painted houses, riverside restaurants, and artistic atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer brings this riverside community to life with outdoor dining, street art, and a laid-back Mediterranean vibe.",
                "booking_tips": "Take the Navibus ferry from Gare Maritime for a scenic river crossing. No reservations needed but check the ferry schedule for return times."
            },
            {
                "name": "Les Rendez-vous de l'Erdre",
                "type": "Festival",
                "description": "Experience this unique festival combining jazz music and heritage river boats along the Erdre River, with concerts on the banks and nautical parades.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This late August festival marks the end of summer with four days of music and maritime heritage celebrations.",
                "booking_tips": "No tickets required for most events. The Île de Versailles and Parc de la Beaujoire host the main stages with food stalls and craft beer stands."
            },
            {
                "name": "Île de Nantes Beach",
                "type": "Outdoor Activity",
                "description": "Relax at the urban beach created each summer on the island in the heart of Nantes, with sand, lounge chairs, refreshments, and activities along the Loire riverbank.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This temporary summer installation provides a beach atmosphere from July through August with sunset DJ sessions on weekends.",
                "booking_tips": "No booking required. Accessible via tram line 1 (Chantiers Navals stop). Beach games and water misters offer relief on hot days."
            },
            {
                "name": "Nantes Food Festival",
                "type": "Food & Drink",
                "description": "Savor local and international cuisine at this summer food festival celebrating Nantes' vibrant culinary scene with chef demonstrations, tastings, and street food markets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This July event showcases regional specialties including seafood, Muscadet wine, and Breton influences in outdoor settings.",
                "booking_tips": "Purchase tasting tokens on arrival. VIP passes for special chef demonstrations should be booked online in advance."
            },
            {
                "name": "La Folle Journée",
                "type": "Cultural Event",
                "description": "Immerse yourself in this renowned classical music festival that makes classical accessible with hundreds of short concerts throughout the city at affordable prices.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "While primarily a winter festival, summer sees encore performances and outdoor concerts as part of its programming.",
                "booking_tips": "Book tickets well in advance through the official website. Many 45-minute concerts cost less than €15 and are designed to be accessible to newcomers."
            },
            {
                "name": "Atlantic Coast Beaches",
                "type": "Day Trip",
                "description": "Escape the city heat with a day trip to the Atlantic beaches near Nantes, including the fine sands of La Baule, Pornichet, or the wilder coastline of Pornic.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "Summer brings warm ocean temperatures and beach services to these coastal towns, all within an hour of Nantes.",
                "booking_tips": "Take the regional TER train from Nantes station to La Baule-Escoublac (about 50 minutes). On summer weekends, trains can be crowded so book tickets in advance."
            },
            {
                "name": "Evening Tour of Passage Pommeraye",
                "type": "Walking Tour",
                "description": "Experience a guided evening tour of Nantes' magnificent 19th-century shopping arcade, a masterpiece of neoclassical design featured in many films.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings bring special lighting to this architectural gem, with extended shopping hours and occasional musical performances.",
                "booking_tips": "Book evening tours through Nantes Tourism office. The arcade connects Rue Santeuil with Rue de la Fosse through three levels of ornate galleries."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Celtomania Festival",
                "type": "Cultural Festival",
                "description": "Celebrate Nantes' Breton heritage at this Celtic music and culture festival featuring traditional and contemporary performances throughout the city and surrounding region.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "This October-November festival highlights Brittany's cultural influence in Western Loire with concerts, dances, and workshops.",
                "booking_tips": "Book tickets for main concerts in advance. Many smaller events in local venues are free or pay-at-the-door."
            },
            {
                "name": "Wine Harvest in Muscadet",
                "type": "Food & Drink",
                "description": "Visit the Muscadet vineyards during harvest season to witness the grape picking and first pressing of Nantes' signature white wine.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "September and early October bring the excitement of harvest to vineyards just outside Nantes, with special events and tastings of young wine.",
                "booking_tips": "Book wine tours through the Maison des Vins in Nantes or contact vineyards directly through the Loire Wine Route organization."
            },
            {
                "name": "Autumn Colors at Parc de Procé",
                "type": "Outdoor Activity",
                "description": "Experience the spectacular fall foliage at this English-style park featuring century-old trees, romantic bridges, and meandering pathways through seasonal colors.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Mid-October to early November offers the most vivid autumn colors in this 19th-century landscape park.",
                "booking_tips": "No booking required. The park is located in west Nantes and easily accessible by bus lines 54 and C3 (Procé stop)."
            },
            {
                "name": "Erdre River Cruise",
                "type": "Boat Tour",
                "description": "Cruise the Erdre River, once called 'the most beautiful river in France' by François I, when autumn colors reflect in its waters and elegant châteaux line its banks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Fall brings spectacular scenery to this river journey with fewer tourists than summer months and perfect photography conditions.",
                "booking_tips": "Book with Bateaux Nantais for 2-3 hour cruises. The Sunday lunch cruise includes regional cuisine served on board while viewing riverside estates."
            },
            {
                "name": "Festival des 3 Continents",
                "type": "Film Festival",
                "description": "Attend this prestigious film festival showcasing cinema from Asia, Africa, and Latin America, with screenings, director talks, and cultural events throughout Nantes.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "This late November festival has been celebrating international cinema in Nantes since 1979 with a focus on emerging filmmakers.",
                "booking_tips": "Purchase festival passes online or individual screening tickets at Katorza cinema. Industry events require separate accreditation."
            },
            {
                "name": "Leçons de Ténèbres at La Chapelle de l'Immaculée",
                "type": "Concert",
                "description": "Experience early music concerts in this neo-Gothic chapel where autumn acoustics and atmospheric lighting create perfect conditions for baroque and medieval performances.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The autumn concert series focuses on contemplative sacred music that suits the season's more introspective mood.",
                "booking_tips": "Purchase tickets through Angers Nantes Opéra or at the chapel box office. Seating is limited so advance booking is essential."
            },
            {
                "name": "Seafood Tasting at La Cigale",
                "type": "Food & Drink",
                "description": "Indulge in oysters and seafood plateaus at Nantes' famous art nouveau brasserie as the autumn oyster season begins, bringing the finest specimens from nearby Brittany coast.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn marks the start of prime oyster season with varieties from Cancale, Marennes-Oléron, and local Bourgneuf Bay at their best.",
                "booking_tips": "Reserve at least a week in advance for this historic restaurant near Place Graslin. The seafood platter to share is their signature offering."
            },
            {
                "name": "Brittany Cider Route",
                "type": "Food & Drink",
                "description": "Explore the cider producers around Nantes after the apple harvest, tasting traditional brews and pear ciders that reflect the region's orchard heritage.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is cider-making season with opportunities to witness pressing and fermentation in traditional cidreries.",
                "booking_tips": "Rent a car or join organized tours from Nantes to visit producers in the Pays de la Loire and southern Brittany regions."
            },
            {
                "name": "Contemporary Art at HAB Galerie",
                "type": "Exhibition",
                "description": "Visit this large industrial space on the banks of the Loire featuring autumn exhibitions by contemporary artists as part of the post-summer cultural calendar.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Fall exhibitions typically open in September and run through December in this converted banana warehouse on the Île de Nantes.",
                "booking_tips": "No booking required. The gallery is closed on Mondays and offers free guided tours on Sunday afternoons."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "La Folle Journée",
                "type": "Music Festival",
                "description": "Immerse yourself in this unique classical music festival that democratizes classical with hundreds of short, affordable concerts throughout Nantes in a festive atmosphere.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "This late January/early February festival is one of Europe's most important classical events, featuring world-class orchestras and soloists.",
                "booking_tips": "Book tickets as soon as they're released in December. Many 45-minute concerts cost under €15, making classical accessible to everyone."
            },
            {
                "name": "Christmas Markets",
                "type": "Market",
                "description": "Wander through Nantes' Christmas markets centered around Place Royale and Place du Commerce, with wooden chalets selling crafts, regional foods, and mulled wine.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "From late November through December, the markets create a festive atmosphere with lights, decorations, and seasonal treats.",
                "booking_tips": "No booking required. Visit weekday evenings to avoid weekend crowds. The grand carousel in Place Royale adds to the fairy-tale ambiance."
            },
            {
                "name": "Passage Pommeraye Christmas Shopping",
                "type": "Shopping",
                "description": "Experience Christmas shopping in Nantes' spectacular 19th-century covered shopping arcade, beautifully decorated for the holidays with lights and garlands.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The ornate three-level neoclassical passage transforms during December with elegant decorations and extended shopping hours.",
                "booking_tips": "No booking required. Visit on weekday mornings for the most peaceful experience. The arcade connects Rue de la Fosse with Rue Santeuil."
            },
            {
                "name": "Winter Gastronomy Workshop",
                "type": "Workshop",
                "description": "Learn to prepare Nantes winter specialties in a cooking class focusing on local ingredients and traditional recipes adapted for the festive season.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Winter workshops highlight warm dishes like cassoulet nantais, seafood cassolettes, and the region's famous Gâteau Nantais.",
                "booking_tips": "Book through L'Atelier des Chefs or Les Ateliers de Laurence at least two weeks in advance. Classes include lunch with wine pairings."
            },
            {
                "name": "Les Machines de l'Île Winter Visit",
                "type": "Cultural Attraction",
                "description": "Experience Nantes' famous mechanical creatures with fewer crowds during winter, when the Great Elephant, Marine Worlds Carousel, and Heron Tree prototype can be enjoyed at a leisurely pace.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "While outdoor elephant rides may be chilly, the spectacular Marine Worlds Carousel is partially enclosed and magical during winter months.",
                "booking_tips": "Book online for specific elephant ride times. Winter hours are reduced so check the schedule. The combined ticket offers the best value."
            },
            {
                "name": "Château des Ducs de Bretagne Winter Tour",
                "type": "Historical Site",
                "description": "Explore this medieval castle and Nantes History Museum when winter brings a special atmosphere to its stone walls and quieter galleries.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Winter offers a more intimate experience of the museum's excellent collections with special exhibitions typically running through the season.",
                "booking_tips": "Admission to the courtyard is free, but museum tickets should be purchased online. Evening openings on Thursdays offer a different perspective."
            },
            {
                "name": "Hammam Relaxation",
                "type": "Wellness",
                "description": "Escape winter chill at Hammam Medina, an authentic Moroccan bath house in central Nantes offering traditional steam rooms, scrubs, and massage treatments.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season to enjoy these warming steam treatments that respect Moroccan traditions.",
                "booking_tips": "Reserve treatments in advance, especially for weekends. Different days are allocated for men, women, and mixed sessions, so check the schedule."
            },
            {
                "name": "Festive Opera at Théâtre Graslin",
                "type": "Performance",
                "description": "Attend a winter opera or ballet performance at Nantes' beautiful 18th-century theater, when holiday productions bring color and music to dark winter evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "The winter season features both classic productions and festive performances in this historically significant venue.",
                "booking_tips": "Purchase tickets through Angers Nantes Opéra at least a month in advance. Dress code is smart casual with many patrons opting for formal attire."
            },
            {
                "name": "Winter Wine Tasting",
                "type": "Food & Drink",
                "description": "Warm up with guided wine tastings focusing on the Loire Valley's diverse offerings, from Nantes' own Muscadet to the robust reds of Saumur-Champigny.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter evenings are perfect for discovering the region's wines in cozy tasting rooms across the city.",
                "booking_tips": "Book specialized tastings at La Comédie des Vins or Cave des Vins Authentiques offering expert guidance through regional appellations."
            }
        ]
    }
}