{
    "Spring": {
        "activities": [
            {
                "name": "Semana Santa (Holy Week)",
                "type": "Cultural/Religious",
                "description": "Experience Toledo's solemn and dramatic Easter processions through the medieval streets, featuring ancient brotherhoods carrying ornate floats with religious imagery against the backdrop of Toledo's historic monuments.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Dates vary each year (March-April) with processions throughout Holy Week. Toledo's celebrations are known for their austerity and historical authenticity compared to more flamboyant Andalusian traditions.",
                "booking_tips": "No booking required; best viewing spots include Plaza de Zocodover and areas near the Cathedral. Book accommodation months in advance as this is a peak visitor period. Processions begin from different churches across the city according to published schedules."
            },
            {
                "name": "Corpus Christi Festival",
                "type": "Cultural/Religious",
                "description": "Witness Toledo's most important annual festival when the historic center is adorned with awnings, tapestries, and heraldic symbols while a grand procession carries the monstrance through streets carpeted with herbs and flowers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Held 60 days after Easter Sunday (typically May-June), this festival has been celebrated in Toledo since 1342 and is considered the most important Corpus Christi celebration in Spain.",
                "booking_tips": "No booking required for the procession, but arrive early for good viewing positions. Book accommodation months in advance. The night before (Wednesday) features the 'Vísperas' ceremony which is less crowded but equally impressive."
            },
            {
                "name": "Hiking in the Toledo Mountains",
                "type": "Nature",
                "description": "Explore the scenic hiking trails of the Montes de Toledo, with routes for all abilities showcasing spring wildflowers, diverse bird life, and panoramic views of the historic city and surrounding countryside.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "Spring (April-May) offers comfortable temperatures, vibrant wildflower displays, and active wildlife. Several natural areas including Cabañeros National Park provide diverse hiking environments.",
                "booking_tips": "No booking required for self-guided routes; visitor centers offer maps. Guided nature tours available with advance reservation. Most areas accessible by car (30-60 minutes from Toledo) or by local buses to trailheads."
            },
            {
                "name": "Medieval Market Weekend",
                "type": "Cultural",
                "description": "Experience Toledo transformed by a traditional medieval market featuring artisans demonstrating historical crafts, period costumes, street performances, and traditional food in the historic Jewish Quarter.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free (purchases extra)",
                "seasonal_notes": "Typically held over a weekend in late May, the market recreates the multicultural atmosphere of medieval Toledo with Christian, Jewish and Islamic influences.",
                "booking_tips": "No booking required; easily accessible in the historic center. Most animated during afternoon and early evening hours. Combined with visits to nearby synagogues and the El Greco Museum for context."
            },
            {
                "name": "Tagus River Kayaking",
                "type": "Adventure",
                "description": "Paddle along the Tagus River as it winds around Toledo's dramatic rocky promontory, offering unique perspectives of the historic city walls, bridges, and monuments from the water.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring provides ideal conditions with comfortable temperatures and adequate water levels. The Tagus is most photogenic in morning light when the eastern facades catch the sun.",
                "booking_tips": "Book through activity operators in Toledo at least a day in advance. No experience necessary for basic routes. The standard circuit takes approximately 2 hours and includes safety equipment and guides."
            },
            {
                "name": "Toledo en Flor (Toledo in Bloom)",
                "type": "Cultural/Nature",
                "description": "Discover Toledo's historic courtyards, gardens, and public spaces specially decorated with elaborate floral displays showcasing traditional Castilian gardening and contemporary floral design.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Held in May, this event transforms various spaces throughout the historic center with seasonal flowers and plants, highlighting Toledo's private courtyards normally closed to the public.",
                "booking_tips": "Purchase route maps at the tourist office showing participating locations. Some private patios and institutional gardens require small entrance fees. Photographer-friendly event with morning and evening offering best lighting conditions."
            },
            {
                "name": "Retamares de Toledo",
                "type": "Nature",
                "description": "Witness the spectacular flowering of broom and gorse in the countryside surrounding Toledo, creating fields of vibrant yellow blooms against the backdrop of the ancient city.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Late April through May brings the peak blooming season for these Mediterranean shrubs that cover hillsides around Toledo. Particularly impressive at the Mirador del Valle viewpoint.",
                "booking_tips": "No booking required; accessible viewpoints include the Mirador del Valle (by bus #71 or taxi) and various hiking trails beginning from the Valley Bridge. Morning light offers best photography conditions."
            },
            {
                "name": "Patio de Don Pedro Wine Experience",
                "type": "Food & Drink",
                "description": "Sample wines from the Toledo region in the atmospheric courtyard of a historic noble house, featuring guided tastings of local Tempranillo, Garnacha, and other varieties from the Montes de Toledo.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings pleasant temperatures perfect for evening courtyard tastings, along with new vintage releases from local wineries.",
                "booking_tips": "Reservation required at least 24 hours in advance; tastings include regional cheese and charcuterie pairings. Located in the historic center with special evening sessions featuring live Spanish guitar music on weekends."
            },
            {
                "name": "Saffron Field Tours",
                "type": "Cultural/Food",
                "description": "Visit the saffron-producing region of La Mancha surrounding Toledo, learning about this precious spice's cultivation and history with guided tours of processing facilities and cooking demonstrations.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "While autumn is the harvest season, spring provides excellent conditions for understanding the cultivation cycle with visible growing fields and less crowded facilities.",
                "booking_tips": "Book through specialist food tour operators based in Toledo at least several days in advance. Tours typically include transportation to villages like Consuegra (45 minutes from Toledo), tastings, and cultural context about Spain's 'red gold'."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Festival de Jazz de Toledo",
                "type": "Music",
                "description": "Experience outdoor jazz concerts held in atmospheric venues throughout the historic city, featuring international performers against the backdrop of illuminated monuments and historic squares.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies (some free, some ticketed)",
                "seasonal_notes": "Held throughout July, this festival takes advantage of Toledo's warm summer evenings with performances in unique settings including historic courtyards, plazas, and the banks of the Tagus River.",
                "booking_tips": "Free concerts in public spaces require no tickets; special venue performances should be booked online in advance through the festival website. Bring cushions for stone seating at historic venues."
            },
            {
                "name": "Night Tours of Historic Toledo",
                "type": "Cultural",
                "description": "Explore Toledo's atmospheric streets, legends, and monuments on specialized evening walking tours when the medieval city is beautifully illuminated and temperatures are more comfortable.",
                "indoor": false,
                "best_time": "Night",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers extended daylight hours with guided tours typically starting around 9:30-10pm when temperature is pleasant and monuments are dramatically lit.",
                "booking_tips": "Book through Toledo tourist office or online at least a day in advance. Several themed routes available including 'Legends and Mysteries,' 'Three Cultures,' and 'Underground Toledo.' Tours typically last 2 hours."
            },
            {
                "name": "Sunset at Mirador del Valle",
                "type": "Scenic",
                "description": "Experience Toledo's most spectacular viewpoint at sunset, when the entire city glows golden on its rocky promontory surrounded by the Tagus River - the view that inspired El Greco's famous landscapes.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "Summer sunsets (around 9:30pm) create perfect conditions for Toledo's famous golden glow when the city's stone buildings reflect the warm evening light.",
                "booking_tips": "No booking required for the viewpoint; accessible by city bus #71 from Plaza de Zocodover or taxi. Arrive 30-45 minutes before sunset to secure a good spot. Restaurant Mirador del Valle offers terrace dining with the same view (reservation essential)."
            },
            {
                "name": "Nocturnal Toledo Cultural Program",
                "type": "Cultural",
                "description": "Attend special evening openings of Toledo's monuments and museums with extended summer hours, cultural performances, and illuminated visits to sites like the Cathedral, Alcázar, and monasteries.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "July and August program offers access to monuments during cooler evening hours, often with special lighting, guided explanations, and occasional musical accompaniment.",
                "booking_tips": "Book specific monument visits through the Nocturnal Toledo program website as capacity is limited. Combined tickets available for multiple venues. Special thematic routes with guides should be booked at least several days in advance."
            },
            {
                "name": "Toledo Gastronomy Festival",
                "type": "Food & Drink",
                "description": "Celebrate the culinary traditions of Toledo and Castilla-La Mancha with this food festival featuring tastings, cooking demonstrations, and special menus throughout the city's restaurants.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Held in late June, this event showcases regional specialties including marzipan, game dishes, manchego cheese, and saffron-infused recipes in a series of outdoor markets and restaurant promotions.",
                "booking_tips": "No booking required for general festival areas in Plaza de Zocodover and surrounding streets; special dining events at participating restaurants should be reserved directly. Tapas routes with passport stamps offer prizes for visitors who complete the circuit."
            },
            {
                "name": "Cigarrales Gardens Tour",
                "type": "Nature/Cultural",
                "description": "Visit the historic country estates (cigarrales) on the hills opposite Toledo, featuring centuries-old gardens with Mediterranean plants, fruit orchards, and unparalleled views of the city.",
                "indoor": false,
                "best_time": "Late Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings showcase these historic gardens at their best, with flowering plants, mature shade trees, and perfect lighting for views of Toledo across the Tagus valley.",
                "booking_tips": "Book through specialist tour companies or directly with properties like Cigarral de Santa María that offer guided visits. Many cigarrales now function as hotels or restaurants where you can experience the gardens while dining or enjoying refreshments."
            },
            {
                "name": "Barranco del Río Dulce Natural Park",
                "type": "Nature",
                "description": "Escape Toledo's summer heat with a day trip to this dramatic river canyon featuring hiking trails, swimming holes, bird watching, and cooler temperatures in a lush river valley.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "Summer months offer refreshing alternatives to urban sightseeing with natural swimming areas and shaded hiking trails. Griffon vultures and eagles can frequently be observed soaring above the canyon.",
                "booking_tips": "No booking required for park entry; accessible by car (approximately 1.5 hours from Toledo). Visitor center provides maps and trail information. Bring picnic supplies and swimming gear during summer months."
            },
            {
                "name": "Noches Toledanas (Toledo Nights Festival)",
                "type": "Cultural",
                "description": "Experience this cultural festival featuring music, theater, dance, and lighting installations throughout Toledo's historic center, when museums and monuments offer special extended hours.",
                "indoor": false,
                "best_time": "Night",
                "price_range": "Mostly Free",
                "seasonal_notes": "Held over a weekend in late July or early August, this festival transforms Toledo with cultural activities continuing past midnight when summer temperatures become comfortable.",
                "booking_tips": "No booking required for most street performances and public space events; special venue performances may require advance tickets through the festival website. Program details usually announced 2-3 weeks before the event."
            },
            {
                "name": "Toledo Artisan Workshops",
                "type": "Cultural/Shopping",
                "description": "Visit traditional artisan workshops creating Toledo's famous damasquinado (damascene metalwork), swords, marzipan, and ceramics with demonstrations and hands-on experiences.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Summer allows visitors to escape midday heat in air-conditioned workshops while learning about traditional crafts that have defined Toledo for centuries.",
                "booking_tips": "Major workshops like Mariano Zamorano (swords) and Artesanía Morales (damascene) welcome walk-in visitors; hands-on workshops teaching basic techniques require advance reservation through Toledo tourist office or directly with artisans."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Saffron Harvest in La Mancha",
                "type": "Cultural/Food",
                "description": "Witness the spectacular autumn harvest of saffron crocus flowers in the fields surrounding Toledo, with opportunities to participate in picking and processing this precious spice.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Late October is the brief harvest season when fields bloom with purple crocus flowers containing the valuable red stigmas. The process of harvesting and processing must be completed within a few hours of flowering.",
                "booking_tips": "Book saffron route tours through specialist operators at least several weeks in advance as the season is short and popular. Villages like Consuegra (famous for Don Quixote's windmills) and Madridejos host saffron festivals with cultural activities."
            },
            {
                "name": "Mushroom Foraging in Toledo Mountains",
                "type": "Nature/Food",
                "description": "Join guided mushroom hunting expeditions in the forests of the Montes de Toledo, learning to identify prized edible species like boletus and chanterelles in their natural habitat.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October and November bring ideal conditions for mushroom growth after autumn rains. The oak and pine forests of the Toledo Mountains are known for their rich variety of edible fungi.",
                "booking_tips": "Essential to book with certified mycological guides through nature tour operators based in Toledo. Tours typically include transportation to foraging areas, equipment, identification lessons, and cooking demonstrations with the day's finds."
            },
            {
                "name": "Castañada (Chestnut Festival)",
                "type": "Cultural/Food",
                "description": "Experience traditional autumn chestnut roasting celebrations in Toledo's historic squares, featuring street vendors, folk music, and the opportunity to sample this seasonal delicacy with sweet anise liqueur.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Celebrated around All Saints' Day (November 1), this tradition marks the arrival of autumn with communal chestnut roasting and seasonal foods that honor the connection between harvest time and remembrance of ancestors.",
                "booking_tips": "No booking required; celebrations center around Plaza de Zocodover and smaller plazas throughout the historic center. Evening events typically include folkloric performances and traditional Castilian autumn foods."
            },
            {
                "name": "Toledo Film Festival",
                "type": "Cultural",
                "description": "Attend this boutique film festival showcasing Spanish and international cinema in unique historic venues throughout Toledo, including converted convents, palaces, and cultural centers.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in October, this cultural festival brings contemporary cinema to historic settings, often featuring films with historical or cultural connections to Toledo and Spain.",
                "booking_tips": "Purchase tickets through the festival website once the program is announced; screenings in unique historic venues tend to sell out quickly. Festival passes offer the best value for multiple screenings."
            },
            {
                "name": "Olive Harvest Experience",
                "type": "Cultural/Food",
                "description": "Participate in the traditional olive harvest on estates surrounding Toledo, learning traditional and modern methods of picking and pressing to produce Spain's liquid gold.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Late autumn (November-December) brings the olive harvest season when the fruit reaches optimal ripeness. The mountains around Toledo produce distinctive varieties including Cornicabra olives.",
                "booking_tips": "Book through agricultural tourism operators at least a week in advance. Experiences typically include transportation to olive groves, participation in the harvest, visits to traditional oil presses, and tasting sessions of various olive oils."
            },
            {
                "name": "Autumn in the Synagogues",
                "type": "Cultural/Music",
                "description": "Experience atmospheric Sephardic music concerts held in Toledo's historic synagogues, featuring traditional instruments and melodies that connect to the city's Jewish heritage.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn concert series highlighting the musical traditions of Sephardic culture in the authentic setting of Toledo's medieval synagogues, including Sinagoga del Tránsito and Sinagoga de Santa María la Blanca.",
                "booking_tips": "Purchase tickets through the cultural program website as seating in these historic venues is limited. Concerts typically last 90 minutes and may include explanations of Sephardic cultural heritage and musical traditions."
            },
            {
                "name": "Tagus River Valley Hiking",
                "type": "Nature",
                "description": "Explore the scenic hiking trails that follow the Tagus River valley around Toledo, showcasing autumn colors, historic bridges, water mills, and unique perspectives of the city's dramatic setting.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "October and November offer ideal hiking conditions with moderate temperatures and autumn colors in the river valley. The Senda Ecológica trail provides a complete circuit around the historic city following the river.",
                "booking_tips": "No booking required; trail maps available at Toledo tourist office. The complete circuit takes approximately 3-4 hours but can be divided into shorter sections. Most scenic sections are east of the city near the historic San Martín Bridge."
            },
            {
                "name": "Game Cuisine Season",
                "type": "Food & Drink",
                "description": "Savor traditional Castilian game dishes as Toledo's restaurants showcase seasonal hunting bounty including partridge, venison, wild boar, and quail prepared according to centuries-old recipes.",
                "indoor": true,
                "best_time": "Dinner",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Autumn hunting season brings specialized game menus to Toledo's restaurants, featuring dishes that have defined the region's gastronomy since medieval times. Particularly notable is perdiz a la toledana (Toledo-style partridge).",
                "booking_tips": "Reservations recommended for renowned game restaurants like Adolfo and El Trebol, especially on weekends. Special game tasting menus typically appear in October and continue through winter."
            },
            {
                "name": "Autumn at the Cigarrales",
                "type": "Scenic/Dining",
                "description": "Enjoy the spectacular autumn colors and views from Toledo's historic cigarrales (country estates) on the hills opposite the city, now operating as exclusive restaurants and hotels.",
                "indoor": false,
                "best_time": "Sunset",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn brings magnificent colors to these historic estates with their panoramic views of Toledo. The golden hour light creates the iconic view that inspired El Greco's famous Toledo landscapes.",
                "booking_tips": "Reserve well in advance for sunset dining at premier cigarrales like Cigarral de las Mercedes or Cigarral del Ángel. Most offer both indoor and terrace dining options depending on weather conditions."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Toledo Christmas Market",
                "type": "Cultural/Shopping",
                "description": "Experience Toledo's traditional Christmas market in Plaza de Zocodover featuring artisanal crafts, seasonal treats like marzipan figures, mulled wine, and the historic city beautifully illuminated for the season.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (purchases extra)",
                "seasonal_notes": "Runs from early December through Epiphany (January 6), with the historic center decorated with lights and seasonal ornaments. Toledo's famous marzipan is particularly associated with Christmas traditions.",
                "booking_tips": "No booking required; most atmospheric in early evening when lights are illuminated. Traditional artisan workshops around the old town offer special Christmas-themed crafts during this period."
            },
            {
                "name": "Three Kings Parade (Cabalgata de Reyes)",
                "type": "Cultural",
                "description": "Witness Spain's most important Christmas celebration as the Three Kings parade through Toledo's medieval streets on elaborate floats, distributing candy to children on the eve of Epiphany.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on January 5th, the parade is particularly magical against Toledo's historic backdrop with the medieval streets creating a timeless atmosphere for this traditional celebration.",
                "booking_tips": "No booking required; the parade route typically includes major streets in the historic center culminating in Plaza del Ayuntamiento. Most spectacular when viewed from Plaza de Zocodover as the procession navigates the narrow streets."
            },
            {
                "name": "Cathedral Winter Organ Concerts",
                "type": "Music/Cultural",
                "description": "Experience the magnificent acoustics of Toledo Cathedral during special winter organ concerts featuring classical and sacred music performed on the historic 18th-century organ.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The cathedral's winter concert series runs from December through February, offering the unique experience of hearing sacred music in one of Spain's most important Gothic cathedrals.",
                "booking_tips": "Purchase tickets through the Cathedral Foundation website as capacity is limited. Concerts typically last 60-90 minutes; bring warm clothing as the cathedral interior remains cool even in winter."
            },
            {
                "name": "Marzipan Making Workshops",
                "type": "Cultural/Food",
                "description": "Learn to make Toledo's signature sweet - traditional marzipan - in hands-on workshops led by master confectioners using centuries-old recipes originated in the city's convents.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is prime marzipan season with Christmas being the traditional time for this almond-based delicacy. Toledo's marzipan carries Protected Geographical Indication status reflecting its cultural importance.",
                "booking_tips": "Book through Toledo tourist office or directly with workshops like Santo Tomé at least several days in advance. Sessions last approximately 2 hours and include historical context, demonstration, hands-on practice, and tasting."
            },
            {
                "name": "Toledo Gastronomy Routes - Winter Edition",
                "type": "Food & Drink",
                "description": "Follow specialized culinary routes featuring Toledo's hearty winter cuisine including game stews, roast meats, Castilian soups, and warming desserts served in historic taverns and restaurants.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings specialized menus featuring seasonal game, hearty stews like carcamusas (Toledo-style pork stew), and traditional migas (fried breadcrumbs with chorizo and grapes).",
                "booking_tips": "Self-guided routes available through tourist office; reservations recommended for premium restaurants like Adolfo, especially on weekends. Lunchtime offers the best value with set 'menu del día' options."
            },
            {
                "name": "Convent Sweets Route",
                "type": "Cultural/Food",
                "description": "Discover Toledo's tradition of convent confectionery by visiting the turnstiles where cloistered nuns sell their handmade sweets according to centuries-old recipes, a tradition particularly associated with Christmas.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Winter, particularly the Christmas season, is when convents produce their greatest variety of traditional sweets including marzipan, almond cookies, and honey-based confections.",
                "booking_tips": "No booking required; self-guided routes available from tourist office showing convents with sweet shops. Most convents sell through turnstiles (no direct contact with nuns); morning hours are most reliable as popular items sell out quickly."
            },
            {
                "name": "Toledo in the Snow",
                "type": "Scenic/Photography",
                "description": "Experience the rare and magical sight of Toledo dusted with snow, when the medieval city takes on an ethereal quality and photographers capture unique images of monuments and streets transformed by winter weather.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Snowfall in Toledo occurs only a few days per year (typically January-February) but creates spectacular photographic opportunities when it happens, particularly from viewpoints like Mirador del Valle.",
                "booking_tips": "No booking possible as snowfall is unpredictable; follow local weather forecasts and be prepared to visit viewpoints early morning after snowfall before it melts. The city's high elevation makes roads accessible even during light snow events."
            },
            {
                "name": "Day Trip to Skiing in Sierra de Guadarrama",
                "type": "Sport",
                "description": "Enjoy winter sports with a day trip to the ski resorts near Madrid in the Sierra de Guadarrama mountains, offering downhill and cross-country skiing just 90 minutes from Toledo.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Winter sports season typically runs from December through March, weather permitting. Navacerrada and Valdesquí are the closest ski areas to Toledo with reliable conditions.",
                "booking_tips": "Book through Toledo travel agencies offering day trips with transportation included, or drive independently (approximately 1.5 hours). Equipment rental available on-site. Weekdays offer reduced crowds and better rates."
            },
            {
                "name": "New Year's Eve in Plaza del Ayuntamiento",
                "type": "Cultural",
                "description": "Celebrate New Year's Eve in Toledo's main square following the Spanish tradition of eating twelve grapes with the midnight bell strikes, followed by festivities in the historic center.",
                "indoor": false,
                "best_time": "Night",
                "price_range": "Free (nightclub or restaurant celebrations extra)",
                "seasonal_notes": "December 31st celebrations center around the Town Hall clock with locals and visitors gathering to follow the midnight grape tradition, before continuing celebrations in bars and restaurants.",
                "booking_tips": "No booking required for the public plaza celebration; restaurants and hotels offering special New Year's Eve dinners and parties should be booked months in advance. Many venues offer traditional late-night 'chocolate con churros' after midnight."
            }
        ]
    }
}