{
    "neighborhoods": [
      {
        "name": "Casco Histórico",
        "alternate_names": [
          "Old Town",
          "Historic Center",
          "Ciudad Antigua"
        ],
        "character": "Toledo's magnificent medieval core with winding cobblestone streets, imposing stone buildings, and a remarkable concentration of monuments from Christian, Jewish, and Muslim cultures, earned its designation as a UNESCO World Heritage site.",
        "location": {
          "central": true,
          "description": "Situated on a rocky promontory surrounded on three sides by the Tagus River, forming a natural defensive position that shaped the city's history.",
          "borders": [
            "Tagus River",
            "Antequeruela",
            "Santa Teresa",
            "San Antón"
          ],
          "landmarks": [
            "Toledo Cathedral",
            "Alcázar",
            "Plaza de Zocodover"
          ]
        },
        "history": {
          "overview": "Inhabited since the Bronze Age and later occupied by Romans, Visigoths, Muslims, and Christians, the historic center preserves layers of Toledo's rich multicultural past as the 'City of Three Cultures.'",
          "significance": "Served as the spiritual and political center of medieval Spain, former capital until 1561, and remains the spiritual heart of Spanish Catholicism.",
          "notable_events": [
            "Roman settlement Toletum established 193 BCE",
            "Visigothic capital of Spain 542-711",
            "Islamic rule 711-1085",
            "Reconquest by Alfonso VI in 1085",
            "Spanish capital under Emperor Charles V (early 16th century)",
            "Capital moved to Madrid by Philip II in 1561",
            "UNESCO World Heritage declaration in 1986"
          ]
        },
        "practical_info": {
          "transit": [
            "Escalators and elevators connect lower city to historic center",
            "Tourist train circuits the old city",
            "Bus lines connect to new town areas"
          ],
          "safety": "Very safe during day and evening; take normal precautions with valuables in crowded tourist areas.",
          "best_time_to_visit": "Early morning or late afternoon to avoid tour groups; magical atmosphere in the evening.",
          "walkability": "Entirely pedestrianized, though challenging with steep, narrow streets and cobblestones."
        },
        "appeal": {
          "known_for": [
            "Medieval architecture",
            "Religious monuments",
            "Cultural heritage of three religions"
          ],
          "atmosphere": [
            "Timeless",
            "Mystical",
            "Historic"
          ],
          "best_for": [
            "History enthusiasts",
            "Architecture lovers",
            "Cultural travelers"
          ]
        },
        "categories": {
          "touristy": 5,
          "residential": 2,
          "green_spaces": 2,
          "shopping": 4,
          "dining": 5,
          "nightlife": 3,
          "cultural": 5,
          "historic": 5
        },
        "highlights": {
          "attractions": [
            {
              "name": "Toledo Cathedral",
              "type": "Religious Monument",
              "description": "Magnificent 13th-century High Gothic cathedral with elements of Mudéjar and Renaissance styles, housing an impressive art collection including works by El Greco, Goya, and Rubens.",
              "appeal": "Marvel at one of Spain's most important cathedrals with its soaring interior, exquisite choir stalls carved from walnut, and El Transparente, an extraordinary Baroque altarpiece with natural lighting effects."
            },
            {
              "name": "Alcázar",
              "type": "Historical Fortress",
              "description": "Imposing square fortress perched at the highest point of Toledo with Roman foundations and significant reconstructions across centuries, now housing the Army Museum.",
              "appeal": "Explore this symbol of Spanish military history and enjoy panoramic views of the city, river, and surrounding countryside from its commanding position."
            },
            {
              "name": "Sinagoga del Tránsito",
              "type": "Historical Monument",
              "description": "14th-century synagogue featuring extraordinary Mudéjar architecture with intricate stucco work, now housing the Sephardic Museum documenting Jewish life in Spain.",
              "appeal": "Witness the remarkable cultural fusion of Islamic-influenced decoration in a Jewish place of worship, created during the Christian kingdom era."
            }
          ],
          "dining": [
            {
              "name": "Adolfo",
              "cuisine": "Traditional Castilian",
              "price_range": "€€€€",
              "known_for": "Refined local cuisine featuring game meats and Manchego specialties",
              "atmosphere": "Elegant fine dining in a restored medieval building with sophisticated service."
            },
            {
              "name": "La Abadía",
              "cuisine": "Traditional Toledo",
              "price_range": "€€€",
              "known_for": "Classic Toledo dishes like carcamusas (pork and vegetable stew) and perdiz estofada (partridge stew)",
              "atmosphere": "Atmospheric restaurant in a former 16th-century abbey with stone walls and vaulted ceilings."
            },
            {
              "name": "El Trebol",
              "cuisine": "Traditional Tapas",
              "price_range": "€€",
              "known_for": "Authentic local tapas and hearty Castilian dishes",
              "atmosphere": "Bustling traditional tavern popular with both locals and visitors."
            }
          ],
          "activities": [
            {
              "name": "Medieval Walls Walk",
              "type": "Cultural/Active",
              "description": "Circuit walk along Toledo's impressive medieval walls with panoramic viewpoints and historical interpretation.",
              "suitable_for": [
                "History enthusiasts",
                "Photographers",
                "Active travelers"
              ]
            },
            {
              "name": "Three Cultures Tour",
              "type": "Cultural",
              "description": "Guided exploration of Christian, Muslim, and Jewish monuments illustrating Toledo's unique multicultural heritage.",
              "suitable_for": [
                "History buffs",
                "Culture seekers",
                "Religious history enthusiasts"
              ]
            }
          ]
        },
        "stay_here_if": [
          "You want to be immersed in medieval atmosphere day and night.",
          "You prefer having main attractions at your doorstep.",
          "You don't mind navigating steep streets and paying a premium for location."
        ],
        "avoid_if": [
          "You have mobility issues (streets are steep, narrow, and cobblestoned).",
          "You're sensitive to noise (central areas can be busy with tourists).",
          "You're traveling by car (vehicle access is heavily restricted)."
        ],
        "insider_tips": [
          "Visit the Cathedral and Alcázar early in the morning before tour groups arrive.",
          "The best viewpoints for classic Toledo panoramas are across the river at the Mirador del Valle.",
          "Many restaurants offer fixed price lunch menus that are better value than dinner service."
        ]
      },
      {
        "name": "Judería",
        "alternate_names": [
          "Jewish Quarter",
          "Barrio Judío"
        ],
        "character": "Atmospheric medieval quarter with narrow, winding streets, historic synagogues, and a unique ambiance that preserves the memory of Toledo's once-thriving Jewish community within the historic center.",
        "location": {
          "central": true,
          "description": "Located in the southeastern section of the historic center, between the Cathedral and the Tagus River.",
          "borders": [
            "Casco Histórico",
            "San Martín",
            "Tagus River",
            "San Juan de los Reyes area"
          ],
          "landmarks": [
            "Sinagoga del Tránsito",
            "Sinagoga de Santa María la Blanca",
            "El Greco Museum"
          ]
        },
        "history": {
          "overview": "Flourished as a center of Jewish culture and learning during the medieval period, particularly under Muslim rule and the early Christian reconquest before declining after persecutions began in the 14th century.",
          "significance": "Preserves the heritage of Sephardic Judaism in Spain and the multicultural coexistence that made Toledo a center of learning and cultural exchange.",
          "notable_events": [
            "Jewish community established as early as the 5th-6th centuries",
            "Golden age under Muslim rule (711-1085) and early Christian reconquest",
            "Construction of synagogues in the 12th-14th centuries",
            "Anti-Jewish riots of 1391 began period of decline",
            "Expulsion of Jews from Spain in 1492",
            "Rediscovery and preservation efforts in the 20th century"
          ]
        },
        "practical_info": {
          "transit": [
            "Entirely pedestrian area",
            "Close to bus stops near Puerta del Cambrón",
            "Tourist train stops nearby"
          ],
          "safety": "Very safe area day and night; normal precautions for personal belongings.",
          "best_time_to_visit": "Mornings for synagogue visits; evenings for atmospheric strolls through the quiet streets.",
          "walkability": "Entirely pedestrianized but challenging with steep narrow streets and steps."
        },
        "appeal": {
          "known_for": [
            "Historic synagogues",
            "Medieval Jewish heritage",
            "Winding atmospheric streets"
          ],
          "atmosphere": [
            "Intimate",
            "Historic",
            "Mysterious"
          ],
          "best_for": [
            "History enthusiasts",
            "Cultural travelers",
            "Photography lovers"
          ]
        },
        "categories": {
          "touristy": 4,
          "residential": 3,
          "green_spaces": 1,
          "shopping": 3,
          "dining": 3,
          "nightlife": 2,
          "cultural": 5,
          "historic": 5
        },
        "highlights": {
          "attractions": [
            {
              "name": "Sinagoga de Santa María la Blanca",
              "type": "Historical Monument",
              "description": "12th-century synagogue featuring unique horseshoe arches and octagonal pillars with intricate capitals, later converted to a church.",
              "appeal": "Experience the oldest surviving synagogue building in Europe, with stunning architecture showcasing the cultural fusion of Islamic, Jewish and Christian elements."
            },
            {
              "name": "Museo del Greco",
              "type": "Museum",
              "description": "Museum dedicated to the painter El Greco in a recreated period house, featuring important works including 'View and Plan of Toledo'.",
              "appeal": "View masterpieces by the city's most famous adopted son in an atmospheric setting that recreates a nobleman's house of his era."
            },
            {
              "name": "Monastery of San Juan de los Reyes",
              "type": "Religious Monument",
              "description": "Magnificent Isabelline Gothic monastery built by Catholic Monarchs Ferdinand and Isabella to commemorate their victory at the Battle of Toro.",
              "appeal": "Admire the elaborate stone carvings, peaceful two-level cloister, and the chains hanging from the exterior walls that once belonged to Christians freed from Muslim captivity."
            }
          ],
          "dining": [
            {
              "name": "La Tabernita",
              "cuisine": "Modern Spanish",
              "price_range": "€€",
              "known_for": "Creative tapas with Jewish influences and local ingredients",
              "atmosphere": "Intimate space with contemporary design elements in a historic building."
            },
            {
              "name": "Locum",
              "cuisine": "Contemporary Spanish",
              "price_range": "€€€",
              "known_for": "Innovative cuisine utilizing traditional Castilian ingredients",
              "atmosphere": "Sophisticated restaurant in a 17th-century house with elegant, modern design."
            },
            {
              "name": "Alfileritos 24",
              "cuisine": "Traditional Castilian",
              "price_range": "€€",
              "known_for": "Classic Toledo specialties in a historic setting",
              "atmosphere": "Charming eatery in a restored building with rustic-elegant decor."
            }
          ],
          "activities": [
            {
              "name": "Jewish Toledo Walking Tour",
              "type": "Cultural/Historical",
              "description": "Guided exploration of the Jewish Quarter's narrow streets, hidden courtyards, and significant sites of Sephardic heritage.",
              "suitable_for": [
                "History enthusiasts",
                "Cultural travelers",
                "Religious history buffs"
              ]
            },
            {
              "name": "Traditional Crafts Shopping",
              "type": "Cultural",
              "description": "Browse artisan workshops creating traditional Toledan crafts including damascene metalwork, ceramics, and swords.",
              "suitable_for": [
                "Craft lovers",
                "Souvenir hunters",
                "Culture seekers"
              ]
            }
          ]
        },
        "stay_here_if": [
          "You seek the most atmospheric part of historic Toledo.",
          "You're interested in Jewish history and multicultural heritage.",
          "You prefer quieter streets away from the most crowded tourist areas."
        ],
        "avoid_if": [
          "You have mobility issues (area has many steep streets and steps).",
          "You prefer modern amenities and accommodations.",
          "You want easy access to parking or public transportation."
        ],
        "insider_tips": [
          "Visit the Synagogue of Santa María la Blanca early in the morning to experience its unique atmosphere before tourist crowds arrive.",
          "Look for the subtle details revealing Jewish heritage, like indentations on doorposts where mezuzahs once hung.",
          "Some of the best photography opportunities are at dawn when light fills the narrow streets with a golden glow."
        ]
      },
      {
        "name": "Antequeruela",
        "alternate_names": [
          "Covachuelas",
          "Western Historic District"
        ],
        "character": "Picturesque historic neighborhood set on Toledo's western slopes with stunning views, artistic heritage, and a more local atmosphere despite being within the old city walls.",
        "location": {
          "central": true,
          "description": "Located on the western slopes of the historic city, descending toward the Tagus River with terraced levels.",
          "borders": [
            "Casco Histórico",
            "Tagus River",
            "San Martín",
            "Cigarrales"
          ],
          "landmarks": [
            "Puerta del Cambrón",
            "Iglesia de San Lucas",
            "El Greco's 'Burial of the Count of Orgaz' at Santo Tomé Church"
          ]
        },
        "history": {
          "overview": "Developed as Toledo expanded within its walls, becoming known for artisan workshops and the residence of notable artists, including El Greco who lived and worked in this area during the late 16th century.",
          "significance": "Represents Toledo's artistic heritage and the influence of El Greco on the city's cultural identity.",
          "notable_events": [
            "Development as part of medieval city expansion",
            "El Greco's residence in the late 16th century",
            "Construction of Santo Tomé Church tower in Mudéjar style (14th century)",
            "Preservation as part of Toledo's historic district"
          ]
        },
        "practical_info": {
          "transit": [
            "Pedestrian access from historic center",
            "Escalators connect to lower city areas",
            "Limited vehicle access"
          ],
          "safety": "Very safe area with normal precautions advised.",
          "best_time_to_visit": "Afternoon light for views; morning for churches and museums.",
          "walkability": "Steep streets and stairs but manageable with some effort."
        },
        "appeal": {
          "known_for": [
            "El Greco heritage",
            "Panoramic views",
            "Historic churches"
          ],
          "atmosphere": [
            "Artistic",
            "Authentic",
            "Picturesque"
          ],
          "best_for": [
            "Art enthusiasts",
            "Photographers",
            "History lovers"
          ]
        },
        "categories": {
          "touristy": 3,
          "residential": 4,
          "green_spaces": 2,
          "shopping": 3,
          "dining": 3,
          "nightlife": 2,
          "cultural": 5,
          "historic": 5
        },
        "highlights": {
          "attractions": [
            {
              "name": "Iglesia de Santo Tomé",
              "type": "Religious Monument",
              "description": "14th-century church with Mudéjar tower, famous for housing El Greco's masterpiece 'The Burial of the Count of Orgaz'.",
              "appeal": "View one of El Greco's most celebrated paintings in its original setting for which it was commissioned, depicting the miraculous burial of a local nobleman."
            },
            {
              "name": "Puerta del Cambrón",
              "type": "Historic Gateway",
              "description": "Impressive 16th-century city gate built on the site of an earlier Visigothic entrance, featuring defensive towers and ornate decoration.",
              "appeal": "Walk through this monumental gateway that has served as an entry point to Toledo for centuries, with architectural elements spanning multiple periods."
            },
            {
              "name": "Iglesia de San Lucas",
              "type": "Religious Monument",
              "description": "Former mosque converted to a church after the Christian reconquest, retaining its original minaret transformed into a bell tower.",
              "appeal": "Discover this lesser-known example of Toledo's religious transformations, where Islamic architecture was adapted for Christian worship."
            }
          ],
          "dining": [
            {
              "name": "Restaurante Orza",
              "cuisine": "Traditional Castilian",
              "price_range": "€€",
              "known_for": "Local specialties including game meats and hearty stews",
              "atmosphere": "Cozy restaurant in a historic building with stone walls and intimate dining space."
            },
            {
              "name": "La Malquerida",
              "cuisine": "Creative Spanish",
              "price_range": "€€",
              "known_for": "Innovative tapas and fusion dishes with local ingredients",
              "atmosphere": "Stylish space combining historic elements with contemporary design."
            },
            {
              "name": "Taberna el Botero",
              "cuisine": "Traditional Tapas",
              "price_range": "€",
              "known_for": "Authentic local tapas and wines",
              "atmosphere": "Classic Spanish tavern with rustic decor and casual, friendly service."
            }
          ],
          "activities": [
            {
              "name": "El Greco Route",
              "type": "Cultural",
              "description": "Follow the footsteps of the famous painter, visiting sites associated with his life and work in Toledo.",
              "suitable_for": [
                "Art enthusiasts",
                "History buffs",
                "Cultural travelers"
              ]
            },
            {
              "name": "Sunset Photography Walk",
              "type": "Leisure/Photography",
              "description": "Evening stroll to capture Toledo's famous golden light as it illuminates the historic buildings and river valley.",
              "suitable_for": [
                "Photographers",
                "Romantics",
                "View seekers"
              ]
            }
          ]
        },
        "stay_here_if": [
          "You want a more authentic neighborhood experience within the historic center.",
          "You're interested in El Greco's legacy and artistic heritage.",
          "You enjoy panoramic views and picturesque streets off the main tourist path."
        ],
        "avoid_if": [
          "You have serious mobility limitations (area has many steep paths and stairs).",
          "You want immediate access to the main shopping and dining areas.",
          "You prefer modern accommodations with full amenities."
        ],
        "insider_tips": [
          "Visit Santo Tomé Church early in the morning or late afternoon to avoid the midday crowds viewing El Greco's masterpiece.",
          "Some of the best viewpoints of the Tagus River and surrounding countryside are found along the western walls of this neighborhood.",
          "Small family-run restaurants in this area often offer more authentic cuisine at better prices than those in the main tourist zones."
        ]
      },
      {
        "name": "Cigarrales",
        "alternate_names": [
          "Countryside Estates",
          "Southern Hills"
        ],
        "character": "Elegant hillside area across the Tagus River from the historic center, featuring historic country estates, luxury hotels, and spectacular panoramic views of Toledo's dramatic skyline.",
        "location": {
          "central": false,
          "description": "Located on the hills south of the Tagus River, opposite Toledo's historic center, providing the classic panoramic view of the city.",
          "borders": [
            "Tagus River",
            "La Bastida",
            "Polígono",
            "Rural countryside"
          ],
          "landmarks": [
            "Mirador del Valle viewpoint",
            "Historic cigarrales (country estates)",
            "Ermita de la Virgen del Valle"
          ]
        },
        "history": {
          "overview": "Developed from the 15th-16th centuries as recreational country estates for Toledo's nobility and wealthy citizens, with the name 'cigarral' possibly deriving from 'cigarra' (cicada) due to the abundant insects in summer.",
          "significance": "Represents the aristocratic and leisurely counterpart to Toledo's dense urban center, providing escape and panoramic perspectives of the historic city.",
          "notable_events": [
            "Development as noble estates from the 15th century onwards",
            "Golden age during the 16th-17th centuries when Toledo was at its cultural peak",
            "Inspiration for landscapes by El Greco and other artists",
            "Conversion of many historic estates into luxury hotels in the 20th-21st centuries"
          ]
        },
        "practical_info": {
          "transit": [
            "Bus service from city center to Mirador del Valle viewpoint",
            "Taxi service recommended",
            "Private vehicle access (one of few areas with good parking)"
          ],
          "safety": "Very safe area at all hours.",
          "best_time_to_visit": "Evening for spectacular sunset views of Toledo; morning for photography in clear light.",
          "walkability": "Scattered properties and hilly terrain make walking between sites challenging."
        },
        "appeal": {
          "known_for": [
            "Panoramic views of Toledo",
            "Historic country estates",
            "Luxury accommodation"
          ],
          "atmosphere": [
            "Elegant",
            "Scenic",
            "Peaceful"
          ],
          "best_for": [
            "Photographers",
            "Luxury travelers",
            "Romantic getaways"
          ]
        },
        "categories": {
          "touristy": 3,
          "residential": 3,
          "green_spaces": 5,
          "shopping": 1,
          "dining": 4,
          "nightlife": 2,
          "cultural": 3,
          "historic": 4
        },
        "highlights": {
          "attractions": [
            {
              "name": "Mirador del Valle",
              "type": "Scenic Viewpoint",
              "description": "Iconic panoramic viewpoint offering the postcard view of Toledo's dramatic cityscape rising above the Tagus River.",
              "appeal": "Capture the quintessential view of Toledo that inspired El Greco's famous landscape, particularly magical at sunset when the city glows golden."
            },
            {
              "name": "Ermita de la Virgen del Valle",
              "type": "Religious Monument",
              "description": "Historic hermitage church with serene surroundings and excellent views of the city.",
              "appeal": "Visit this peaceful sanctuary away from tourist crowds, offering spiritual atmosphere and impressive vistas."
            },
            {
              "name": "Historic Cigarrales",
              "type": "Architectural Heritage",
              "description": "Traditional country estates characterized by orchards, gardens, and historic buildings, many now operating as luxury hotels or restaurants.",
              "appeal": "Experience the elegant counterpart to Toledo's dense urban center, where nobility and artists sought inspiration and leisure."
            }
          ],
          "dining": [
            {
              "name": "Cigarral de las Mercedes",
              "cuisine": "Refined Castilian",
              "price_range": "€€€€",
              "known_for": "Sophisticated cuisine with panoramic terrace dining",
              "atmosphere": "Elegant restaurant in a historic estate with breathtaking views of Toledo."
            },
            {
              "name": "Restaurante Venta de Aires",
              "cuisine": "Traditional Toledo",
              "price_range": "€€€",
              "known_for": "Historic restaurant (since 1891) serving classic Toledan specialties",
              "atmosphere": "Traditional country house setting with rustic elegance and regional character."
            },
            {
              "name": "El Cigarral de Cadenas",
              "cuisine": "Modern Spanish",
              "price_range": "€€€",
              "known_for": "Contemporary interpretations of traditional cuisine",
              "atmosphere": "Sophisticated dining in a restored historic estate with garden and city views."
            }
          ],
          "activities": [
            {
              "name": "Sunset Photography",
              "type": "Leisure",
              "description": "Capture Toledo's skyline as the setting sun bathes the city in golden light, creating one of Spain's most iconic views.",
              "suitable_for": [
                "Photographers",
                "Romantics",
                "View seekers"
              ]
            },
            {
              "name": "Luxury Estate Hotel Experience",
              "type": "Accommodation",
              "description": "Stay in a converted historic cigarral offering a blend of history, luxury, and spectacular views.",
              "suitable_for": [
                "Couples",
                "Luxury travelers",
                "Special occasions"
              ]
            }
          ]
        },
        "stay_here_if": [
          "You prefer luxury accommodation with scenic views over central location.",
          "You want a peaceful retreat after exploring the crowded historic center.",
          "You're traveling with a car and prefer easier access and parking."
        ],
        "avoid_if": [
          "You want to be within walking distance of major attractions.",
          "You're traveling on a budget (accommodation tends toward luxury).",
          "You rely on public transportation for frequent city access."
        ],
        "insider_tips": [
          "The Mirador del Valle gets crowded at sunset; arrive early to secure a good viewpoint or book dinner at a cigarral restaurant with similar views.",
          "Some cigarral hotels offer day passes to their gardens and terraces for non-guests to enjoy the views and facilities.",
          "The light for photography is particularly beautiful in the early morning when the city is bathed in soft golden light and before haze develops over the valley."
        ]
      },
      {
        "name": "Santa Bárbara",
        "alternate_names": [
          "Ensanche",
          "New Toledo",
          "Modern Toledo"
        ],
        "character": "Toledo's principal modern district with wide avenues, contemporary apartment buildings, shopping centers, and municipal facilities, offering a stark contrast to the medieval historic center.",
        "location": {
          "central": false,
          "description": "Located to the north of the historic center across the Tagus River, forming the main residential and commercial expansion of modern Toledo.",
          "borders": [
            "Tagus River",
            "Historic Center",
            "Industrial zones",
            "Buenavista"
          ],
          "landmarks": [
            "Toledo Central Bus Station",
            "Hospital Virgen de la Salud",
            "Safont Park"
          ]
        },
        "history": {
          "overview": "Developed primarily in the 20th century as Toledo expanded beyond its historic confines to accommodate modern needs, growing significantly from the 1960s onwards.",
          "significance": "Represents the transition of Toledo from a purely historical city to a modern provincial capital with contemporary infrastructure.",
          "notable_events": [
            "Initial development in the early 20th century",
            "Major expansion in the 1960s-1970s during Spain's economic growth",
            "Construction of key infrastructure including bus station and hospital",
            "Continued development of commercial and residential properties in recent decades"
          ]
        },
        "practical_info": {
          "transit": [
            "Central bus station with connections to Madrid and other cities",
            "Local bus routes to historic center",
            "Good parking facilities"
          ],
          "safety": "Safe residential area with good lighting and security.",
          "best_time_to_visit": "Weekdays for practical services; not primarily a tourist area.",
          "walkability": "Well-planned with wide sidewalks and modern urban layout."
        },
        "appeal": {
          "known_for": [
            "Modern amenities",
            "Shopping centers",
            "Residential comfort"
          ],
          "atmosphere": [
            "Contemporary",
            "Functional",
            "Residential"
          ],
          "best_for": [
            "Long-term stays",
            "Practical travelers",
            "Budget accommodations"
          ]
        },
        "categories": {
          "touristy": 1,
          "residential": 5,
          "green_spaces": 3,
          "shopping": 4,
          "dining": 3,
          "nightlife": 2,
          "cultural": 1,
          "historic": 1
        },
        "highlights": {
          "attractions": [
            {
              "name": "Parque de Safont",
              "type": "Urban Park",
              "description": "Modern riverside park with walking paths, recreational areas, and views of the historic city across the Tagus.",
              "appeal": "Enjoy green space with excellent views of Toledo's dramatic skyline and riverside walking paths away from tourist crowds."
            },
            {
              "name": "Centro Comercial Luz del Tajo",
              "type": "Shopping Center",
              "description": "Large modern mall with Spanish and international retailers, restaurants, and entertainment options.",
              "appeal": "Access practical shopping and services not available in the historic center, with major brands and everyday conveniences."
            },
            {
              "name": "Pasarela de Safont",
              "type": "Modern Architecture",
              "description": "Contemporary pedestrian bridge connecting Santa Bárbara with the historic center, offering excellent views.",
              "appeal": "Cross this striking modern structure for panoramic views of the river and city while transitioning between Toledo's new and old districts."
            }
          ],
          "dining": [
            {
              "name": "Asador Palomarejos",
              "cuisine": "Castilian Grill",
              "price_range": "€€",
              "known_for": "Grilled meats and traditional Castilian dishes",
              "atmosphere": "Casual dining in a modern setting."
            }
          ],
          "activities": [
            {
              "name": "Modern Toledo Tour",
              "type": "Cultural",
              "description": "Guided tour of Santa Bárbara's modern architecture, shopping centers, and urban landscape.",
              "suitable_for": [
                "Shopping enthusiasts",
                "Modern architecture lovers",
                "Urban explorers"
              ]
            }
          ]
        },
        "stay_here_if": [
          "You prefer modern amenities and easy access to shopping centers.",
          "You are looking for residential comfort away from tourist crowds.",
          "You value practical services and modern urban planning."
        ],
        "avoid_if": [
          "You want to immerse yourself in historic architecture and medieval streets.",
          "You prefer a tourist-heavy area with abundant historical sites.",
          "You seek a compact city center with a pedestrian focus."
        ],
        "insider_tips": [
          "Visit local shopping centers during weekdays to avoid weekend crowds.",
          "Explore nearby urban parks for a blend of modern and natural settings.",
          "Utilize the excellent bus and parking facilities for hassle-free transit."
        ]
      }
    ]
  }
  