{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Dia de Ano Novo)",
          "notes": "New Year's Day is a public holiday throughout Portugal. Most attractions, shops, and restaurants in Faro are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. Most museums and attractions typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout Faro, particularly on Rua de Santo António shopping street and in shopping centers like Forum Algarve. Christmas decorations gradually come down. The city's traditional tascas and cafés offer warm refuge from winter weather."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is the off-season with fewer tourists and excellent hotel value. Mild winter weather with occasional rain. While cooler, daytime temperatures often reach 16°C (61°F), making Faro one of Europe's warmest winter destinations. Winter sales continue throughout January in the main shopping districts. Faro's museums and indoor cultural attractions provide respite from occasional wet weather. Perfect time to explore the historic Cidade Velha (Old Town) without crowds."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 8,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Winter conditions continue but with occasional clear, crisp days. Tourism remains low, making it an excellent time to explore Faro's museums and cultural attractions without crowds. The historic Cidade Velha (Old Town) and Marina de Faro are particularly atmospheric during this quiet season."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "Carnival (Carnaval)",
          "notes": "The days leading up to Carnival Tuesday feature parades and festivities in Faro, particularly in the downtown areas. Children's fancy dress parades take place between Jardim Manuel Bivar and Praça da Pontinha. Traditional sweets and street performances create a lively atmosphere throughout the city."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Late February brings hints of spring to Faro with almond blossoms beginning to appear in the countryside surrounding the city. Cultural events at the Teatro das Figuras and other venues offer entertainment during the cooler season. With temperatures warming slightly, it's a good time to explore the Ria Formosa lagoon on boat trips that are less crowded than during high season."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 9,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. Perfect time to explore both the city and begin venturing to the barrier islands of Ria Formosa Natural Park. Boat tours to Ilha Deserta and other islands become more regular. The historic center and viewpoints around the city become more pleasant for exploration and photography."
        },
        {
          "days": [17, 18, 19],
          "score": 4,
          "special": true,
          "event": "Feast of St. Joseph (Dia de São José)",
          "notes": "The Feast of St. Joseph on March 19 is celebrated in Faro's traditional neighborhoods. While not a national holiday, it's a cultural celebration with special bread and sweets available at local bakeries. Small religious processions may take place in older parts of the city."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Início da Primavera)",
          "notes": "Spring officially begins, bringing pleasant temperatures to Faro. Perfect time for exploring the Cidade Velha (Old Town) and taking boat trips to the Ria Formosa islands. Easter markets appear in late March if Easter falls then. Wildlife watching in Ria Formosa Natural Park becomes increasingly rewarding as migratory birds return."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 10,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Páscoa) & Faro International Music Festival",
          "notes": "Easter celebrations include the Procisão do Enterro do Senhor (Good Friday procession) and special services at Faro Cathedral. Late April features the Faro International Music Festival with performances of classical music by leading Portuguese orchestras. Spring weather is ideal for exploring both city and nature, with temperatures typically reaching 20°C (68°F). An excellent time to visit with reliable weather but without summer crowds."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Freedom Day (Dia da Liberdade)",
          "notes": "April 25th is a national holiday commemorating the 1974 Carnation Revolution that ended the Estado Novo dictatorship. Celebrations and official ceremonies take place in municipal buildings, and some cultural venues offer free admission. Museums and cultural institutions often feature special exhibitions related to Portuguese democracy and freedom."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Mid-to-late April brings reliable spring weather to Faro. Perfect time for exploring the city's historic neighborhoods and Ria Formosa Natural Park. The Museu Municipal de Faro and other cultural attractions offer excellent experiences without summer crowds. Boat trips to Ilha Deserta and other barrier islands operate regularly with more comfortable temperatures. The municipal market and local food markets become especially vibrant with seasonal local produce."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Dia do Trabalhador)",
          "notes": "May Day is a national holiday in Portugal. Many businesses are closed, but museums and cultural attractions remain open. Traditional labor celebrations may take place in major squares. Workers' organizations traditionally gather in central plazas for speeches, music, and food."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "May brings perfect weather with longer days and temperatures reaching 23°C (73°F). The beaches of Faro, particularly Praia de Faro, begin to see more visitors but remain uncrowded. Tourism begins to increase but the city isn't yet at peak season crowds. Boat trips to the barrier islands of Ria Formosa Natural Park are highly recommended during this month with ideal conditions for exploring the pristine beaches of Ilha Deserta."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "Festival preparations",
          "notes": "Late May sees preparations for summer cultural events and festivals in Faro. The city begins to transition to its summer schedule with extended opening hours at many attractions and restaurants. Temperature conditions are perfect for outdoor dining and evening strolls along the Marina de Faro."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 14,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "Baixa Street Fest",
          "notes": "The Baixa Street Fest takes place on Friday evenings from late June through August, featuring concerts, theater, circus, and sound and light shows in downtown Faro. Shops offer extended opening hours and special discounts. Early summer brings warm weather and extended daylight hours to Faro. Tourism increases but the city remains less crowded than July and August."
        },
        {
          "days": [23, 24],
          "score": 5,
          "special": true,
          "event": "São João Festival (Festas de São João)",
          "notes": "The night of June 23-24 celebrates the Feast of St. John with traditional festivities throughout the city. While not as massive as Porto's celebration, Faro's São João features local food, music, and dancing. Traditional grilled sardines are served at restaurants throughout the city, and there may be smaller community bonfires and celebrations."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late June sees increasing temperatures as summer fully arrives. Perfect time for beach activities at Praia de Faro and boat trips to the barrier islands. Faro's outdoor café culture is in full swing, with restaurants and bars along the marina and in the Old Town filled with visitors and locals alike. Day trips to nearby towns like Tavira, Olhão, and Loulé are highly recommended."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 17,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "special": true,
          "event": "Faro International Motorbike Rally",
          "notes": "Mid-July hosts one of Europe's biggest motorcycle gatherings near Faro airport. The event attracts over 20,000 motorcyclists from around the world for four days of concerts, exhibitions, and competitions. The rally culminates with a parade through downtown Faro on Sunday. High summer temperatures reach around 29°C (84°F) but remain pleasant due to Atlantic breezes. Tourism increases significantly as European summer holidays begin."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Ria Formosa Festival preparations",
          "notes": "Late July sees preparations for the Ria Formosa Festival, one of the largest gastronomic events in Faro. High summer with warm temperatures and long daylight hours. The beaches at Praia de Faro and the barrier islands become busy but never overcrowded like other Algarve resorts. Boat trips to Ilha Deserta and other islands in the Ria Formosa operate at full schedule. Outdoor dining in the Marina de Faro and the historic center is at its most vibrant."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 19,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Ria Formosa Festival & Assumption Day (Assunção de Nossa Senhora)",
          "notes": "The Ria Formosa Festival runs from late July to early August in Largo de São Francisco, featuring the best seafood from the lagoon and other regional specialties. August 15th is a national holiday celebrating the Assumption of Mary, with religious processions taking place around Faro Cathedral. Many Faro locals leave the city for their own holidays in August, giving parts of the city a quieter feel despite high tourist numbers."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Peak summer with warm temperatures, typically around 29°C (84°F) but rarely exceeding 32°C (90°F) thanks to Atlantic breezes. High tourism season with visitors from around the world. Faro Cathedral, the Capela dos Ossos (Bone Chapel), and the Ria Formosa boat tours are particularly popular attractions. Praia de Faro beach becomes crowded, especially on weekends. The Baixa Street Fest continues on Friday evenings, bringing entertainment to downtown areas."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 19,
      "tourismLevel": 9
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 5,
          "special": true,
          "event": "Festival F",
          "notes": "Early September hosts Festival F in the Vila-Adentro (Old Town), marking the end of summer with performances by Portugal's best musicians and artists. The streets of the historic center transform into one of Portugal's best music festivals for three days of music and entertainment. Perfect weather continues with temperatures around 27°C (81°F)."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Perfect late summer weather for outdoor activities and exploring the city without the peak season crowds. Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather but fewer crowds. The University of Algarve welcomes back students, bringing a renewed energy to the city. Boat trips to the barrier islands remain available in pleasant conditions. Riverside walks along the Marina de Faro and outdoor dining continue to be enjoyable in the mild weather."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 17,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4],
          "score": 5,
          "special": true,
          "event": "Republic Day (Implantação da República)",
          "notes": "October 5th is a national holiday commemorating the overthrow of the monarchy and establishment of the Portuguese Republic in 1910. Official ceremonies take place at city hall and other governmental buildings. Many museums and cultural sites remain open but with holiday schedules."
        },
        {
          "days": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Autumn weather brings cooler but still pleasant temperatures to Faro, typically around 23°C (73°F). Perfect time for visiting both indoor and outdoor attractions like the Cidade Velha (Old Town), Faro Cathedral, and Ria Formosa boat trips. The university areas show renewed activity with students returning. Good month for experiencing Faro's diverse culinary scene and exploring the Museum Municipal de Faro without crowds."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "Halloween (Dia das Bruxas)",
          "notes": "While not a traditional Portuguese celebration, Halloween has gained popularity in recent years, especially among younger people. Some bars and clubs in downtown Faro host Halloween-themed parties. Shopping centers and some restaurants may have Halloween decorations or special events."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 14,
      "tourismLevel": 6
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "All Saints' Day (Dia de Todos os Santos)",
          "notes": "November 1st is a national holiday when Portuguese families traditionally visit cemeteries to honor deceased relatives. Some businesses may be closed, but many tourist attractions remain open. Traditional sweets associated with this time include Bolo Rei (King Cake), which begins appearing in bakeries."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Autumn weather with cooler temperatures but still pleasant daytime conditions around 20°C (68°F). November is one of the wettest months with an average of 100mm of rain, but rainy days are interspersed with clear, sunny periods. Excellent time for museum visits and indoor cultural activities. Traditional tascas with hearty Portuguese dishes offer cozy retreats from occasional wet weather. The Museu Municipal de Faro and other museums provide authentic indoor entertainment during this quieter tourism period."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "special": true,
          "event": "Feira de Santa Iria",
          "notes": "Mid-November hosts the Feira de Santa Iria, Faro's largest traditional festa. The event features regional products, handicrafts, and cultural performances. Local gastronomy is highlighted with traditional foods and sweets available from vendors throughout the festival grounds."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Christmas Season Begins",
          "notes": "Faro's Christmas celebrations begin in late November with the lighting of the city's Christmas lights. The main Christmas tree is usually placed in a central location. Christmas markets open in various locations featuring craft stalls, food vendors, and seasonal activities. Christmas shopping begins in earnest on Rua de Santo António and in the city's shopping centers like Forum Algarve."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "special": true,
          "event": "Constitution Day & Immaculate Conception (Dia da Constituição & Imaculada Conceição)",
          "notes": "December 1st (Constitution Day) and December 8th (Immaculate Conception) are public holidays. The December 8th holiday traditionally marks the beginning of the Christmas season for many Portuguese families, when Christmas trees and Nativity scenes are set up in homes. Christmas markets and festivities are in full swing by this time."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Faro Christmas Celebrations",
          "notes": "Throughout December, Faro hosts Christmas markets and festivities. The city center is beautifully decorated with Christmas lights. Shopping streets and the Forum Algarve mall are bustling with Christmas shoppers. The Teatro das Figuras and other venues offer seasonal performances and Christmas concerts. The Faro Cathedral features special Christmas services and decorations."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Véspera de Natal)",
          "notes": "Christmas Eve is the main celebration day for most Portuguese families. Most businesses close by early afternoon. The Christmas Markets end. Faro Cathedral and other churches hold special Midnight Mass services. Restaurants that remain open often require advance reservations for special Christmas Eve dinners, which traditionally feature bacalhau (salt cod) and other fish dishes."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Day & St. Stephen's Day",
          "notes": "December 25 (Christmas Day) is a public holiday. Most businesses, restaurants, and attractions are closed or operate with limited hours. December 26 is not a public holiday in Portugal, unlike in some other European countries, so many businesses reopen. Traditional Christmas lunch often features roast turkey or goat with Portuguese stuffing."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year is typically busy with both Portuguese and international visitors. Major museums and attractions are open. Good time for winter sales shopping along Rua de Santo António and at Forum Algarve shopping center. Indoor cultural activities provide welcome entertainment during the cooler weather."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "New Year's Eve (Véspera de Ano Novo)",
          "notes": "New Year's Eve celebrations center around the Marina de Faro and main squares with midnight countdown events and fireworks. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), and hotels host celebration events. Bars and clubs throughout downtown Faro offer special New Year's parties. The marina provides a spectacular backdrop for fireworks displays, with many people gathering along the waterfront for the celebrations."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 9,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Boat Tours of Ria Formosa Natural Park (March through May)",
      "Visits to Ilha Deserta (Desert Island) for pristine beaches",
      "April 25th Freedom Day Celebrations",
      "Faro International Music Festival (late April)",
      "Cidade Velha (Old Town) Historical Tours",
      "Day Trips to Tavira, Olhão and Loulé",
      "Birdwatching in Ria Formosa lagoon",
      "Outdoor café culture begins along Marina de Faro"
    ],
    "summer": [
      "Faro International Motorbike Rally (July)",
      "Ria Formosa Festival (early August)",
      "Boat Trips to Barrier Islands",
      "Praia de Faro and Island Beaches",
      "Baixa Street Fest (Friday evenings, June to August)",
      "Festival F (early September)",
      "Evening walks along the Marina de Faro",
      "Outdoor dining in historic center restaurants"
    ],
    "autumn": [
      "Feira de Santa Iria (mid-November)",
      "Cultural events at Teatro das Figuras",
      "Wine tasting tours in the rural Algarve",
      "Museum visits including Museu Municipal de Faro",
      "Photography walks in the Old Town",
      "Dolphin watching boat trips",
      "Day trips to Silves and Monchique",
      "Culinary tours featuring Algarvean specialties"
    ],
    "winter": [
      "Faro Christmas Markets (late November to December 23)",
      "Christmas lights throughout the city center",
      "New Year's Eve Celebration at Marina de Faro",
      "Winter Shopping on Rua de Santo António and Forum Algarve",
      "Indoor cultural attractions like Capela dos Ossos (Bone Chapel)",
      "Cozy café culture in historic establishments",
      "Warming up with Cataplana (Algarve's signature seafood stew)",
      "Teatro das Figuras winter performances"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or mild, occasionally wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}