{
    "Spring": {
        "activities": [
            {
                "name": "Sea Urchin Diving and Beach Picnics",
                "type": "Culinary Experience",
                "description": "Join locals in the traditional spring activity of diving for sea urchins (oursins) and enjoying them fresh on the beach with local Corsican wine. This authentic experience captures the essence of island life.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Sea urchins are at their best from March to May. This is a beloved local tradition that brings communities together.",
                "booking_tips": "Ask locals for the best spots or join organized sea urchin diving tours. Bring waterproof shoes for rocky coastlines."
            },
            {
                "name": "Festa di a Misericordia",
                "type": "Religious Festival",
                "description": "Celebrate Ajaccio's patron saint festival on March 18th with traditional processions, religious ceremonies, and local festivities throughout the old town.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This important religious celebration marks the beginning of spring festivities in Ajaccio.",
                "booking_tips": "No booking required. Join the procession or watch from the streets. Best views from Place Foch and around the cathedral."
            },
            {
                "name": "Hiking Sentier des Crêtes",
                "type": "Outdoor Activity",
                "description": "Explore the scenic ridge trail offering panoramic views over the Gulf of Ajaccio, surrounding mountains, and Mediterranean coastline. Spring weather provides ideal hiking conditions.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Perfect spring weather with mild temperatures and blooming Mediterranean vegetation. Clear views before afternoon haze.",
                "booking_tips": "Start early to avoid afternoon heat. Bring water, sun protection, and comfortable hiking shoes. Trail can be challenging in places."
            },
            {
                "name": "Marché d'Ajaccio Spring Market",
                "type": "Market",
                "description": "Experience the vibrant local market in full spring glory with fresh Corsican produce, local cheeses like brocciu, seasonal vegetables, and spring flowers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the best selection of local produce and flowers. Market is most lively on Tuesday, Thursday, and Saturday mornings.",
                "booking_tips": "Arrive early for best selection. Bring a basket and try free samples. Practice basic French phrases for better interaction with vendors."
            },
            {
                "name": "Napoleon Walking Tour",
                "type": "Historical Tour",
                "description": "Explore Napoleon's birthplace and childhood haunts with perfect spring weather for walking. Visit Maison Bonaparte, Place Foch, and other sites connected to the emperor.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Comfortable temperatures make this ideal season for outdoor historical exploration. Spring light is perfect for photography.",
                "booking_tips": "Book guided tours in advance or create your own route. Combine with visits to Napoleon-related museums."
            },
            {
                "name": "Boat Excursion to Îles Sanguinaires",
                "type": "Boat Tour",
                "description": "Take a boat trip to the famous Sanguinaires Islands, with their dramatic red granite formations and lighthouse. Spring offers calm seas and excellent wildlife viewing.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Calmer seas and pleasant temperatures. Ideal for photography and wildlife observation. Islands are less crowded than in summer.",
                "booking_tips": "Book half-day tours from the port. Bring sun protection and camera. Some tours include swimming stops."
            },
            {
                "name": "Corsican Cooking Class",
                "type": "Culinary Workshop",
                "description": "Learn to prepare traditional Corsican dishes using spring ingredients like fresh brocciu cheese, wild herbs, and seasonal vegetables.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring provides the best seasonal ingredients for authentic Corsican cuisine. Perfect time to learn about local culinary traditions.",
                "booking_tips": "Book in advance with local cooking schools. Often includes market visits and full meal. Great for rainy spring days."
            },
            {
                "name": "Coastal Photography at Pointe de la Parata",
                "type": "Photography",
                "description": "Capture stunning spring landscapes at this dramatic rocky promontory with its Genoese tower and views of the Sanguinaires Islands.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Spring light provides excellent photography conditions. Wildflowers bloom along the coastal paths.",
                "booking_tips": "Best light is 1-2 hours before sunset. Bring tripod for long exposures. Watch for strong coastal winds."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Napoleonic Evenings Festival",
                "type": "Cultural Festival",
                "description": "Celebrate Napoleon's birthday in mid-August with historical reenactments, period costumes, parades, and performances throughout Ajaccio's historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "The highlight of Ajaccio's summer cultural calendar, celebrating the city's most famous son with authentic historical recreations.",
                "booking_tips": "No booking required for street events. Premium viewing spots fill early. Some indoor events may require tickets."
            },
            {
                "name": "Jazz in Aiacciu Festival",
                "type": "Music Festival",
                "description": "Enjoy world-class jazz performances at the outdoor Casone Theatre in late June, featuring both international and French artists in a beautiful Mediterranean setting.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect summer evenings for outdoor concerts. Warm Mediterranean nights create an ideal atmosphere for jazz music.",
                "booking_tips": "Purchase tickets in advance as popular concerts sell out. Bring light jacket for evening coolness."
            },
            {
                "name": "Beach Day at Mare e Sole",
                "type": "Beach Activity",
                "description": "Relax on one of Corsica's most beautiful beaches with white sand, crystal-clear waters, and beachfront restaurants serving fresh seafood.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Perfect summer weather with warm sea temperatures ideal for swimming. Beach activities and water sports available.",
                "booking_tips": "Arrive early for best beach spots. Rent umbrellas and loungers from beach clubs. Try the beachfront restaurants for lunch."
            },
            {
                "name": "Sunset Boat Tour to Îles Sanguinaires",
                "type": "Boat Tour",
                "description": "Experience the world-famous sunset over the Sanguinaires Islands on a specially timed boat excursion, with the granite cliffs glowing red in the evening light.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular sunsets and calm sea conditions. The islands' name comes from their blood-red appearance at sunset.",
                "booking_tips": "Book sunset tours well in advance during peak season. Bring camera and warm layer for evening return."
            },
            {
                "name": "Swimming and Snorkeling at Plage de Capo di Feno",
                "type": "Water Sports",
                "description": "Enjoy excellent swimming and snorkeling conditions at this pristine beach known for its clear waters and marine life, popular with both locals and surfers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer offers perfect water temperatures and excellent visibility for snorkeling. Popular surfing spot with consistent waves.",
                "booking_tips": "Bring your own snorkeling gear or rent locally. Limited parking - arrive early. Natural beach with no facilities."
            },
            {
                "name": "Corsican Wine Tasting Tour",
                "type": "Wine Experience",
                "description": "Visit local vineyards in the Ajaccio wine region to taste indigenous Corsican grape varieties like Sciacarellu and learn about island winemaking traditions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer harvest season offers insights into winemaking process. Indoor tastings provide relief from afternoon heat.",
                "booking_tips": "Book vineyard tours in advance. Often includes transportation and food pairings. Designated driver required."
            },
            {
                "name": "Hiking in Valle de la Gravona",
                "type": "Mountain Activity",
                "description": "Escape summer heat with early morning hikes in the cooler mountain valleys, featuring traditional Corsican villages and stunning mountain scenery.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Start very early to avoid summer heat. Mountain areas provide cooler temperatures and refreshing streams.",
                "booking_tips": "Bring plenty of water and sun protection. Some trails require good fitness levels. Check weather conditions."
            },
            {
                "name": "Evening Market and Aperitif Culture",
                "type": "Cultural Experience",
                "description": "Experience authentic Corsican social life with evening markets, followed by aperitifs at waterfront cafés watching the sunset over the Mediterranean.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor socializing. Experience the relaxed Mediterranean lifestyle.",
                "booking_tips": "No booking needed. Best spots along the waterfront promenade. Try local Pietra beer or Muscat wine."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Chestnut Harvest Festival",
                "type": "Cultural Festival",
                "description": "Participate in traditional chestnut harvest celebrations in nearby mountain villages, featuring chestnut-based foods, traditional music, and local crafts.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Autumn is chestnut season in Corsica. These festivals celebrate an important part of traditional Corsican cuisine and culture.",
                "booking_tips": "Check local village schedules as dates vary. Often includes traditional meals and craft demonstrations."
            },
            {
                "name": "Palais Fesch Museum Visit",
                "type": "Museum",
                "description": "Explore one of France's finest collections of Italian Renaissance paintings in perfect autumn weather, housed in Napoleon's uncle's former palace.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Cooler autumn temperatures make indoor cultural activities more appealing. Fewer crowds than summer months.",
                "booking_tips": "Check for special exhibitions. Guided tours available. Combine with visit to nearby Chapelle Impériale."
            },
            {
                "name": "Figatellu Tasting Season",
                "type": "Culinary Experience",
                "description": "Experience the start of figatellu (Corsican liver sausage) season, traditionally grilled over chestnuts and enjoyed with local wine during autumn gatherings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Figatellu season begins in autumn when pigs are traditionally slaughtered. Important part of Corsican culinary heritage.",
                "booking_tips": "Visit traditional restaurants or join local food tours. Best paired with Corsican red wine."
            },
            {
                "name": "Coastal Hiking to Piana Calanques",
                "type": "Outdoor Activity",
                "description": "Enjoy perfect hiking weather to explore the UNESCO-listed red granite cliffs and turquoise waters of the Piana calanques.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Ideal hiking temperatures without summer heat. Crystal clear autumn air provides spectacular views.",
                "booking_tips": "Full-day excursion from Ajaccio. Bring camera and comfortable hiking shoes. Some trails require good fitness."
            },
            {
                "name": "Wine Harvest Participation",
                "type": "Agricultural Experience",
                "description": "Join local vineyards during harvest season to pick grapes and learn about traditional Corsican winemaking in the Ajaccio appellation.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September to October is harvest season. Experience authentic agricultural traditions and seasonal rhythms.",
                "booking_tips": "Contact local vineyards directly. Often includes meals and wine tasting. Advance booking essential."
            },
            {
                "name": "Storm Watching at Pointe de la Parata",
                "type": "Natural Phenomenon",
                "description": "Experience the dramatic autumn storms and wild seas from the safety of the Genoese tower, watching powerful waves crash against the granite cliffs.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings more dramatic weather and spectacular storm watching opportunities. Impressive wave action.",
                "booking_tips": "Check weather conditions for safety. Best during windy days. Dress warmly and bring rain protection."
            },
            {
                "name": "Traditional Craft Workshops",
                "type": "Cultural Workshop",
                "description": "Learn traditional Corsican crafts like knife making, wooden crafts, or textile work from local artisans in preparation for the holiday season.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is perfect for learning indoor crafts. Many artisans offer workshops as tourist season winds down.",
                "booking_tips": "Book with local artisan associations. Often includes take-home pieces. Great for unique souvenirs."
            },
            {
                "name": "Mushroom Foraging Excursions",
                "type": "Nature Activity",
                "description": "Join guided foraging trips to discover edible mushrooms in Corsican forests, learning about local varieties and traditional uses.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Peak mushroom season in Corsican forests. Important part of traditional Corsican cuisine and culture.",
                "booking_tips": "Must join guided tours for safety. Often includes cooking session. Check weather for recent rain."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Val d'Ese Skiing",
                "type": "Winter Sports",
                "description": "Experience the unique opportunity to ski with Mediterranean views at Val d'Ese resort, just 40 minutes from Ajaccio - combining mountain and sea pleasures.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "One of the few places in the world where you can ski in the morning and swim in the afternoon. Snow conditions vary yearly.",
                "booking_tips": "Check snow conditions before traveling. Equipment rental available. Consider half-day trips to combine with coastal activities."
            },
            {
                "name": "Sea Urchin Beach Picnics",
                "type": "Culinary Tradition",
                "description": "Join the beloved winter tradition of diving for sea urchins and enjoying them fresh on the beach with wine and friends, even in cooler weather.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Peak sea urchin season from December to April. A cherished local winter tradition that brings communities together.",
                "booking_tips": "Join locals or organized tours. Bring warm clothes and waterproof gear. Best combined with hot drinks and local wine."
            },
            {
                "name": "Christmas Market in Place Foch",
                "type": "Holiday Market",
                "description": "Browse the charming Christmas market featuring local Corsican crafts, seasonal treats, and holiday decorations in the heart of historic Ajaccio.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Brings festive warmth to winter evenings. Features unique Corsican holiday traditions and locally made gifts.",
                "booking_tips": "No booking required. Best atmosphere in evening when lights are on. Try local holiday specialties like canistrelli."
            },
            {
                "name": "Indoor Museum Marathon",
                "type": "Cultural Activity",
                "description": "Spend winter days exploring Ajaccio's excellent museums including Maison Bonaparte, Musée A Bandera, and Palais Fesch during cooler weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect weather for indoor cultural exploration. Museums are less crowded and offer deeper exploration opportunities.",
                "booking_tips": "Consider museum passes for multiple visits. Many offer guided tours. Combine with café stops for warmth."
            },
            {
                "name": "Traditional Figatellu and Chestnut Meals",
                "type": "Culinary Experience",
                "description": "Enjoy hearty winter meals featuring figatellu sausage, chestnuts, and other traditional Corsican winter foods in cozy local restaurants.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Peak season for traditional winter foods. Figatellu is grilled over chestnut wood for authentic flavor.",
                "booking_tips": "Reserve at traditional restaurants. Try pairing with aged Corsican cheeses and local red wine."
            },
            {
                "name": "Thermal Springs at Caldaniccia",
                "type": "Wellness Activity",
                "description": "Warm up in natural thermal springs in the nearby mountains, a perfect winter retreat offering relaxation and therapeutic benefits.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Natural hot springs provide warmth during cooler months. Beautiful winter mountain scenery surrounding the springs.",
                "booking_tips": "Check access conditions in winter. Bring towels and warm clothes for changing. Natural pools with no facilities."
            },
            {
                "name": "Storm Photography and Citadel Views",
                "type": "Photography",
                "description": "Capture dramatic winter storms and moody Mediterranean seascapes from the historic citadel and waterfront locations.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and stormy seas perfect for photography. Clear post-storm days offer incredible visibility.",
                "booking_tips": "Dress warmly and protect camera equipment. Best after storms when light is dramatic. Check wind conditions for safety."
            },
            {
                "name": "Cozy Wine Bar Evenings",
                "type": "Social Activity",
                "description": "Warm up in traditional wine bars with local vintages, charcuterie platters, and the company of locals during long winter evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect season for indoor socializing. Wine bars offer warmth, local atmosphere, and seasonal food pairings.",
                "booking_tips": "No reservations usually needed. Learn basic French phrases for better interaction. Try different neighborhoods for variety."
            }
        ]
    }
}