{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Spring Awakening & Park Blooms",
                "details": "Witness Malmö emerging from winter as parks like Kungsparken, Slottsträdgården, and Pildammsparken start to bloom. Enjoy the increasing daylight hours."
            },
            {
                "reason": "Outdoor Cafes Reopen",
                "details": "Experience the start of the outdoor seating season ('uteserveringar') at cafes in charming squares like Lilla Torg and Davidshallstorg, perfect for 'fika'."
            },
            {
                "reason": "Ideal for City Exploration",
                "details": "Explore Malmö's diverse neighborhoods like Gamla Staden, Västra Hamnen, and Möllevången on foot or by bike in pleasant, pre-summer temperatures."
            },
            {
                "reason": "Shoulder Season Advantages",
                "details": "Visit key attractions such as Malmö Castle (Malmö Museer), Moderna Museet, or the Form/Design Center with potentially fewer crowds and possibly better accommodation prices (outside Easter)."
            },
            {
                "reason": "Walpurgis Night Celebrations (April 30th)",
                "details": "Experience the traditional Swedish welcome to spring (Valborg) with bonfires, singing, and community gatherings, often held in parks like Folkets Park."
            },
            {
                "reason": "Proximity to Copenhagen & Lund",
                "details": "April is a good time for comfortable day trips to nearby cities like Copenhagen or the university town of Lund via the Öresund Line train before peak season."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Unpredictable Coastal Weather",
                "details": "April in Malmö brings variable weather. Sunny days are possible, but expect frequent cool winds, rain showers, and generally unsettled conditions common to Skåne's coast."
            },
            {
                "reason": "Cool Temperatures",
                "details": "Average temperatures are still cool, ranging from lows around 3-4°C to highs around 11-12°C. Wind chill, especially near the coast (Ribersborg, Västra Hamnen), can make it feel colder."
            },
            {
                "reason": "Easter Holiday Impact (if applicable)",
                "details": "If Easter occurs in April, be aware of potential closures or reduced hours for shops (including Systembolaget) and some services on public holidays."
            },
            {
                "reason": "Pollen Season Starts",
                "details": "Spring blooms mean the beginning of pollen season (especially birch), which could affect allergy sufferers."
            },
            {
                "reason": "Sea Too Cold for Swimming",
                "details": "The Öresund strait remains very cold; while coastal walks are lovely, swimming is generally only for the very hardy or those using the Kallbadhus sauna."
            },
            {
                "reason": "Some Seasonal Activities Limited",
                "details": "While the city is active, peak summer activities (like extensive beach services or frequent outdoor events) haven't fully started."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "11°C",
                    "low": "3°C"
                },
                "precipitation": "Variable; expect cloudy periods, rain showers, and potentially strong breezes. Sunny intervals are also possible.",
                "general_tips": "Layering is essential: thermal base, fleece or sweater, windproof and waterproof outer layer, hat, scarf, gloves. Waterproof shoes highly recommended."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. Quieter than summer, but can increase if Easter falls within this period.",
                "pricing": "Generally mid-range for accommodation, potentially lower than summer but higher around Easter.",
                "overall_atmosphere": "City feels fresh and is slowly waking up. Parks are greening. Good time for museum visits and exploring neighborhoods without large crowds."
            },
            "events_holidays": [
                {
                    "name": "Easter Weekend (Påsk)",
                    "date": "Varies (can fall in early/mid-April)",
                    "description": "Public holidays on Good Friday, Easter Sunday, and Easter Monday. Primarily a family-focused holiday.",
                    "notes": "Many shops, especially Systembolaget, have reduced hours or are closed. Check attraction opening times. Public transport runs, often on a Sunday schedule."
                },
                {
                    "name": "Outdoor Dining Season Begins",
                    "date": "From April 1st (weather permitting)",
                    "description": "Cafes and restaurants officially open their outdoor seating areas ('uteserveringar'), especially visible in Lilla Torg, Davidshall, and Möllevången.",
                    "notes": "Comfort depends entirely on the day's weather; blankets are often provided!"
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Gamla Staden & Gamla Väster",
                    "where": "Old Town",
                    "description": "Wander the historic heart of Malmö, including the lively squares Stortorget & Lilla Torg and the charming cobblestone streets and colorful houses of Gamla Väster.",
                    "practical_tips": "Wear comfortable shoes for cobblestones. Enjoy fika at a cafe on Lilla Torg.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Free (walking), cost for food/shopping.",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Malmö Museer at Malmö Castle",
                    "where": "Near Kungsparken",
                    "description": "Explore the various museums housed within Scandinavia's oldest preserved Renaissance castle, including history exhibits, an aquarium, and art.",
                    "practical_tips": "Allow several hours. Check for combined tickets if visiting associated museums.",
                    "best_time": "Anytime during opening hours.",
                    "estimated_cost": "Moderate (entry fee).",
                    "weather_dependent": false
                },
                {
                    "activity": "Discover Moderna Museet Malmö",
                    "where": "Near Stortorget",
                    "description": "Visit Malmö's museum for modern and contemporary art, housed in a striking building. Features changing exhibitions.",
                    "practical_tips": "Check current exhibitions online. Often free entry for under 18s.",
                    "best_time": "Anytime during opening hours.",
                    "estimated_cost": "Moderate (entry fee).",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Cycle in Kungsparken & Slottsparken",
                    "where": "West of Gamla Staden",
                    "description": "Enjoy Malmö's beautiful central parks, connected by canals. See the windmill (Slottsmöllan) and the Castle Garden (Slottsträdgården) as spring emerges.",
                    "practical_tips": "Paths are well-maintained. Rent a bike for wider exploration. Visit the Slottsträdgården Kafé.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Free.",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "12°C",
                    "low": "4°C"
                },
                "precipitation": "Continues to be variable, potential for slightly more frequent mild, sunny days but rain and wind remain common.",
                "general_tips": "Layering remains key. Be prepared for both cool breezes and potentially warmer sunshine."
            },
            "tourism_level": {
                "crowds": "Moderate. Activity picks up towards the end of the month, especially around Valborg.",
                "pricing": "Generally stable mid-range pricing.",
                "overall_atmosphere": "Noticeable spring feeling. More greenery, longer days. City feels increasingly lively, outdoor seating more utilized on good days."
            },
            "events_holidays": [
                {
                    "name": "Art Week Malmö",
                    "date": "Usually late April (check specific dates)",
                    "description": "A week dedicated to contemporary art with exhibitions, open studios, performances, and events across various galleries and art institutions in Malmö.",
                    "notes": "Check the official Art Week Malmö program for venues and schedules."
                },
                {
                    "name": "Walpurgis Night (Valborgsmässoafton / Valborg)",
                    "date": "April 30th (evening)",
                    "description": "Traditional Swedish celebration welcoming spring. Expect bonfires, choir singing, and public gatherings in parks (like Folkets Park or Pildammsparken).",
                    "notes": "Popular local event. Dress warmly for evening outdoor activities. Student celebrations in nearby Lund are particularly large."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Västra Hamnen & Turning Torso",
                    "where": "Western Harbour",
                    "description": "Visit the modern, sustainable waterfront district. Admire the iconic Turning Torso skyscraper and walk along the Sundspromenaden boardwalk for sea views.",
                    "practical_tips": "Can be windy. Take bus #2 or #3 from Central Station. Good spot for sunset views over the bridge.",
                    "best_time": "Daytime or sunset.",
                    "estimated_cost": "Free (walking), cost for cafes.",
                    "weather_dependent": true
                },
                {
                    "activity": "Experience Möllevången & its Market",
                    "where": "Möllevången (Möllan)",
                    "description": "Explore the vibrant, multicultural neighborhood. Visit the lively Möllevångstorget market (best mornings) for produce and atmosphere. Try affordable falafel, a Malmö specialty.",
                    "practical_tips": "Bring cash for market stalls, though many take cards/Swish. Explore the diverse food shops.",
                    "best_time": "Market: Morning. General exploration/food: Daytime/Evening.",
                    "estimated_cost": "Low (market browsing/falafel).",
                    "weather_dependent": true
                },
                {
                    "activity": "Sauna at Ribersborgs Kallbadhus",
                    "where": "Ribersborg Beach",
                    "description": "Experience the historic open-air bathhouse ('Kallis'). Enjoy a traditional Swedish sauna with views over the Öresund, maybe followed by a quick, cold sea dip.",
                    "practical_tips": "Separate sections for men/women, usually nude. Bring a towel. Check opening hours.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Moderate (entry fee).",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Lund",
                    "where": "Lund (short train ride)",
                    "description": "Visit the charming, historic university town. Explore Lund Cathedral, the picturesque streets, Kulturen open-air museum, and the botanical garden.",
                    "practical_tips": "Frequent trains from Malmö C (approx. 10-15 mins). Very walkable city.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Low-Moderate (train fare + optional museum entries).",
                    "weather_dependent": true
                }
            ]
        }
    }
}