{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Pre-Peak Summer Weather",
                "details": "June in Malmö offers delightful weather, typically warm and sunny (avg highs 20-22°C/68-72°F), perfect for exploring the city and nearby Skåne before the main summer crowds."
            },
            {
                "reason": "Longest Daylight Hours",
                "details": "Experience the enchanting long Nordic daylight hours around the summer solstice (June 21st). Maximize your time for sightseeing, beach visits, and enjoying outdoor cafes late into the evening."
            },
            {
                "reason": "Midsummer Celebrations",
                "details": "Witness or participate in Sweden's iconic Midsummer holiday (late June). Look for traditional celebrations with maypoles, dancing, and festivities in Folkets Park or potentially in the surrounding Skåne countryside."
            },
            {
                "reason": "National Day of Sweden",
                "details": "Join the celebrations for Sweden's National Day on June 6th. Expect events, flag ceremonies, and a festive atmosphere, often with activities centered around Stortorget or Folkets Park."
            },
            {
                "reason": "Beach Season Begins at Ribersborg",
                "details": "June marks the start of the beach season. Head to Ribersborg strand ('Ribban') for walks, sunbathing, early swims, or a visit to the Kallbadhuset (open-air bath)."
            },
            {
                "reason": "Lush Parks & Outdoor Dining",
                "details": "Malmö's parks like Kungsparken, Slottsparken, and Pildammsparken are beautifully green. Enjoy picnics, strolls, and the vibrant outdoor seating ('uteserveringar') at Lilla Torg, Möllevångstorget, and Västra Hamnen."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Midsummer Closures & Impact",
                "details": "Midsummer Eve (Friday) is a major holiday in practice. Expect widespread closures of shops (including Systembolaget), museums, and many restaurants. Midsummer Day (Saturday) is also a public holiday. Essential to plan ahead for food and activities."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "June signals the start of the high season. Crowds increase, particularly later in the month and around Midsummer and National Day. Accommodation and flight prices rise."
            },
            {
                "reason": "Booking Ahead Essential (Especially Midsummer)",
                "details": "Accommodation, especially for the Midsummer weekend, should be booked well in advance. Popular restaurants might also require reservations."
            },
            {
                "reason": "Variable Weather Still Possible",
                "details": "While often sunny and warm, June can still bring cooler days and rain showers. Pack layers and waterproof gear just in case."
            },
            {
                "reason": "National Day Closures (June 6th)",
                "details": "As a public holiday, expect some closures (banks, offices, some independent shops). Major attractions are often open, but public transport might run on a reduced schedule."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "20°C (68°F)",
                    "low": "11°C (52°F)"
                },
                "precipitation": "Generally pleasant with increasing sunshine, but still a moderate chance of rain showers. Daylight hours are very long and increasing.",
                "general_tips": "Pack layers: t-shirts, long sleeves, a sweater or fleece, and a light to medium jacket (ideally waterproof). Comfortable walking shoes are essential. Sunglasses needed."
            },
            "tourism_level": {
                "crowds": "High season kicks off. Noticeably busier, especially around National Day (June 6th), but typically less crowded than July.",
                "pricing": "High season prices apply for flights and accommodation. Book early.",
                "overall_atmosphere": "Bright and vibrant early summer feel. Parks are lush, outdoor cafes are busy. Focus on enjoying the outdoors and National Day festivities."
            },
            "events_holidays": [
                {
                    "name": "National Day of Sweden (Sveriges nationaldag)",
                    "date": "June 6",
                    "description": "Public holiday. Celebrations typically occur at Stortorget with flag ceremonies, music, and speeches. Folkets Park often hosts family-friendly activities.",
                    "notes": "Check local listings for specific event times. Expect crowds in central areas. Some closures apply."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Celebrate National Day in Malmö",
                    "where": "Stortorget / Folkets Park",
                    "description": "Join the local celebrations for Sweden's National Day. Experience flag ceremonies, listen to music, and soak up the festive atmosphere in the city center or the park.",
                    "practical_tips": "Wear blue and yellow! Check the official schedule. June 6th is a public holiday, plan accordingly.",
                    "best_time": "June 6th (Daytime)",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Early Season Visit to Ribersborg Beach",
                    "where": "Ribersborg Strand ('Ribban')",
                    "description": "Enjoy the long sandy beach as the season begins. Take a walk along the shore, dip your toes in the water, or visit the iconic Kallbadhuset.",
                    "practical_tips": "Water might still be chilly for swimming for some. Kallbadhuset offers saunas and sea dips. Easily accessible by bus or bike.",
                    "best_time": "Daytime on a sunny day",
                    "estimated_cost": "Free (Kallbadhus entry extra)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Gamla Väster & Lilla Torg",
                    "where": "Old Town (Gamla Staden)",
                    "description": "Wander the charming cobblestone streets of Gamla Väster, admire the half-timbered houses, and enjoy the lively atmosphere and outdoor cafes at Lilla Torg.",
                    "practical_tips": "Lilla Torg gets very busy, especially in the evenings. Explore the surrounding streets for quieter spots.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "Free (dining/shopping extra)",
                    "weather_dependent": false
                 },
                {
                    "activity": "Cycle Around the City",
                    "where": "Throughout Malmö",
                    "description": "Rent a bike and explore Malmö's extensive network of cycle paths. Ride through parks, along canals, and out to Västra Hamnen or Ribersborg.",
                    "practical_tips": "Malmö is very flat and bike-friendly. Rental options available near Central Station and elsewhere. Use apps like Malmö by Bike.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low-Moderate (bike rental)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "22°C (72°F)",
                    "low": "13°C (55°F)"
                },
                "precipitation": "Typically warm and sunny summer weather. Very long daylight hours peak around the solstice (June 21st). Showers remain possible.",
                "general_tips": "Summer attire is standard (shorts, t-shirts). Keep a light jacket/sweater for evenings. A compact umbrella or rain jacket is still wise."
            },
            "tourism_level": {
                "crowds": "High season intensifies, reaching a peak around Midsummer weekend. The city might feel slightly quieter on Midsummer Eve itself as many Swedes celebrate elsewhere.",
                "pricing": "Peak season prices. Essential to book accommodation and any desired tours/restaurants far in advance, especially for Midsummer.",
                "overall_atmosphere": "Peak summer vibe with exceptionally long, bright evenings. Midsummer dominates the end of the month, requiring significant planning due to closures and traditions."
            },
            "events_holidays": [
                {
                    "name": "Midsummer Eve (Midsommarafton)",
                    "date": "Friday between June 19-25",
                    "description": "The main celebration day (de facto holiday). Many locals leave the city. Public celebrations often occur in Folkets Park with maypole dancing, games, and music. Others head to the Skåne countryside.",
                    "notes": "EXTENSIVE CLOSURES: Shops (incl. Systembolaget), banks, many museums/restaurants close early or entirely. Plan all food/drink needs in advance. Limited public transport. Confirm event details locally."
                },
                {
                    "name": "Midsummer Day (Midsommardagen)",
                    "date": "Saturday between June 20-26",
                    "description": "Official public holiday. A very quiet day after the previous night's celebrations. Most things remain closed.",
                    "notes": "Treat it like a quiet Sunday regarding opening hours. Check transport schedules."
                },
                {
                    "name": "Summer Solstice",
                    "date": "Around June 21st",
                    "description": "The longest day of the year, providing almost 18 hours of daylight. Enjoy the extended evening light in parks or by the water.",
                    "notes": "Celebrated culturally through Midsummer rather than as a separate event."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Midsummer in Folkets Park",
                    "where": "Folkets Park, Malmö",
                    "description": "Join the public Midsummer celebration in the city's main park. Experience maypole raising, traditional dancing, singing, and family activities.",
                    "practical_tips": "Check the park's official schedule. Arrive early as it gets crowded. Remember closures elsewhere for food/drinks.",
                    "best_time": "Midsummer Eve (afternoon)",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Enjoy the Long Evenings in Västra Hamnen",
                    "where": "Western Harbour (Västra Hamnen)",
                    "description": "Take advantage of the incredibly long daylight. Stroll along the waterfront, admire the Turning Torso, find a spot for dinner or drinks with sea views as the sun lingers.",
                    "practical_tips": "Popular area for locals and tourists. Great for watching the sunset (which happens very late).",
                    "best_time": "Evening",
                    "estimated_cost": "Free (dining extra)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Picnic in Pildammsparken",
                    "where": "Pildammsparken",
                    "description": "Pack a picnic and enjoy Malmö's largest park during the long summer evenings. Relax by the pond or find a spot under the trees.",
                    "practical_tips": "Buy picnic supplies well before Midsummer Eve closures. A beautiful and spacious park.",
                    "best_time": "Late Afternoon / Evening",
                    "estimated_cost": "Low",
                    "weather_dependent": true
                 },
                { 
                    "activity": "Day Trip to Copenhagen",
                    "where": "Train across Öresund Bridge (approx. 35 min)",
                    "description": "Take advantage of the easy connection to visit Denmark's capital for a day. Explore Nyhavn, Tivoli Gardens (check opening), or Strøget shopping street.",
                    "practical_tips": "Frequent trains run from Malmö Central. Remember passport/ID. Check Danish holidays if traveling around Midsummer, although it's less disruptive there than in Sweden.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate-High (train fare + Copenhagen expenses)",
                    "weather_dependent": false
                }
            ]
        }
    }
}