{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Transition to Spring & Fewer Crowds",
                "details": "Experience Malmö as winter recedes. Enjoy increasing daylight, potentially milder days than deep winter, and explore museums like Malmö Museer or Malmö Konsthall with minimal crowds."
            },
            {
                "reason": "Shoulder Season Value",
                "details": "March generally offers good value for flights and accommodation before the main tourist season starts (excluding potential Easter holiday spikes)."
            },
            {
                "reason": "Cozy 'Fika' & Last Chance for Semlor",
                "details": "Perfect time to embrace Swedish 'fika'. Find warmth in cafes in Gamla Väster or Davidshall. March is typically the last month to easily find traditional 'semlor' (Lenten cream buns) before they disappear after Easter."
            },
            {
                "reason": "Waffle Day (Våffeldagen)",
                "details": "Celebrate Våffeldagen on March 25th. Many cafes across Malmö will serve classic heart-shaped Swedish waffles with jam and cream."
            },
            {
                "reason": "Focus on Indoor Culture",
                "details": "Unpredictable weather makes it ideal for exploring Malmö's indoor cultural attractions like Malmö Castle (Malmö Museer), Moderna Museet Malmö, Form/Design Center, or the unique Disgusting Food Museum."
            },
            {
                "reason": "Early Signs of Spring in Parks",
                "details": "Towards the end of the month, look for early spring bulbs like snowdrops and crocuses starting to appear in parks like Kungsparken and Pildammsparken on milder days."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Chilly, Wet & Windy Weather",
                "details": "March remains cold (avg highs 6-9°C/43-48°F) and is often damp and windy due to Malmö's coastal location in Skåne. Rain is frequent, sometimes mixed with sleet. Proper waterproof and windproof gear is essential."
            },
            {
                "reason": "Limited Daylight (Though Increasing)",
                "details": "Daylight hours increase significantly through March, but still limit extensive outdoor exploration compared to summer. Evenings remain dark."
            },
            {
                "reason": "Parks & Outdoor Spaces Not Yet Lush",
                "details": "While signs of spring may appear, parks and gardens are generally still emerging from winter and lack the greenery and vibrancy of later months."
            },
            {
                "reason": "Need for Warm & Waterproof Clothing",
                "details": "Packing warm layers, a waterproof and windproof outer jacket, hat, gloves, scarf, and waterproof footwear is crucial for comfort."
            },
            {
                "reason": "Easter Holiday Closures (If Applicable)",
                "details": "If Easter falls in late March, Good Friday and Easter Monday are public holidays. Expect widespread closures of shops, Systembolaget, and potentially reduced hours for some attractions and restaurants. Check specific dates."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "6°C (43°F)",
                    "low": "0°C (32°F)"
                },
                "precipitation": "Still feels like late winter. High probability of rain, often cold and persistent. Sleet or wet snow possible, especially early in the period. Windy conditions are common. Occasional crisp, sunny days.",
                "general_tips": "Essential: waterproof and windproof jacket, warm layers (thermals, fleece), hat, gloves, scarf, waterproof boots. Umbrella highly recommended."
            },
            "tourism_level": {
                "crowds": "Low season. Attractions and cafes are generally quiet.",
                "pricing": "Good value for travel and accommodation.",
                "overall_atmosphere": "Late winter/early spring transition. Quiet city focused on indoor activities. Locals emerge for 'fika' or walks on clearer days."
            },
            "events_holidays": [
                 {
                    "name": "BUFF International Film Festival (Potential)",
                    "date": "Usually mid-March",
                    "description": "Malmö hosts this major international film festival focused on movies for children and young people. Check dates for the specific year.",
                    "notes": "Public screenings might be available. Primarily industry-focused but brings an international buzz."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Malmö Museer (Malmö Castle)",
                    "where": "Malmöhus Castle",
                    "description": "Spend a day exploring the diverse museums within the castle complex (history, art, natural history, aquarium) without crowds. Perfect for a cold or rainy day.",
                    "practical_tips": "Allow several hours. One ticket covers all museums in the complex.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Cozy Fika with Semlor",
                    "where": "Cafés in Gamla Väster, Davidshall, Möllevången",
                    "description": "Enjoy the Swedish tradition of 'fika'. Seek out cafes still serving 'semlor' (Lenten cream buns) – a rich treat perfect for a chilly day.",
                    "practical_tips": "Look for signs advertising 'Semlor'. Try Konditori Hollandia or cafes around Davidshallstorg.",
                    "best_time": "Mid-morning or Afternoon",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Malmö Konsthall",
                    "where": "Near Triangeln Station",
                    "description": "Explore contemporary art exhibitions in this renowned art gallery, known for its flexible space and natural light (even on grey days).",
                    "practical_tips": "Free entry. Check current exhibition schedule. Has a nice café (SMAK).",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Wander through Malmö Saluhall",
                    "where": "Near Malmö Central Station",
                    "description": "Explore this indoor food market. Browse local produce, cheeses, meats, and enjoy lunch or 'fika' at one of the diverse stalls, staying warm and dry.",
                    "practical_tips": "Good spot for lunch or picking up unique food items. Can get busy during peak lunch hours.",
                    "best_time": "Lunchtime / Daytime",
                    "estimated_cost": "Moderate (for food/purchases)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "9°C (48°F)",
                    "low": "2°C (36°F)"
                },
                "precipitation": "Noticeable increase in daylight hours. Still a high chance of rain and wind, but pure snow becomes less likely. More frequent sunny spells, though still cool.",
                "general_tips": "Continue with waterproof and windproof layers. Weather remains very changeable."
            },
            "tourism_level": {
                "crowds": "Remains relatively low. May see a slight increase if Easter falls during this period.",
                "pricing": "Generally good value, but check for potential Easter holiday price increases if applicable.",
                "overall_atmosphere": "Definite feel of approaching spring, though often wet. Waffle Day (Mar 25) offers a cheerful culinary highlight."
            },
            "events_holidays": [
                 {
                    "name": "Waffle Day (Våffeldagen)",
                    "date": "March 25",
                    "description": "Join Swedes in celebrating Waffle Day! Cafés across Malmö serve traditional crispy, heart-shaped waffles, usually with jam and whipped cream.",
                    "notes": "A fun, non-holiday tradition. Look for 'Våfflor' signs outside cafes."
                 },
                 {
                    "name": "Easter Weekend (Potential - Check Dates)",
                    "date": "Varies (can fall late March)",
                    "description": "If Easter weekend occurs, Good Friday & Easter Monday are public holidays. Look for Easter decorations ('påskris') and chocolate eggs in shops.",
                    "notes": "Check exact dates for the year. Expect widespread closures on public holidays (Good Friday, Easter Monday). Plan shopping and dining accordingly."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Celebrate Waffle Day in Malmö",
                    "where": "Cafés throughout the city",
                    "description": "Seek out a cozy café on March 25th and indulge in freshly made Swedish waffles with traditional toppings.",
                    "practical_tips": "Popular cafes might be busy. Consider trying cloudberry jam ('hjortronsylt') if available.",
                    "best_time": "Afternoon on March 25th",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore Västra Hamnen & Turning Torso",
                    "where": "Western Harbour (Västra Hamnen)",
                    "description": "Take a walk through the modern, sustainable Västra Hamnen district. Admire the iconic Turning Torso skyscraper and enjoy the sea views (dress warmly!).",
                    "practical_tips": "Can be very windy. Several cafes offer refuge. Good views across to Copenhagen on clearer days.",
                    "best_time": "Daytime, preferably on a less windy day",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Moderna Museet Malmö",
                    "where": "Gasverksgatan",
                    "description": "Explore modern and contemporary art in Malmö's branch of the national museum, housed in a striking former power station.",
                    "practical_tips": "Check current exhibitions. Located a short walk from the city center.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Walk in Kungsparken or Pildammsparken",
                    "where": "Central Malmö Parks",
                    "description": "Enjoy a walk through Malmö's central parks as the first signs of spring might be emerging (early flowers, tree buds).",
                    "practical_tips": "Wear waterproof footwear as paths might be muddy. The greenhouse in Slottsträdgården (Castle Garden, near Malmöhus) offers warmth.",
                    "best_time": "Daytime on a dry day",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 }
            ]
        }
    }
}