{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May brings delightful spring weather to Malmö. Expect increasingly sunny days, mild temperatures (average highs 16-18°C/61-64°F), and long daylight hours, perfect for exploring parks and the coast."
            },
            {
                "reason": "City Parks in Full Bloom",
                "details": "Experience Malmö's parks like Kungsparken, Slottsparken, and Pildammsparken bursting with spring color. See tulips, cherry blossoms (early May), and lush greenery."
            },
            {
                "reason": "Outdoor Cafes & Lively Squares",
                "details": "Outdoor seating ('uteserveringar') flourishes at Lilla Torg, Möllevångstorget, and along canals. Enjoy fika, drinks, or meals outdoors, soaking up the vibrant spring atmosphere."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "While tourism noticeably increases, May generally offers a less crowded experience and potentially better prices than the peak summer months of June-August."
            },
            {
                "reason": "Beach Walks & Early Coastal Season",
                "details": "Ribersborg beach becomes inviting for walks and enjoying the sea air. The Kallbadhuset (open-air bath) is open for saunas and bracing dips as the water slowly warms."
            },
            {
                "reason": "Day Trips to Skåne & Copenhagen",
                "details": "Pleasant weather makes May ideal for day trips. Explore the blooming rapeseed fields of Skåne, visit nearby Lund, or take the train across the Öresund Bridge to Copenhagen."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "Despite the improving trend, May can still deliver cool, windy days and rain showers. Malmö's coastal position means weather can change quickly. Packing layers is crucial."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks the beginning of the busier season. Expect more tourists, especially on weekends and holidays, and rising prices for accommodation and flights."
            },
            {
                "reason": "May Day Holiday (May 1st)",
                "details": "May 1st is a major public holiday (Labor Day). Expect widespread closures (shops, Systembolaget, banks) and potential political marches in the city center impacting access."
            },
            {
                "reason": "Ascension Day Holiday (Potential)",
                "details": "Ascension Day (Kristi Himmelsfärdsdag), a public holiday, frequently falls in May (check dates). Creates a long weekend, boosting domestic travel and potentially affecting availability and prices."
            },
            {
                "reason": "Pollen Season",
                "details": "Significant tree pollen (especially birch) can be challenging for allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C (61°F)",
                    "low": "7°C (45°F)"
                },
                "precipitation": "Increasing sunshine and warmth, but still a moderate chance of rain showers and windy conditions. Daylight hours lengthen significantly.",
                "general_tips": "Pack layers: t-shirts, sweaters, a light to medium jacket (waterproof recommended), comfortable shoes. Sunglasses essential. Allergy medication if needed."
            },
            "tourism_level": {
                "crowds": "Moderate and increasing. Very busy around May 1st due to the holiday and associated events/closures.",
                "pricing": "Shoulder/High season prices. Book accommodation early, especially for May 1st weekend.",
                "overall_atmosphere": "Vibrant spring energy. Parks are greening, outdoor cafes bustling on sunny days. May 1st brings closures and potential demonstrations."
            },
            "events_holidays": [
                {
                    "name": "Walpurgis Night (Valborgsmässoafton) - Evening Before",
                    "date": "April 30 (Evening)",
                    "description": "Eve of May 1st. Celebrated with bonfires, singing (often student choirs), and festivities. Check for events in parks like Folkets Park or potentially locations outside the city.",
                    "notes": "Popular tradition marking the arrival of spring. Leads into the May 1st holiday."
                },
                {
                    "name": "May Day / Labor Day (Första maj)",
                    "date": "May 1",
                    "description": "Public holiday. Political demonstrations and marches by labor unions are common, usually in the city center (around Stortorget/Gustav Adolfs Torg).",
                    "notes": "Widespread closures (most shops, Systembolaget, banks). Expect disruptions in central Malmö. Check museum/attraction opening status."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Kungsparken & Slottsparken",
                    "where": "Central Malmö Parks",
                    "description": "Wander through Malmö's beautiful central parks as they burst into spring bloom. See flowers, blossoming trees, and enjoy the green spaces near the canal and Malmöhus Castle.",
                    "practical_tips": "The historic windmill in Slottsparken is a landmark. Consider visiting Slottsträdgården café within the park.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Fika Outdoors at Lilla Torg or Möllevångstorget",
                    "where": "Lilla Torg / Möllevångstorget",
                    "description": "Embrace the Swedish 'fika' tradition at an outdoor café ('uteservering') in one of Malmö's lively squares. Soak up the sun and people-watch.",
                    "practical_tips": "Lilla Torg is historic and bustling. Möllevångstorget offers a more diverse, bohemian vibe. Both get busy on sunny afternoons.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": true
                },
                 {
                    "activity": "Walk or Cycle Along the Canals",
                    "where": "Central Malmö Canals",
                    "description": "Enjoy the spring weather by walking or cycling along Malmö's canals. See the city from a different perspective as trees leaf out.",
                    "practical_tips": "Rent a bike using Malmö by Bike or other services. Paths are flat and easy to navigate.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking) / Low-Moderate (bike rental)",
                    "weather_dependent": true
                 },
                {
                    "activity": "Visit Form/Design Center",
                    "where": "Lilla Torg",
                    "description": "Explore exhibitions focused on architecture, design, and craft in a historic granary building right on Lilla Torg.",
                    "practical_tips": "Good indoor option for a cooler or rainy day. Check current exhibitions. Free entry.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "18°C (64°F)",
                    "low": "9°C (48°F)"
                },
                "precipitation": "Often the most pleasant part of spring. Generally sunnier and warmer, though rain showers are still possible. Long daylight hours.",
                "general_tips": "Focus on lighter clothing layers, but always have a jacket or sweater for cooler evenings or potential rain. Sunscreen useful on sunny days."
            },
            "tourism_level": {
                "crowds": "High season approaching. Gets busier, particularly on weekends and around the Ascension Day holiday if it falls here.",
                "pricing": "High season prices are generally standard now.",
                "overall_atmosphere": "Beautiful late spring feeling. Ideal time for outdoor exploration, parks, and day trips before the main summer rush."
            },
            "events_holidays": [
                 {
                    "name": "Ascension Day (Kristi Himmelsfärdsdag)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday in Sweden. Creates a long weekend for many.",
                    "notes": "Check the date for the specific year. Expect closures (shops, banks). Increased travel within Sweden, book ahead if traveling during this weekend."
                 },
                 {
                    "name": "Malmö Garden Show (Potential - Check Dates)",
                    "date": "Often late May/early June",
                    "description": "A popular garden show sometimes held in Slottsträdgården, featuring inspiring gardens, plants for sale, and expert advice.",
                    "notes": "Check Malmö City website or local listings for confirmation and exact dates."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to Copenhagen",
                    "where": "Train from Malmö Central (approx. 35 min)",
                    "description": "Take advantage of the easy and scenic train ride across the Öresund Bridge to visit Denmark's vibrant capital.",
                    "practical_tips": "Trains run very frequently. Remember passport/ID. A full day allows exploration of key sights like Nyhavn or Tivoli Gardens.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate-High (train fare + Copenhagen expenses)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Ribersborg Beach & Kallbadhus",
                    "where": "Ribersborg",
                    "description": "Enjoy a walk on Malmö's main beach. Visit the historic open-air bathhouse (Kallbadhuset) for a sauna and perhaps a bracing dip in the Öresund.",
                    "practical_tips": "Water is still cold for most swimmers, but the sauna experience is great year-round. Check Kallbadhus opening hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (beach) / Moderate (Kallbadhus entry)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Pildammsparken",
                    "where": "South of City Center",
                    "description": "Discover Malmö's largest park, featuring beautiful flower arrangements (like the Queen Silvia Rose Trail), the large pond ('pildamm'), sculptures, and perhaps outdoor theatre preparations.",
                    "practical_tips": "Great for long walks or picnics. The 'Margaretapaviljongen' is a notable building within the park.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Canal Boat Tour ('Rundan')",
                    "where": "Departing near Malmö Central Station",
                    "description": "Take a guided boat tour through Malmö's canals for a relaxing overview of the city's architecture and history from the water.",
                    "practical_tips": "Tours usually run regularly by May. Commentary often available in multiple languages. Book ahead or arrive early on sunny days.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                 }
            ]
        }
    }
}