{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Spectacular Funchal Carnival",
                "details": "If Carnival falls in February (dates vary), Funchal hosts one of Europe's most vibrant celebrations, famous for its dazzling Allegoric Parade (Saturday) and fun Trapalhão Parade (Shrove Tuesday)."
            },
            {
                "reason": "Mild Winter Escape",
                "details": "Enjoy pleasant daytime temperatures (averaging 17-19°C), often sunny, offering a comfortable escape from harsher northern winters. Ideal for city exploration and coastal walks."
            },
            {
                "reason": "Lower Crowds (outside Carnival)",
                "details": "Excluding the busy Carnival week, February is generally a quieter month with fewer tourists than peak seasons, allowing for more relaxed sightseeing and potentially lower prices."
            },
            {
                "reason": "Early Signs of Spring & Flowers",
                "details": "While not peak bloom, Madeira's flora starts awakening. You'll find early spring flowers adding colour to gardens and landscapes, hinting at the beauty to come."
            },
            {
                "reason": "Good Conditions for Levada Walking (Weather Permitting)",
                "details": "The mild temperatures can be excellent for hiking along the levadas, provided the weather is dry. Choose lower altitude or coastal walks for more reliable conditions."
            },
            {
                "reason": "Authentic Local Atmosphere",
                "details": "Outside of Carnival, experience Funchal with a more local feel. Enjoy uncrowded cafes, markets, and interactions with residents."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Carnival Crowds & Prices",
                "details": "If visiting during Carnival week, expect Funchal to be very crowded, especially for the main parades. Accommodation and flight prices surge; book *very* far in advance."
            },
            {
                "reason": "Higher Chance of Rain & Cloud",
                "details": "February is statistically one of Madeira's wetter months. While sunny days occur, be prepared for rain, overcast skies, and potentially windy conditions, especially in the mountains."
            },
            {
                "reason": "Cool Evenings & Sea Temperature",
                "details": "Evenings remain cool (11-13°C). The sea is chilly (around 18°C), generally too cold for comfortable swimming."
            },
            {
                "reason": "Shorter Daylight Hours",
                "details": "Days are still relatively short (sunset around 6:45 PM by month end), limiting time for extensive daytime exploration, especially longer hikes."
            },
            {
                "reason": "Some Mountain Trails May Be Affected",
                "details": "Higher altitude levada walks or mountain trails could be affected by adverse weather conditions (rain, fog, wind) more frequently than in drier months."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "12°C"
                },
                "precipitation": "Moderate to high chance of rain showers, interspersed with sunny periods. Mountain areas often cloudier/wetter.",
                "general_tips": "Pack layers including sweaters/fleece and a reliable waterproof jacket. Comfortable, water-resistant walking shoes are key. Umbrella useful."
            },
            "tourism_level": {
                "crowds": "Generally low season, quiet. Increases significantly if Carnival preparations/early events begin.",
                "pricing": "Typically low season rates, good value unless Carnival starts early.",
                "overall_atmosphere": "Quiet and relaxed local feel. Anticipation builds if Carnival is approaching. Pleasant for uncrowded city exploration."
            },
            "events_holidays": [
                {
                    "name": "Early Carnival Preparations/Events (if applicable)",
                    "date": "Varies depending on Carnival dates",
                    "description": "Street decorations might start appearing, and smaller community Carnival events or rehearsals could begin.",
                    "notes": "Check the official Carnival program ('Programa Carnaval Madeira') closer to the time."
                },
                 {
                    "name": "Valentine's Day (Dia dos Namorados)",
                    "date": "February 14",
                    "description": "Observed with couples dining out. Some restaurants offer special menus.",
                    "notes": "Book popular restaurants in advance. Not a public holiday."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Funchal's Zona Velha (Old Town)",
                    "where": "East of city center",
                    "description": "Wander the charming narrow streets with painted doors, browse small shops, and enjoy coffee at a quiet café without the usual crowds.",
                    "practical_tips": "Wear comfortable shoes for cobblestones. Many restaurants offer good value lunch menus ('prato do dia').",
                    "best_time": "Daytime",
                    "estimated_cost": "Low",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit the Mercado dos Lavradores",
                    "where": "Downtown Funchal",
                    "description": "Experience the vibrant market with fewer tourists. See colourful displays of exotic fruits, vegetables, flowers, and the bustling fish hall.",
                    "practical_tips": "Best Mon-Fri morning. Be prepared for enthusiastic vendors. Try exotic fruits like passionfruit varieties.",
                    "best_time": "Morning (Mon-Fri)",
                    "estimated_cost": "Free entry, costs for purchases",
                    "weather_dependent": false
                },
                {
                    "activity": "Madeira Wine Lodge Tour & Tasting",
                    "where": "Various lodges (e.g., Blandy's, Oliveiras)",
                    "description": "Learn about the history and production of Madeira's unique fortified wine and enjoy a tasting session. A good indoor activity for a potentially rainy day.",
                    "practical_tips": "Book tours in advance, especially if specific times are desired. Several lodges are located centrally.",
                    "best_time": "Designated tour times",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk the Funchal Promenade",
                    "where": "Avenida do Mar / Promenade do Lido",
                    "description": "Enjoy a bracing walk along the seafront promenade, stretching from the marina towards the Lido area, offering sea views and fresh air.",
                    "practical_tips": "Flat and accessible. Can be windy. Stop at a cafe along the way.",
                    "best_time": "Daytime, preferably during dry spells",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "13°C"
                },
                "precipitation": "Rain still fairly common, but potential for longer spells of sunshine increases. Days get slightly longer.",
                "general_tips": "Continue with layers and waterproofs. Sunglasses might be needed. Check Carnival schedule if visiting during this time."
            },
            "tourism_level": {
                "crowds": "Can transform from low to very high if Carnival week falls here. Book everything far ahead if visiting for Carnival.",
                "pricing": "Low season rates surge to peak/premium rates during Carnival week.",
                "overall_atmosphere": "Can range from quiet pre-spring feel to wildly festive and chaotic during Carnival parades and street events."
            },
            "events_holidays": [
                {
                    "name": "Funchal Carnival Main Events (if applicable)",
                    "date": "Varies (Sat before & Shrove Tuesday)",
                    "description": "Allegoric Parade (Cortejo Alegórico) on Saturday evening features elaborate costumes and floats. Trapalhão Parade (Cortejo Trapalhão) on Tuesday afternoon is known for satire and participation.",
                    "notes": "Parades usually along Avenida do Mar/Avenida Sá Carneiro. Extremely crowded. Plan viewing spots early. Check official program."
                },
                {
                    "name": "Other Carnival Festivities",
                    "date": "Carnival Week (if applicable)",
                    "description": "Includes children's parade (Friday), concerts, street entertainment, parties in bars/clubs.",
                    "notes": "Funchal center is very lively during Carnival week."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Watch the Funchal Carnival Parades",
                    "where": "Main parade route (Avenida do Mar area)",
                    "description": "Experience the spectacle of the Allegoric Parade with its samba schools, elaborate floats, and costumes, or enjoy the humor and chaos of the Trapalhão Parade.",
                    "practical_tips": "Find a viewing spot hours in advance or consider purchasing seated tickets (usually available for Allegoric Parade). Be prepared for massive crowds and loud music.",
                    "best_time": "Saturday Evening (Allegoric), Tuesday Afternoon (Trapalhão) - check program",
                    "estimated_cost": "Free standing / Moderate+ seated tickets",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Botanical Garden or Monte Palace Garden",
                    "where": "Funchal hills / Monte",
                    "description": "Explore Madeira's famous gardens. While not peak season, they offer lush greenery, early blooms, and fewer crowds than summer (outside Carnival week).",
                    "practical_tips": "Check winter opening hours. Allow ample time. Wear comfortable shoes. Monte Palace often considered more visually impressive year-round.",
                    "best_time": "Daytime, preferably dry day",
                    "estimated_cost": "Moderate (entrance fees)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Hike a Lower Altitude Levada (Weather Permitting)",
                    "where": "e.g., Levada dos Piornais, Levada do Caniço, sections of Levada do Norte",
                    "description": "Take advantage of mild temperatures for a walk along an accessible levada offering coastal or valley views, if weather conditions are favorable.",
                    "practical_tips": "Check weather forecast and trail conditions beforehand. Paths can be muddy. Wear sturdy, waterproof footwear. Inform someone of your plans.",
                    "best_time": "Morning/early afternoon on dry days",
                    "estimated_cost": "Low (transport cost)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Enjoy Local Cuisine",
                    "where": "Restaurants in Zona Velha or downtown Funchal",
                    "description": "Try Madeiran specialties like 'Espetada' (beef skewers), 'Bolo do Caco' (traditional bread), 'Lapas' (limpets), or fresh fish, perhaps paired with Madeira wine.",
                    "practical_tips": "Look for restaurants popular with locals. Many offer good value lunch deals.",
                    "best_time": "Lunch or Dinner",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        }
    }
}