{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Madeira Flower Festival (Festa da Flor)",
                "details": "Often held in early/mid-May (check annual dates!), this is Funchal's iconic festival. Experience stunning flower carpets, parades (Wall of Hope, Allegoric Float Parade), flower market, workshops, and concerts."
            },
            {
                "reason": "Peak Spring Beauty & Gardens",
                "details": "Madeira is arguably at its most beautiful. Gardens like the Botanical Garden, Monte Palace, and Palheiro Gardens are in full, spectacular bloom. Landscapes are lush and vibrant."
            },
            {
                "reason": "Ideal Hiking Weather",
                "details": "May offers excellent hiking conditions with warm, generally sunny weather and longer daylight hours. Perfect for exploring levadas and mountain trails."
            },
            {
                "reason": "Pleasant Temperatures",
                "details": "Enjoy comfortable warmth (avg. high 21-23°C) ideal for sightseeing, walking, and enjoying outdoor cafes without the intensity of high summer."
            },
            {
                "reason": "Warming Sea Temperatures",
                "details": "The Atlantic warms to around 20-21°C, making swimming, snorkeling, and water activities increasingly appealing."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Flower Festival Crowds & Prices",
                "details": "If your visit coincides with the Festa da Flor, expect *very* large crowds, fully booked accommodation, and peak prices. Book flights, hotels, and car rentals *months* in advance."
            },
            {
                "reason": "Higher Prices Generally",
                "details": "Even outside the festival period, May sees prices rise as it transitions into the high season. Book ahead for better deals."
            },
            {
                "reason": "Increased Tourist Numbers",
                "details": "Tourist numbers increase significantly compared to early spring, meaning popular spots (cable car, gardens, key viewpoints) will be busier."
            },
            {
                "reason": "Potential for Some Rain/Cloud",
                "details": "While generally sunny, spring showers or cloudy spells are still possible, particularly in the mountains."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "15°C"
                },
                "precipitation": "Low chance of rain, mostly sunny and pleasant. Mountain areas can be cooler/cloudier.",
                "general_tips": "Pack layers: t-shirts, light sweaters/cardigan, potentially a light waterproof. Comfortable walking shoes essential. Sunscreen and sunglasses needed."
            },
            "tourism_level": {
                "crowds": "High to Very High, especially if Flower Festival falls in this period. Extremely busy during festival events.",
                "pricing": "High, potentially peak prices if Flower Festival is active. Book everything far ahead.",
                "overall_atmosphere": "Vibrant, festive, beautiful spring atmosphere. Can be very crowded during festival days."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Dia do Trabalhador)",
                    "date": "May 1",
                    "description": "Public holiday. Generally a quiet day, locals may have the day off.",
                    "notes": "Banks, schools, some businesses closed. Tourist services generally operate. Public transport on holiday schedule."
                },
                 {
                    "name": "Madeira Flower Festival Main Events (if applicable)",
                    "date": "Usually early/mid-May (check specific dates!)",
                    "description": "Key events like the Wall of Hope Ceremony (children building a flower wall), the main Allegoric Float Parade, Flower Market (Avenida Arriaga), flower carpets, workshops.",
                    "notes": "Consult the official Festa da Flor program. Parades draw huge crowds; find viewing spots early."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Experience the Flower Festival Events",
                    "where": "Funchal Center (Avenida Arriaga, Praça do Município, Parade Route)",
                    "description": "Immerse yourself in the festival: admire intricate flower carpets, watch the colourful parades, visit the Flower Market, enjoy the concerts and festive atmosphere.",
                    "practical_tips": "Check the official program for timings/locations. Be prepared for massive crowds during parades. Wear comfortable shoes.",
                    "best_time": "During festival dates (check program)",
                    "estimated_cost": "Free to observe; costs for food/purchases",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Botanical Garden",
                    "where": "Quinta do Bom Sucesso, Funchal",
                    "description": "Explore the hillside garden during peak blooming season, enjoying vast plant collections, themed areas, and stunning views over Funchal.",
                    "practical_tips": "Can be busy, especially if Flower Festival is on. Accessible by bus or dedicated cable car. Allow 2-3 hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low to Moderate (entrance fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk a Levada Surrounded by Spring Growth",
                    "where": "Various levadas (e.g., Levada dos Balcões, Levada do Furado)",
                    "description": "Enjoy hiking along the irrigation channels amidst lush vegetation and potentially wildflowers.",
                    "practical_tips": "Choose trail based on fitness. Check weather forecast. Wear appropriate footwear. Bring water.",
                    "best_time": "Morning / Early Afternoon",
                    "estimated_cost": "Low (transport) to Moderate (guided tour)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Ride the Funchal Cable Car to Monte",
                    "where": "Departs from Almirante Reis Garden",
                    "description": "Enjoy panoramic views over a vibrant Funchal on the ascent to Monte village.",
                    "practical_tips": "Can have queues, especially during festival time. Combine with Monte Palace Garden visit.",
                    "best_time": "Daytime, clear weather",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "16°C"
                },
                "precipitation": "Very low chance of rain. Consistently sunny and warm.",
                "general_tips": "Pack primarily summer clothing, but keep a light layer for evenings/mountains. Sunscreen essential."
            },
            "tourism_level": {
                "crowds": "Moderate to High. Still busy, but potentially slightly calmer if Flower Festival was earlier in the month.",
                "pricing": "High season prices generally standard.",
                "overall_atmosphere": "Beautiful late spring/early summer weather. Ideal conditions for exploring the whole island."
            },
            "events_holidays": [
                 {
                    "name": "Madeira Classic Car Revival (Often late May)",
                    "date": "Check specific dates (often weekend)",
                    "description": "Classic car show and rally held in Funchal (Praça do Povo usually), attracting enthusiasts and showcasing vintage automobiles.",
                    "notes": "Check annual dates and program if interested."
                 }
            ],
            "unique_experiences": [
                 {
                    "activity": "Visit Monte Palace Tropical Garden",
                    "where": "Monte",
                    "description": "Explore this stunning multi-level garden with its oriental pagodas, vast plant collection, lakes, tile panels, and museum spaces.",
                    "practical_tips": "Allow ample time (3+ hours). Wear comfortable shoes for walking slopes/steps. Accessible via cable car or bus.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entrance fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Hike to Pico Ruivo (Highest Peak)",
                    "where": "Starting from Achada do Teixeira (easier) or Pico do Arieiro (harder)",
                    "description": "Reach the highest point in Madeira for breathtaking 360-degree views above the clouds (weather permitting).",
                    "practical_tips": "Check weather forecast carefully (can change quickly!). Go early. Bring layers, water, food, sun protection. Route from Achada do Teixeira is shorter/easier.",
                    "best_time": "Early Morning, clear weather",
                    "estimated_cost": "Low (transport) to Moderate (taxi/transfer)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Dolphin & Whale Watching",
                    "where": "Departs from Funchal Marina",
                    "description": "Take a boat trip to spot marine life. May offers good chances to see dolphins and various whale species.",
                    "practical_tips": "Book in advance. Choose tours focused on responsible observation. Bring sunscreen.",
                    "best_time": "Morning or Afternoon",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                },
                 {
                    "activity": "Enjoy Sunset & Dinner in Zona Velha",
                    "where": "Funchal Old Town",
                    "description": "Relax at an outdoor table in the atmospheric Old Town, enjoying dinner and drinks as the evening cools down.",
                    "practical_tips": "Many restaurants to choose from. Can get busy; booking might be wise for popular spots.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        }
    }
}