{
  "neighborhoods": [
    {
      "name": "Vieux-Lille",
      "alternate_names": [
        "Old Lille",
        "Le Vieux-Lille"
      ],
      "character": "The historic heart of Lille with elegant 17th and 18th-century Flemish architecture, cobblestone streets, upscale boutiques, gourmet restaurants, and a sophisticated yet lively atmosphere.",
      "location": {
        "central": true,
        "description": "Located in the northern part of central Lille, Vieux-Lille is characterized by narrow streets, historic buildings, and a charming blend of French and Flemish architectural influences.",
        "borders": [
          "City Center",
          "Citadelle",
          "Euralille"
        ],
        "landmarks": [
          "Cathédrale Notre-Dame de la Treille",
          "Vieille Bourse",
          "Hospice Comtesse",
          "Place aux Oignons"
        ]
      },
      "history": {
        "overview": "Originally the medieval core of Lille, Vieux-Lille evolved from a merchant trading hub to become a wealthy district during the 17th century when Lille was under Flemish and Spanish rule before being conquered by Louis XIV in 1667.",
        "significance": "Represents the historical and cultural heritage of Lille, showcasing the city's unique blend of French and Flemish influences.",
        "notable_events": [
          "Spanish rule and architectural influence in the 16th-17th centuries",
          "Louis XIV's conquest in 1667 and subsequent French architectural additions",
          "Urban renewal and gentrification since the 1980s"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro stations: Rihour and Gare Lille Flandres (10-minute walk)",
          "Bus lines connecting to other districts",
          "Very limited parking - public garages at Grand Place recommended"
        ],
        "safety": "Very safe area both day and night, with frequent police patrols and good lighting.",
        "best_time_to_visit": "Weekday mornings for quiet exploration; Thursday to Saturday evenings for lively restaurant and bar atmosphere.",
        "walkability": "Extremely walkable with pedestrianized streets, though cobblestones may be challenging for some mobility needs."
      },
      "appeal": {
        "known_for": [
          "Historic architecture",
          "Upscale shopping",
          "Gourmet restaurants",
          "Art galleries"
        ],
        "atmosphere": [
          "Sophisticated",
          "Charming",
          "Lively but elegant"
        ],
        "best_for": [
          "History enthusiasts",
          "Luxury shoppers",
          "Couples",
          "Foodies"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 4,
        "green_spaces": 2,
        "shopping": 5,
        "dining": 5,
        "nightlife": 4,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Cathédrale Notre-Dame de la Treille",
            "type": "Religious site",
            "description": "Neo-Gothic cathedral with a striking modern facade completed in 1999, featuring a marble and glass wall that creates spectacular light effects.",
            "appeal": "Unique architectural blend of gothic and contemporary design elements."
          },
          {
            "name": "Hospice Comtesse",
            "type": "Museum",
            "description": "Former hospital founded in 1237, now a museum showcasing Flemish art, furniture, and regional history with a beautiful courtyard garden.",
            "appeal": "Authentic glimpse into Lille's past with well-preserved period rooms and artifacts."
          },
          {
            "name": "Place aux Oignons",
            "type": "Historic square",
            "description": "Charming small square surrounded by traditional Flemish architecture, once home to the city's onion market.",
            "appeal": "One of the most picturesque spots in Vieux-Lille, perfect for photography."
          }
        ],
        "dining": [
          {
            "name": "Bloempot",
            "cuisine": "Modern Flemish",
            "price_range": "€€€",
            "known_for": "Creative farm-to-table cuisine by Top Chef finalist Florent Ladeyn",
            "atmosphere": "Rustic-chic with open kitchen"
          },
          {
            "name": "Estaminet T'Rijsel",
            "cuisine": "Traditional Flemish",
            "price_range": "€€",
            "known_for": "Authentic regional dishes like carbonnade flamande and welsh",
            "atmosphere": "Cozy tavern with traditional decor"
          },
          {
            "name": "La Petite Table",
            "cuisine": "Modern French",
            "price_range": "€€",
            "known_for": "Seasonally changing menu in an intimate setting",
            "atmosphere": "Elegant yet welcoming"
          }
        ],
        "activities": [
          {
            "name": "Luxury Shopping",
            "type": "Retail experience",
            "description": "Browse high-end boutiques on Rue de la Grande Chaussée and Rue Esquermoise for fashion, home goods, and gourmet products.",
            "suitable_for": [
              "Fashion enthusiasts",
              "Luxury shoppers",
              "Souvenir hunters"
            ]
          },
          {
            "name": "Architectural Walking Tour",
            "type": "Self-guided exploration",
            "description": "Discover the distinctive 17th-century Flemish baroque architecture with ornate facades, courtyards, and historic details.",
            "suitable_for": [
              "History buffs",
              "Photographers",
              "Architecture enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You value historic charm and architectural beauty",
        "You enjoy upscale shopping and fine dining",
        "You want to be within walking distance of major cultural attractions"
      ],
      "avoid_if": [
        "You're on a tight budget",
        "You prefer modern accommodations with extensive amenities",
        "You need easy parking access"
      ],
      "insider_tips": [
        "Visit the specialty cheese shop Phillipe Olivier on Rue du Cure Saint-Etienne for an exceptional selection of regional cheeses.",
        "The small streets between Rue de la Monnaie and Rue Basse are less touristed and contain some of the district's best-preserved architecture.",
        "Sunday mornings offer a quieter atmosphere for photography and exploration before the restaurants fill up for lunch."
      ]
    },
    {
      "name": "Wazemmes",
      "alternate_names": [
        "Quartier Wazemmes"
      ],
      "character": "A vibrant, multicultural district known for its famous market, diverse culinary scene, artistic atmosphere, and authentic local lifestyle away from the typical tourist routes.",
      "location": {
        "central": false,
        "description": "Located southwest of the city center, Wazemmes is a lively residential area centered around the Place de la Nouvelle Aventure and its market hall.",
        "borders": [
          "City Center",
          "Moulins",
          "Bois-Blancs",
          "Faubourg de Béthune"
        ],
        "landmarks": [
          "Marché de Wazemmes",
          "Maison Folie Wazemmes",
          "Saint-Pierre-Saint-Paul Church",
          "Rue Jules Guesde"
        ]
      },
      "history": {
        "overview": "Originally a separate commune, Wazemmes was annexed by Lille in 1858 during the industrial revolution, becoming a working-class district with factories and worker housing.",
        "significance": "Represents Lille's industrial heritage and immigrant integration, now transformed into a cultural and creative hub while maintaining its authentic character.",
        "notable_events": [
          "Industrial development in the 19th century",
          "Immigration waves creating multicultural character",
          "Urban renewal and cultural regeneration since the 1990s"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro stations: Gambetta and Wazemmes",
          "Multiple bus lines",
          "V'Lille bike sharing stations"
        ],
        "safety": "Generally safe, but exercise normal urban precautions especially at night and around the market after closing.",
        "best_time_to_visit": "Sunday mornings for the famous market; Thursday and Friday evenings for lively bar scene.",
        "walkability": "Very walkable neighborhood with good pedestrian infrastructure."
      },
      "appeal": {
        "known_for": [
          "Wazemmes Market",
          "Multicultural atmosphere",
          "Affordable dining",
          "Alternative arts scene"
        ],
        "atmosphere": [
          "Vibrant",
          "Diverse",
          "Authentic",
          "Bohemian"
        ],
        "best_for": [
          "Budget travelers",
          "Foodies",
          "Culture enthusiasts",
          "Young travelers"
        ]
      },
      "categories": {
        "touristy": 2,
        "residential": 5,
        "green_spaces": 2,
        "shopping": 4,
        "dining": 5,
        "nightlife": 4,
        "cultural": 4,
        "historic": 2
      },
      "highlights": {
        "attractions": [
          {
            "name": "Marché de Wazemmes",
            "type": "Market",
            "description": "One of France's largest markets, especially lively on Sundays with hundreds of vendors selling everything from fresh produce to clothing and crafts.",
            "appeal": "Authentic local experience with vibrant colors, sounds, and flavors from multiple cultures."
          },
          {
            "name": "Maison Folie Wazemmes",
            "type": "Cultural center",
            "description": "Former textile factory converted into a contemporary cultural space hosting exhibitions, performances, and community events.",
            "appeal": "Symbol of the neighborhood's creative regeneration and cultural diversity."
          },
          {
            "name": "Halles de Wazemmes",
            "type": "Covered market",
            "description": "Historic covered market hall filled with food vendors selling specialty products, fresh ingredients, and prepared foods.",
            "appeal": "Culinary showcase of the region's products and multicultural influences."
          }
        ],
        "dining": [
          {
            "name": "Le Barbier qui fume",
            "cuisine": "Smokehouse/BBQ",
            "price_range": "€€",
            "known_for": "Craft BBQ with French influences and local beer selection",
            "atmosphere": "Hip and casual"
          },
          {
            "name": "La Vieille",
            "cuisine": "Traditional French and Flemish",
            "price_range": "€€",
            "known_for": "Classic regional dishes with generous portions",
            "atmosphere": "Rustic and welcoming"
          },
          {
            "name": "Le Comptoir Volant",
            "cuisine": "International street food",
            "price_range": "€",
            "known_for": "Creative global cuisine in a former industrial space",
            "atmosphere": "Industrial-chic and lively"
          }
        ],
        "activities": [
          {
            "name": "Sunday Market Experience",
            "type": "Cultural immersion",
            "description": "Explore the legendary Sunday market, sample diverse foods, and experience the neighborhood's multicultural energy.",
            "suitable_for": [
              "Foodies",
              "Photographers",
              "Culture enthusiasts"
            ]
          },
          {
            "name": "Bar Hopping",
            "type": "Nightlife",
            "description": "Discover the eclectic range of bars along Rue Massena, from traditional estaminets to trendy craft beer spots.",
            "suitable_for": [
              "Nightlife enthusiasts",
              "Beer lovers",
              "Young travelers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You seek authentic local experiences away from tourist areas",
        "You enjoy vibrant food and nightlife scenes",
        "You appreciate cultural diversity and artistic atmospheres"
      ],
      "avoid_if": [
        "You prefer quiet, upscale neighborhoods",
        "You're uncomfortable in bustling, diverse urban settings",
        "You want primarily historical or traditional experiences"
      ],
      "insider_tips": [
        "Visit the Wazemmes market early on Sunday (before 11am) to avoid the largest crowds while still experiencing the vibrant atmosphere.",
        "Explore the side streets off Rue Jules Guesde for hidden street art and eclectic boutiques.",
        "Many bars offer happy hour specials from 6-8pm, perfect for pre-dinner apéritifs."
      ]
    },
    {
      "name": "Euralille",
      "alternate_names": [
        "Lille-Centre",
        "Business District"
      ],
      "character": "A modern, dynamic business and shopping district centered around Lille's transportation hub, featuring bold contemporary architecture, major retail centers, and efficient urban planning.",
      "location": {
        "central": true,
        "description": "Positioned between Lille's two main train stations and the historic center, Euralille is a purpose-built district developed in the 1990s as part of the city's modernization.",
        "borders": [
          "Vieux-Lille",
          "City Center",
          "Saint-Maurice Pellevoisin"
        ],
        "landmarks": [
          "Lille Europe Station",
          "Lille Flandres Station",
          "Euralille Shopping Center",
          "Grand Palais"
        ]
      },
      "history": {
        "overview": "Conceived in the early 1990s coinciding with the opening of the Channel Tunnel, Euralille was designed by renowned architect Rem Koolhaas as a futuristic business district to position Lille as a major European hub.",
        "significance": "Symbolizes Lille's economic transformation from an industrial city to a modern service-oriented metropolis and transportation crossroads.",
        "notable_events": [
          "Opening of Lille Europe TGV station in 1994",
          "Development of the Euralille commercial center",
          "Designation as European Capital of Culture in 2004 which accelerated development"
        ]
      },
      "practical_info": {
        "transit": [
          "Major transit hub with two train stations (Lille Europe and Lille Flandres)",
          "Metro stations: Lille Flandres and Lille Europe",
          "Multiple bus lines and tram connections"
        ],
        "safety": "Very safe area with constant activity and security presence, though take normal precautions around the train stations.",
        "best_time_to_visit": "Weekdays for business atmosphere; weekends for shopping with fewer commuters.",
        "walkability": "Excellent walkability with modern infrastructure designed for pedestrians."
      },
      "appeal": {
        "known_for": [
          "Contemporary architecture",
          "Major shopping center",
          "Transportation hub",
          "Business district"
        ],
        "atmosphere": [
          "Modern",
          "Bustling",
          "International",
          "Efficient"
        ],
        "best_for": [
          "Business travelers",
          "Architecture enthusiasts",
          "Shoppers",
          "Day-trippers"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 2,
        "green_spaces": 2,
        "shopping": 5,
        "dining": 3,
        "nightlife": 2,
        "cultural": 2,
        "historic": 1
      },
      "highlights": {
        "attractions": [
          {
            "name": "Lille Europe Station",
            "type": "Architectural landmark",
            "description": "Contemporary transportation hub designed by Jean-Marie Duthilleul, connecting Lille to London, Brussels, and Paris via high-speed rail.",
            "appeal": "Striking modern architecture and symbol of Lille's connected position in Europe."
          },
          {
            "name": "Euralille Mall",
            "type": "Shopping center",
            "description": "Large commercial complex designed by Jean Nouvel featuring over 120 shops, restaurants, and services.",
            "appeal": "One-stop shopping destination with international and French brands."
          },
          {
            "name": "Casino Lucien Barrière",
            "type": "Entertainment venue",
            "description": "Modern casino offering gaming tables, slot machines, and entertainment options.",
            "appeal": "Adult entertainment and nightlife venue in the heart of the business district."
          }
        ],
        "dining": [
          {
            "name": "Les Frangins",
            "cuisine": "Modern French Bistro",
            "price_range": "€€",
            "known_for": "Quality lunch menus popular with business clientele",
            "atmosphere": "Contemporary and efficient"
          },
          {
            "name": "El Mercado",
            "cuisine": "Spanish Tapas",
            "price_range": "€€",
            "known_for": "Authentic tapas and Spanish wines",
            "atmosphere": "Lively and convivial"
          },
          {
            "name": "L'Île de Crète",
            "cuisine": "Greek",
            "price_range": "€€",
            "known_for": "Mediterranean specialties in a casual setting",
            "atmosphere": "Relaxed with blue and white decor"
          }
        ],
        "activities": [
          {
            "name": "Architectural Tour",
            "type": "Self-guided exploration",
            "description": "Discover the bold contemporary buildings designed by star architects like Rem Koolhaas, Jean Nouvel, and Christian de Portzamparc.",
            "suitable_for": [
              "Architecture enthusiasts",
              "Photographers",
              "Design lovers"
            ]
          },
          {
            "name": "Shopping Experience",
            "type": "Retail therapy",
            "description": "Explore the multi-level Euralille mall and surrounding retail areas offering everything from luxury brands to daily necessities.",
            "suitable_for": [
              "Shoppers",
              "Fashion enthusiasts",
              "Rainy day activity seekers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You're traveling by train and value convenience to transportation",
        "You're on a short visit or business trip",
        "You prefer modern hotels with full amenities"
      ],
      "avoid_if": [
        "You seek authentic local character and charm",
        "You prefer historic architecture and quiet streets",
        "You want to avoid busy, commercial environments"
      ],
      "insider_tips": [
        "The top level of Euralille mall offers several restaurants with good views of the city.",
        "The Lille Europe station contains a small grocery store open late, perfect for picking up supplies.",
        "The area between the two train stations can get congested - allow extra time during rush hours."
      ]
    },
    {
      "name": "Citadelle",
      "alternate_names": [
        "Bois de Boulogne",
        "Vauban"
      ],
      "character": "A peaceful, green district centered around Lille's historic star-shaped fortress, offering extensive parklands, recreational facilities, and a welcome natural escape from the urban environment.",
      "location": {
        "central": false,
        "description": "Located northwest of the city center, the Citadelle district is dominated by the 17th-century fortress and its surrounding 60-hectare park, creating a green lung for the city.",
        "borders": [
          "Vieux-Lille",
          "Bois-Blancs",
          "Vauban-Esquermes"
        ],
        "landmarks": [
          "Citadelle de Lille",
          "Parc de la Citadelle",
          "Zoo de Lille",
          "Canal de la Deûle"
        ]
      },
      "history": {
        "overview": "The district is defined by the pentagonal fortress designed by Vauban and built between 1667-1670 after Louis XIV's conquest of Lille, serving as both a defensive structure and a symbol of royal power.",
        "significance": "Represents the military heritage of Lille and the engineering genius of Vauban, whose fortification designs are UNESCO World Heritage listed.",
        "notable_events": [
          "Construction after Louis XIV's conquest in 1667",
          "Transformation of the surrounding area into public parks in the late 19th century",
          "Development as a recreational center in the modern era"
        ]
      },
      "practical_info": {
        "transit": [
          "Bus lines connecting to city center",
          "V'Lille bike sharing stations",
          "15-20 minute walk from Vieux-Lille"
        ],
        "safety": "Very safe area even after dark, with regular security patrols and good lighting on main paths.",
        "best_time_to_visit": "Weekday mornings for quiet exploration; weekend afternoons for people-watching and activities.",
        "walkability": "Excellent for walking with extensive paths and pedestrian areas throughout the park."
      },
      "appeal": {
        "known_for": [
          "Historic fortress",
          "Extensive parklands",
          "Recreational activities",
          "Lille Zoo"
        ],
        "atmosphere": [
          "Peaceful",
          "Green",
          "Recreational",
          "Family-friendly"
        ],
        "best_for": [
          "Nature lovers",
          "Families",
          "Runners and cyclists",
          "History enthusiasts"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 2,
        "green_spaces": 5,
        "shopping": 1,
        "dining": 2,
        "nightlife": 1,
        "cultural": 3,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Citadelle de Lille",
            "type": "Historic fortress",
            "description": "Star-shaped 17th-century military fortress designed by Vauban, still partially used by the French military but offering guided tours of certain areas.",
            "appeal": "Exceptional example of military architecture and engineering from the era of Louis XIV."
          },
          {
            "name": "Parc de la Citadelle",
            "type": "Urban park",
            "description": "Extensive green space surrounding the fortress with walking and cycling paths, ponds, and recreational areas.",
            "appeal": "The largest and most beautiful park in Lille, perfect for outdoor activities and relaxation."
          },
          {
            "name": "Zoo de Lille",
            "type": "Zoo",
            "description": "Small, free zoo within the park housing around 70 species of animals in a historic setting.",
            "appeal": "Family-friendly attraction with conservation focus, particularly appealing with young children."
          }
        ],
        "dining": [
          {
            "name": "Le Guinguette de la Marine",
            "cuisine": "French bistro",
            "price_range": "€€",
            "known_for": "Waterside dining with views of the canal",
            "atmosphere": "Relaxed with terrace seating"
          },
          {
            "name": "La Friterie du Jardin de la Citadelle",
            "cuisine": "Belgian fries",
            "price_range": "€",
            "known_for": "Traditional frites with various sauces",
            "atmosphere": "Casual street food"
          }
        ],
        "activities": [
          {
            "name": "Citadelle Guided Tour",
            "type": "Historic tour",
            "description": "Join a guided visit of the fortress to learn about its military history and architectural significance.",
            "suitable_for": [
              "History buffs",
              "Architecture enthusiasts",
              "Cultural tourists"
            ]
          },
          {
            "name": "Recreational Activities",
            "type": "Outdoor pursuits",
            "description": "Enjoy running, cycling, boating on the canal, or fitness trails throughout the expansive parklands.",
            "suitable_for": [
              "Active travelers",
              "Families",
              "Fitness enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You value green space and quiet surroundings",
        "You're interested in military history and architecture",
        "You enjoy outdoor activities and recreation"
      ],
      "avoid_if": [
        "You want to be in the heart of urban activities",
        "You're seeking extensive dining or shopping options",
        "You prefer not to walk or cycle to reach city attractions"
      ],
      "insider_tips": [
        "The northwest corner of the park offers the least crowded areas for picnics and relaxation.",
        "Time your visit to the Citadelle for Thursday or Saturday afternoons when guided tours in English are more likely to be available.",
        "The canal path offers a pleasant alternative route to walk or cycle from the Citadelle to the Bois-Blancs neighborhood and beyond."
      ]
    },
    {
      "name": "Vauban-Esquermes",
      "alternate_names": [
        "Vauban"
      ],
      "character": "An upscale residential neighborhood with tree-lined boulevards, stately homes, university campuses, and a quieter pace of life that attracts families and academics.",
      "location": {
        "central": false,
        "description": "Located southwest of the city center, Vauban-Esquermes is a primarily residential district known for its prestigious Catholic University, elegant architecture, and family-friendly atmosphere.",
        "borders": [
          "Citadelle",
          "Wazemmes",
          "Bois-Blancs"
        ],
        "landmarks": [
          "Catholic University of Lille",
          "Jardin Vauban",
          "Boulevard Vauban",
          "Eglise Saint-Michel"
        ]
      },
      "history": {
        "overview": "Developed in the late 19th century as Lille expanded beyond its original walls, Vauban became a prestigious residential area populated by the industrial bourgeoisie before evolving into an important educational district.",
        "significance": "Represents Lille's intellectual heritage and the prosperity of its industrial golden age, now preserved in an elegant residential setting.",
        "notable_events": [
          "Founding of the Catholic University in 1875",
          "Development of grand bourgeois houses in the Belle Époque era",
          "Growth of educational institutions throughout the 20th century"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro station: Port de Lille",
          "Bus lines connecting to city center",
          "V'Lille bike sharing stations"
        ],
        "safety": "Very safe district with low crime rates and well-maintained public spaces.",
        "best_time_to_visit": "Weekday afternoons to observe university life; weekends for quiet exploration of residential streets.",
        "walkability": "Very walkable with wide sidewalks and pleasant pedestrian areas."
      },
      "appeal": {
        "known_for": [
          "Prestigious university campus",
          "Elegant residential architecture",
          "Jardin Vauban park",
          "Intellectual atmosphere"
        ],
        "atmosphere": [
          "Refined",
          "Academic",
          "Residential",
          "Tranquil"
        ],
        "best_for": [
          "Education tourists",
          "Architecture enthusiasts",
          "Families",
          "Visitors seeking quiet areas"
        ]
      },
      "categories": {
        "touristy": 1,
        "residential": 5,
        "green_spaces": 3,
        "shopping": 2,
        "dining": 3,
        "nightlife": 2,
        "cultural": 4,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Catholic University of Lille",
            "type": "Educational institution",
            "description": "Prestigious private university founded in 1875 with impressive neo-Gothic architecture and a campus spread across several historic buildings.",
            "appeal": "Architecturally significant campus with beautiful chapel and courtyards open to visitors."
          },
          {
            "name": "Jardin Vauban",
            "type": "Public garden",
            "description": "English-style park dating from the 19th century featuring a lake, ornamental bridge, and lush plantings.",
            "appeal": "Peaceful green space ideal for relaxation away from the urban bustle."
          },
          {
            "name": "Église Saint-Michel",
            "type": "Religious site",
            "description": "Neo-Gothic church built in the late 19th century with impressive spire and stained glass windows.",
            "appeal": "Architectural landmark and spiritual center of the neighborhood."
          }
        ],
        "dining": [
          {
            "name": "Café Wax",
            "cuisine": "Café and light fare",
            "price_range": "€",
            "known_for": "Student-friendly café with specialty coffees and fresh snacks",
            "atmosphere": "Casual and youthful"
          },
          {
            "name": "La Clairière",
            "cuisine": "French contemporary",
            "price_range": "€€",
            "known_for": "Seasonal ingredients with creative presentation",
            "atmosphere": "Elegant but relaxed"
          },
          {
            "name": "La Terrasse des Remparts",
            "cuisine": "Traditional French",
            "price_range": "€€",
            "known_for": "Classic bistro dishes in a historic setting",
            "atmosphere": "Traditional with outdoor seating"
          }
        ],
        "activities": [
          {
            "name": "Architectural Walking Tour",
            "type": "Self-guided exploration",
            "description": "Discover the impressive 19th and early 20th century mansions and university buildings that line Boulevard Vauban and surrounding streets.",
            "suitable_for": [
              "Architecture enthusiasts",
              "Photographers",
              "History buffs"
            ]
          },
          {
            "name": "University Campus Visit",
            "type": "Educational interest",
            "description": "Explore the grounds and public areas of the Catholic University, including its impressive chapel and historic academic buildings.",
            "suitable_for": [
              "Education tourists",
              "History enthusiasts",
              "Architecture lovers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You prefer quiet, upscale residential neighborhoods",
        "You're visiting the Catholic University or related institutions",
        "You want a peaceful base that's still accessible to the city center"
      ],
      "avoid_if": [
        "You want to be in the heart of tourist attractions",
        "You're seeking vibrant nightlife and entertainment",
        "You prefer historic or very contemporary surroundings"
      ],
      "insider_tips": [
        "Visit the University's main chapel even if it's not normally on tourist itineraries - its architecture and stained glass are impressive.",
        "The area has several hidden squares and small parks beyond the main Jardin Vauban that offer quiet spots for reading or relaxation.",
        "Some university facilities host public lectures and cultural events - check bulletin boards or the university website for opportunities."
      ]
    }
  ]
}