{
    "Spring": {
        "activities": [
            {
                "name": "Lille International Market",
                "type": "Cultural Event",
                "description": "Experience one of Europe's largest street markets as Lille's city center transforms into a massive international bazaar with vendors from across Europe selling crafts, food, and unique products.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This April/May event brings hundreds of traders and thousands of visitors to Lille's streets, creating a festive atmosphere throughout the city center.",
                "booking_tips": "No booking required. Arrive early morning to avoid the biggest crowds and find the best selection. Bring cash as not all vendors accept cards."
            },
            {
                "name": "Wazemmes Flower Market",
                "type": "Market",
                "description": "Visit the vibrant Wazemmes Market when the flower stalls burst with color and seasonal blooms, offering everything from cut flowers to garden plants and botanical specialties.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings an explosion of tulips, daffodils, and local seasonal flowers to this historic market, particularly spectacular on Sunday mornings.",
                "booking_tips": "Visit early Sunday morning (before 10am) for the best selection and most pleasant shopping experience."
            },
            {
                "name": "Series Mania Festival",
                "type": "Festival",
                "description": "Attend this international television festival featuring premieres, meet-and-greets with creators and actors, and screenings of upcoming series from around the world.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This March festival transforms Lille into the capital of TV series with events at multiple venues including Le Nouveau Siècle and Tripostal.",
                "booking_tips": "Book tickets for popular screenings and master classes online in advance. Many public screenings are free but require reservation."
            },
            {
                "name": "Citadelle Park Bloom",
                "type": "Park",
                "description": "Explore Lille's largest park as it comes alive with spring blooms, offering perfect picnic spots, jogging paths, and boat rentals on the canal.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings lush greenery and flowering trees to this 60-hectare park built around Vauban's star-shaped fortress.",
                "booking_tips": "No booking required. Rent a rowboat at the small dock near the zoo entrance for a peaceful exploration of the park's waterways."
            },
            {
                "name": "Guided Tour of Lille's Secret Gardens",
                "type": "Guided Tour",
                "description": "Discover hidden courtyards and private gardens of Vieux-Lille that open to the public only during spring, revealing architectural and botanical treasures behind historic facades.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring is the only time to access many of these private spaces, with special permission granted during 'Rendez-vous aux Jardins' events in late May/early June.",
                "booking_tips": "Book through the Lille Tourism Office at least one week in advance as tour groups are kept small to respect the private nature of these spaces."
            },
            {
                "name": "Lille Piano Festival",
                "type": "Cultural Event",
                "description": "Experience this prestigious piano festival featuring world-class performers in various venues across the city, from the Opéra de Lille to intimate historic spaces.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "This spring event brings together classical and jazz piano virtuosos for performances in some of Lille's most beautiful architectural settings.",
                "booking_tips": "Book tickets at least one month in advance for popular recitals. Consider the festival pass for access to multiple performances at better value."
            },
            {
                "name": "Cycling the Canal de la Deûle",
                "type": "Outdoor Activity",
                "description": "Enjoy a spring bicycle ride along the scenic Canal de la Deûle path, extending from Lille to the neighboring towns through blooming countryside and industrial heritage sites.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring weather is perfect for cycling this flat, easy route with wildflowers blooming along the canal banks and outdoor cafés opening for the season.",
                "booking_tips": "Rent V'Lille bikes from stations throughout the city or book a guided cycling tour through the tourism office for historical context."
            },
            {
                "name": "Beer Workshop at Célestin",
                "type": "Workshop",
                "description": "Learn about regional brewing traditions in a hands-on workshop at a Lille craft brewery, creating your own beer with springtime ingredients and local expertise.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Workshops in spring often feature seasonal ingredients like local honey, spring herbs, and special yeasts that flourish in warmer weather.",
                "booking_tips": "Book at least two weeks in advance as classes are small. Your custom-brewed beer will be ready for pickup or shipping several weeks after the workshop."
            },
            {
                "name": "Le Printemps de l'Art Déco",
                "type": "Festival",
                "description": "Participate in this regional Art Deco festival with special exhibitions, building tours, and events highlighting the rich Art Deco heritage of Lille and surrounding cities.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "This March-June event spans the entire Hauts-de-France region, with Lille hosting special exhibitions and opening normally private Art Deco buildings.",
                "booking_tips": "Check the festival program online and book guided tours of specific buildings in advance, as many have limited capacity."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Lille Plage (Lille Beach)",
                "type": "Beach",
                "description": "Experience urban beach life at this summer installation featuring imported sand, palm trees, loungers, and water activities along the banks of the Deûle river and at various city locations.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This July-August event transforms areas of the city into beachfront spaces, with recreational activities, food stalls, and cultural performances.",
                "booking_tips": "No booking required. Arrive early to secure loungers, especially on weekends. Check the city's website for specific activities each day."
            },
            {
                "name": "Fête Nationale Celebrations",
                "type": "Festival",
                "description": "Join Lille's Bastille Day celebrations on July 14th with the traditional military parade, spectacular fireworks display, and public dances in the city center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This patriotic celebration brings locals and visitors together for one of France's most important national holidays.",
                "booking_tips": "For best fireworks viewing, find a spot along the Champ de Mars or near the Citadelle. Arrive several hours early for prime locations."
            },
            {
                "name": "Open-Air Cinema at Gare Saint Sauveur",
                "type": "Cinema",
                "description": "Enjoy free film screenings under the stars at this converted railway station that now serves as a cultural center with an outdoor cinema during summer evenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "The summer film program features classics, independent films, and family-friendly options in this unique post-industrial setting.",
                "booking_tips": "No formal booking required, but arrive at least an hour early to secure a good spot. Bring a blanket or cushion for comfort on the ground seating."
            },
            {
                "name": "Les Jeudis du Jazz",
                "type": "Concert",
                "description": "Experience free open-air jazz concerts every Thursday evening in various squares throughout Lille, showcasing local talent and international performers.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This summer concert series takes advantage of Lille's long summer evenings with performances that often continue until 10pm or later.",
                "booking_tips": "No booking required. Check the city's cultural program for weekly locations, which rotate between Grand Place, Place Rihour, and other public squares."
            },
            {
                "name": "Guinguette de la Marine",
                "type": "Food & Drink",
                "description": "Visit this seasonal waterside bar and restaurant along the Deûle canal, offering outdoor dining, cocktails, and weekend live music in a festive atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This summer pop-up venue recreates the traditional French riverside 'guinguette' experience with a modern twist.",
                "booking_tips": "Reserve tables for dinner in advance, especially for weekend evenings. Walk-ins are usually accommodated for drinks only seating."
            },
            {
                "name": "Wazemmes l'Accordéon Festival",
                "type": "Festival",
                "description": "Celebrate the accordion at this quirky neighborhood festival featuring concerts, street performances, dances, and workshops dedicated to this traditional instrument with modern interpretations.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free-Budget",
                "seasonal_notes": "This unique June festival brings together traditional French music with global accordion traditions in the multicultural Wazemmes district.",
                "booking_tips": "Most street performances are free, but book tickets for headliner concerts at venues like the Maison Folie Wazemmes in advance."
            },
            {
                "name": "Paddleboarding on the Deûle",
                "type": "Water Sport",
                "description": "Try stand-up paddleboarding on the calm waters of the Deûle canal, offering a unique perspective of Lille's waterfront landscapes and architectural landmarks.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions with gentle waters and pleasant temperatures for this increasingly popular water activity.",
                "booking_tips": "Book equipment and beginner lessons through Grand Huit or other water sports providers at least 24 hours in advance."
            },
            {
                "name": "Lille Beer Festival",
                "type": "Food & Drink",
                "description": "Sample hundreds of local and international craft beers at this celebration of brewing culture, featuring tastings, food pairings, and brewing demonstrations.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "This summer event highlights the rich beer heritage of the region with a focus on traditional Flemish brewing techniques and modern craft innovations.",
                "booking_tips": "Purchase tickets online before the event as they often sell out. Consider the VIP option for early entry and special tastings."
            },
            {
                "name": "LaM Summer Program",
                "type": "Museum",
                "description": "Participate in the Lille Métropole Museum of Modern Art's special summer activities, including outdoor sculpture walks, evening events, and family workshops in their expansive sculpture garden.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "The museum extends hours during summer and hosts special outdoor installations and performances throughout their sculpture park.",
                "booking_tips": "Book specialty workshops in advance through the museum website. The sculpture park is particularly beautiful in the evening light."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Braderie de Lille",
                "type": "Market",
                "description": "Experience Europe's largest flea market, a massive 48-hour event where millions of visitors hunt for treasures among thousands of vendors spread throughout the city streets.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This early September institution has been held for centuries, featuring antiques, second-hand goods, street food, and the famous mountain of mussel shells competition between restaurants.",
                "booking_tips": "Book accommodation at least 6 months in advance. Arrive at dawn for serious antiquing, or mid-morning for a more relaxed experience among the crowds."
            },
            {
                "name": "Flemish Autumn Beer Festival",
                "type": "Food & Drink",
                "description": "Discover the region's harvest beers and seasonal brews at this specialized beer festival celebrating the rich brewing traditions of French Flanders and Belgium.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn marks the release of special seasonal beers including harvest ales, pumpkin beers, and the highly anticipated Bière de Garde varieties.",
                "booking_tips": "Purchase tickets online at least two weeks in advance and download the festival app to plan your tasting route efficiently."
            },
            {
                "name": "Jazz en Nord Festival",
                "type": "Festival",
                "description": "Attend performances at this respected jazz festival featuring international artists performing in intimate venues throughout Lille and neighboring towns.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This October-November festival brings jazz performances to historical venues and theaters across the metropolitan area of Lille.",
                "booking_tips": "Book tickets for headliner acts at least a month in advance. Consider the festival pass for better value if attending multiple performances."
            },
            {
                "name": "Regional Cuisine Workshop",
                "type": "Workshop",
                "description": "Learn to prepare traditional Northern French dishes in a hands-on cooking class focused on autumn specialties and local seasonal ingredients.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn classes focus on hearty regional specialties like carbonnade flamande (beef and beer stew), potjevleesch (cold meat in jelly), and seasonal desserts with local apples and pears.",
                "booking_tips": "Book at least two weeks in advance through cooking schools like Cook & Go or L'Atelier des Chefs. Morning classes typically include lunch with beer pairings."
            },
            {
                "name": "Route du Houblon (Hop Route)",
                "type": "Excursion",
                "description": "Explore the hop-growing countryside north of Lille during harvest season, visiting hop farms, rural breweries, and charming Flemish villages.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September is hop harvest time, when the countryside is alive with activity and many farms open their doors to visitors for special tours and tastings.",
                "booking_tips": "Book a guided tour with transportation or create a self-driving itinerary. Many farms require advance notice for visits during this busy harvest period."
            },
            {
                "name": "Festival International du Court Métrage",
                "type": "Festival",
                "description": "Discover emerging filmmaking talent at Lille's International Short Film Festival, screening hundreds of short films from around the world in various venues across the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "This autumn festival transforms Lille into a showcase for innovative short-form filmmaking, with screenings organized by theme and genre.",
                "booking_tips": "Purchase a festival pass for the best value, or book individual screening blocks that interest you. Some masterclasses and workshops require separate registration."
            },
            {
                "name": "Autumn Walks in Parc Mosaïc",
                "type": "Park",
                "description": "Experience the spectacular fall colors at this unique park featuring gardens representing different cultures, with special autumn activities and artistic installations.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings stunning foliage to this park in the Lille metropolitan area, with special programming focused on harvest traditions from around the world.",
                "booking_tips": "Check the park's calendar for special events and guided tours. The park closes for winter in early November, making October visits ideal."
            },
            {
                "name": "Lille Photography Fair",
                "type": "Exhibition",
                "description": "Browse exhibitions, meet photographers, and attend workshops at this art fair dedicated to contemporary photography and visual storytelling.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "This autumn event attracts photography enthusiasts and collectors with exhibitions held in various locations throughout the city.",
                "booking_tips": "Purchase tickets online to avoid lines. Special workshops and portfolio reviews require separate registration well in advance."
            },
            {
                "name": "Allumoirs Festival",
                "type": "Cultural Event",
                "description": "Participate in this traditional northern French lantern procession where children parade through the streets with homemade lanterns ('allumoirs') singing traditional songs.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This charming autumn tradition takes place in various neighborhoods throughout October and November, often coinciding with Saint Martin's Day celebrations.",
                "booking_tips": "Check the city's cultural calendar for specific dates and neighborhoods. Lantern-making workshops are often held beforehand for visitors who wish to participate."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Lille Christmas Market",
                "type": "Market",
                "description": "Experience the magic of Lille's Christmas Village in Place Rihour with over 90 chalets offering festive foods, artisanal crafts, and holiday decorations in a twinkling winter wonderland.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "From late November to December 30th, the market transforms the city center with lights, decorations, and the aromas of mulled wine and gingerbread.",
                "booking_tips": "Visit on weekdays or early in the day on weekends to avoid the largest crowds. Evening visits offer the most magical atmosphere with all the lights illuminated."
            },
            {
                "name": "Palais des Beaux-Arts After Dark",
                "type": "Museum",
                "description": "Visit Lille's renowned fine arts museum during its special winter evening openings, featuring themed tours, music performances, and illuminated displays.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "During winter months, the museum extends hours on Thursday evenings with special programming and a cozy café serving seasonal treats.",
                "booking_tips": "Some specialty guided tours require advance booking through the museum website. The first Sunday of each month offers free entry."
            },
            {
                "name": "Winter Beer Tasting Tour",
                "type": "Food & Drink",
                "description": "Warm up with a guided tour of Lille's historic estaminets (traditional taverns) and modern craft breweries, sampling hearty winter beers and traditional snacks.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is ideal for sampling the region's stronger, warming beers like Bière de Noël (Christmas beer) and aged varieties in cozy, historic settings.",
                "booking_tips": "Book through the tourism office or specialized beer tour companies at least a week in advance. Tours run regardless of weather."
            },
            {
                "name": "Lille Patinoire (Ice Skating)",
                "type": "Outdoor Activity",
                "description": "Glide across the ice at Lille's seasonal outdoor skating rink in Place du Général de Gaulle, surrounded by historic architecture and festive decorations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "From December through February, this temporary rink offers winter fun in the heart of the city, with special music nights and skating demonstrations.",
                "booking_tips": "No advance booking needed. Skate rental is included in the entry fee. Weekday mornings are least crowded for beginners."
            },
            {
                "name": "Carnival de Wazemmes",
                "type": "Festival",
                "description": "Experience this lively neighborhood carnival with colorful parades, music, dance performances, and traditional giant puppets celebrating the approach of spring.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This February/March event brings color and warmth to the late winter, featuring distinctly northern French carnival traditions.",
                "booking_tips": "No booking required. Check local listings for the exact parade route and timing, which changes slightly each year."
            },
            {
                "name": "Festival Séries Mania",
                "type": "Festival",
                "description": "Attend one of Europe's premier television festivals featuring preview screenings of upcoming series, panel discussions with creators, and immersive experiences.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This late winter festival (typically March) brings television industry professionals and fans together for screenings throughout the city.",
                "booking_tips": "Many screenings are free but require online registration, which opens several weeks before the festival. Premium events with celebrities sell out quickly."
            },
            {
                "name": "Welsh Cooking Workshop",
                "type": "Workshop",
                "description": "Learn to prepare Lille's signature comfort food - the Welsh - a hearty beer and cheese dish perfect for cold winter days, along with other regional specialties.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter workshops focus on the hearty, warming dishes that define Northern French cuisine, with plenty of beer and cheese featuring prominently.",
                "booking_tips": "Book classes through Le Traiteur de Lille or other cooking schools at least two weeks in advance. Most classes include tastings of multiple regional dishes."
            },
            {
                "name": "Musée de l'Hospice Comtesse by Candlelight",
                "type": "Museum",
                "description": "Experience this historic museum in a magical atmosphere during special candlelit evening tours that bring the former hospital's medieval and Renaissance periods to life.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "These atmospheric winter tours offer a glimpse into the building's past with special lighting, storytelling, and occasionally period costumes.",
                "booking_tips": "Book these specialty tours at least two weeks in advance as they have limited capacity and are only offered on select winter evenings."
            },
            {
                "name": "Lille International Short Film Festival",
                "type": "Festival",
                "description": "Discover emerging cinematic talent at this festival showcasing hundreds of short films from around the world, with screenings, workshops, and director Q&As.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "This winter festival brings international filmmakers to Lille, with warm indoor theaters providing perfect refuge from cold winter days.",
                "booking_tips": "Purchase a festival pass for the best value or tickets for specific screening programs. Some venues are small, so book popular programs in advance."
            }
        ]
    }
}