{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Neujahrstag)",
          "notes": "New Year's Day is a public holiday throughout Switzerland. Most attractions and shops in Basel operate with limited hours. The city is relatively quiet as residents recover from New Year's Eve celebrations. Cold temperatures averaging around -1°C (30°F) and short daylight hours characterize this period. Basel often experiences snowfall and fog during January, with the Rhine River providing a dramatic winter backdrop to the city's medieval architecture."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "January is typically cold in Basel with temperatures between -2°C and 4°C (28°F to 39°F). This is the height of the low season for tourism, making it an excellent time to explore Basel's world-class museums without crowds, particularly the Kunstmuseum (Fine Arts Museum) and Fondation Beyeler. Winter sales begin in many shops throughout the city, offering good value for shoppers. The atmospheric Old Town (Altstadt) takes on a quiet charm in winter, with cozy cafés and restaurants offering traditional Swiss winter cuisine like fondue and raclette. The Three Kings Hotel offers its famous Basilisk afternoon tea, a warming tradition during the cold months. The Rhine River sometimes freezes partially along the edges, creating a unique winter landscape. The University of Basel, Switzerland's oldest university, continues its academic activities, and the city maintains its international business atmosphere with the pharmaceutical industry continuing operations."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": -2,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "February continues with winter conditions but sometimes features slightly milder days than January. Tourism remains low, making it an excellent time to enjoy Basel's incredible museum landscape, including the Museum Tinguely and the Basel Historical Museum. Valentine's Day is celebrated with special menus at many of Basel's fine restaurants and chocolatiers offer special creations. The Theater Basel and Kaserne Basel host various cultural performances as part of their winter program. Alpine skiing remains excellent in nearby Black Forest (Germany) and Swiss Jura mountains, easily accessible as day trips from the city."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "special": true,
          "event": "Basler Fasnacht Preparations",
          "notes": "The second half of February in Basel is dominated by preparations for Basler Fasnacht (Basel Carnival), the city's most important cultural event. Anticipation builds throughout the city as Fasnacht cliques (carnival groups) finalize their costumes, lanterns, and musical repertoires. The 'Gässle' (small unofficial parades) may take place in the evenings as groups practice their drumming and piccolo playing. Specialty Fasnacht pastries like Fastenwähe (cumin-flavored bread) begin appearing in bakeries. Some pre-Fasnacht events take place, including exhibitions of Fasnacht lanterns. The Museum der Kulturen often hosts special exhibitions related to masks and carnival traditions from around the world during this period."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": -1,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
          "score": 5,
          "special": true,
          "event": "Basler Fasnacht (Basel Carnival)",
          "notes": "Early March is typically when Basler Fasnacht (Basel Carnival) takes place, beginning on the Monday after Ash Wednesday at precisely 4:00 am with the Morgestraich. This UNESCO-recognized cultural event transforms Basel completely for 72 hours. Thousands of participants in elaborate costumes parade through the streets playing piccolos and drums, while large painted lanterns satirize political and social events. During these three days, the city operates around the clock with restaurants and bars serving traditional carnival foods like flour soup, onion and cheese tarts, and Fasnachtskiechli (carnival pastries). Tourism peaks during this period with visitors from around the world coming to experience this unique festival. Hotels are fully booked months in advance, and prices are at their yearly high."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "After Fasnacht, Basel becomes considerably quieter as the city returns to normal. Spring begins to emerge with temperatures gradually rising and the first flowers appearing along the Rhine. The period offers excellent value for travelers with good weather and few crowds. The city's parks like Schützenmattpark come alive with early spring blooms. The Rhine promenade begins to see more activity with locals enjoying the improving weather. This is an excellent time to explore Basel's Old Town and visit museums without the crowds of Fasnacht or summer. Easter celebrations may occur in late March (date varies yearly), bringing special church services, decorated fountains, and festive markets."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 2,
      "tourismLevel": 6
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "special": true,
          "event": "Easter Celebrations & Spring Festival",
          "notes": "Early April often coincides with Easter celebrations in Basel. The city's many historic churches hold special services, and the famous Münster (cathedral) is particularly impressive during this period. Basel's fountains are traditionally decorated with elaborate Easter decorations. The Spring Fair (Frühlingsmesse) brings amusement rides and food stalls to various squares throughout the city. The Spalentor and its surrounding gardens become particularly photogenic with spring blooms. This is also the beginning of the river cruise season on the Rhine, with many European river cruises starting or ending in Basel."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Art Basel Hong Kong & Spring Cultural Season",
          "notes": "Mid to late April brings increasingly pleasant weather with temperatures reaching the mid-teens Celsius. While Art Basel itself takes place in June, April sees Art Basel Hong Kong, generating increased activity in Basel's gallery scene in solidarity. Basel's cultural season is in full swing with performances at Theater Basel and Kaserne Basel. Parks and the banks of the Rhine become increasingly lively. The botanical garden at the University of Basel showcases colorful spring displays. This shoulder season offers good value and fewer crowds than the summer months while still providing comfortable conditions for sightseeing. Day trips to the nearby Black Forest in Germany or the Alsace region in France become increasingly popular as the weather improves."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Tag der Arbeit)",
          "notes": "May 1st is Labor Day and observed in Basel, though not as a full public holiday in all of Switzerland. Some political demonstrations and small parades take place in the city center. Many locals use this day to begin enjoying outdoor activities in earnest, gathering in parks and along the Rhine. Most businesses and tourist attractions remain open."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Ascension Day & Rhine Swimming Season Begins",
          "notes": "May brings reliably good weather to Basel with average temperatures between 9°C and 20°C (48-68°F). The city's parks and Rhine riverside areas become lively with outdoor activities. The Basel Rhine Swim season unofficially begins as water temperatures become more tolerable (though still quite cool). Ascension Day (40 days after Easter) is a public holiday in Switzerland with special events and outdoor gatherings. This is the beginning of the tourist season, but before the summer peak, making it an excellent time to visit with good weather and manageable crowds. The outdoor cafés in Barfüsserplatz and Marktplatz become popular spots for people-watching. The Museum Tinguely often hosts special spring exhibitions, and the Fondation Beyeler's gardens are particularly beautiful during this time. Ferry services across the Rhine using only the natural current (Fähri) become increasingly popular with tourists."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 9,
      "tourismLevel": 5
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Rhine Festival (Rhyfest) & ImFluss Cultural Festival",
          "notes": "Early to mid-June brings summer weather to Basel. The Rhine Festival (Rhyfest) transforms the riverbanks into a celebration of local culture, food, and music. The ImFluss Festival begins, hosting concerts on a floating stage on the Rhine. Outdoor dining becomes extremely popular along the Rhine and in the Old Town. Swimming in the Rhine becomes a daily activity for locals, with the distinctive Wickelfisch waterproof bags (shaped like fish) appearing throughout the city as people float downstream. Pentecost (Whit Monday) is a public holiday falling 50 days after Easter, often in June."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Art Basel",
          "notes": "The highlight of June is Art Basel, one of the world's premier international art fairs. This prestigious event transforms the city into the global center of the art world for one week, with hundreds of galleries participating and thousands of artists, collectors, curators, and art enthusiasts attending. The main exhibition takes place at the Messe Basel, but the entire city becomes a canvas with numerous parallel events, exhibitions, and installations at museums and galleries throughout Basel. Hotels are fully booked months in advance, and prices reach their peak. Beyond Art Basel, June offers long daylight hours (up to 16 hours) and pleasant temperatures, creating perfect conditions for exploring Basel's historic center and taking Rhine river cruises. Outdoor cafés and beer gardens are filled with locals and visitors."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Basel Tattoo & ImFluss Festival",
          "notes": "July is one of the warmest months in Basel with temperatures averaging 26°C (79°F) but sometimes reaching 32°C (90°F) or higher. This is high tourist season with visitors from around the world. The Basel Tattoo, the second-largest military tattoo in the world, takes place in late July, featuring performances by international military bands, traditional folk musicians, dancers, and precision drill teams in the historic barracks courtyard. The ImFluss Festival continues with concerts on the floating Rhine stage. Swimming in the Rhine reaches its peak popularity, with thousands of locals and tourists floating down the river daily. Many locals take their summer holidays in July, giving the city a slightly more tourist-oriented feel. The international character of Basel is evident with the many languages heard throughout the city. Evening cultural events take place in the courtyards of the Old Town. The Basel Paper Mill Museum (Basler Papiermühle) offers hands-on papermaking workshops, particularly popular with families visiting during summer holidays."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 15,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Swiss National Day (Bundesfeiertag)",
          "notes": "August 1st is Swiss National Day, celebrating the founding of the Swiss Confederation in 1291. Basel hosts numerous events including fireworks over the Rhine, traditional performances, and official ceremonies. Festivities take place in public squares and along the riverfront. Most businesses close for the holiday, but tourist attractions remain open. The Münster (cathedral) is illuminated, and a special patriotic program takes place on Münsterplatz. This is one of the most festive days in the Swiss calendar."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Rhine Swimming & Summer Cultural Events",
          "notes": "August continues with warm summer conditions, perfect for enjoying Basel's outdoor attractions. Rhine swimming remains extremely popular, with the annual Rhine Swim event (Basler Rheinschwimmen) typically taking place in mid-August, when thousands of participants swim downstream together in a festive atmosphere. Cultural events continue throughout the city, with outdoor cinema screenings in various locations including the courtyard of the Kunstmuseum. The weather remains warm and ideal for outdoor activities and swimming in the Rhine. Tourism begins to decrease slightly from the June/July peak, creating a good balance of lively atmosphere without extreme crowds. This is considered one of the best times to visit Basel, with good weather and slightly fewer tourists than at peak times. Families with children begin to return home for the school year toward the end of the month, making accommodations somewhat easier to find. The botanical garden at the University of Basel showcases its summer collections, and the Rhine ferries (Fähri) operate at full capacity. Basel's location at the border of three countries makes it an ideal base for day trips to the Alsace wine region in France and the Black Forest in Germany."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 14,
      "tourismLevel": 7
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Herbstmesse Preparations & European Heritage Days",
          "notes": "September brings autumn to Basel with pleasant temperatures around 21°C (70°F) and beautiful fall colors beginning to appear in parks and the surrounding countryside. This is grape harvest season in the nearby wine regions of Alsace (France) and Baden (Germany), with many wineries offering special events and tastings easily accessible from Basel. Tourism decreases as European summer holidays end, making this an excellent time to visit with good weather and fewer crowds. The European Heritage Days (usually mid-September) provide access to many historical buildings and monuments not normally open to the public, particularly interesting in a city with Basel's rich architectural heritage. Rhine swimming continues to be popular in early September, though water temperatures begin to cool by the end of the month. Preparations begin for the autumn Herbstmesse (Autumn Fair). This is widely considered one of the best months to visit Basel with its golden light, comfortable temperatures, and authentic atmosphere as locals return to their routines after summer holidays. Basel's reputation as Switzerland's cultural capital is evident with the beginning of the new theater and concert season. The Kunstmuseum and other major museums typically unveil their fall exhibitions during this period."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 11,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Autumn Cultural Season & Herbstmesse (Autumn Fair)",
          "notes": "October brings autumn colors to their peak in Basel, with city parks and the Rhine promenade showing stunning foliage. Temperatures cool significantly with averages around 7-16°C (45-61°F). The highlight of October is the beginning of the Herbstmesse (Autumn Fair), Switzerland's oldest and largest fair dating back to 1471. Opening in late October, the fair spreads across several squares in the city, featuring amusement rides, food stalls, and market vendors selling crafts and seasonal specialties. Basel's cultural season is in full swing with theaters, concert halls, and museums presenting their new programs. The Basel wine region celebrates the harvest with special events and tastings. Tourism continues to decrease, creating good opportunities for value accommodation and uncrowded attractions. Foggy mornings become more common, sometimes creating atmospheric views along the Rhine. This is a good time for museum visits, with the Kunstmuseum and Museum Tinguely being particularly popular. Autumn specialties appear on restaurant menus with game dishes and seasonal vegetables featuring prominently. Halloween celebrations, while not traditionally Swiss, have grown in popularity in recent years, especially among younger people."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 7,
      "tourismLevel": 4
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day (Allerheiligen)",
          "notes": "All Saints' Day on November 1st is observed in the Basel region. Churches hold special services, and some people visit cemeteries to honor deceased family members. The Münster (cathedral) often hosts special musical programs. While not a public holiday in Basel itself, the day has cultural significance especially in nearby Catholic communities."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "special": true,
          "event": "Herbstmesse & Early Christmas Market Preparations",
          "notes": "November brings increasingly cold conditions to Basel, with temperatures around 3-9°C (37-48°F) and daylight hours significantly reduced. The first half of November sees the continuation of the Herbstmesse (Autumn Fair), bringing life and color to the darkening days. This is low season for tourism, though the city maintains a vibrant local atmosphere with cultural events and cozy indoor activities. Traditional winter foods appear on restaurant menus, with fondue and raclette being particularly popular. The Museum Tinguely and the Kunstmuseum host major winter exhibitions, offering visitors rich cultural experiences indoors. Toward the end of November, preparations begin for the famous Basel Christmas Market, with decorations appearing throughout the city center. Basler Läckerli (traditional hard spiced biscuits) begin to appear in bakeries and shops. The spectacular Christmas illuminations are usually switched on in late November, creating a magical atmosphere in the Old Town. Basel's pharmaceutical and chemical companies host various conferences and events, sometimes bringing specific groups of visitors to the city."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "special": true,
          "event": "Basel Christmas Market",
          "notes": "December brings winter conditions with temperatures around 1-6°C (34-43°F) and very short daylight hours. The highlight of December in Basel is the Christmas Market, considered one of the prettiest and most authentic in Europe. Located primarily in Barfüsserplatz and Münsterplatz, the market features beautifully decorated stalls selling crafts, decorations, and seasonal foods like Glühwein (mulled wine), raclette, and Basel's famous Läckerli biscuits. The Old Town is magnificently decorated with thousands of lights and Christmas trees, creating a magical atmosphere. Johann Wanner's Christmas House, world-famous for its handcrafted Christmas ornaments, attracts visitors from around the globe. Special Advent concerts take place in Basel's historic churches, particularly the Münster (cathedral). The Theater Basel typically presents seasonal productions including ballet performances of The Nutcracker. Many restaurants offer special Christmas menus featuring traditional Swiss holiday dishes. This period sees an increase in tourism, particularly from neighboring countries, with weekends being especially busy at the Christmas Market. Shopping streets like Freie Strasse are beautifully decorated and lively with holiday shoppers."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Heiligabend & Weihnachten)",
          "notes": "Christmas is celebrated both on Christmas Eve (December 24) and Christmas Day (December 25) in Basel. Christmas Eve typically features family gatherings and traditional meals, while Christmas Day is a public holiday with continued celebrations. Boxing Day (December 26) is also a public holiday in the region. Many restaurants and attractions close early on Christmas Eve and may remain closed on Christmas Day and Boxing Day. The Christmas Market ends before Christmas Eve. Church services, particularly Midnight Mass at the Münster, are important traditions. Public transportation runs on limited schedules. Despite this, winter tourism remains steady as international visitors arrive for holiday celebrations and winter sports in nearby Black Forest and Swiss Jura mountains."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees Basel quiet but festive. Winter activities like visiting museums and shopping at post-Christmas sales are popular among tourists. Many restaurants and shops reopen after brief Christmas closures. The Museum Tinguely and Fondation Beyeler often have special winter exhibitions during this period. The Old Town takes on a peaceful charm, with holiday decorations still illuminating the streets. Hotels may be busy with visitors using Basel as a base for skiing in nearby resorts or for business purposes related to Basel's pharmaceutical industry."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Silvester)",
          "notes": "New Year's Eve celebrations center around the Rhine and the Old Town, with various events and parties throughout the city. Many restaurants offer special New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. At midnight, an unofficial fireworks display takes place along the Rhine, with the best viewing spots on the Mittlere Brücke (Middle Bridge) and the riversides. The city's many bars and clubs host special events, typically with advance tickets required. This attracts both locals and tourists, bringing a festive atmosphere to end the year. The Grand Hotel Les Trois Rois offers one of the most prestigious New Year's celebrations in the city."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 1,
      "tourismLevel": 4
    }
  },
  "activityTypes": {
    "spring": [
      "Experiencing the Basler Fasnacht (Basel Carnival) in March",
      "Exploring the botanical garden's spring flower displays",
      "Taking a Rhine river cruise as the season begins",
      "Visiting world-class museums like Kunstmuseum and Fondation Beyeler",
      "Attending spring cultural events at Theater Basel",
      "Enjoying the Spring Fair (Frühlingsmesse) in April",
      "Cycling along the Rhine River paths",
      "Outdoor 'café culture' as terraces reopen for the season",
      "Day trips to nearby Alsace (France) and Black Forest (Germany)"
    ],
    "summer": [
      "Swimming in the Rhine with a Wickelfisch waterproof bag",
      "Attending Art Basel in June",
      "Experiencing the Basel Tattoo military music festival in July",
      "Swiss National Day celebrations (August 1)",
      "Joining the annual Rhine Swim event (Rheinschwimmen) in August",
      "Attending concerts at the ImFluss Festival on the floating Rhine stage",
      "Dining at outdoor restaurants and riverside terraces",
      "Evening boat cruises on the Rhine",
      "Exploring the medieval Old Town and its many hidden courtyards"
    ],
    "autumn": [
      "Exploring autumn colors in parks and along the Rhine",
      "Wine tasting in nearby wine regions of Alsace and Baden",
      "Museum visits to Kunstmuseum, Museum Tinguely, and Fondation Beyeler",
      "Attending the Herbstmesse (Autumn Fair) in October/November",
      "Experiencing premieres of Basel's cultural season",
      "Shopping in boutiques along Freie Strasse",
      "Walking around the Old Town with fewer tourists",
      "Visiting European Heritage Days sites (September)",
      "Day trips to surrounding countryside with beautiful fall foliage"
    ],
    "winter": [
      "Basel Christmas Market at Barfüsserplatz and Münsterplatz",
      "Visiting Johann Wanner's world-famous Christmas House",
      "Ice skating at seasonal rinks",
      "New Year's Eve celebrations around the Rhine",
      "Warming up in historic cafés with hot chocolate and Basel Läckerli",
      "Shopping during winter sales (typically January)",
      "Museum explorations including special winter exhibitions",
      "Day trips to nearby ski resorts in the Black Forest and Swiss Jura",
      "Preparing for and anticipating Basler Fasnacht (late winter)"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, cold or wet weather, very low tourism (some business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, limited activities or accessibility"
  }
}