{
    "Spring": {
        "activities": [
            {
                "name": "Basel Fasnacht",
                "type": "Festival/Cultural Event",
                "description": "Experience Switzerland's largest carnival celebration, recognized by UNESCO as Intangible Cultural Heritage. Watch the processions of 'Cliques' with their lanterns, costumes, and unique music (Guggemusik). The festival begins with 'Morgestraich' at 4am when all city lights go out.",
                "indoor": false,
                "best_time": "Three days starting Monday after Ash Wednesday (February/March)",
                "price_range": "Free (Spectating)/Budget (Food/Drinks)",
                "seasonal_notes": "The city comes alive with round-the-clock festivities. Very crowded but offers authentic Basel culture.",
                "booking_tips": "Book accommodation well in advance. Stay near the Old Town for easy access to events. Bring warm clothing for Morgestraich."
            },
            {
                "name": "Rhine Promenade Strolling",
                "type": "Leisure/Nature",
                "description": "Enjoy the awakening spring along Basel's beautiful Rhine promenade. Walk from Mittlere Brücke toward Dreiländereck (Three Countries Corner) or in the opposite direction toward Wettsteinbrücke, enjoying riverside cafes and views.",
                "indoor": false,
                "best_time": "Daytime (March-May)",
                "price_range": "Free (Walking)/Budget (Cafe stops)",
                "seasonal_notes": "The river banks become lively as the weather warms. Cherry trees bloom along certain sections.",
                "booking_tips": "No booking required. Combine with stops at the various riverside 'Buvettes' (seasonal kiosks) that begin to open."
            },
            {
                "name": "Fondation Beyeler in Spring",
                "type": "Art/Culture",
                "description": "Visit Switzerland's most popular art museum, housed in a Renzo Piano building surrounded by beautiful park grounds that are especially lovely in spring. The museum features rotating world-class exhibitions alongside its permanent collection.",
                "indoor": true,
                "best_time": "Daytime (Check for current exhibitions)",
                "price_range": "Moderate-High (Museum entry)",
                "seasonal_notes": "The museum's grounds and water lily pond make for pleasant spring viewing alongside the art.",
                "booking_tips": "Check the website for current exhibitions. Book tickets online. Easily accessible via tram from city center."
            },
            {
                "name": "Basel Spring Trade Fair (Muba)",
                "type": "Exhibition/Trade Show",
                "description": "If scheduled, visit Switzerland's oldest trade fair, with hundreds of exhibitors showcasing lifestyle products, innovations, and regional specialties. The fair has evolved over the years, so check current format.",
                "indoor": true,
                "best_time": "Usually February-March (Check if running and exact dates)",
                "price_range": "Moderate (Entry ticket)",
                "seasonal_notes": "A longstanding Basel tradition that signals the approach of spring.",
                "booking_tips": "Check if the fair is scheduled, as format has changed in recent years. Buy tickets online to avoid queues."
            },
            {
                "name": "Merian Gardens (Merian Gärten)",
                "type": "Nature/Gardens",
                "description": "Explore Basel's beautiful botanical gardens in suburban Brüglingen as spring flowers bloom. The 18-hectare park features themed gardens, historic villa, greenhouse collections, and Switzerland's largest iris collection.",
                "indoor": false,
                "best_time": "Daytime (April-May for spring blooms)",
                "price_range": "Free/Budget",
                "seasonal_notes": "Beautiful spring blooms and peaceful atmosphere away from the city center.",
                "booking_tips": "Take tram 10/11 to Münchensteinerstrasse. Check website for seasonal bloom highlights and events."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Rhine Swimming",
                "type": "Leisure/Recreation",
                "description": "Join locals in the beloved tradition of floating down the Rhine River. Using a 'Wickelfisch' (waterproof swim bag shaped like a fish) to keep belongings dry, swim with the current from Schwarzwaldbrücke to various exit points downriver.",
                "indoor": false,
                "best_time": "Daytime (June-August, warm sunny days)",
                "price_range": "Free (Swimming)/Budget (Wickelfisch purchase)",
                "seasonal_notes": "A quintessential Basel summer activity. Water is clean but current can be strong. Pay attention to official swimming areas only.",
                "booking_tips": "Purchase a Wickelfisch at local shops or tourist office. Check water conditions and follow safety guidelines. Exit before the harbor area."
            },
            {
                "name": "Im Fluss Festival",
                "type": "Music/Cultural",
                "description": "Enjoy this summer music festival featuring concerts on a floating stage in the Rhine. Watch from the riverbanks as diverse musicians perform against the backdrop of the flowing river and historic cityscape.",
                "indoor": false,
                "best_time": "Evenings (July-August, check schedule)",
                "price_range": "Free (Most performances)",
                "seasonal_notes": "Relaxed atmosphere with audiences gathering along the riverbanks.",
                "booking_tips": "Check the festival website for program and dates. Arrive early to secure a good viewing spot along the river."
            },
            {
                "name": "Basel Tattoo",
                "type": "Music/Cultural Event",
                "description": "Experience Switzerland's largest open-air event after the Montreux Jazz Festival. This military music spectacle features international bands, precision drilling, and traditional performances in the historic barracks courtyard.",
                "indoor": false,
                "best_time": "Late July (Check exact dates)",
                "price_range": "Moderate-High (Tickets)",
                "seasonal_notes": "Very popular event with spectacular performances and a parade through the city.",
                "booking_tips": "Purchase tickets well in advance. Consider the parade through the city (free) if tickets are sold out."
            },
            {
                "name": "Rhine Festival (Rhein Fescht)",
                "type": "Festival/Fireworks",
                "description": "Celebrate Basel's relationship with its river during this festival with food stalls, music, activities along the banks, and spectacular fireworks over the Rhine, synchronized to music.",
                "indoor": false,
                "best_time": "Mid-July (Check specific dates)",
                "price_range": "Free (Entry)/Budget-Moderate (Food/Drinks)",
                "seasonal_notes": "Major summer highlight attracting large crowds, especially for fireworks.",
                "booking_tips": "Stake out a riverside viewing spot early for the fireworks. The Mittlere Brücke area gets extremely crowded."
            },
            {
                "name": "Open-Air Cinema Basel",
                "type": "Entertainment/Cinema",
                "description": "Watch films under the stars in the unique setting of the courtyard of the Basel Cathedral or at locations like Orange Cinema, depending on the year's program. Enjoy new and classic films in a beautiful outdoor setting.",
                "indoor": false,
                "best_time": "Evenings (July-August, check schedule)",
                "price_range": "Moderate (Tickets)",
                "seasonal_notes": "Screenings start after sunset. Food and drinks often available for purchase.",
                "booking_tips": "Book tickets online in advance. Bring something to sit on if not provided. Dress in layers as evenings can cool down."
            },
            {
                "name": "Basel Zoo (Zolli)",
                "type": "Family/Nature",
                "description": "Visit Switzerland's oldest and largest zoo, home to over 600 species. Summer allows viewing of many animals in their outdoor enclosures, including the African savanna section and the famous Basel elephant family.",
                "indoor": false,
                "best_time": "Daytime (Morning or late afternoon to avoid midday heat)",
                "price_range": "Moderate (Entry tickets)",
                "seasonal_notes": "Popular family attraction. Animals are often more active in summer mornings and evenings.",
                "booking_tips": "Purchase tickets online. Easily accessible via public transport. Allow at least half a day to explore fully."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Herbstmesse (Autumn Fair)",
                "type": "Fair/Festival",
                "description": "Experience Switzerland's largest and oldest fair, dating back to 1471. Spread across several city squares, it features rides, market stalls, food vendors (try the traditional 'Mässmogge' candy), and attractions for all ages.",
                "indoor": false,
                "best_time": "Late October - Mid November (Check exact dates)",
                "price_range": "Free (Entry)/Budget-Moderate (Rides/Food)",
                "seasonal_notes": "A beloved tradition marking the autumn season. Different squares offer different atmospheres - from traditional markets to modern rides.",
                "booking_tips": "Visit Münsterplatz for traditional stalls, Barfüsserplatz and Messeplatz for rides. Purchase 'Mässmogge' sweets as a traditional treat."
            },
            {
                "name": "Basel Autumn Wine Fair",
                "type": "Food & Drink",
                "description": "Sample wines from Swiss regions and international producers at this annual wine fair, typically held at the Messe Basel exhibition center.",
                "indoor": true,
                "best_time": "Late October/Early November (Check exact dates)",
                "price_range": "Moderate (Entry ticket includes tastings)",
                "seasonal_notes": "Good opportunity to discover Swiss wines not widely exported.",
                "booking_tips": "Purchase tickets online. Consider using public transport as wine tasting is involved. Check if masterclasses are offered if you're a wine enthusiast."
            },
            {
                "name": "Art Basel Cities Week",
                "type": "Art/Cultural",
                "description": "If scheduled, attend special exhibitions and cultural programs from the organizers of the famous Art Basel fair. While the main Art Basel event occurs in summer, autumn may feature satellite programming.",
                "indoor": true,
                "best_time": "Check schedule for dates (if running)",
                "price_range": "Varies by exhibition",
                "seasonal_notes": "Showcases Basel's importance as a global art center beyond the main fair.",
                "booking_tips": "Check Art Basel website for information on cities programming and affiliated events."
            },
            {
                "name": "Autumn Walks in Basel Region",
                "type": "Nature/Outdoors",
                "description": "Explore the colorful autumn landscapes in the hills surrounding Basel. Popular routes include the Gempen plateau, Ermitage in Arlesheim, or trails along the Birs river valley with their changing foliage.",
                "indoor": false,
                "best_time": "Daytime (October-November)",
                "price_range": "Free (Walking)/Budget (Transport)",
                "seasonal_notes": "Beautiful fall colors and milder temperatures make for pleasant hiking.",
                "booking_tips": "Check regional bus/train schedules for access to starting points. The tourist office offers maps of recommended hiking routes."
            },
            {
                "name": "Basel Museums Night",
                "type": "Cultural/Museums",
                "description": "Experience many of Basel's 40+ museums during this special night when they open their doors until late with special programs, installations, concerts, and refreshments.",
                "indoor": true,
                "best_time": "One Friday in November (Check exact date, typically 6pm-2am)",
                "price_range": "Budget (Single ticket for all museums)",
                "seasonal_notes": "A cultural highlight of the autumn season allowing exploration of multiple museums in one night.",
                "booking_tips": "Purchase tickets early. Plan your route as you won't be able to visit everything. Special shuttle buses connect museum locations."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Basel Christmas Market",
                "type": "Shopping/Festive",
                "description": "Experience one of Switzerland's largest and most atmospheric Christmas markets, centered around Barfüsserplatz and Münsterplatz. Browse wooden chalets selling crafts, decorations, and seasonal food and drink.",
                "indoor": false,
                "best_time": "Late November - December 23rd (Check exact dates)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases/Food)",
                "seasonal_notes": "Creates a magical winter atmosphere with decorations and lights throughout the Old Town. The Münsterplatz section features a large Christmas tree.",
                "booking_tips": "Visit on weekdays or early in the day to avoid weekend crowds. Try seasonal specialties like Glühwein (mulled wine) and raclette."
            },
            {
                "name": "Museum Tinguely",
                "type": "Art/Culture",
                "description": "Discover the whimsical kinetic sculptures of Swiss artist Jean Tinguely in this modern museum along the Rhine. The interactive mechanical artwork is entertaining even for those not typically interested in art.",
                "indoor": true,
                "best_time": "Anytime (Check opening hours)",
                "price_range": "Moderate (Entry ticket)",
                "seasonal_notes": "Excellent indoor activity for colder winter days.",
                "booking_tips": "Check the website for current exhibitions. The museum is closed on Mondays. Consider the combined ticket with Fondation Beyeler if visiting both."
            },
            {
                "name": "Basel Theater Season",
                "type": "Performing Arts",
                "description": "Attend a performance at Theater Basel, Switzerland's largest three-stage theater offering opera, ballet, and drama. Winter months feature some of the season's premiere productions.",
                "indoor": true,
                "best_time": "Evening (Check performance schedule)",
                "price_range": "Moderate-High (Performance tickets)",
                "seasonal_notes": "Basel has a strong theatrical tradition, with both classic and avant-garde productions.",
                "booking_tips": "Book tickets well in advance for popular productions. Check for English surtitles if language is a concern."
            },
            {
                "name": "Eislaufen (Ice Skating)",
                "type": "Sport/Recreation",
                "description": "Enjoy ice skating at seasonal rinks set up in locations like Barfüsserplatz or Eglisee. Some years feature special installations like the 'Zauberpark' (Magic Park) combining skating with light installations.",
                "indoor": false,
                "best_time": "Daytime/Evening (November-February, check locations and hours)",
                "price_range": "Budget (Entry + skate rental)",
                "seasonal_notes": "Fun winter activity for all ages.",
                "booking_tips": "Check city websites for current skating locations, as they may change annually. Some locations offer evening skating with lights and music."
            },
            {
                "name": "Basel Hammam",
                "type": "Wellness/Relaxation",
                "description": "Warm up in winter at the Hammam & Spa Oktogon Basel, a traditional Near Eastern bathhouse experience with steam rooms, peeling treatments, and relaxation areas in a beautifully converted historic brewery building.",
                "indoor": true,
                "best_time": "Anytime (Check opening hours and women's/men's/mixed days)",
                "price_range": "High (Entry and treatments)",
                "seasonal_notes": "Particularly appealing during cold winter months.",
                "booking_tips": "Book in advance, especially for weekends. Check the schedule for gender-specific and mixed days. Basic entry includes 3-hour stay."
            }
        ]
    }
}