{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Nyttårsdag)",
          "notes": "New Year's Day is a public holiday throughout Norway. Most attractions and shops in Bergen operate with limited hours. The city is relatively quiet as residents recover from New Year's Eve celebrations. Cold temperatures averaging around 2°C (36°F) and short daylight hours characterize this period. Bergen experiences mild winter conditions with frequent rainfall rather than heavy snowfall."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "January is one of the wettest months in Bergen with temperatures generally between 1°C and 4°C (34°F to 39°F). Daylight is limited to around 6-7 hours per day. The city often experiences heavy rainfall, with Bergen being known as one of Europe's rainiest cities. This is low season for tourism, so you'll find fewer crowds at major museums like KODE Art Museums and Bryggens Museum. Winter activities include visiting the indoor fish market (Fisketorget), exploring the UNESCO-listed Bryggen wharf district, and taking the Fløibanen funicular for winter views. Indoor attractions like museums, cafés, and the Grieg Hall are particularly appealing during this wet month. The nearby mountains offer skiing opportunities at Voss Resort, accessible by train."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": 1,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 2,
          "notes": "February continues with winter conditions but typically features slightly longer daylight hours than January. This is the month to try 'fastelavnsboller' - sweet cardamom buns with whipped cream, a traditional Norwegian seasonal treat. Bergen International Film Festival (BIFF Barn) for children often takes place in February, bringing family-friendly films to the city. Winter sports remain available in nearby mountains, with Voss and Myrkdalen offering good skiing conditions. Tourism remains low, making it an excellent time to enjoy indoor attractions like the Hanseatic Museum and the Leprosy Museum without crowds."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": 0,
      "tourismLevel": 2
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Borealis Festival",
          "notes": "March brings the first signs of spring to Bergen, with temperatures gradually rising and daylight hours increasing noticeably. The Borealis Festival for experimental music takes place in March, featuring contemporary and avant-garde performances throughout the city. Bergen International Festival's Festspillene i Bergen program begins to be announced, creating anticipation for the May events. Indoor attractions remain popular, but on sunny days, locals begin to venture more into outdoor spaces like the city lake (Lille Lungegårdsvannet) and Bergen Aquarium. This is still a relatively quiet tourist season, offering good value for accommodations and easy access to popular attractions."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 1,
      "tourismLevel": 3
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "notes": "Early April sees spring truly arriving in Bergen. The botanical gardens at Milde begin their spring displays with early blossoms. Ferry services to the fjords start to operate more frequently as the weather becomes milder. Hiking trails on the seven mountains surrounding Bergen begin to open up as snow melts, with Mount Fløyen and Mount Ulriken becoming more accessible."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21],
          "score": 4,
          "special": true,
          "event": "Easter Celebrations (dates vary annually)",
          "notes": "Easter is a significant holiday period in Norway. Maundy Thursday, Good Friday, Easter Sunday, and Easter Monday are all public holidays. Many Bergen residents leave the city to visit holiday cabins in the mountains or fjords. Those who remain enjoy a quieter city with special Easter concerts and events. Shops and restaurants may have limited hours during the Easter weekend."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late April brings increasingly pleasant weather with temperatures often reaching double digits, though rainfall remains common in Bergen. Outdoor seating begins to appear at restaurants and cafes around Bryggen and Fisketorget, though sometimes with blankets and heaters still provided for cooler evenings. The city gradually becomes more lively as residents return from Easter holidays and tourist numbers begin to increase."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 4,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day (Arbeidernes dag)",
          "notes": "May 1st is International Workers' Day and a public holiday in Norway. Political demonstrations and parades take place in central Bergen, particularly around Torgallmenningen. This is also a day for spring celebrations as the weather continues to improve, with many locals gathering in parks."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 5,
          "notes": "Early May brings reliably good weather to Bergen with average temperatures between 8°C and 14°C (46-57°F), though the city still experiences its characteristic rainfall. The city's parks and botanical garden come into full bloom. Outdoor activities become increasingly popular, including hiking on Bergen's seven mountains and boat trips to the surrounding fjords. This is the beginning of the tourist season, but before the summer peak, making it an excellent time to visit with improving weather and manageable crowds."
        },
        {
          "days": [17],
          "score": 5,
          "special": true,
          "event": "Constitution Day (Syttende mai)",
          "notes": "May 17th is Norway's National Day, celebrating the signing of the Norwegian Constitution in 1814. This is the most important holiday in Norway, marked by children's parades, marching bands, traditional costumes (bunads), and festive gatherings. Bergen hosts one of Norway's largest celebrations, with a parade passing through the city center. The streets are filled with people in national dress, and the atmosphere is joyous, with ice cream, hot dogs, and games for children."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Bergen International Festival (Festspillene)",
          "notes": "Late May features the prestigious Bergen International Festival (Festspillene i Bergen), one of Norway's most important cultural events. The festival brings world-class performances in music, theater, dance, and opera to venues throughout the city. This coincides with excellent spring weather and lengthening daylight hours. Parks and outdoor spaces become increasingly busy with locals and tourists enjoying the warmer temperatures. This is an ideal time to explore the city on foot or bicycle and take advantage of the outdoor cafes and restaurants."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 8,
      "tourismLevel": 5
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Bergen Pride & Bergenfest Music Festival",
          "notes": "Early June brings the beginning of summer weather to Bergen. Bergen Pride, the city's LGBTQ+ festival, features a parade and events throughout the city. The Bergenfest music festival brings international and local musicians to the city center. Outdoor activities become extremely popular, especially fjord cruises and hiking on the mountains surrounding Bergen."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "Summer Solstice",
          "notes": "The summer solstice (around June 21) brings the longest day of the year to Bergen, with approximately 19 hours of daylight. The city takes on a lively atmosphere as residents make the most of the extended daylight hours. This is a magical time to experience Bergen's outdoor spaces, as well as evening boat trips on the fjords in the golden light."
        },
        {
          "days": [23, 24],
          "score": 5,
          "special": true,
          "event": "Midsummer (Sankthansaften)",
          "notes": "Midsummer Eve (June 23) is celebrated with bonfires along the waterfront and in parks. Traditional celebrations include gathering around bonfires, singing, and feasting. In Bergen, popular spots for Midsummer celebrations include the waterfront areas and mountain plateaus. This marks the beginning of the summer holiday period for many locals."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Late June continues with excellent summer weather. Temperatures are typically pleasant, between 12°C and 18°C (54-64°F), though rain showers remain common. Many residents begin their summer holidays, but tourist numbers increase. This is the beginning of the high season for tourism in Bergen. Outdoor activities are popular in the surrounding nature, with hiking, fjord cruises, and visits to nearby stave churches and fishing villages."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 12,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Nattjazz Festival & Bergen Food Festival",
          "notes": "July is the warmest month in Bergen with temperatures averaging 19°C (66°F) but sometimes reaching 25°C (77°F). This is peak tourist season with visitors from around the world exploring the city's attractions and using Bergen as a gateway to the fjords. Many locals leave Bergen for vacation, creating an interesting mix where the city is simultaneously at its busiest with tourists and emptiest of residents. The Nattjazz Festival brings jazz performances to venues throughout the city. The Bergen Food Festival celebrates local culinary traditions and ingredients. Fjord tours are extremely popular, with the Norway in a Nutshell tour operating at full capacity. Despite being summer, Bergen's famous rain continues, with the city experiencing an average of 19 rainy days in July. The harbor area is particularly lively with outdoor dining and cultural events."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 13,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "special": true,
          "event": "Bergen International Wood Festival",
          "notes": "The Bergen International Wood Festival focuses on wooden boat traditions and craftsmanship. This unique event celebrates Bergen's maritime heritage and attracts enthusiasts from across Scandinavia. Tourism remains at peak levels, and hotel prices are at their highest. Outdoor activities dominate, including fjord cruises, hiking on Bergen's seven mountains, and exploring the historic Bryggen wharf."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "Late August brings slightly cooler temperatures but still excellent conditions for exploring the city. Locals begin to return from summer vacations, bringing a more authentic feel back to the city. This is considered one of the best times to visit Bergen, with good weather but slightly lower tourist numbers than peak July. The Beyond the Gates metal festival takes place in late August, bringing heavy metal fans to the city. August remains one of the wettest months in Bergen, but the rain typically comes in short showers rather than all-day downpours."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Bergen International Film Festival (BIFF)",
          "notes": "September brings autumn to Bergen with pleasant temperatures around 14°C (57°F) and beautiful fall colors beginning to appear in parks and surrounding mountains. Tourism decreases as European summer holidays end, making this an excellent time to visit with good weather and fewer crowds. The Bergen International Film Festival (BIFF) is Norway's largest film festival, screening international and Norwegian films throughout the city. Cultural life intensifies with new exhibitions and performances as the winter cultural season begins. This is widely considered one of the best months to visit Bergen, with comfortable temperatures and the beginning of autumn colors in the surrounding landscapes."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Oktoberfest Bergen & Cultural Events",
          "notes": "October brings autumn colors to their peak in Bergen, with parks and forests showing stunning red and gold foliage. Temperatures cool significantly with averages around 8-10°C (46-50°F). Daylight hours decrease noticeably. Oktoberfest Bergen celebrates German beer traditions with a Norwegian twist. Cultural events increase as the indoor season gets fully underway at venues like Grieghallen and Den Nationale Scene. This is a good time for museum visits, with the KODE Art Museums and Bergen Maritime Museum particularly popular. Tourism continues to decrease, creating good opportunities for value accommodation and uncrowded attractions. Rainy days become more common, so indoor activities gain popularity."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 7,
      "tourismLevel": 4
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "notes": "November brings increasingly cold and dark conditions to Bergen, with temperatures around 5-7°C (41-45°F) and daylight hours significantly reduced. This is low season for tourism, though the city maintains a vibrant local atmosphere with cultural events and cozy indoor activities. Bergen is notoriously rainy during November, often experiencing some of its highest rainfall of the year. Traditional winter foods appear on restaurant menus, including hearty fish soups and seasonal game dishes. Christmas markets begin to open in late November, with decorations and lights being installed throughout the city. This is a good time to experience Bergen like a local, with fewer tourists and authentic cultural experiences."
        }
      ],
      "weatherHighC": 7,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
          "score": 3,
          "special": true,
          "event": "Christmas Markets & Preparations",
          "notes": "Early December brings winter conditions with temperatures around 5°C (41°F) and very short daylight hours (around 6 hours). The Christmas market at Festplassen offers traditional crafts, decorations, and seasonal foods like gløgg (mulled wine) and pepperkaker (ginger cookies). Shopping streets and squares are beautifully decorated with lights, creating a magical atmosphere despite the darkness. Advent concerts take place in churches and concert venues throughout the city, with Grieghallen hosting special seasonal performances."
        },
        {
          "days": [13],
          "score": 3,
          "special": true,
          "event": "St. Lucia Day (Luciadagen)",
          "notes": "December 13th is St. Lucia Day, a festival of light during the darkest time of year. Processions featuring young people dressed in white, with the leader wearing a crown of candles, take place in churches, schools, and public venues throughout Bergen. The tradition symbolizes hope and light in the darkness of winter. Special concerts and events mark this day in Bergen, with particular focus on children's processions."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "notes": "The week before Christmas sees Bergen at its most festive, with decorations, lights, and special events throughout the city. Shopping areas like Torgallmenningen and Galleriet are beautifully decorated and busy with last-minute shoppers. Museums and attractions maintain normal winter hours but may have special holiday-themed exhibitions. December 23rd (Little Christmas Eve) is when many Norwegians decorate their Christmas trees."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Julaften & Juledag)",
          "notes": "Christmas is celebrated primarily on Christmas Eve (December 24) in Norway, with family gatherings for traditional julebord (Christmas buffet) featuring dishes like pinnekjøtt (lamb ribs), which is particularly popular in Western Norway. Many restaurants and attractions close early on Christmas Eve and may remain closed on Christmas Day and Boxing Day (December 26). Public transportation runs on limited schedules. Despite this, winter tourism begins to increase as international visitors arrive for holiday celebrations."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees Bergen quiet but festive. Winter activities in the surrounding mountains gain popularity as visitors and locals seek outdoor experiences. Museums welcome visitors seeking indoor activities during the wet weather. Many restaurants and shops reopen after brief Christmas closures. This can be a good time to visit for those seeking a quieter experience of the city while still enjoying the holiday atmosphere."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Nyttårsaften)",
          "notes": "New Year's Eve celebrations center around the harbor area and Torgallmenningen with fireworks at midnight visible across the city. Many restaurants offer special New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. The city maintains a festive atmosphere with locals and tourists gathering to welcome the New Year."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 1,
      "tourismLevel": 3
    }
  },
  "activityTypes": {
    "spring": [
      "Hiking on Bergen's seven mountains as trails become accessible",
      "Exploring the Botanical Garden at Milde",
      "Taking fjord cruises as water activities resume for the season",
      "Celebrating Constitution Day (May 17) with parades and festivities",
      "Attending the Bergen International Festival (Festspillene)",
      "Visiting the KODE Art Museums without summer crowds",
      "Ferry trips to nearby islands and coastal villages",
      "Outdoor dining at cafes along Bryggen when weather permits",
      "Exploring the Hanseatic Museum and other cultural sites"
    ],
    "summer": [
      "Taking the famous 'Norway in a Nutshell' tour from Bergen",
      "Visiting the fjords (Sognefjord, Hardangerfjord) by boat or car",
      "Attending music festivals like Bergenfest and Nattjazz",
      "Midsummer celebrations with bonfires (late June)",
      "Bergen Pride Festival (June)",
      "Hiking on Mount Fløyen and Mount Ulriken",
      "Outdoor dining along the historic Bryggen wharf",
      "Swimming at beaches like Kyrkjetangen and Helleneset",
      "Exploring coastal villages like Austevoll and Øygarden"
    ],
    "autumn": [
      "Exploring autumn colors on Bergen's seven mountains",
      "Bergen International Film Festival (September)",
      "Museum visits to KODE, the Hanseatic Museum, and the Maritime Museum",
      "Cozy coffee breaks at traditional cafes",
      "Shopping in boutique districts as holiday season approaches",
      "Cultural performances at Grieghallen and Den Nationale Scene",
      "Sampling seasonal seafood at the Fish Market",
      "Taking the funicular to Mount Fløyen for autumn panoramas",
      "Day trips to see fall foliage in surrounding fjord landscapes"
    ],
    "winter": [
      "Christmas markets throughout the city (November-December)",
      "Skiing at nearby resorts like Voss and Myrkdalen",
      "Exploring the UNESCO-listed Bryggen in winter atmosphere",
      "Attending concerts at Grieghallen",
      "Indoor exploration of Bergen's many museums",
      "St. Lucia Day celebrations (December 13)",
      "Sampling traditional Christmas foods at restaurants",
      "Taking the Fløibanen funicular for winter city views",
      "Day trips to nearby stave churches and cultural sites"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, wet weather, very low tourism (some business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, limited activities or accessibility"
  }
}