{
    "Spring": {
        "activities": [
            {
                "name": "Spring Blooms in Bergen Parks",
                "type": "Nature/Social",
                "description": "Experience the arrival of spring in Bergen's parks like Nygårdsparken or the Muséhagen Botanical Garden. Enjoy early flowers and the greening landscape after the winter rains.",
                "indoor": false,
                "best_time": "Late April-May (daytime)",
                "price_range": "Free",
                "seasonal_notes": "Blooming times vary with weather. Spring in Bergen often starts wet but gradually warms up, with average temperatures around 5-12°C (41-54°F) in April/May. Be prepared for rain!",
                "booking_tips": "No booking needed. Dress in layers and bring waterproof gear. Muséhagen (Botanical Garden at University Museum) is particularly lovely."
            },
            {
                "name": "Visit Muséhagen (Botanical Garden)",
                "type": "Nature/Cultural",
                "description": "Explore the historic Botanical Garden at the University Museum on Nygårdshøyden as it comes alive with spring blooms. Features diverse plant collections in a peaceful setting.",
                "indoor": false,
                "best_time": "Daytime (April-May)",
                "price_range": "Free (Garden access)",
                "seasonal_notes": "Rhododendrons and other spring flowers put on a good show. Less crowded than peak summer.",
                "booking_tips": "No booking required for the garden. Combine with a visit to the University Museum's indoor collections."
            },
            {
                "name": "May 17th Constitution Day Celebrations",
                "type": "Cultural Festival/National Holiday",
                "description": "Witness Bergen's vibrant celebration of Norway's National Day. Enjoy parades (including the unique 'Buekorps' marching brigades), traditional costumes (bunad), music, and festivities throughout Sentrum.",
                "indoor": false,
                "best_time": "May 17th (morning and daytime)",
                "price_range": "Free (Public events)",
                "seasonal_notes": "A major celebration in Bergen, known for its unique traditions like the Buekorps. The city is decorated and full of energy.",
                "booking_tips": "Find a spot along the parade routes in Sentrum early. Restaurants will be very busy; book well in advance if planning to dine out."
            },
            {
                "name": "Hike Mount Fløyen or Ulriken Trails",
                "type": "Hiking/Nature",
                "description": "As snow melts, hike the trails on Bergen's city mountains, Fløyen and Ulriken. Enjoy improving views and emerging spring nature. Start with lower trails if higher elevations are still snowy/muddy.",
                "indoor": false,
                "best_time": "Daytime (April-May, check conditions)",
                "price_range": "Free (Hiking)/Moderate (Funicular/Cable Car)",
                "seasonal_notes": "Trail conditions vary greatly in spring. Check weather forecasts and trail status. Lower trails clear first. Views become clearer as weather improves.",
                "booking_tips": "Wear proper hiking boots with good grip. Bring layers, waterproofs, water, and snacks. Fløibanen funicular and Ulriksbanen cable car offer easier access to the top."
            },
            {
                "name": "Fjord Cruise Season Starts/Increases",
                "type": "Nature/Boating",
                "description": "Take a fjord cruise from Bergen harbor to explore the stunning nearby fjords like Osterfjord and Mostraumen. Spring offers dramatic scenery with melting snow feeding waterfalls.",
                "indoor": false,
                "best_time": "Daytime (April-May onwards)",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Fewer sailings than summer, but less crowded. Waterfalls are often spectacular due to snowmelt. Weather can be unpredictable; dress warmly.",
                "booking_tips": "Book tickets online in advance, especially for popular routes like the Mostraumen cruise. Choose enclosed seating options if weather is poor."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Midsummer Celebrations (Sankt Hans/Jonsok)",
                "type": "Cultural Festival/Holiday",
                "description": "Experience Norwegian Midsummer (June 23rd) with bonfires, often held at coastal locations near Bergen or sometimes at specific city spots like the Norwegian Fisheries Museum.",
                "indoor": false,
                "best_time": "Evening, June 23rd",
                "price_range": "Free (Public events)",
                "seasonal_notes": "Celebrating the longest day of the year. Bergen's long summer daylight enhances the festive mood.",
                "booking_tips": "Check local event listings (e.g., Visit Bergen website, local newspapers) for specific locations and timings of public bonfires."
            },
            {
                "name": "Swimming at City Beaches/Pools",
                "type": "Leisure/Recreation",
                "description": "Take a refreshing dip at Bergen's swimming spots. Options include Nordnes Sjøbad (heated seawater pool & fjord access), Sandviken Sjøbad (diving tower), or the beach at Marineholmen.",
                "indoor": false,
                "best_time": "Daytime (Warm days, June-August)",
                "price_range": "Free/Budget (Nordnes Sjøbad has entry fee)",
                "seasonal_notes": "Fjord temperatures remain cool even in summer ('refreshing'!). Nordnes Sjøbad offers a heated option.",
                "booking_tips": "Check opening times for Nordnes Sjøbad and Sandviken Sjøbad. Marineholmen is freely accessible."
            },
            {
                "name": "Explore Bryggen Hanseatic Wharf",
                "type": "History/Culture/Sightseeing",
                "description": "Wander through the iconic UNESCO World Heritage site of Bryggen, exploring its narrow passages, historic wooden buildings, museums (Hanseatic, Bryggens), shops, and galleries.",
                "indoor": false,
                "best_time": "Daytime/Early Evening",
                "price_range": "Free (Exploring)/Moderate (Museum entries)",
                "seasonal_notes": "Peak tourist season means Bryggen is lively but can be crowded. Long daylight hours allow for extended exploration.",
                "booking_tips": "Visit early morning or late afternoon to avoid the biggest cruise ship crowds. Wear comfortable shoes for uneven wooden walkways."
            },
            {
                "name": "Hike or Ride up Fløyen/Ulriken",
                "type": "Hiking/Viewpoint/Recreation",
                "description": "Take the Fløibanen funicular or Ulriksbanen cable car, or hike up Bergen's city mountains for stunning panoramic views, hiking trails, playgrounds (Fløyen), and restaurants.",
                "indoor": false,
                "best_time": "Daytime/Evening (Long daylight hours)",
                "price_range": "Free (Hiking)/Moderate (Transport)",
                "seasonal_notes": "Summer offers the best chance for clear views and comfortable hiking conditions. Fløyen is particularly family-friendly.",
                "booking_tips": "Book funicular/cable car tickets online to potentially skip queues, especially during peak season. Check operating hours."
            },
            {
                "name": "Outdoor 'Utepils' and Dining Season",
                "type": "Leisure/Social",
                "description": "Enjoy an 'utepils' (outdoor beer) or meal at the many restaurants and bars with outdoor seating, especially popular along Bryggen, Zachariasbryggen (Fish Market area), and streets in Sentrum.",
                "indoor": false,
                "best_time": "Daytime/Evening (sunny days)",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Bergeners flock outdoors when the sun shines. Waterfront spots are particularly popular.",
                "booking_tips": "Prime outdoor spots fill up quickly on sunny days. Reservations might be helpful for popular restaurants, especially on weekends."
            },
            {
                "name": "Attend Summer Festivals (e.g., Bergenfest)",
                "type": "Music/Entertainment",
                "description": "Experience Bergen's summer festival scene. Events like Bergenfest (usually June) bring international and local artists to venues like Bergenhus Fortress.",
                "indoor": false,
                "best_time": "Varies by festival (June-August)",
                "price_range": "Moderate/Expensive (Festival tickets)",
                "seasonal_notes": "Check schedules for various music, food, or cultural festivals happening during the summer months.",
                "booking_tips": "Buy tickets well in advance for major festivals. Check festival websites for lineups, schedules, and venue information."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Autumn Colors Hiking (Fløyen/Ulriken/Stoltzekleiven)",
                "type": "Hiking/Nature",
                "description": "Hike Bergen's city mountains to witness beautiful autumn foliage. Trails on Fløyen, Ulriken, or the challenging Stoltzekleiven offer stunning views coloured by fall.",
                "indoor": false,
                "best_time": "Daytime (Late September-October)",
                "price_range": "Free (Hiking)/Moderate (Transport up)",
                "seasonal_notes": "Bergen's autumn can be very wet, but clear days offer spectacular colors against the fjord and city. Temperatures cool down, averaging 8-13°C (46-55°F) in Sep/Oct.",
                "booking_tips": "Check weather forecast carefully. Wear waterproof gear and sturdy hiking boots. Stoltzekleiven is steep and can be slippery when wet."
            },
            {
                "name": "Explore Bergen's Museums",
                "type": "Cultural/Historical",
                "description": "Dive into Bergen's rich culture and history at its many museums. Visit KODE art museums, the Hanseatic Museum, Bryggens Museum, Norwegian Fisheries Museum, or the University Museum.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect activity for rainy autumn days. Fewer crowds than summer.",
                "booking_tips": "Consider the Bergen Card for free/discounted entry to many museums and public transport. Check opening hours as some may reduce hours after summer."
            },
            {
                "name": "Enjoy Bergen's Seafood",
                "type": "Food/Cultural",
                "description": "Savor fresh seafood at Bergen's Fish Market (Fisketorget) or in restaurants. While available year-round, autumn is a good time for shellfish and traditional dishes like Persetorsk (cod).",
                "indoor": true,
                "best_time": "Lunchtime (Fish Market)/Evening (Restaurants)",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "The indoor part of the Fish Market offers warmth. Many restaurants feature seasonal seafood.",
                "booking_tips": "Reservations recommended for popular seafood restaurants. The Fish Market offers both ready-to-eat options and fresh seafood to buy."
            },
            {
                "name": "Attend Cultural Events",
                "type": "Arts/Entertainment",
                "description": "Check schedules for concerts at Grieghallen, performances at Den Nationale Scene (theatre), or events at cultural hubs like USF Verftet.",
                "indoor": true,
                "best_time": "Evenings (Varies by event)",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Autumn marks the start of the main cultural season after the summer break.",
                "booking_tips": "Book tickets online in advance for popular performances or concerts. Check venue websites for programs."
            },
            {
                "name": "Cozy Up in Cafés and Pubs",
                "type": "Leisure/Social",
                "description": "Experience Norwegian 'kos' (coziness) as the days get shorter and wetter. Enjoy coffee and cake (like the local 'Skillingsbolle' cinnamon bun) in charming cafes or relax in traditional pubs.",
                "indoor": true,
                "best_time": "Daytime/Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect way to escape the autumn rain. Look for cafes in Nordnes, Sandviken, or Sentrum.",
                "booking_tips": "No reservations usually needed for cafes or casual pubs. Try traditional spots like Pingvinen for Norwegian pub food."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Bergen Christmas Market at Festplassen",
                "type": "Shopping/Cultural/Festive",
                "description": "Visit Bergen's main Christmas market located at Festplassen by the lake Lille Lungegårdsvannet. Features food stalls, crafts, a Ferris wheel, and festive lights.",
                "indoor": false,
                "best_time": "Late November-December (Check specific dates/hours)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases/Rides)",
                "seasonal_notes": "Creates a festive atmosphere in the city center. Bergen winters are often mild and wet, but can bring snow.",
                "booking_tips": "No booking required. Dress very warmly and wear waterproofs. Try local Christmas treats and 'gløgg' (mulled wine)."
            },
            {
                "name": "Ice Skating at Festplassen (Seasonal Rink)",
                "type": "Sport/Recreation",
                "description": "Enjoy ice skating on the temporary rink usually set up alongside the Christmas Market at Festplassen.",
                "indoor": false,
                "best_time": "Daytime/Evening (December-January/February, weather/operation permitting)",
                "price_range": "Free (If you bring own skates)/Budget (Skate rental)",
                "seasonal_notes": "Operation depends on the seasonal setup and weather conditions.",
                "booking_tips": "Check if the rink is operational during your visit. Skate rental typically available on site."
            },
            {
                "name": "Winter Views from Fløyen or Ulriken",
                "type": "Viewpoint/Transport",
                "description": "Take the Fløibanen funicular or Ulriksbanen cable car (check winter operation) for potentially snow-dusted panoramic views of Bergen and the fjords. Enjoy the cozy restaurant/cafe at the top.",
                "indoor": true,
                "best_time": "Daytime (Check operating hours/weather)",
                "price_range": "Moderate (Transport)",
                "seasonal_notes": "Views can be spectacular with snow, but visibility depends heavily on weather. Mountains can be windy and cold.",
                "booking_tips": "Check winter operating schedules for Fløibanen and Ulriksbanen, as they may be reduced or closed for maintenance. Dress very warmly."
            },
            {
                "name": "Visit Indoor Attractions",
                "type": "Cultural/Family",
                "description": "Escape the winter weather at Bergen's indoor attractions like the KODE Art Museums, Bergen Aquarium (Akvariet), VilVite Science Centre, or various historical museums.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Ideal for cold or rainy winter days.",
                "booking_tips": "Check opening hours, as some attractions might have reduced winter schedules. Consider the Bergen Card."
            },
            {
                "name": "Winter Sauna and Fjord Dip",
                "type": "Wellness/Recreation",
                "description": "Brave the cold with a session at one of Bergen's floating saunas (e.g., Heit Bergen Sauna in Sandviken or Møhlenpris/Laksevåg), followed by an invigorating dip in the icy fjord.",
                "indoor": true,
                "best_time": "Daytime/Evening (Check opening hours)",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "A trendy and traditional wellness experience. Very popular, especially in winter.",
                "booking_tips": "Book well in advance, especially for weekends. Bring swimwear, towels, and potentially flip-flops."
            },
            {
                "name": "Enjoy Festive Lights and Atmosphere",
                "type": "Festive/Sightseeing",
                "description": "Stroll through Sentrum and Bryggen in the evenings to enjoy the Christmas lights and decorations, creating a cozy and festive atmosphere despite the dark winter nights.",
                "indoor": false,
                "best_time": "Evening (Late November-December)",
                "price_range": "Free",
                "seasonal_notes": "Bergen's narrow streets and historic buildings look particularly charming with festive lighting.",
                "booking_tips": "Combine with a visit to the Christmas market or cozying up in a pub/cafe afterwards. Dress warmly."
            }
        ]
    }
} 