{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Weather",
                "details": "In May, Nice enjoys mild and sunny weather with temperatures averaging 13-21°C, making it perfect for outdoor activities and beach visits without the summer crowds. The city receives about 58mm of rainfall and 9.5 hours of sunshine daily."
            },
            {
                "reason": "Cannes Film Festival",
                "details": "Though primarily in July, May sees the city buzzing with film-related events and venues gearing up for the festival, offering a rich cultural atmosphere. The nearby Cannes Film Festival creates an elegant atmosphere throughout the region."
            },
            {
                "reason": "Flower Festival",
                "details": "The city is in full bloom, with stunning floral displays in parks and gardens, especially at the Promenade du Paillon. Spring flowers create beautiful photographic opportunities throughout the city."
            },
            {
                "reason": "Mediterranean Cuisine",
                "details": "May is ideal for experiencing the fresh, vibrant flavors of local seafood and produce available in the city's many outdoor markets and restaurants. Seasonal ingredients include fresh herbs, asparagus, and local fish."
            },
            {
                "reason": "Monaco Grand Prix",
                "details": "Visitors can easily take a short trip to nearby Monaco to experience the excitement of the famous Formula 1 Grand Prix, just 20 minutes from Nice by train."
            },
            {
                "reason": "Fewer Tourists",
                "details": "Compared to the peak summer months, May sees fewer tourists, allowing for a more relaxed exploration of the city's attractions. Popular sites have manageable wait times."
            },
            {
                "reason": "Cultural Events",
                "details": "A variety of cultural events, including art exhibitions and performances, are held in May, showcasing the vibrant arts scene of Nice. Museums offer special spring exhibitions."
            },
            {
                "reason": "Perfect Beach Weather",
                "details": "May offers ideal conditions for beach activities with warm temperatures and pleasant sea breezes. The Mediterranean is warming up and perfect for swimming and water sports."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Weather",
                "details": "While generally pleasant, May can sometimes bring unexpected rain showers (about 58mm total), requiring flexible plans. Expect 4-6 days of rain during the month."
            },
            {
                "reason": "Higher Accommodation Prices",
                "details": "With the approach of summer and nearby events like the Cannes Film Festival and Monaco Grand Prix, accommodation prices may rise by 20-30% compared to spring months."
            },
            {
                "reason": "Event Crowds",
                "details": "Events in Cannes and Monaco can lead to crowded transport and attractions in Nice as visitors transit through the city. Book transportation and restaurants in advance during festival periods."
            },
            {
                "reason": "Increased Tourism",
                "details": "May marks the beginning of the high tourism season, with more visitors arriving as the weather improves. Popular attractions may have longer wait times."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "13°C"
                },
                "precipitation": "May experiences occasional light rain showers, but these are usually short-lived. Expect 2-3 days of rain in the first half.",
                "general_tips": "Layered clothing is recommended; bring a light jacket for cooler evenings. Mornings can be cool but afternoons are warm and pleasant."
            },
            "tourism_level": {
                "crowds": "Moderate tourist activity with a noticeable increase during weekends and holidays. Popular attractions have moderate wait times.",
                "pricing": "Accommodation and travel deals can still be found, but prices are on the rise. Early booking is recommended for better rates.",
                "overall_atmosphere": "Lively with a mix of locals and early tourists enjoying spring events. The city feels energetic and welcoming."
            },
            "events_holidays": [
                {
                    "name": "Labor Day",
                    "date": "May 1",
                    "description": "A public holiday with parades and events celebrating workers' rights. Many shops and attractions may be closed.",
                    "notes": "Expect some closures and reduced public transport services. Plan indoor activities for this day."
                },
                {
                    "name": "Cannes Film Festival",
                    "date": "Mid-May",
                    "description": "The famous film festival in nearby Cannes creates an elegant atmosphere throughout the region. Many celebrities and film industry professionals visit the area.",
                    "notes": "Transport to Cannes may be crowded. Book restaurants and transportation in advance during the festival."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit to Castle Hill",
                    "where": "Castle Hill (Colline du Château)",
                    "description": "Explore the ruins of an ancient castle and enjoy panoramic views of Nice and the Mediterranean. Spring brings fresh greenery and beautiful views.",
                    "practical_tips": "Wear comfortable shoes for the climb; a lift is available for those with mobility issues. Take the elevator up and walk down for the best experience.",
                    "best_time": "Morning (9 AM - 11 AM) or late afternoon (4 PM - 6 PM)",
                    "estimated_cost": "Free",
                    "weather_dependent": true,
                    "duration": "1-2 hours"
                },
                {
                    "activity": "Old Town Exploration",
                    "where": "Vieille Ville (Old Town)",
                    "description": "Stroll through narrow streets filled with vibrant shops, cafes, and historical buildings. May brings fresh energy and outdoor dining to the area.",
                    "practical_tips": "Start early to avoid crowds; try local specialties like socca and pissaladière. Begin at Place Rossetti and explore the maze of streets.",
                    "best_time": "Morning (9 AM - 12 PM)",
                    "estimated_cost": "Free, with optional food and shopping costs",
                    "weather_dependent": false,
                    "duration": "2-3 hours"
                },
                {
                    "activity": "Visit to Matisse Museum",
                    "where": "Cimiez",
                    "description": "Discover the works of Henri Matisse in a museum dedicated to his art and life. The museum is housed in a beautiful villa surrounded by gardens.",
                    "practical_tips": "Check for temporary exhibitions; discounts available for students and seniors. The gardens are particularly beautiful in May.",
                    "best_time": "Midday (11 AM - 2 PM)",
                    "estimated_cost": "€10",
                    "weather_dependent": false,
                    "duration": "1.5-2 hours"
                },
                {
                    "activity": "Promenade des Anglais Walk",
                    "where": "Promenade des Anglais",
                    "description": "Take a leisurely stroll along the famous promenade with beautiful views of the Mediterranean. May offers perfect walking conditions.",
                    "practical_tips": "Visit early morning or late afternoon for fewer crowds. Stop at cafes along the way for refreshments. The promenade is about 7km long.",
                    "best_time": "Early morning (8 AM - 10 AM) or late afternoon (5 PM - 7 PM)",
                    "estimated_cost": "Free",
                    "weather_dependent": true,
                    "duration": "1-2 hours"
                },
                {
                    "activity": "Cours Saleya Market Visit",
                    "where": "Cours Saleya",
                    "description": "Explore the vibrant market with fresh produce, flowers, and local delicacies. May brings colorful spring produce and fresh flowers.",
                    "practical_tips": "Arrive early for the best selection. The market is closed on Mondays. Try local specialties like socca and fresh pastries.",
                    "best_time": "Morning (8 AM - 12 PM)",
                    "estimated_cost": "Free to visit, purchases vary",
                    "weather_dependent": true,
                    "duration": "1 hour"
                },
                {
                    "activity": "Cooking Class Experience",
                    "where": "Local cooking schools",
                    "description": "Learn to prepare traditional Niçoise cuisine with hands-on classes. May brings fresh seasonal ingredients to the classes.",
                    "practical_tips": "Book in advance as classes fill quickly. Many include market visits and wine pairings. Look for spring seasonal menus.",
                    "best_time": "Morning (10 AM - 2 PM)",
                    "estimated_cost": "€50-€100",
                    "weather_dependent": false,
                    "duration": "3-4 hours"
                },
                {
                    "activity": "Day Trip to Èze Village",
                    "where": "Èze",
                    "description": "Explore the medieval village perched on a hill with breathtaking sea views. May offers perfect weather for exploring the village.",
                    "practical_tips": "Wear comfortable shoes for the steep paths. Public transport available from Nice (€1.50). The village is small but very picturesque.",
                    "best_time": "Daytime (10 AM - 4 PM)",
                    "estimated_cost": "€15-€25",
                    "weather_dependent": true,
                    "duration": "4-5 hours"
                },
                {
                    "activity": "Phoenix Park Visit",
                    "where": "Promenade des Anglais",
                    "description": "Explore the large botanical garden with themed sections and a tropical greenhouse. May brings new blooms and pleasant temperatures.",
                    "practical_tips": "Ideal for families. Check the schedule for special events. The greenhouse is warm and humid year-round.",
                    "best_time": "Morning (10 AM - 2 PM)",
                    "estimated_cost": "€5",
                    "weather_dependent": true,
                    "duration": "2-3 hours"
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "14°C"
                },
                "precipitation": "Weather continues to improve with more sunny days and warmer temperatures. Rainfall decreases as summer approaches.",
                "general_tips": "Light clothing becomes more appropriate, but still bring a light jacket for evenings. Temperatures are increasingly pleasant for outdoor activities."
            },
            "tourism_level": {
                "crowds": "Tourism continues to increase as summer approaches, but crowds remain manageable. Popular attractions may have longer wait times.",
                "pricing": "Prices continue to rise as the high season approaches. Early booking is recommended for better rates and availability.",
                "overall_atmosphere": "The city feels vibrant and energetic as summer approaches. Outdoor activities become increasingly popular and enjoyable."
            },
            "events_holidays": [
                {
                    "name": "Monaco Grand Prix",
                    "date": "Late May",
                    "description": "The famous Formula 1 Grand Prix in Monaco creates excitement throughout the region. Many visitors use Nice as a base for attending the race.",
                    "notes": "Transport to Monaco may be crowded. Book accommodation and transportation well in advance. The event attracts international visitors."
                },
                {
                    "name": "Spring Cultural Events",
                    "date": "Throughout second half",
                    "description": "Various cultural events and exhibitions continue as the city transitions to summer. Museums and galleries host special programs.",
                    "notes": "Check local cultural calendars for specific events. Many venues offer spring-themed exhibitions and performances."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Beach Day at Plage Beau Rivage",
                    "where": "Plage Beau Rivage",
                    "description": "Enjoy a day at one of Nice's most popular beaches with crystal-clear waters and beautiful views. May offers perfect beach weather without summer crowds.",
                    "practical_tips": "Arrive early to secure a good spot. Bring sunscreen and water. Beach equipment can be rented on site.",
                    "best_time": "Daytime (10 AM - 6 PM)",
                    "estimated_cost": "Free (beach equipment rental €10-€20)",
                    "weather_dependent": true,
                    "duration": "4-6 hours"
                },
                {
                    "activity": "Visit Musée d'Art Moderne et d'Art Contemporain",
                    "where": "Place Yves Klein",
                    "description": "Explore contemporary art in this modern museum featuring rotating exhibitions and a rooftop terrace with city views.",
                    "practical_tips": "Check for temporary exhibitions. The rooftop terrace offers great views. Free on first Sunday of month.",
                    "best_time": "Afternoon (2 PM - 6 PM)",
                    "estimated_cost": "€10",
                    "weather_dependent": false,
                    "duration": "1.5-2 hours"
                },
                {
                    "activity": "Wine Tasting Experience",
                    "where": "Local wine bars",
                    "description": "Experience the rich flavors of Provence wines with guided tastings. Learn about local wine traditions and seasonal pairings.",
                    "practical_tips": "Book in advance, especially for specific vineyards. Many tastings include food pairings. Look for spring wine events.",
                    "best_time": "Evening (6 PM - 8 PM)",
                    "estimated_cost": "€20-€50",
                    "weather_dependent": false,
                    "duration": "1-1.5 hours"
                },
                {
                    "activity": "Coastal Walk to Villefranche",
                    "where": "Villefranche-sur-Mer",
                    "description": "Take a scenic walk along the coast to the charming village of Villefranche-sur-Mer, about 6km from Nice. May offers perfect walking conditions.",
                    "practical_tips": "Wear comfortable walking shoes. The path offers stunning coastal views. You can take the bus back to Nice (€1.50).",
                    "best_time": "Morning (9 AM - 12 PM)",
                    "estimated_cost": "Free (bus back €1.50)",
                    "weather_dependent": true,
                    "duration": "3-4 hours"
                },
                {
                    "activity": "Photography Walk in Cimiez",
                    "where": "Cimiez",
                    "description": "Capture the beauty of the historic Cimiez neighborhood with its Roman ruins and beautiful gardens. May light creates perfect conditions for photography.",
                    "practical_tips": "Bring a good camera or smartphone. Early morning offers the best lighting. Combine with Matisse Museum visit.",
                    "best_time": "Morning (9 AM - 11 AM)",
                    "estimated_cost": "Free",
                    "weather_dependent": true,
                    "duration": "1-1.5 hours"
                },
                {
                    "activity": "Palais Lascaris Visit",
                    "where": "15 Rue Droite",
                    "description": "Explore this historic palace showcasing 17th-century architecture and a collection of ancient musical instruments.",
                    "practical_tips": "Check for guided tours to enhance your visit. The palace is small but very detailed. Located in Old Town.",
                    "best_time": "Afternoon (2 PM - 5 PM)",
                    "estimated_cost": "€6",
                    "weather_dependent": false,
                    "duration": "45 minutes"
                },
                {
                    "activity": "Day Trip to Monaco",
                    "where": "Monaco",
                    "description": "Explore the glamour of Monaco, just a short train ride from Nice. Visit the Prince's Palace and Monte Carlo Casino.",
                    "practical_tips": "Plan your visit around key attractions. The train takes about 20 minutes and costs €4.50 each way.",
                    "best_time": "Daytime (9 AM - 6 PM)",
                    "estimated_cost": "€20-€40 for transport and attractions",
                    "weather_dependent": true,
                    "duration": "6-8 hours"
                },
                {
                    "activity": "Evening Jazz Performance",
                    "where": "Local music venues",
                    "description": "Enjoy live jazz performances in intimate settings. Many venues offer spring jazz series and special events.",
                    "practical_tips": "Check local listings for performances. Tickets may sell out quickly. Many venues are in Old Town.",
                    "best_time": "Evening (8 PM - 11 PM)",
                    "estimated_cost": "€20-€40",
                    "weather_dependent": false,
                    "duration": "2-3 hours"
                }
            ]
        }
    }
}