{
  "overview_paragraph": "Nice shines from April to October with sea‑breeze days, long golden evenings, and a vibrant events calendar. Summer (June–September) brings warm water, beach clubs, and festivals; it’s lively and sunny, with higher prices and crowds. Winter is mild and bright by Mediterranean standards—perfect for museum days, market tastings, and coastal walks—while February explodes with Carnival parades and confetti. Spring and autumn offer the sweet spot for hiking Cap‑Ferrat, terrace apéros, and calm swims in clear water.",
  "January": [
    "Crystal winter light on the Baie des Anges, quiet museums, and steaming socca at the market.",
    "Pebble‑beach strolls, MAMAC color therapy, and terrace coffees under blue Mediterranean skies."
  ],
  "February": [
    "Carnival confetti, illuminated floats in Place Masséna, and citrus‑scented parades in Menton nearby.",
    "Mild days for Castle Hill views, cozy Niçoise bistros, and sunsets that glow pink over the sea."
  ],
  "March": [
    "First swims for the bold, Cap‑Ferrat paths in bloom, and market stalls filling with spring greens.",
    "Sunny lunches of pan bagnat, gallery afternoons, and calm evenings on the Promenade des Anglais."
  ],
  "April": [
    "Blossoms in Cimiez, terrace apéros returning, and coastal hikes with jasmine on the breeze.",
    "Clear water, quieter beaches, and golden hours made for Castle Hill panoramas."
  ],
  "May": [
    "Warmth without the rush, bouquets at Cours Saleya, and picnics along Promenade du Paillon.",
    "Day trips to Èze and Villefranche, soft‑sea swims, and long blue‑hour wanders by the harbor."
  ],
  "June": [
    "Beach days settle in, Cap‑Ferrat swims, and alfresco dinners in Vieux Nice’s cool alleys.",
    "Fête de la Musique vibes, warm evenings on Place Garibaldi, and pastel sunsets across the bay."
  ],
  "July": [
    "Nice Jazz Festival nights, fireworks over the sea, and late swims when the stones still hold the sun.",
    "Beach clubs buzzing, rosé in the shade, and promenades that stretch under starry skies."
  ],
  "August": [
    "Hot, sunny, and festive—early swims, shaded siestas, and golden‑hour dips near Villefranche.",
    "Harbor breezes, lemon gelato, and moonlit walks along the water’s edge."
  ],
  "September": [
    "Sea at its warmest, vineyards inland turning, and locals back on terraces for la rentrée.",
    "Calm coves, gallery re‑openings, and perfect evenings for waterfront seafood in Port Lympia."
  ],
  "October": [
    "Soft light on ochre facades, easy coastal hikes, and markets bursting with figs and olives.",
    "Sun‑warmed afternoons, quiet beaches, and golden views from the Château hill."
  ],
  "November": [
    "Peaceful promenades, bright museum days, and truffle‑season menus in snug Old Town spots.",
    "Clear horizons after showers, espresso stops, and unrushed browsing at Libération market."
  ],
  "December": [
    "Christmas market glow at Place Masséna, Ferris‑wheel views, and citrus sweets for the season.",
    "Sunny winter walks, cozy socca breaks, and lights twinkling along the Promenade."
  ]
}


