{
    "Spring": {
        "activities": [
            {
                "name": "King's Day (Koningsdag)",
                "type": "National Holiday/Festival",
                "description": "Groningen turns orange for the King's birthday! Expect city-wide flea markets ('vrijmarkt'), live music stages (especially Vismarkt, Grote Markt), boat parties on the canals, and general street festivities.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free (activities/market browsing)",
                "seasonal_notes": "April 27th (or 26th if 27th is a Sunday). Very crowded and lively. Major stages often require paid entry in the evening.",
                "booking_tips": "Wear orange! Plan transport as city center access is limited. Check event schedules for specific stage locations and times."
            },
            {
                "name": "Enjoy Noorderplantsoen Park",
                "type": "Nature/Recreation",
                "description": "See Groningen's beloved park come to life with blossoming flowers and greenery. Perfect for walks, picnics, and enjoying the spring sunshine.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "The park is especially beautiful as nature awakens. Ponds and bridges offer scenic spots.",
                "booking_tips": "Cafes within the park reopen their terraces."
            },
            {
                "name": "Day Trip to Lauwersmeer National Park",
                "type": "Day Trip/Nature",
                "description": "Explore this nearby national park, known for its diverse birdlife, walking/cycling trails, and wide-open landscapes as nature blooms.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget (transport) to Moderate (activities/visitor center)",
                "seasonal_notes": "Spring is excellent for birdwatching during migration seasons.",
                "booking_tips": "Best reached by car or organized tour. Check visitor center opening times."
            },
            {
                "name": "Terrace Season Opening",
                "type": "Food & Drink/Social",
                "description": "Groningen's numerous terraces on the Grote Markt, Vismarkt, and along canals open up. Enjoy the first outdoor drinks and meals of the year.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Varies (Budget to Moderate)",
                "seasonal_notes": "Becomes increasingly popular as the weather improves, usually from April.",
                "booking_tips": "Prime spots on sunny days fill up quickly. No reservations usually needed for casual drinks."
            },
            {
                "name": "Groningen Flower Market (Vismarkt)",
                "type": "Market",
                "description": "Browse a wide selection of spring flowers, plants, and bulbs at the large Vismarkt market.",
                "indoor": false,
                "best_time": "Saturday Morning",
                "price_range": "Free entry (purchases vary)",
                "seasonal_notes": "The market buzzes with color in spring. Find tulips, daffodils, and more.",
                "booking_tips": "Combine with browsing the food and general goods stalls at the market."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Noorderzon Performing Arts Festival",
                "type": "Major Arts Festival",
                "description": "One of the Netherlands' most exciting festivals transforms the Noorderplantsoen park into a vibrant hub of international theatre, music, dance, literature, and visual arts, combined with food stalls and bars.",
                "indoor": false, 
                "best_time": "Late Afternoon/Evening (11 days in late August)",
                "price_range": "Free (park entry/atmosphere) / Moderate to High (ticketed performances)",
                "seasonal_notes": "Major international event. Very popular, creates a unique atmosphere in the park.",
                "booking_tips": "Book tickets for specific shows well in advance. Free performances and general park access available without tickets."
            },
            {
                "name": "Swimming at Hoornseplas/Paterswoldsemeer",
                "type": "Recreation/Nature",
                "description": "Cool off at the popular city beach and lake area just south of Groningen. Offers swimming, sunbathing, paddleboarding, and lakeside cafes.",
                "indoor": false,
                "best_time": "Daytime (warm weather)",
                "price_range": "Free (access) / Budget to Moderate (rentals/food)",
                "seasonal_notes": "Very popular local spot during heatwaves. Can get crowded.",
                "booking_tips": "Easily reachable by bike or bus. Check water quality if planning to swim."
            },
            {
                "name": "Outdoor Dining & Drinks (Terraces)",
                "type": "Food & Drink/Social",
                "description": "Peak season for enjoying Groningen's extensive terrace scene. The Grote Markt, Vismarkt, Poeleplein, and canal-side spots are bustling.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Varies",
                "seasonal_notes": "Long summer evenings are perfect for enjoying the lively city atmosphere outdoors.",
                "booking_tips": "Reservations often recommended for dinner on popular terraces."
            },
             {
                "name": "Explore Groningen by Canoe/SUP",
                "type": "Activity/Sightseeing",
                "description": "Rent a canoe or Stand-Up Paddleboard (SUP) to explore Groningen's canals ('diepen') from a different perspective.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate (rental costs)",
                "seasonal_notes": "A fun way to see the city and enjoy the water during summer months.",
                "booking_tips": "Several rental places available; book ahead on sunny weekends."
            },
            {
                "name": "Summer Festivals (Various)",
                "type": "Music/Culture",
                "description": "Check local listings for various smaller music festivals, neighbourhood events, and open-air cinema nights that often take place during summer.",
                "indoor": false, 
                "best_time": "Evenings/Weekends (check schedules)",
                "price_range": "Varies (Free to High)",
                "seasonal_notes": "Events like Kadepop or Paradigm Festival (techno/electronic) often happen in summer.",
                "booking_tips": "Follow local event pages (e.g., Groninger Uitburo) for announcements and tickets."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Cultural Season Opening",
                "type": "Arts/Culture",
                "description": "Major venues like Stadsschouwburg (theatre), Oosterpoort (music), SPOT Groningen, and Forum Groningen launch their new season programs.",
                "indoor": true,
                "best_time": "Evenings (check schedules)",
                "price_range": "Moderate to High",
                "seasonal_notes": "September/October sees a surge in theatre, music, and cultural events after the summer break.",
                "booking_tips": "Browse programs online and book tickets for desired performances."
            },
            {
                "name": "Bokbier Season",
                "type": "Food & Drink",
                "description": "Enjoy seasonal Dutch 'Herfstbok' (autumn bock beer) in Groningen's many pubs and specialty beer cafes like De Pintelier.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Bokbier arrives around late September/October. Look for 'Bokbier' signs outside pubs.",
                "booking_tips": "Many pubs offer multiple Bokbiers on tap; ask for advice or try a tasting platter if available."
            },
            {
                "name": "Cozy Cafe & Pub Visits",
                "type": "Social/Food & Drink",
                "description": "Retreat indoors to Groningen's cozy cafes (for coffee and cake) or traditional 'brown cafes' (for beers and 'borrelhapjes') as the weather turns cooler.",
                "indoor": true,
                "best_time": "Afternoon/Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Experience Dutch 'gezelligheid' (coziness) in classic pubs or modern cafes.",
                "booking_tips": "Popular spots can still be busy, especially weekends."
            },
            {
                "name": "Museum Exploration (Groninger Museum, Forum)",
                "type": "Culture/History/Art",
                "description": "Perfect weather for exploring indoor attractions like the striking Groninger Museum or the multi-functional Forum (library, cinema, exhibitions, rooftop view).",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Ideal for rainy or colder days. Check for temporary exhibitions.",
                "booking_tips": "Book tickets online, especially for popular exhibitions at the Groninger Museum."
            },
            {
                "name": "Walks in Autumn Colors (Noorderplantsoen, Stadspark)",
                "type": "Nature/Recreation",
                "description": "Enjoy the autumn foliage in Groningen's parks like Noorderplantsoen or the larger Stadspark.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "October often brings beautiful autumn colors to the trees.",
                "booking_tips": "Combine with a warm drink at a nearby cafe afterwards."
            }
        ]
    },
    "Winter": {
        "activities": [
             {
                "name": "Eurosonic Noorderslag (ESNS)",
                "type": "Major Music Festival/Conference",
                "description": "Europe's premier showcase festival for emerging music talent. Hundreds of acts perform in venues across the city center, alongside a music industry conference.",
                "indoor": true,
                "best_time": "Evenings (4 days in mid-January)",
                "price_range": "High (Festival pass) / Moderate (Single venue tickets, if available)",
                "seasonal_notes": "A huge event drawing international music professionals and fans. Creates a major buzz in the city.",
                "booking_tips": "Festival passes sell out far in advance. Accommodation is also scarce and expensive. Plan extremely early if attending."
            },
             {
                "name": "WinterWelVaart",
                "type": "Festival/Community Event",
                "description": "Historic ships moor along the canals (Hoge der A / Lage der A), decorated with lights. Enjoy music performances, theatre, art exhibitions onboard and along the quayside, plus winter market stalls.",
                "indoor": false,
                "best_time": "One Weekend in mid-December (Evening focus)",
                "price_range": "Free (quayside) / Budget to Moderate (onboard events)",
                "seasonal_notes": "A unique and atmospheric Groningen winter event.",
                "booking_tips": "Check the event program for specific ship activities and timings. Dress warmly."
            },
            {
                "name": "Sinterklaas Arrival (Intocht)",
                "type": "Traditional/Family Event",
                "description": "Welcome Sinterklaas (St. Nicholas) and his helpers ('Pieten') as they arrive in Groningen by boat, typically followed by a parade.",
                "indoor": false,
                "best_time": "One Saturday Morning in mid-November",
                "price_range": "Free",
                "seasonal_notes": "Kicks off the Sinterklaas season (gifts on Dec 5th). Primarily aimed at children.",
                "booking_tips": "Find a spot along the expected canal route (check local news) early."
            },
            {
                "name": "Christmas Atmosphere & Shopping",
                "type": "Shopping/Ambiance",
                "description": "Enjoy the festive lights and decorations in the city center, browse shops for gifts, and look out for small-scale Christmas markets or festive events.",
                "indoor": true, 
                "best_time": "December Evenings/Weekends",
                "price_range": "Free (atmosphere) / Varies (shopping/markets)",
                "seasonal_notes": "Groningen usually has festive lighting but less large-scale Christmas markets compared to some cities.",
                "booking_tips": "Check Forum Groningen or local event listings for special Christmas activities."
            },
            {
                "name": "Ice Skating (Potential - Kardinge or Temporary Rink)",
                "type": "Recreation",
                "description": "Go ice skating at the indoor Kardinge sports center, or check if a temporary outdoor rink is set up in the city center (availability varies yearly).",
                "indoor": true, 
                "best_time": "Daytime/Evening",
                "price_range": "Budget to Moderate (entry + rental)",
                "seasonal_notes": "Kardinge offers reliable indoor skating. Outdoor rinks depend on event organizers.",
                "booking_tips": "Check Kardinge's website for public skating hours. Look for announcements about temporary rinks closer to winter."
            },
            {
                "name": "Oliebollen & Winter Treats",
                "type": "Food & Drink",
                "description": "Indulge in Dutch winter classics like 'oliebollen' (doughnuts) and 'appelflappen' (apple fritters) from street stalls ('kramen') appearing in late autumn/winter.",
                "indoor": false,
                "best_time": "December/January",
                "price_range": "Budget",
                "seasonal_notes": "A must-try treat, especially around New Year's Eve.",
                "booking_tips": "Stalls are often found near Vismarkt or shopping streets. Best eaten warm."
            }
        ]
    }
} 