{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Quieter Off-Season Atmosphere",
                "details": "Experience Stavanger with significantly fewer tourists than in peak season. Enjoy a more relaxed exploration of the city and its attractions."
            },
            {
                "reason": "Cozy Indoor Activities & Museums",
                "details": "Perfect time to explore Stavanger's excellent museums (Petroleum Museum, Maritime Museum, Canning Museum, Art Museum) and enjoy the warmth of cafes and restaurants ('kos')."
            },
            {
                "reason": "Potential for Crisp, Clear Winter Days",
                "details": "While often wet, February can offer beautiful, crisp winter days with low sun, ideal for atmospheric walks around the city center or along the coast (if conditions allow)."
            },
            {
                "reason": "Lower Off-Season Prices",
                "details": "Benefit from potentially lower prices for flights and accommodation compared to peak summer or Christmas seasons."
            },
            {
                "reason": "Experience Authentic Local Life",
                "details": "Witness the city as the locals live it during winter, potentially finding local events or enjoying less crowded public spaces."
            },
            {
                "reason": "Winter Hiking (Conditional & Low Altitude)",
                "details": "Some low-altitude coastal trails or local hills like Dalsnuten might be hikeable, but require careful checking of conditions (ice, mud) and appropriate gear (waterproof, good grip, possibly cleats)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cold, Wet, and Windy Coastal Winter",
                "details": "February is typically Stavanger's coldest month (average highs ~2°C/36°F, lows below freezing). Expect frequent rain, sleet, potential wet snow, and strong, chilling coastal winds."
            },
            {
                "reason": "Very High Chance of Ice",
                "details": "Frequent freeze-thaw cycles mean icy sidewalks and roads are highly likely and hazardous. Good grip waterproof footwear is essential; ice cleats ('brodder') strongly recommended."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "Although increasing, daylight is still limited (approx. 8-10 hours). Outdoor activities need to be planned within this shorter window."
            },
            {
                "reason": "Iconic Hikes Likely Inaccessible/Dangerous",
                "details": "Preikestolen (Pulpit Rock) and Kjeragbolten are generally considered off-season and unsafe for hiking due to snow, ice, and unpredictable mountain weather."
            },
            {
                "reason": "Fewer Fjord Cruises & Tours Operating",
                "details": "Many tourist-oriented fjord cruises and specific guided tours may operate on reduced schedules or not at all during the deep off-season."
            },
            {
                "reason": "No Guarantee of Snow in the City",
                "details": "While snow is possible, Stavanger's coastal location means rain and sleet are more common than persistent, picturesque snow cover in the city itself."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "2°C (36°F)",
                    "low": "-2°C (28°F)"
                },
                "precipitation": "High chance of precipitation: rain, sleet, wet snow common. Often overcast and damp. Strong winds possible. Icy conditions very likely, especially mornings.",
                "general_tips": "Waterproof and windproof outerwear (jacket, trousers) is crucial. Warm layers (wool, fleece), thermal base layers, hat, gloves, scarf are essential. Waterproof boots with excellent grip mandatory. Carry ice cleats."
            },
            "tourism_level": {
                "crowds": "Low. One of the quietest times to visit.",
                "pricing": "Generally off-season pricing for accommodation and flights. Good value possible.",
                "overall_atmosphere": "Quiet winter atmosphere. Focus on indoor activities, museums, cafes. Outdoor exploration requires careful planning and gear."
            },
            "events_holidays": [
                {
                    "name": "Valentine's Day (Valentinsdagen)",
                    "date": "February 14",
                    "description": "Recognized, but not a major public holiday. Some restaurants might offer special menus.",
                    "notes": "Book restaurants in advance if planning a special meal."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit the Norwegian Petroleum Museum",
                    "where": "Kjeringholmen",
                    "description": "Explore Norway's oil and gas history with interactive exhibits. Ideal for a cold or wet day.",
                    "practical_tips": "Allow 2-3 hours. Warm and dry inside.",
                    "best_time": "During opening hours.",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore Gamle Stavanger (Old Stavanger)",
                    "where": "West side of Vågen harbour",
                    "description": "Wander the charming, potentially icy cobblestone streets lined with historic white wooden houses.",
                    "practical_tips": "Wear boots with excellent grip and consider ice cleats. Best during limited daylight hours. Respect residents.",
                    "best_time": "Daylight hours (approx. 9 AM - 4 PM)",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Warm Up in a Cozy Cafe",
                    "where": "Sentrum, Fargegaten",
                    "description": "Escape the elements and enjoy a hot drink ('kaffe', 'kakao') and pastry in one of Stavanger's many cafes. Embrace 'kos'.",
                    "practical_tips": "Look for cafes with comfortable seating and a warm atmosphere.",
                    "best_time": "Anytime, especially when needing a break from the cold/wet.",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                 {
                    "activity": "Visit Stavanger Art Museum (Kunstmuseum)",
                    "where": "Near Mosvatnet lake",
                    "description": "View collections of Norwegian art, including works by Lars Hertervig.",
                    "practical_tips": "Check opening hours. Requires a short bus ride or longer walk from the city center.",
                    "best_time": "During opening hours.",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "2°C (36°F)",
                    "low": "-1°C (30°F)"
                },
                "precipitation": "Conditions remain similar: cold, damp, windy with frequent rain/sleet/wet snow. Ice remains a significant hazard. Daylight hours increase noticeably towards month's end (~9-10 hours).",
                "general_tips": "No change in gear recommendations - stay warm, dry, and prepared for ice. Utilize the slightly longer daylight."
            },
            "tourism_level": {
                "crowds": "Remains Low. Still off-season.",
                "pricing": "Off-season pricing likely continues.",
                "overall_atmosphere": "Late winter feel. Slightly more daylight offers better window for potential outdoor walks, but weather remains dominant factor. Focus still largely indoors."
            },
            "events_holidays": [
                {
                    "name": "Carnival / Fastelavn Period",
                    "date": "Varies (Shrovetide period, 40 days before Easter)",
                    "description": "Minor observance in Norway. Look for 'Fastelavnsboller' (sweet buns with cream) in bakeries around this time.",
                    "notes": "Not a major public event or festival in Stavanger typically."
                },
                {
                    "name": "Local School Winter Break ('Vinterferie' - Potential Timing)",
                    "date": "One week, often late Feb/early Mar (check Rogaland county calendar)",
                    "description": "May slightly increase local activity at family attractions or indoor venues, but minimal impact on tourism.",
                    "notes": "City remains generally quiet for tourists."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the Norwegian Canning Museum",
                    "where": "Gamle Stavanger",
                    "description": "Discover the history of Stavanger's important sardine canning industry in an authentic old factory.",
                    "practical_tips": "Interesting insight into local industrial history. Check opening times.",
                    "best_time": "During opening hours.",
                    "estimated_cost": "Moderate (entry fee, often bundled with Maritime Museum)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk around Mosvatnet or Stokkavatnet Lakes",
                    "where": "Near city center / slightly west",
                    "description": "Enjoy a brisk walk around local lakes, popular with residents for exercise.",
                    "practical_tips": "Paths are generally paved/gravel but check for icy patches carefully. Dress warmly. Mosvatnet is closer to the center.",
                    "best_time": "Daylight hours.",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Stavanger Cathedral (Check Status)",
                    "where": "City Center",
                    "description": "Admire Norway's oldest cathedral. Note: Has been undergoing extensive renovation, check if accessible internally.",
                    "practical_tips": "Even if closed internally, the exterior architecture is notable. Check official website for current renovation status and access.",
                    "best_time": "Daylight hours for exterior viewing.",
                    "estimated_cost": "Free (exterior) / Low (if internal access available)",
                    "weather_dependent": false
                },
                {
                    "activity": "Coastal Walk (Conditions Permitting)",
                    "where": "e.g., near Sola beach or along Hafrsfjord",
                    "description": "Experience the raw coastal scenery on a bracing walk, if weather is dry and winds are manageable.",
                    "practical_tips": "Requires transport (bus/car). Check weather forecast meticulously. Trails can be muddy/icy. Dress extremely well for wind and cold.",
                    "best_time": "Dry, calmest possible day during daylight.",
                    "estimated_cost": "Low (transport)",
                    "weather_dependent": true
                }
            ]
        }
    }
}