{
    "July": {
        "reasons_to_visit": [
            {
                "reason": "Best Summer Weather & Long Days",
                "details": "July offers Stavanger's warmest temperatures (avg. highs ~17°C/62°F) and very long daylight hours (approx. 17-18 hours), ideal for maximizing outdoor activities."
            },
            {
                "reason": "Prime Hiking Season (Iconic Hikes Open)",
                "details": "Ideal conditions for hiking Preikestolen (Pulpit Rock) and Kjeragbolten (check local conditions/advice first). Trails are generally snow-free and fully accessible."
            },
            {
                "reason": "Gladmat Food Festival (Often Late June/Early July)",
                "details": "Experience Scandinavia's largest food festival, filling the harbour with local and international food stalls, cooking demos, and a vibrant atmosphere (check exact dates yearly)."
            },
            {
                "reason": "Fjord Cruises & Island Exploration",
                "details": "Peak season for Lysefjord cruises (seeing Pulpit Rock from below, waterfalls), kayaking, RIB boat tours, and exploring nearby islands or coastal towns like Egersund."
            },
            {
                "reason": "Vibrant City & Coastal Life",
                "details": "Stavanger buzzes with summer energy. Enjoy outdoor seating at cafes/restaurants along the harbour (Vågen), explore Gamle Stavanger in bloom, and visit local beaches (e.g., Sola Strand)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Absolute Peak Tourist Season & Highest Prices",
                "details": "July is the busiest month. Expect maximum crowds at popular hikes (Preikestolen especially), Fjellheisen (if taking), city center, and on tours. Flights, accommodation, and rental cars are most expensive."
            },
            {
                "reason": "Everything Must Be Booked Far in Advance",
                "details": "Extremely high demand means booking accommodation, popular tours (fjord cruises, hiking guides), rental cars, and Gladmat-related events months ahead is crucial."
            },
            {
                "reason": "Variable Coastal Weather",
                "details": "While potentially warm and sunny, Stavanger's coastal weather remains unpredictable. Be prepared for rain showers, wind, and cooler days. Pack layers and waterproofs."
            },
            {
                "reason": "Potential for Crowded Hiking Trails",
                "details": "Iconic hikes like Preikestolen can become extremely crowded, potentially detracting from the experience. Starting very early or late is recommended."
            },
            {
                "reason": "Gladmat Festival Impact",
                "details": "If visiting during Gladmat, expect the city center (especially the harbour) to be extremely busy and potentially noisy. Accommodation prices will be even higher."
            }
        ],
        "first_half": {
            "date_range": "July 1–15",
            "weather": {
                "average_temperature": {
                    "high": "17°C (62°F)",
                    "low": "12°C (54°F)"
                },
                "precipitation": "Mix of sunny periods and potential rain showers. Long daylight hours (approx. 18 hours). Can feel cooler with coastal breezes.",
                "general_tips": "Pack layers: T-shirts, fleece/sweater, waterproof/windproof jacket. Sunscreen and sunglasses needed for sunny days. Comfortable walking/hiking shoes essential."
            },
            "tourism_level": {
                "crowds": "Peak season. Very busy, especially if Gladmat falls in this period. Book everything.",
                "pricing": "Highest prices of the year. Advance booking mandatory.",
                "overall_atmosphere": "Vibrant summer atmosphere. Long days encourage outdoor exploration. Focus on hiking, fjord trips, city sightseeing, and potentially Gladmat festival."
            },
            "events_holidays": [
                 {
                    "name": "Gladmat Food Festival (Potentially)",
                    "date": "Check exact dates yearly (often late June/early July)",
                    "description": "Scandinavia's largest food festival potentially takes place during this period, dominating the harbour area.",
                    "notes": "Confirm dates. Requires booking accommodation/travel extremely early if attending."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Hike Preikestolen (Pulpit Rock)",
                    "where": "Requires ferry/bus or car from Stavanger",
                    "description": "Undertake the iconic hike to the flat-topped cliff overlooking Lysefjord. Allow a full day.",
                    "practical_tips": "Start VERY early (e.g., first ferry/bus) to avoid the worst crowds. Check weather forecast. Wear proper hiking boots. Bring water/food. Parking fills quickly.",
                    "best_time": "Early morning on a clear day.",
                    "estimated_cost": "Moderate (transport/parking)",
                    "weather_dependent": true
                },
                {
                    "activity": "Lysefjord Cruise",
                    "where": "Departing from Skagenkaien, Stavanger",
                    "description": "Take a 2-3 hour cruise into the stunning Lysefjord, seeing waterfalls, wildlife, Fantahålå (Vagabond's Cave), and Pulpit Rock from below.",
                    "practical_tips": "Multiple operators, book in advance during peak season. Choose between standard ferry or faster RIB boat tours.",
                    "best_time": "Daytime, check schedules.",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                },
                 {
                    "activity": "Explore Gamle Stavanger (Old Stavanger)",
                    "where": "West side of Vågen harbour",
                    "description": "Wander the charming cobblestone streets lined with Europe's best-preserved wooden houses (18th/19th century), often adorned with flowers in summer.",
                    "practical_tips": "Easy walk from city center. Respect residents' privacy. Visit the Canning Museum located within the area.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (to walk around)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Sola Beach (Solastranden)",
                    "where": "Near Stavanger Airport (requires bus/car)",
                    "description": "Enjoy one of Norway's most famous beaches, known for its long sandy stretches and sand dunes. Popular for walks, sunbathing (if warm enough), and wind/kitesurfing.",
                    "practical_tips": "Can be windy. Water is cold for swimming. Easily accessible by bus or car. Sola Strand Hotel nearby for refreshments.",
                    "best_time": "Sunny day",
                    "estimated_cost": "Low (transport)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "July 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C (62°F)",
                    "low": "12°C (54°F)"
                },
                "precipitation": "Similar conditions to early July. Mix of sun and potential rain showers. Daylight hours start very gradually decreasing but remain very long (~17 hours).",
                "general_tips": "Continue with versatile layers and waterproof gear. Be prepared for changing conditions, especially if hiking."
            },
            "tourism_level": {
                "crowds": "Remains absolute peak season. High demand for all activities and accommodation.",
                "pricing": "Highest prices persist. Last-minute availability is rare.",
                "overall_atmosphere": "Peak summer holiday season. Busy, lively atmosphere in the city and popular nature spots."
            },
            "events_holidays": [
                 {
                    "name": "Gladmat Food Festival (Potentially)",
                    "date": "Check exact dates yearly (often late June/early July)",
                    "description": "If not held earlier, Scandinavia's largest food festival might occur in this period.",
                    "notes": "Confirm dates. Book accommodation/travel very early."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Hike Kjeragbolten (Requires fitness & preparation)",
                    "where": "Lysebotn (requires car/bus/ferry - long day trip)",
                    "description": "Challenge yourself with the demanding hike to Kjerag mountain, famous for the boulder wedged between two cliffs. Requires significant time and effort.",
                    "practical_tips": "Very strenuous hike (allow 10-12 hours total travel/hike). Check road/ferry access to Lysebotn. Only attempt in good, stable weather. Not for those afraid of heights. Go with guide if unsure.",
                    "best_time": "Early morning on a very good weather day.",
                    "estimated_cost": "Moderate to High (transport, potential guide)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore the Colourful Street (Øvre Holmegate)",
                    "where": "Fargegaten, Sentrum",
                    "description": "Stroll down Stavanger's vibrant street where houses are painted in bright colours, lined with unique shops, cafes, and pubs with outdoor seating.",
                    "practical_tips": "Popular spot for photos and relaxing with a drink/coffee. Can get busy.",
                    "best_time": "Daytime or evening",
                    "estimated_cost": "Free (to walk), Low-Moderate (cafes/shops)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Island Hopping (e.g., Vassøy, Kvitsøy)",
                    "where": "Local ferries from Stavanger Fiskepirterminalen",
                    "description": "Take local ferries to nearby small islands for a different perspective, coastal walks, and a quieter atmosphere away from the main crowds.",
                    "practical_tips": "Check ferry timetables carefully (Ryfylke Kollektivtrafikk - Kolumbus). Limited services/facilities on some islands. Bring snacks/water.",
                    "best_time": "Daytime on a clear day",
                    "estimated_cost": "Low (ferry tickets)",
                    "weather_dependent": true
                 },
                  {
                    "activity": "Visit the Norwegian Petroleum Museum",
                    "where": "Kjeringholmen, Stavanger harbour",
                    "description": "Explore the interactive exhibits detailing Norway's significant oil and gas history. A good option for a potentially rainy afternoon.",
                    "practical_tips": "Allow 2-3 hours. Located centrally by the harbour.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                 }
            ]
        }
    }
}