{
    "Spring": {
        "activities": [
            {
                "name": "Bari Vecchia Walking Tour",
                "type": "Cultural Tour",
                "description": "Explore Bari's historic old town with perfect spring weather. Wander through narrow alleys, visit the Basilica di San Nicola, and discover hidden courtyards and traditional architecture.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers ideal walking conditions with pleasant temperatures and fewer crowds than summer. Perfect for exploring the maze-like streets of the old town.",
                "booking_tips": "Start early to avoid afternoon heat. Wear comfortable walking shoes. Consider a local guide for hidden gems and historical context."
            },
            {
                "name": "Spring Market at Mercato del Pesce",
                "type": "Market Experience",
                "description": "Experience Bari's famous fish market during spring when fresh seafood is abundant. Watch local fishermen, learn about Mediterranean fish varieties, and enjoy the authentic atmosphere.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the best selection of fresh Mediterranean fish. Market is most lively early morning when fishing boats return.",
                "booking_tips": "Arrive early for best selection. Bring a camera for the colorful displays. Try fresh seafood at nearby restaurants."
            },
            {
                "name": "Lungomare Promenade Walk",
                "type": "Outdoor Activity",
                "description": "Enjoy a leisurely walk along Bari's beautiful waterfront promenade with perfect spring weather. Take in views of the Adriatic Sea and the city skyline.",
                "indoor": false,
                "best_time": "Morning or Evening",
                "price_range": "Free",
                "seasonal_notes": "Spring offers comfortable temperatures for waterfront walks. Beautiful light for photography and fewer crowds than summer.",
                "booking_tips": "Best light is early morning or golden hour. Bring a camera for stunning coastal views. Many cafés along the promenade."
            },
            {
                "name": "Basilica di San Nicola Visit",
                "type": "Cultural Tour",
                "description": "Visit Bari's most important religious site, the Basilica di San Nicola, in perfect spring weather. Explore the stunning Romanesque architecture and learn about Saint Nicholas.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers comfortable temperatures for exploring the historic center. Beautiful light for photography and fewer crowds than summer.",
                "booking_tips": "Modest dress required. Visit early morning for best light and fewer crowds. Guided tours available."
            },
            {
                "name": "Spring Photography at Castello Svevo",
                "type": "Photography",
                "description": "Capture stunning spring landscapes of Bari's medieval castle with perfect lighting conditions. Photograph the dramatic fortress, coastal views, and spring flowers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring light provides excellent photography conditions. Castle grounds are beautiful with spring blooms and pleasant temperatures.",
                "booking_tips": "Best light is 1-2 hours after sunrise. Bring tripod for architectural shots. Castle interior tours available separately."
            },
            {
                "name": "Spring Beach Day at Pane e Pomodoro",
                "type": "Beach Activity",
                "description": "Enjoy Bari's main beach before the summer crowds arrive. Perfect weather for sunbathing, beach walks, and enjoying the Adriatic Sea views.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers pleasant temperatures and fewer crowds. Water may still be cool but beaches are peaceful and beautiful.",
                "booking_tips": "Beach facilities open in spring with better prices than peak season. Bring layers for changing temperatures."
            },
            {
                "name": "Traditional Bari Cooking Workshop",
                "type": "Culinary Experience",
                "description": "Learn to cook traditional Bari dishes using spring ingredients like fresh herbs, seasonal vegetables, and local olive oil. Master dishes like orecchiette and seafood specialties.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring provides the best seasonal ingredients for authentic Bari cuisine. Perfect time to learn local culinary traditions.",
                "booking_tips": "Book in advance with local cooking schools. Often includes market visits and full meal preparation."
            },
            {
                "name": "Boat Trip to Polignano a Mare",
                "type": "Nature Excursion",
                "description": "Take advantage of spring weather to visit the stunning coastal town of Polignano a Mare. Explore sea caves, dramatic cliffs, and beautiful beaches.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers ideal conditions for coastal exploration. Fewer tourists and pleasant temperatures for sightseeing.",
                "booking_tips": "Book boat tours in advance. Bring water and comfortable shoes for exploring the town."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Adriatic Sea Boat Tour",
                "type": "Maritime Experience",
                "description": "Experience the stunning Adriatic coast from the water with boat tours to hidden coves, sea caves, and coastal villages. Perfect for swimming and coastal photography.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular coastal views and perfect swimming conditions. Peak season for boat tours.",
                "booking_tips": "Book boat tours well in advance during peak season. Consider private charters for more intimate experiences."
            },
            {
                "name": "Beach Club Experience at Pane e Pomodoro",
                "type": "Luxury Beach Activity",
                "description": "Enjoy exclusive beach clubs with private beach access, water sports, gourmet dining, and stunning views of the Adriatic Sea.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer is peak season for beach clubs. Perfect weather for swimming, sunbathing, and luxury beach experiences.",
                "booking_tips": "Reserve beach beds and dining well in advance. Dress codes may apply at upscale clubs."
            },
            {
                "name": "Sunset Sailing on the Adriatic",
                "type": "Boat Experience",
                "description": "Charter a yacht or join a sailing excursion to experience the stunning Adriatic sunset from the water, with views of Bari's coastline.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular sunsets and calm sea conditions. Perfect for romantic experiences.",
                "booking_tips": "Book private charters or group excursions in advance. Sunset tours are most popular."
            },
            {
                "name": "Evening Stroll in Bari Vecchia",
                "type": "Cultural Experience",
                "description": "Experience the magical evening atmosphere in Bari's historic old town, with illuminated basilica, charming streets, and Mediterranean backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings are magical with warm temperatures and vibrant atmosphere. Perfect for people-watching and photography.",
                "booking_tips": "No booking required. Best atmosphere during sunset and early evening. Many restaurants stay open late."
            },
            {
                "name": "Water Sports at Marina di Bari",
                "type": "Adventure Activity",
                "description": "Enjoy water sports including jet skiing, paddleboarding, and snorkeling at the main harbor with excellent facilities and clear waters.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers perfect water temperatures and calm conditions for water sports. Professional instructors available.",
                "booking_tips": "Book water sports activities in advance during peak season. Equipment rental available on-site."
            },
            {
                "name": "Puglia Wine Tasting",
                "type": "Wine Experience",
                "description": "Visit local vineyards in the Puglia wine region to taste local wines and learn about Bari's winemaking traditions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer offers insights into winemaking. Indoor tastings provide relief from afternoon heat.",
                "booking_tips": "Book vineyard tours in advance. Often includes transportation and food pairings. Designated driver required."
            },
            {
                "name": "Evening Aperitivo Culture",
                "type": "Social Experience",
                "description": "Experience authentic Italian social life with evening aperitifs at waterfront cafés, watching the sunset over the Adriatic Sea.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor socializing. Experience the relaxed Mediterranean lifestyle.",
                "booking_tips": "No booking needed for most cafés. Best spots along the waterfront. Try local wines and Italian cocktails."
            },
            {
                "name": "Bari Summer Music Festival",
                "type": "Cultural Festival",
                "description": "Experience the vibrant summer music scene with concerts in stunning venues, including the castle courtyard and waterfront locations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer brings various music festivals and outdoor concerts in beautiful settings throughout the city.",
                "booking_tips": "Book concert tickets months in advance. Consider package deals with dining experiences."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Autumn Hiking in Parco 2 Giugno",
                "type": "Outdoor Activity",
                "description": "Enjoy perfect hiking weather to explore Bari's largest park with stunning autumn colors, walking paths, and peaceful green spaces.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Ideal hiking temperatures without summer heat. Crystal clear autumn air provides spectacular views of the city.",
                "booking_tips": "Start early to avoid afternoon heat. Bring camera and comfortable walking shoes. Park is easily accessible from city center."
            },
            {
                "name": "Autumn Market at Mercato delle Erbe",
                "type": "Market Experience",
                "description": "Experience the autumn harvest at Bari's main food market with seasonal produce, local specialties, and authentic Italian atmosphere.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings seasonal specialties like truffles, mushrooms, and autumn fruits. Market is less crowded than summer.",
                "booking_tips": "Visit early for best selection. Try seasonal specialties and local autumn products."
            },
            {
                "name": "Truffle Season Culinary Experience",
                "type": "Culinary Experience",
                "description": "Experience the start of truffle season in Puglia, with special menus at local restaurants and truffle markets in nearby villages.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Truffle season begins in autumn. Many restaurants feature special truffle menus during this period.",
                "booking_tips": "Reserve at restaurants known for truffle dishes. Consider truffle hunting experiences in nearby areas."
            },
            {
                "name": "Wine Harvest in Puglia",
                "type": "Agricultural Experience",
                "description": "Join local vineyards during harvest season to pick grapes and learn about traditional Puglia winemaking.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September to October is harvest season. Experience authentic agricultural traditions and seasonal rhythms.",
                "booking_tips": "Contact local vineyards directly. Often includes meals and wine tasting. Advance booking essential."
            },
            {
                "name": "Storm Watching at Lungomare",
                "type": "Natural Phenomenon",
                "description": "Experience the dramatic autumn storms and wild seas from the safety of the waterfront promenade, watching powerful waves crash against the shore.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings more dramatic weather and spectacular storm watching opportunities. Impressive wave action on the Adriatic.",
                "booking_tips": "Check weather conditions for safety. Best during windy days. Dress warmly and bring rain protection."
            },
            {
                "name": "Traditional Craft Workshops",
                "type": "Cultural Workshop",
                "description": "Learn traditional Bari crafts like ceramics, olive wood carving, or pasta making from local artisans.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is perfect for learning indoor crafts. Many artisans offer workshops as tourist season winds down.",
                "booking_tips": "Book with local artisan associations. Often includes take-home pieces. Great for unique souvenirs."
            },
            {
                "name": "Mushroom Foraging in Local Forests",
                "type": "Nature Activity",
                "description": "Join guided foraging trips to discover edible mushrooms in local forests, learning about varieties and traditional uses.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Peak mushroom season in local forests. Important part of traditional Italian cuisine and culture.",
                "booking_tips": "Must join guided tours for safety. Often includes cooking session. Check weather for recent rain."
            },
            {
                "name": "Autumn Photography Tour",
                "type": "Photography",
                "description": "Capture the stunning autumn colors and dramatic light throughout Bari with guided photography tours.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn provides perfect lighting conditions and dramatic skies for urban and coastal photography.",
                "booking_tips": "Book with local photography guides. Bring appropriate equipment for changing weather conditions."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Market in Piazza del Ferrarese",
                "type": "Holiday Market",
                "description": "Experience the charming Christmas market featuring local Italian crafts, seasonal treats, and holiday decorations in the heart of Bari.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Brings festive warmth to winter evenings. Features unique Italian holiday traditions and locally made gifts.",
                "booking_tips": "No booking required. Best atmosphere in evening when lights are on. Try local holiday specialties."
            },
            {
                "name": "Indoor Museum and Cultural Sites",
                "type": "Cultural Activity",
                "description": "Spend winter days exploring Bari's excellent museums including the Archaeological Museum and Pinacoteca during cooler weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect weather for indoor cultural exploration. Museums are less crowded and offer deeper exploration opportunities.",
                "booking_tips": "Consider museum passes for multiple visits. Many offer guided tours. Combine with café stops for warmth."
            },
            {
                "name": "Traditional Italian Winter Meals",
                "type": "Culinary Experience",
                "description": "Enjoy hearty winter meals featuring Italian specialties, truffles, and other traditional winter foods in cozy local restaurants.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Peak season for traditional winter foods. Many restaurants feature special winter menus with seasonal ingredients.",
                "booking_tips": "Reserve at traditional restaurants. Try pairing with local Puglia wines and aged cheeses."
            },
            {
                "name": "Thermal Springs in nearby areas",
                "type": "Wellness Activity",
                "description": "Warm up in natural thermal springs in nearby areas, a perfect winter retreat offering relaxation and therapeutic benefits.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Natural hot springs provide warmth during cooler months. Beautiful winter scenery surrounding the springs.",
                "booking_tips": "Check transportation schedules in winter. Bring towels and warm clothes for changing. Book thermal spa treatments in advance."
            },
            {
                "name": "Storm Photography and Coastal Views",
                "type": "Photography",
                "description": "Capture dramatic winter storms and moody Adriatic seascapes from coastal viewpoints and waterfront locations.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and stormy seas perfect for photography. Clear post-storm days offer incredible visibility.",
                "booking_tips": "Dress warmly and protect camera equipment. Best after storms when light is dramatic. Check wind conditions for safety."
            },
            {
                "name": "Cozy Wine Bar Evenings",
                "type": "Social Activity",
                "description": "Warm up in traditional wine bars with local Puglia vintages, charcuterie platters, and the company of locals during long winter evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect season for indoor socializing. Wine bars offer warmth, local atmosphere, and seasonal food pairings.",
                "booking_tips": "No reservations usually needed. Learn basic Italian phrases for better interaction. Try different neighborhoods for variety."
            },
            {
                "name": "Winter Beach Walks",
                "type": "Nature Activity",
                "description": "Enjoy peaceful winter walks along the beaches with dramatic winter light, fewer crowds, and the therapeutic sound of winter waves.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter beaches offer peaceful solitude and dramatic natural beauty. Perfect for reflection and photography.",
                "booking_tips": "Dress warmly and wear appropriate footwear. Best during low tide for beach exploration."
            },
            {
                "name": "Italian Olive Oil Tasting",
                "type": "Culinary Experience",
                "description": "Visit local olive mills during the winter harvest season to taste fresh olive oil and learn about traditional production methods.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is olive harvest season in Italy. Experience the production of one of the region's most important products.",
                "booking_tips": "Book tours in advance with local olive mills. Often includes tastings and product purchases."
            }
        ]
    }
}