{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Awakening",
                "details": "March brings noticeably milder temperatures (average highs 16-18°C) and more sunshine to Heraklion, perfect for exploring Knossos, the city walls, and the harbor comfortably."
            },
            {
                "reason": "Blooming Countryside",
                "details": "Crete bursts into bloom in March. The countryside around Heraklion becomes vibrant with wildflowers, making drives or walks exceptionally scenic."
            },
            {
                "reason": "Fewer Crowds & Shoulder Season Value",
                "details": "Enjoy Knossos Palace, the Archaeological Museum, and the Old Town with significantly fewer crowds than peak season. Accommodation prices are generally moderate (outside potential Carnival/Easter/Independence Day)."
            },
            {
                "reason": "Greek Independence Day (March 25th)",
                "details": "Witness patriotic celebrations in Heraklion, typically including parades (student/military) along the main avenues near Plateia Eleftherias, offering a unique cultural experience."
            },
            {
                "reason": "Carnival ('Apokries') & Clean Monday Potential",
                "details": "Depending on the Orthodox calendar, Carnival often culminates in early March. Experience local events, Tsiknopempti grilling, or Clean Monday ('Kathara Deftera') kite flying (e.g., beaches near Heraklion) and Lenten foods."
            },
            {
                "reason": "Ideal Hiking & Exploring Weather",
                "details": "Comfortable temperatures are great for exploring archaeological sites, walking the Venetian walls, or even attempting easier gorge hikes (check conditions first) before summer heat."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "March weather in Crete can be unpredictable ('Martis Gdartis' - 'Fickle March'). Expect potential for rain showers, windy days (North or South winds), and cool spells alongside beautiful sunny periods. Pack layers."
            },
            {
                "reason": "Cool Evenings",
                "details": "Evenings remain cool (average lows 9-10°C), especially if windy. A jacket or fleece is necessary."
            },
            {
                "reason": "Carnival/Clean Monday Crowds & Closures (if applicable)",
                "details": "If Carnival's final days or Clean Monday fall in March, expect crowds for events (especially in Rethymno if visiting), potential transport impacts, and closures on Clean Monday (public holiday)."
            },
            {
                "reason": "March 25th Holiday Closures",
                "details": "Independence Day (March 25th) is a major public holiday. Expect widespread closures (shops, museums, sites). The parade causes road closures in central Heraklion."
            },
            {
                "reason": "Pollen Season Begins",
                "details": "The explosion of spring flowers means high pollen counts, which can affect allergy sufferers."
            },
            {
                "reason": "Sea Still Too Cold for Swimming",
                "details": "The Mediterranean Sea is still quite cold (around 16°C), generally too chilly for comfortable swimming."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C",
                    "low": "9°C"
                },
                "precipitation": "Moderate chance of rain showers continues, but sunny periods become more frequent and longer. Can be windy.",
                "general_tips": "Pack layers: t-shirts, long sleeves, fleece/sweater, a waterproof and wind-resistant jacket. Comfortable walking shoes essential. Umbrella useful."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. A noticeable pickup from winter, but sites are still relatively uncrowded. Very busy if peak Carnival/Clean Monday falls here.",
                "pricing": "Good shoulder season value, unless coinciding with Carnival peak.",
                "overall_atmosphere": "Transition month. Feel the shift towards spring, potentially very lively if Carnival culminates."
            },
            "events_holidays": [
                {
                    "name": "Carnival ('Apokries') Peak & Clean Monday ('Kathara Deftera')",
                    "date": "Varies (often early March - check dates)",
                    "description": "If occurring, expect peak Carnival festivities (check Heraklion events, Rethymno is famous). Clean Monday is celebrated with kite flying (beaches, open areas) and Lenten picnics.",
                    "notes": "Clean Monday is a public holiday - expect closures. Good day for outdoor activities if weather permits."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Clean Monday Kite Flying (if applicable)",
                    "where": "Beaches near Heraklion (e.g., Amoudara, Karteros), open spaces",
                    "description": "Join locals flying colourful kites and enjoying Lenten foods outdoors if Clean Monday falls in this period. Beaches are popular spots.",
                    "practical_tips": "Dress for potentially windy conditions. Bring/buy a kite. Enjoy the festive, family atmosphere.",
                    "best_time": "Daytime on Clean Monday",
                    "estimated_cost": "Low (food/kite extra)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Knossos Palace",
                    "where": "Just south of Heraklion",
                    "description": "Visit the iconic Minoan palace complex in pleasant temperatures and with fewer crowds than later in spring or summer.",
                    "practical_tips": "Check opening hours. Wear comfortable shoes. Allow 2-3 hours.",
                    "best_time": "Daytime (morning often best)",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Heraklion Archaeological Museum",
                    "where": "Heraklion city center",
                    "description": "Explore the world-renowned collection of Minoan art and artifacts. An excellent indoor activity for any weather.",
                    "practical_tips": "Allow 2-3 hours minimum. Consider combo ticket with Knossos.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk the Venetian Walls",
                    "where": "Encircling the old city of Heraklion",
                    "description": "Enjoy a walk along sections of the impressive Venetian fortifications, offering great views over the city, especially as it greens up.",
                    "practical_tips": "Accessible from various points. Visit the Martinengo Bastion (Kazantzakis tomb). Wear comfortable shoes.",
                    "best_time": "Sunny afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "10°C"
                },
                "precipitation": "Decreasing chance of rain, sunny days become more dominant. Feels distinctly spring-like, perfect for outdoor activities.",
                "general_tips": "Continue layering, but lighter options needed. Sunscreen increasingly important. Comfortable walking shoes remain key."
            },
            "tourism_level": {
                "crowds": "Moderate shoulder season crowds. Steadily increasing towards Easter/April. Very busy around March 25th due to parade/holiday.",
                "pricing": "Shoulder season rates, but check for potential increases around Independence Day weekend.",
                "overall_atmosphere": "Pleasant spring feel. Good mix of local life and tourism. Strong patriotic atmosphere around March 25th."
            },
            "events_holidays": [
                 {
                    "name": "Greek Independence Day (National Holiday)",
                    "date": "March 25",
                    "description": "Commemorates the 1821 revolution against Ottoman rule. Heraklion hosts parades (military, student) typically along central avenues.",
                    "notes": "Major public holiday. Widespread closures (sites, museums, shops). Significant road closures near parade route. Expect large crowds."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Watch the Independence Day Parade in Heraklion",
                    "where": "Central Heraklion avenues (check local announcements for route)",
                    "description": "Experience the patriotic fervor with military units, school groups, and cultural associations marching on March 25th.",
                    "practical_tips": "Arrive extremely early for a good viewing spot. Expect large crowds and road closures. Dress appropriately for weather.",
                    "best_time": "Morning of March 25th",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Archanes or Cretan Countryside",
                    "where": "Villages/areas south of Heraklion",
                    "description": "Take advantage of the pleasant weather and blooming wildflowers with a drive to the charming village of Archanes or explore the surrounding hills and vineyards.",
                    "practical_tips": "Requires car rental ideally. Enjoy lunch at a village taverna. Perfect time for scenic drives.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (car rental, food)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Koules Fortress & Venetian Harbor",
                    "where": "Heraklion Harbor",
                    "description": "Visit the imposing Venetian fortress (Rocca a Mare) guarding the harbor entrance and enjoy a walk around the picturesque harbor area.",
                    "practical_tips": "Check fortress opening hours. Can be windy. Offers great sea views.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (entry fee for fortress)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Visit the Historical Museum of Crete",
                    "where": "Near the waterfront",
                    "description": "Explore Cretan history from early Christian times to modern day, including Byzantine art, folklore collections, and El Greco paintings.",
                    "practical_tips": "Closed on March 25th. Allow 1.5-2 hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low-Moderate (entry fee)",
                    "weather_dependent": false
                 }
            ]
        }
    }
}