{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing in Gothenburg",
                "type": "Nature/Social",
                "description": "Witness the beautiful cherry blossoms, particularly stunning at the Botanical Garden (Botaniska Trädgården) and Järntorget square. A popular sign of spring attracting visitors for photos and enjoying the pink blooms.",
                "indoor": false,
                "best_time": "Mid-late April (daytime)",
                "price_range": "Free (Järntorget)/Budget (Botanical Garden entry)",
                "seasonal_notes": "The blooming period is weather-dependent and usually lasts 1-2 weeks. Check local updates for peak bloom.",
                "booking_tips": "No booking needed for Järntorget. Botanical Garden is highly recommended. Visit on a weekday for fewer crowds."
            },
            {
                "name": "Walpurgis Night (Valborgsmässoafton) Celebrations",
                "type": "Cultural Festival/Community Event",
                "description": "Welcome spring on April 30th with traditional celebrations featuring large bonfires ('majbrasor'), choral singing, speeches, and student festivities. Major public events often held in parks like Slottsskogen or Trädgårdsföreningen.",
                "indoor": false,
                "best_time": "Evening (April 30th)",
                "price_range": "Free (Public events)",
                "seasonal_notes": "A major Swedish tradition celebrating the arrival of spring. Check the City of Gothenburg website or local news for specific locations and times.",
                "booking_tips": "Arrive early for good viewing spots at popular locations like Slottsskogen. Dress warmly. Student areas like Chalmers University often have large, lively celebrations."
            },
            {
                "name": "Explore Slottsskogen and Botanical Garden",
                "type": "Nature/Recreation/Cultural",
                "description": "Stroll or cycle through Gothenburg's main city park, Slottsskogen, as it comes alive with greenery. Visit the free animal enclosures or the adjacent, renowned Botanical Garden.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Slottsskogen)/Budget (Botanical Garden entry)",
                "seasonal_notes": "Pleasant weather for enjoying Gothenburg's largest green spaces. See spring flowers blooming in the Botanical Garden.",
                "booking_tips": "The Botanical Garden offers vast collections and beautiful trails. Slottsskogen is great for relaxation, picnics, and seeing Nordic animals."
            },
            {
                "name": "Liseberg Amusement Park Season Opening",
                "type": "Entertainment/Amusement Park",
                "description": "Experience the excitement as Scandinavia's largest amusement park, Liseberg, opens its doors for the summer season, usually in late April. Enjoy rides, games, gardens, and early season events.",
                "indoor": false,
                "best_time": "Daytime/Evening (Check opening hours)",
                "price_range": "Moderate/Expensive (Entry + ride passes)",
                "seasonal_notes": "Opening dates vary slightly each year. Check the Liseberg website for exact dates, hours, and ticket prices.",
                "booking_tips": "Buy tickets online in advance to save time and potentially money. Weekdays are generally less crowded than weekends right after opening."
            },
            {
                "name": "Outdoor 'Fika' Season Begins",
                "type": "Leisure/Social",
                "description": "Enjoy the Swedish coffee break ('fika') outdoors as cafes in charming neighborhoods like Haga, Linné, and Vasastan open their terraces ('uteserveringar').",
                "indoor": false,
                "best_time": "Daytime (when sunny)",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "A welcome sign of warmer weather. Cafes along Linnégatan and Haga Nygata are particularly popular for outdoor seating.",
                "booking_tips": "Explore different neighborhoods to find your favorite spot. No booking usually needed, but popular terraces fill up quickly on sunny days."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Midsummer Celebrations (Midsommar)",
                "type": "Cultural Festival/Holiday",
                "description": "Celebrate Midsummer's Eve (closest Friday to summer solstice) with maypole dancing, flower wreaths, herring, strawberries, and schnapps. While many Swedes leave the city, public celebrations can often be found in Slottsskogen or nearby community centers.",
                "indoor": false,
                "best_time": "Midsummer's Eve (Friday between June 19-25)",
                "price_range": "Free (Public events)/Moderate (Transport/Food)",
                "seasonal_notes": "A major holiday; expect many shops in the city center to be closed. Public transport may run on a reduced schedule.",
                "booking_tips": "Check local listings for public celebrations in parks like Slottsskogen. For an authentic experience, consider a trip to the Southern Archipelago if joining local festivities (requires planning/invitation)."
            },
            {
                "name": "Explore the Southern Archipelago (Södra Skärgården)",
                "type": "Nature/Boating/Leisure",
                "description": "Discover Gothenburg's beautiful and car-free southern archipelago. Take public ferries (part of Västtrafik system) from Saltholmen to islands like Styrsö, Donsö, Brännö, or Vrångö. Enjoy swimming from cliffs, walking trails, picturesque villages, and fresh seafood.",
                "indoor": false,
                "best_time": "Daytime (June-August)",
                "price_range": "Budget/Moderate (Public transport ferry tickets + food/activities)",
                "seasonal_notes": "Peak season with frequent ferries. Water is warmest in July/August. Brännö is known for its summer dances at the jetty.",
                "booking_tips": "Use the Västtrafik app or ticket for ferries. Allow ample time as ferry journeys take 30-60+ minutes each way. Check timetables. Pack swimwear, towels, and walking shoes. Consider renting bikes on Styrsö/Donsö."
            },
            {
                "name": "Swimming and Sunbathing (Badplatser)",
                "type": "Leisure/Recreation",
                "description": "Cool off at Gothenburg's popular swimming spots. Options include Saltholmen (rocky bathing near archipelago ferries), Askimsbadet (long sandy beach), Delsjön lake (freshwater), or Näset badplats.",
                "indoor": false,
                "best_time": "Daytime (Warm sunny days, June-August)",
                "price_range": "Free",
                "seasonal_notes": "Can get very busy on hot days. Water temperatures vary but are generally best in July/August.",
                "booking_tips": "Easily reachable by tram/bus (e.g., tram 11 to Saltholmen). Check water quality via city reports if desired. Bring picnic supplies or check for nearby kiosks/cafes."
            },
            {
                "name": "Park Life in Slottsskogen",
                "type": "Leisure/Social/Nature",
                "description": "Relax, picnic, play games, and socialize in Gothenburg's largest city park, Slottsskogen. Visit the free zoo area with Nordic animals, the large 'Plikta' playground, or simply enjoy the green expanse.",
                "indoor": false,
                "best_time": "Daytime/Early Evening (May-August)",
                "price_range": "Free",
                "seasonal_notes": "Hub for summer activities, including festivals like Way Out West. Long daylight hours make evenings pleasant.",
                "booking_tips": "Easy to reach by tram (e.g., Linnéplatsen). Plenty of space, but popular areas can be lively. Kiosks and cafes are available within the park."
            },
            {
                "name": "Way Out West Music Festival",
                "type": "Music Festival",
                "description": "Attend one of Sweden's major music festivals, held annually in Slottsskogen park. Features a mix of international and Swedish artists across various genres, plus film screenings and talks ('Stay Out West' club nights continue downtown).",
                "indoor": false,
                "best_time": "Early August (Specific weekend)",
                "price_range": "Expensive (Festival pass required)",
                "seasonal_notes": "Major event attracting large crowds. The park transforms into a festival site.",
                "booking_tips": "Book festival passes and accommodation well in advance as they sell out. Check the festival lineup and schedule online."
            },
            {
                "name": "Liseberg Concerts and Summer Season",
                "type": "Music/Entertainment/Amusement Park",
                "description": "Enjoy the full summer offerings at Liseberg amusement park, including rides, gardens, restaurants, and a popular summer concert series featuring Swedish and international artists on its main stage.",
                "indoor": false,
                "best_time": "Evenings for concerts, Daytime/Evening for park (June-August)",
                "price_range": "Moderate/Expensive (Park entry + ride pass/Concert requires park entry)",
                "seasonal_notes": "Check Liseberg's website for concert schedule and park opening hours.",
                "booking_tips": "Book park tickets online. Arrive early for concerts to get a good spot. Concerts are included in park admission but space can be limited."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Admire Autumn Colors in Parks and Gardens",
                "type": "Nature/Walking",
                "description": "Experience the fall foliage in Gothenburg's beautiful green spaces. Slottsskogen offers vast areas, while the Botanical Garden (Botaniska Trädgården) provides a curated display of autumn colors. Trädgårdsföreningen park is also lovely.",
                "indoor": false,
                "best_time": "Daytime (Late September - October)",
                "price_range": "Free (Slottsskogen, Trädgårdsföreningen)/Budget (Botanical Garden)",
                "seasonal_notes": "Peak foliage varies yearly. Enjoy the crisp air and quieter atmosphere compared to summer.",
                "booking_tips": "Wear comfortable walking shoes. The Botanical Garden's different sections showcase diverse autumn transformations."
            },
            {
                "name": "Visit Museums with Fewer Crowds",
                "type": "Cultural/Historical",
                "description": "Explore Gothenburg's excellent museums like the Gothenburg Museum of Art (Konstmuseet), Museum of World Culture (Världskulturmuseet), Maritime Museum (Sjöfartsmuseet Akvariet), or the City Museum (Stadsmuseet) in a calmer season.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Good time for indoor activities as weather cools. Check specific museum opening hours.",
                "booking_tips": "Consider purchasing tickets online if available. Allocate sufficient time, especially for larger museums like the Konstmuseet."
            },
            {
                "name": "Seafood Season Feasts (Lobster Premiere!)",
                "type": "Food/Cultural",
                "description": "Indulge in West Coast seafood at its peak season. Autumn marks the start of the lobster season ('Hummerpremiär' - late Sept), a major event. Enjoy fresh lobster, oysters, mussels, and langoustines at restaurants or buy from Feskekôrka (Fish Church) market.",
                "indoor": true,
                "best_time": "Evenings (September onwards for lobster)",
                "price_range": "Expensive (Lobster & shellfish)/Moderate-Expensive (Other seafood)",
                "seasonal_notes": "Gothenburg is renowned for its seafood. Restaurants often feature special lobster menus after the premiere.",
                "booking_tips": "Book tables at popular seafood restaurants (e.g., Sjömagasinet, Fiskekrogen) well in advance, especially for lobster season weekends. Visit Feskekôrka for the market experience."
            },
            {
                "name": "Gothenburg Book Fair (Bokmässan)",
                "type": "Literature/Cultural Event",
                "description": "Attend Scandinavia's largest book fair, held at the Swedish Exhibition & Congress Centre (Svenska Mässan). Features author appearances, seminars, publishers, and a vast number of books.",
                "indoor": true,
                "best_time": "Late September (Specific weekend)",
                "price_range": "Moderate (Entry ticket)",
                "seasonal_notes": "A major cultural event for literature lovers, attracting huge crowds.",
                "booking_tips": "Buy tickets online in advance. Check the seminar program and author schedules beforehand. Be prepared for crowds, especially on Saturday."
            },
            {
                "name": "Cozy Pub Evenings",
                "type": "Leisure/Social",
                "description": "As evenings get darker and cooler, enjoy the cozy atmosphere of Gothenburg's many pubs, especially in areas like Majorna, Linné (Långgatorna), or Vasastan. Sample local craft beers or traditional pub fare.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "A perfect way to experience local life and 'mys' (coziness).",
                "booking_tips": "Explore different pubs for various atmospheres, from traditional spots in Majorna to craft beer bars near Järntorget."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas at Liseberg",
                "type": "Amusement Park/Christmas Market/Festive",
                "description": "Experience one of Scandinavia's largest and most atmospheric Christmas markets. Liseberg amusement park transforms into a winter wonderland with millions of lights, festive stalls selling crafts and food, ice skating, Santa's workshop, and selected rides open.",
                "indoor": false,
                "best_time": "Late November - Late December (Check specific dates/hours)",
                "price_range": "Moderate/Expensive (Entry fee + optional rides/activities)",
                "seasonal_notes": "A major Gothenburg Christmas attraction. Very popular, especially on weekends. Snow is possible but not guaranteed.",
                "booking_tips": "Book entry tickets online in advance, especially for peak times/weekends, to guarantee entry and potentially save time. Dress very warmly! Allow several hours to explore."
            },
            {
                "name": "Haga Christmas Market (Julmarknad i Haga)",
                "type": "Shopping/Cultural/Festive",
                "description": "Stroll through the charming Haga neighborhood during its traditional Christmas market, typically held on weekends leading up to Christmas. Browse stalls along Haga Nygata offering crafts, gifts, and festive treats amidst the historic wooden houses.",
                "indoor": false,
                "best_time": "Weekends in late November/December (Daytime)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases)",
                "seasonal_notes": "Offers a cozier, more traditional market atmosphere compared to Liseberg. Can get crowded.",
                "booking_tips": "Check specific dates and times. Combine with fika in one of Haga's cafes. Dress warmly."
            },
            {
                "name": "Ice Skating at Heden",
                "type": "Sport/Recreation",
                "description": "Enjoy outdoor ice skating at the large public rink often set up at Heden, a central sports ground. Skate rental is usually available.",
                "indoor": false,
                "best_time": "Daytime/Evening (Check opening hours, weather permitting)",
                "price_range": "Free (Entry)/Budget (Skate rental)",
                "seasonal_notes": "Opening depends on weather conditions allowing for ice maintenance.",
                "booking_tips": "Check if the rink is open before going. Wear warm clothes. Other smaller rinks might pop up."
            },
            {
                "name": "Lucia Concerts",
                "type": "Cultural/Music/Religious",
                "description": "Witness the beautiful Lucia tradition (Dec 13th) with candlelit processions and singing in churches like Gothenburg Cathedral (Domkyrkan) or Vasa Church (Vasakyrkan), as well as other venues.",
                "indoor": true,
                "best_time": "Morning/Evening (December 13th, some concerts on nearby dates)",
                "price_range": "Free (Some processions)/Moderate-Expensive (Church concerts)",
                "seasonal_notes": "A key Swedish winter tradition celebrating light. Enjoy with 'lussekatter' (saffron buns) and 'glögg' (mulled wine).",
                "booking_tips": "Book tickets for major church concerts well in advance as they are very popular and sell out quickly. Check local listings for times and venues."
            },
            {
                "name": "Winter Bathing at Saltholmen Kallbadhus",
                "type": "Wellness/Recreation",
                "description": "Experience the invigorating tradition of a cold dip in the sea followed by a warm sauna at the historic Saltholmen Kallbadhus (cold bath house), accessible by tram.",
                "indoor": true,
                "best_time": "Daytime (Check specific opening hours/days, often segregated times for men/women)",
                "price_range": "Moderate (Entry fee)",
                "seasonal_notes": "A bracing local experience with views of the archipelago entrance.",
                "booking_tips": "Check their website for current opening hours, potential booking requirements, and rules/etiquette (e.g., regarding swimwear in sauna). Take tram 11 to Saltholmen terminus."
            }
        ]
    }
}