{
  "sites": [
    {
      "name": "Liseberg",
      "type": "Amusement Park",
      "description": "One of Europe's leading amusement parks, offering thrilling roller coasters like Helix and Valkyria, numerous family-friendly attractions, beautifully landscaped gardens, restaurants, and concerts. Awarded Europe's best amusement park in 2023.",
      "indoor": false,
      "best_time": "Afternoon/Evening (seasonal)",
      "price_range": "High",
      "seasonal_notes": "Open seasonally (typically late April to September, plus Halloween and Christmas). Opening hours and concert schedules vary; check online. Can be very crowded, especially during peak season and concert nights.",
      "booking_tips": "Buy entrance tickets and ride passes ('Åkpass') online in advance, especially for specific dates or concerts. Ride passes are separate from entrance. Expect queues for popular rides. Located near central Gothenburg.",
      "ratings": {
        "cost_estimate": 40,
        "suggested_duration_hours": 5.0,
        "cultural_significance": 3
      },
      "latitude": 57.6953,
      "longitude": 11.9921
    },
    {
      "name": "Gothenburg Archipelago",
      "type": "Nature",
      "description": "A stunning collection of over 20 islands accessible by ferry from Saltholmen (southern, car-free islands like Styrsö, Brännö, Vrångö) or Lilla Varholmen (northern islands like Hönö, Öckerö). Offers picturesque fishing villages, granite cliffs for swimming, hiking trails, kayaking, and sailing opportunities.",
      "indoor": false,
      "best_time": "Daytime (Summer)",
      "price_range": "Budget",
      "seasonal_notes": "Accessible year-round, but ferry schedules may be reduced in winter. Summer is ideal for swimming and exploring. Car-free islands require walking or cycling.",
      "booking_tips": "Accessible via public transport (ferries are part of the Västtrafik network). A standard public transport ticket covers the journey. Allow a full day for exploring multiple islands. Southern islands reachable from Saltholmen terminal; northern islands from Lilla Varholmen.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 6.0,
        "cultural_significance": 4
      },
      "latitude": 57.6500,
      "longitude": 11.7500
    },
    {
      "name": "Haga District",
      "type": "Historic District",
      "description": "One of Gothenburg's oldest and most charming neighborhoods, featuring well-preserved wooden houses ('landshövdingehus'), cobblestone streets (pedestrianized Haga Nygata), independent boutiques, antique shops, and numerous cozy cafés. Famous for its giant cinnamon buns ('hagabulle').",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Charming year-round. Lively atmosphere, especially on weekends. Christmas market in December.",
      "booking_tips": "Free to wander. Best explored on foot. Ideal for 'fika' (Swedish coffee break), shopping for unique items, and soaking up the historic atmosphere. Located west of the city center.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 57.6986,
      "longitude": 11.9598
    },
    {
      "name": "Gothenburg Museum of Art (Göteborgs konstmuseum)",
      "type": "Museum",
      "description": "Home to a significant collection of Nordic art from the 15th century onwards, as well as international works by artists like Rembrandt, Picasso, and Van Gogh. Features impressive collections and temporary exhibitions. Awarded three stars in the Michelin Green Guide.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Check website for current exhibitions and opening hours.",
      "booking_tips": "Located at Götaplatsen, at the top of the main avenue Kungsportsavenyn. Allow 2-3 hours. Consider purchasing the Gothenburg Pass for entry to multiple museums.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 57.6975,
      "longitude": 11.9800
    },
    {
      "name": "Feskekörka (Fish Church)",
      "type": "Market",
      "description": "An iconic indoor fish and seafood market housed in a building resembling a Gothic church, originally built in 1874. Reopened in 2024 after renovation, it features multiple fish counters, restaurants, bars, and outdoor seating by the canal (Vallgraven).",
      "indoor": true,
      "best_time": "Lunchtime/Daytime",
      "price_range": "Free (Market access)",
      "seasonal_notes": "Open year-round. Market stalls open during the day; restaurants may have evening hours. Check website for specific vendor hours.",
      "booking_tips": "Free to browse the market. Restaurant reservations might be needed, especially for popular spots. A must-visit for seafood lovers.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 57.7023,
      "longitude": 11.9590
    },
    {
      "name": "Universeum",
      "type": "Museum",
      "description": "Scandinavia's largest science center, featuring interactive exhibits, a large aquarium with sharks, a walk-through rainforest with exotic animals and plants, space exhibits, and Wisdome Gothenburg - a large visualization dome theater.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "High",
      "seasonal_notes": "Open year-round, daily. Popular with families.",
      "booking_tips": "Buy tickets online to save time. Allow at least 3-4 hours, potentially a full day. Located near Liseberg. Wisdome shows often require separate booking/timing.",
      "ratings": {
        "cost_estimate": 30,
        "suggested_duration_hours": 4.0,
        "cultural_significance": 3
      },
      "latitude": 57.6958,
      "longitude": 11.9896
    },
    {
      "name": "Gothenburg Botanical Garden (Botaniska Trädgården)",
      "type": "Park",
      "description": "One of Europe's foremost botanical gardens, covering 175 hectares (430 acres). Features around 16,000 plant species in various sections like the Rhododendron Valley, Japanese Glade, Rock Garden, greenhouses with orchids, and landscaped areas.",
      "indoor": false,
      "best_time": "Daytime (Spring/Summer)",
      "price_range": "Budget",
      "seasonal_notes": "Gardens open year-round; greenhouses have specific hours. Spring and summer offer the most blooms. Requires significant walking.",
      "booking_tips": "Small entrance fee for the garden, separate fee for greenhouses. Allow 2-3 hours. Located adjacent to Slottsskogen park.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 57.6825,
      "longitude": 11.9508
    },
    {
      "name": "Slottsskogen",
      "type": "Park",
      "description": "Gothenburg's main city park, a large green space offering walking paths, picnic areas, playgrounds, a free zoo with Nordic animals (elk, deer, seals, penguins), the Gothenburg Natural History Museum, and the 'Plikta' activity park. Hosts the Way Out West music festival in August.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Zoo enclosure visiting hours may vary. Very popular on sunny days and during events.",
      "booking_tips": "Free access. Easily accessible by tram. Allow several hours to explore. Great for families and relaxation.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 3
      },
      "latitude": 57.6889,
      "longitude": 11.9427
    },
    {
      "name": "Trädgårdsföreningen (Garden Society of Gothenburg)",
      "type": "Park",
      "description": "A well-preserved 19th-century park in the heart of the city. Features beautiful rose gardens (Rosarium), lawns, sculptures, a historic Palm House (Palmhuset) with exotic plants, and cafés. Hosts events and concerts.",
      "indoor": false,
      "best_time": "Daytime (Summer for roses)",
      "price_range": "Budget",
      "seasonal_notes": "Park generally open year-round; Palm House has specific hours and entrance fee. Roses bloom June-July. Can be busy during events.",
      "booking_tips": "Small entrance fee may apply seasonally or for the Palm House. Located near the central station. Allow 1-2 hours.",
      "ratings": {
        "cost_estimate": 4,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 57.7053,
      "longitude": 11.9750
    },
    {
      "name": "Maritiman",
      "type": "Museum",
      "description": "A floating maritime museum featuring a collection of historic vessels moored in the Göta älv river. Visitors can board and explore ships including a destroyer (HMS Småland), a submarine (Nordkaparen), lightship, towboats, and other vessels, learning about life at sea.",
      "indoor": true,
      "best_time": "Daytime (seasonal)",
      "price_range": "Moderate",
      "seasonal_notes": "Opening hours are seasonal, typically open daily during summer and reduced hours/closed in winter. Check website for current schedule.",
      "booking_tips": "Buy tickets online or at the entrance. Allow 2-3 hours. Located near the Gothenburg Opera House.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 3
      },
      "latitude": 57.7087,
      "longitude": 11.9610
    },
    {
      "name": "Skansen Kronan",
      "type": "Landmark",
      "description": "A 17th-century fortress perched on a hill in the Haga district, offering panoramic views over Gothenburg. Originally built for defense, it later served as a prison and museum. A café is located nearby.",
      "indoor": false,
      "best_time": "Daytime/Sunset",
      "price_range": "Free",
      "seasonal_notes": "Exterior viewpoint accessible year-round. Interior access may be limited or for events only. Steep walk up the hill.",
      "booking_tips": "Free access to the viewpoint. Combine with a visit to the Haga district. Great spot for photos, especially at sunset.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.75,
        "cultural_significance": 3
      },
      "latitude": 57.6991,
      "longitude": 11.9541
    },
    {
      "name": "World of Volvo",
      "type": "Museum",
      "description": "An experience center showcasing the history, innovations, and future vision of the Volvo brand (both cars and trucks/equipment). Features interactive exhibitions, iconic vehicles, and focuses on themes like safety, sustainability, and Scandinavian design.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Check website for current exhibitions and opening hours.",
      "booking_tips": "Located next to Liseberg and Universeum. Allow 1.5-2.5 hours. Book tickets online.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 57.6969,
      "longitude": 11.9910
    },
    {
      "name": "Kronhuset and Kronhusbodarna",
      "type": "Historic Site",
      "description": "Kronhuset, one of Gothenburg's oldest preserved buildings (mid-17th century), originally served as an artillery storehouse and hosted the 1660 Riksdag. Today it's primarily a concert venue. The surrounding Kronhusbodarna are charming artisan workshops and boutiques (glassblowing, pottery, chocolate, watchmaker) housed in historic buildings.",
      "indoor": true,
      "best_time": "Daytime (check workshop hours)",
      "price_range": "Free",
      "seasonal_notes": "Kronhuset interior access depends on event schedule. Kronhusbodarna workshops have individual opening hours, generally Tue-Sat daytime. Christmas market held here.",
      "booking_tips": "Free to wander the courtyard and browse shops. Check event schedule for Kronhuset concerts or access. Located near Gustaf Adolfs Torg.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 57.7078,
      "longitude": 11.9636
    },
    {
      "name": "Stora Saluhallen",
      "type": "Market",
      "description": "Gothenburg's main indoor market hall, dating back to the mid-19th century. Offers a vibrant atmosphere with around 40 stalls selling fresh produce, meats, cheeses, spices, baked goods, international delicacies, and lunch spots.",
      "indoor": true,
      "best_time": "Lunchtime/Daytime",
      "price_range": "Free (Market access)",
      "seasonal_notes": "Open year-round, Monday-Saturday during daytime hours. Can be busy, especially around lunchtime.",
      "booking_tips": "Located on Kungstorget square. Free to browse. Great place to grab lunch or buy local food items. No booking needed.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 57.7035,
      "longitude": 11.9703
    },
    {
      "name": "Götaplatsen",
      "type": "Landmark",
      "description": "Gothenburg's main cultural square, located at the southern end of Kungsportsavenyn. Dominated by Carl Milles' Poseidon statue (1931). Surrounded by major cultural institutions: Gothenburg Museum of Art, Gothenburg City Theatre, and Gothenburg Concert Hall.",
      "indoor": false,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open public space accessible year-round. Lively area, often hosts events or gatherings.",
      "booking_tips": "Free to visit. A central point for accessing nearby cultural attractions. Good photo opportunities.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 57.6971,
      "longitude": 11.9798
    },
    {
      "name": "Gothenburg Natural History Museum (Naturhistoriska)",
      "type": "Museum",
      "description": "Gothenburg's oldest museum (est. 1833), showcasing biological diversity. Features extensive collections (around 10 million animals), dioramas, exhibits on evolution, Swedish fauna, and the famous Malm Whale (a taxidermied blue whale calf).",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Budget",
      "seasonal_notes": "Open year-round (closed Mondays). Check website for specific hours and potential temporary exhibit closures.",
      "booking_tips": "Located within Slottsskogen park. Usually less crowded than other major museums. Check entrance fee (sometimes free). Allow 1.5-2.5 hours.",
      "ratings": {
        "cost_estimate": 6,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 57.6875,
      "longitude": 11.9480
    },
    {
      "name": "Gunnebo House and Gardens",
      "type": "Historic Site",
      "description": "One of Scandinavia's best-preserved 18th-century neoclassical estates, located just outside Gothenburg in Mölndal. Features the main house (designed by Carl Wilhelm Carlberg), formal gardens, an English landscape park, kitchen gardens, an organic restaurant, and a gift shop.",
      "indoor": true,
      "best_time": "Daytime (Gardens best in Summer)",
      "price_range": "Moderate",
      "seasonal_notes": "Gardens and restaurant open year-round. House access typically requires a guided tour (check schedule and book). Gardens are part of a cultural reserve.",
      "booking_tips": "Located in Mölndal, requires travel from central Gothenburg (bus/car). Book guided tours in advance online. Allow 2-3 hours plus travel time. Restaurant is popular, consider booking.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 4
      },
      "latitude": 57.6581,
      "longitude": 12.0583
    }
  ]
}