{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Nyårsdagen)",
          "notes": "New Year's Day is a public holiday throughout Sweden. Most attractions and shops in Gothenburg operate with limited hours. The city is relatively quiet as residents recover from New Year's Eve celebrations. Cold temperatures averaging around -2°C (28°F) and short daylight hours characterize this period. Gothenburg typically experiences milder winters than Stockholm due to its west coast location."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "January is one of the coldest months in Gothenburg with temperatures generally between -2°C and 3°C (28°F to 37°F). Daylight is limited to around7-8 hours. The city experiences occasional snowfall but less than central Sweden, with periods of rain also common. This is low season for tourism, so you'll find fewer crowds at major attractions like the Universeum and Maritime Museum. Many restaurants in the Haga district maintain cozy winter atmospheres. Winter activities include ice skating at outdoor rinks and indoor swimming at Valhallabadet. The Gothenburg Film Festival, Scandinavia's leading film festival, typically begins in late January."
        }
      ],
      "weatherHighC": 3,
      "weatherLowC": -2,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 2,
          "special": true,
          "event": "Gothenburg Film Festival",
          "notes": "The Gothenburg Film Festival (Göteborg Film Festival) continues through early February, bringing international filmmakers and cinema enthusiasts to the city. This is Scandinavia's largest film festival, screening approximately 450 films from 80 countries for an audience of 160,000 visitors annually. Despite the winter conditions, the festival creates a vibrant atmosphere in the city center."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 2,
          "notes": "February continues with winter conditions but typically features slightly longer daylight hours than January. Tourism remains low, making it an excellent time to enjoy indoor attractions like the Gothenburg Museum of Art and the Universeum science center without crowds. This is the month to try 'semla' - a traditional Swedish pastry only available during this season, with many of Gothenburg's cafés offering their own special variations. Gothenburg's proximity to the sea means winters are generally milder but wetter than in Stockholm."
        }
      ],
      "weatherHighC": 3,
      "weatherLowC": -2,
      "tourismLevel": 2
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "notes": "March brings the first signs of spring to Gothenburg, with temperatures gradually rising and daylight hours increasing noticeably. The city's parks begin to show the first spring flowers. Indoor attractions remain popular, but on sunny days, locals begin to venture more into the city's green spaces like Slottsskogen park. This is still a relatively quiet tourist season, offering good value for accommodations and easy access to popular attractions. The combination of occasional sunny days and continued low tourist numbers makes this a good time for visitors seeking a more local experience."
        },
        {
          "days": [31],
          "score": 3,
          "special": true,
          "event": "Easter Preparations (if Easter falls in early April)",
          "notes": "If Easter falls in early April, the end of March sees preparations for the holiday with special events and decorations appearing throughout the city."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 4,
          "special": true,
          "event": "Easter Celebrations (date varies) & Spring Bloom",
          "notes": "April sees spring truly arriving in Gothenburg. The botanical gardens (Botaniska Trädgården) begin their spring displays with flowering bulbs and early blossoms. Easter celebrations include traditional decorations and special foods throughout the city. The Majorna Market begins its seasonal weekend operation, offering food and vintage goods. Tourist numbers start to increase as the weather improves, but the city is still relatively uncrowded. The ferry services to the southern archipelago begin to operate more frequently as the weather becomes milder."
        },
        {
          "days": [26, 27, 28, 29],
          "score": 4,
          "notes": "Late April brings increasingly pleasant weather with temperatures often reaching double digits. Outdoor seating begins to appear at restaurants and cafes around Järntorget and along the canal, though sometimes with blankets and heaters still provided for cooler evenings."
        },
        {
          "days": [30],
          "score": 5,
          "special": true,
          "event": "Walpurgis Night (Valborgsmässoafton)",
          "notes": "Walpurgis Night on April 30th celebrates the arrival of spring with bonfires, singing, and gatherings throughout the city. In Gothenburg, celebrations are particularly notable at Slottsskogen park, where thousands gather for music and to see the ceremonial bonfire lit at dusk."
        }
      ],
      "weatherHighC": 11,
      "weatherLowC": 3,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Första maj)",
          "notes": "May 1st is International Workers' Day and a public holiday in Sweden. Political demonstrations and parades take place in central Gothenburg, particularly around Götaplatsen. This is also a day for spring celebrations as the weather continues to improve, with many locals gathering in parks."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Gothenburg Green World & Göteborgsvarvet Half Marathon",
          "notes": "May brings reliably good weather to Gothenburg with average temperatures between 12°C and 18°C (54-64°F). The city's parks and botanical garden are in full bloom. Göteborgsvarvet, the world's largest half marathon, takes place in mid-May with approximately 60,000 runners participating. Liseberg amusement park is fully operational for the season, featuring rides and entertainment. This is the beginning of the tourist season, but before the summer peak, making it an excellent time to visit with good weather and manageable crowds. Boat tours of the archipelago become a popular activity as the water warms."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 8,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 5,
          "special": true,
          "event": "West Pride & A Taste of Gothenburg",
          "notes": "Early June brings the beginning of summer weather to Gothenburg. West Pride, the city's LGBTQ+ festival, features a parade and events throughout the city. 'A Taste of Gothenburg' food festival showcases local cuisine from the west coast, known for its exceptional seafood."
        },
        {
          "days": [6],
          "score": 5,
          "special": true,
          "event": "National Day of Sweden (Sveriges nationaldag)",
          "notes": "June 6th is Sweden's National Day. In Gothenburg, celebrations are centered around Slottsskogen park with folk dancing, music, and ceremonies. This is a public holiday with special events throughout the city. The Gothenburg Symphony Orchestra typically performs a special concert for the occasion."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
          "score": 5,
          "notes": "Mid-June brings long daylight hours (around 18-19 hours), pleasant temperatures, and a lively atmosphere throughout the city. Outdoor dining becomes extremely popular in the Haga district and along the canals. The southern archipelago islands become busy with day-trippers enjoying swimming and sunbathing."
        },
        {
          "days": [20, 21, 22, 23, 24, 25],
          "score": 5,
          "special": true,
          "event": "Midsummer (Midsommar)",
          "notes": "Midsummer is one of Sweden's most important holidays, celebrating the summer solstice. Traditional celebrations include raising the maypole (midsommarstång), dancing, singing, and feasting on herring, potatoes, and strawberries. In Gothenburg, visitor-friendly Midsummer events are held at Slottsskogen park and on several archipelago islands. This marks the beginning of the Swedish vacation period, with many locals departing for their summer houses."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Late June continues with excellent summer weather. The city takes on a relaxed atmosphere as many residents begin their summer holidays, but tourist numbers increase. This is the beginning of the high season for tourism in Gothenburg."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Gothenburg Culture Festival & Way Out West Music Festival",
          "notes": "July is the warmest month in Gothenburg with temperatures averaging 21°C (70°F) but sometimes reaching 28°C (82°F). This is peak tourist season with visitors from around the world exploring the city's attractions. Many locals leave Gothenburg for vacation, creating an interesting mix where the city is simultaneously at its busiest with tourists and emptiest of residents. The Way Out West music festival in early August is preceded by 'Stay Out West' club performances in late July. Sporadic summer showers are common but typically brief. Water activities are popular, including swimming at spots like Saltholmen and boat tours of the archipelago. The historic district of Haga is particularly lively with outdoor cafes and shops."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 13,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 4,
          "special": true,
          "event": "Way Out West Music Festival",
          "notes": "Early August brings the Way Out West music festival to Slottsskogen park, one of Sweden's largest music festivals featuring international and local artists across multiple genres. This three-day event significantly increases visitor numbers to the city. Tourism remains at peak levels, and hotel prices are at their highest. Outdoor activities dominate, including visits to the archipelago islands, swimming, and enjoying Gothenburg's many parks and green spaces."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Gothenburg Culture Festival",
          "notes": "The Gothenburg Culture Festival (Kulturkalaset) fills the city with music, dance, art, and workshops for several days in mid-to-late August. All events are free, with performances on stages throughout central Gothenburg. Late August brings slightly cooler temperatures but still excellent conditions for exploring the city. Locals begin to return from summer vacations, bringing a more authentic feel back to the city. This is considered one of the best times to visit Gothenburg, with good weather but slightly lower tourist numbers than peak July."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 13,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Gothenburg Book Fair & Seafood Festival",
          "notes": "September brings autumn to Gothenburg with pleasant temperatures around 16°C (61°F) and beautiful fall colors beginning to appear in parks and gardens. Tourism decreases as European summer holidays end, making this an excellent time to visit with good weather and fewer crowds. The Gothenburg Book Fair (Bokmässan) is Scandinavia's largest literary event, attracting authors and readers from around the world. The Seafood Festival celebrates West Sweden's famous seafood with tastings and demonstrations. Cultural life intensifies with new exhibitions and performances as the winter cultural season begins. The Majorna weekend market continues until the end of the month. This is widely considered one of the best months to visit Gothenburg."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Gothenburg International Science Festival",
          "notes": "October brings autumn colors to their peak in Gothenburg, with parks and gardens showing stunning red and gold foliage. Temperatures cool significantly with averages around 10-12°C (50-54°F). Daylight hours decrease noticeably. The Gothenburg International Science Festival is one of Europe's leading popular science events. This is a good time for museum visits, with the Gothenburg Museum of Art and the Maritime Museum particularly popular. Mushroom picking in nearby forests becomes a popular local activity. Tourism continues to decrease, creating good opportunities for value accommodation and uncrowded attractions. Rainy days become more common, so indoor activities gain popularity."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 6,
      "tourismLevel": 4
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "notes": "November brings increasingly cold and dark conditions to Gothenburg, with temperatures around 6°C (43°F) and daylight hours significantly reduced. This is low season for tourism, though the city maintains a vibrant local atmosphere with cultural events and cozy indoor activities. Traditional winter foods appear on restaurant menus, including hearty stews and seasonal game dishes. Gothenburg's famous Christmas Market at Liseberg amusement park opens in mid-November, transforming the park into a winter wonderland with millions of lights, seasonal food, and handicrafts. This is one of Europe's best Christmas markets and draws visitors even during this otherwise quiet season."
        }
      ],
      "weatherHighC": 7,
      "weatherLowC": 2,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
          "score": 3,
          "special": true,
          "event": "Christmas Markets & Preparations",
          "notes": "Early December brings winter conditions with temperatures around freezing and very short daylight hours (around 6-7 hours). Christmas markets continue throughout the city, with the most popular at Liseberg amusement park and in Haga district. These markets offer traditional crafts, decorations, and seasonal foods like glögg (mulled wine) and pepparkakor (ginger cookies). Gothenburg's status as 'Christmas City of Sweden' means exceptional decorations and events throughout December."
        },
        {
          "days": [13],
          "score": 4,
          "special": true,
          "event": "St. Lucia Day (Luciadagen)",
          "notes": "December 13th is St. Lucia Day, one of Sweden's most beautiful traditions. Processions featuring a young woman wearing a crown of candles, followed by a choir dressed in white, take place in churches, schools, and public venues throughout Gothenburg. The central procession along Avenyn is particularly spectacular. This 'festival of light' brings warmth and brightness to the dark winter."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "notes": "The week before Christmas sees Gothenburg at its most festive, with decorations, lights, and special events throughout the city. Shopping areas like Nordstan shopping center and Avenyn are beautifully decorated and buzzing with activity. Museums and attractions maintain normal winter hours but may have special holiday-themed exhibitions."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Julafton & Juldagen)",
          "notes": "Christmas is celebrated primarily on Christmas Eve (December 24) in Sweden, with family gatherings for traditional julbord (Christmas buffet) featuring dishes like ham, meatballs, herring, and rice pudding. Many restaurants and attractions close early on Christmas Eve and may remain closed on Christmas Day. Public transportation runs on limited schedules. Despite this, winter tourism begins to increase as international visitors arrive for holiday celebrations."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees Gothenburg quiet but festive. Winter activities like ice skating at outdoor rinks are popular, and museums welcome visitors seeking indoor activities during the cold weather. Many restaurants and shops reopen after brief Christmas closures."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Nyårsafton)",
          "notes": "New Year's Eve celebrations center around Götaplatsen with countdown and fireworks visible across the city. Many restaurants offer special New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. The city maintains a festive atmosphere with locals and tourists gathering to welcome the New Year."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": 0,
      "tourismLevel": 3
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the Botanical Garden's spring flower displays",
      "Taking a canal tour as the waterways reopen for the season",
      "Visiting the Majorna weekend market for food and vintage goods",
      "Walpurgis Night (April 30) celebrations with bonfires and singing",
      "Göteborgsvarvet half marathon (May) - participating or spectating",
      "Exploring the city's parks as they come into bloom",
      "Ferry trips to the southern archipelago as weather improves",
      "Outdoor 'fika' (coffee break) at cafes setting up seasonal terraces",
      "National Day celebrations (June 6)"
    ],
    "summer": [
      "Swimming at city beaches and archipelago islands",
      "Visiting the southern archipelago islands by ferry",
      "Attending outdoor concerts at Liseberg amusement park",
      "Midsummer celebrations (late June)",
      "West Pride Festival (June)",
      "Way Out West music festival (August)",
      "Dining at outdoor restaurants and waterfront cafes",
      "Canoeing and kayaking in the canals and archipelago",
      "Exploring the Gothenburg Botanical Garden at its summer peak"
    ],
    "autumn": [
      "Exploring autumn colors in Slottsskogen and other parks",
      "Mushroom picking in nearby forests",
      "Gothenburg Book Fair (September)",
      "Gothenburg International Science Festival (October)",
      "Museum visits to Maritime Museum, Art Museum, and Universeum",
      "Cozy 'fika' breaks at traditional cafes in Haga district",
      "Shopping in boutique districts as holiday season approaches",
      "Cultural performances as the winter season begins",
      "Seafood festival with local west coast specialties"
    ],
    "winter": [
      "Christmas markets at Liseberg and in Haga (November-December)",
      "Ice skating at outdoor rinks",
      "St. Lucia Day celebrations (December 13)",
      "Gothenburg Film Festival (January-February)",
      "Indoor swimming at Valhallabadet",
      "Cozy dinners featuring traditional Swedish winter cuisine",
      "Museum explorations including the City Museum and Museum of Art",
      "Winter boat tours of the harbor with heated cabins",
      "Trying seasonal 'semla' pastries in February"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, cold or wet weather, very low tourism (some business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, limited activities or accessibility"
  }
}