{
    "Spring": {
        "activities": [
            {
                "name": "Dolní Vítkovice Spring Tours",
                "type": "Industrial Heritage",
                "description": "Explore the UNESCO World Heritage industrial site with guided tours of the blast furnaces and mining facilities, enhanced by spring blooms.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers pleasant weather for outdoor industrial heritage exploration with blooming greenery.",
                "booking_tips": "Book guided tours in advance, especially for weekend visits when they're most popular."
            },
            {
                "name": "Ostrava Zoo Spring Visits",
                "type": "Zoo",
                "description": "Visit Ostrava Zoo during spring when animals are most active and the grounds are blooming with seasonal flowers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is ideal for zoo visits with active animals and beautiful blooming gardens.",
                "booking_tips": "Purchase tickets online to avoid queues and plan for a full day visit."
            },
            {
                "name": "City Parks Spring Walks",
                "type": "Park",
                "description": "Enjoy spring walks in Ostrava's parks, particularly Komenského Gardens, with blooming flowers and pleasant temperatures.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings beautiful blooms and comfortable weather for outdoor activities.",
                "booking_tips": "Visit during weekdays for quieter experiences and better photo opportunities."
            },
            {
                "name": "Moravian Wine Tasting",
                "type": "Food & Drink",
                "description": "Sample local Moravian wines at wine bars and restaurants, featuring spring releases and seasonal specialties.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is a great time to try new wine releases from the nearby Moravian wine region.",
                "booking_tips": "Reserve tables at popular wine bars and ask for local Moravian wine recommendations."
            },
            {
                "name": "Industrial Photography Tours",
                "type": "Photography",
                "description": "Capture the industrial heritage of Ostrava with photography tours of Dolní Vítkovice and other industrial sites.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Budget",
                "seasonal_notes": "Spring light is perfect for industrial photography with softer, more dramatic lighting.",
                "booking_tips": "Join organized photography tours or get permits for professional photography sessions."
            },
            {
                "name": "Local Market Visits",
                "type": "Market",
                "description": "Explore Ostrava's central market for fresh spring produce, local specialties, and seasonal treats.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets offer fresh local produce and seasonal specialties.",
                "booking_tips": "Visit early for the best selection and to avoid crowds."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Dolní Vítkovice Summer Events",
                "type": "Cultural Event",
                "description": "Attend summer concerts, festivals, and cultural events at the industrial heritage site with its unique industrial backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the best weather for outdoor events in the industrial setting.",
                "booking_tips": "Check the event calendar and book tickets in advance for popular performances."
            },
            {
                "name": "Stodolní Street Nightlife",
                "type": "Nightlife",
                "description": "Experience Ostrava's famous entertainment district with over 60 bars and clubs, enhanced by summer outdoor seating.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings outdoor terraces and vibrant street atmosphere to the entertainment district.",
                "booking_tips": "Start early and explore different venues throughout the evening."
            },
            {
                "name": "Ostrava Zoo Summer Visits",
                "type": "Zoo",
                "description": "Visit the zoo during summer when all outdoor exhibits are open and animals are most active in the warm weather.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the best zoo experience with all exhibits open and active animals.",
                "booking_tips": "Arrive early to avoid crowds and see animals during their most active periods."
            },
            {
                "name": "Industrial Heritage Tours",
                "type": "Historical Tour",
                "description": "Take guided tours of Ostrava's industrial heritage sites including Michal Mine and other preserved facilities.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer tours provide comfortable underground temperatures and good accessibility.",
                "booking_tips": "Book tours in advance as group sizes are limited and they're popular in summer."
            },
            {
                "name": "Outdoor Dining in City Center",
                "type": "Dining",
                "description": "Enjoy outdoor dining at restaurants throughout the city center, particularly around Masaryk Square.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for al fresco dining with pleasant temperatures.",
                "booking_tips": "Reserve outdoor tables in advance, especially on weekends."
            },
            {
                "name": "City Hall Tower Sunset Views",
                "type": "Sightseeing",
                "description": "Climb the tallest city hall tower in the Czech Republic for panoramic sunset views of Ostrava and the surrounding region.",
                "indoor": true,
                "best_time": "Sunset",
                "price_range": "Low",
                "seasonal_notes": "Summer offers the best sunset views with longer daylight hours.",
                "booking_tips": "Visit during golden hour for the most spectacular views and photography opportunities."
            },
            {
                "name": "Local Beer Garden Visits",
                "type": "Food & Drink",
                "description": "Enjoy Ostravar beer and local specialties at outdoor beer gardens throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer is perfect for outdoor beer garden experiences with local brews.",
                "booking_tips": "Try the local Ostravar beer and traditional Czech pub food."
            },
            {
                "name": "Poruba Architecture Walks",
                "type": "Walking Tour",
                "description": "Explore the modernist architecture of Poruba district with its socialist realist buildings and wide boulevards.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer offers pleasant weather for architectural walking tours.",
                "booking_tips": "Join guided architectural tours or explore independently with a map."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Industrial Heritage Photography",
                "type": "Photography",
                "description": "Capture the industrial heritage sites with autumn colors providing dramatic backdrops for photography.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Budget",
                "seasonal_notes": "Autumn light and colors create stunning contrasts with industrial architecture.",
                "booking_tips": "Get permits for professional photography and visit during golden hour for best lighting."
            },
            {
                "name": "Dolní Vítkovice Autumn Events",
                "type": "Cultural Event",
                "description": "Attend autumn cultural events and exhibitions at the industrial heritage site with its unique atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers comfortable weather for both indoor and outdoor events at the site.",
                "booking_tips": "Check the event calendar for special autumn exhibitions and performances."
            },
            {
                "name": "City Parks Autumn Walks",
                "type": "Park",
                "description": "Enjoy autumn walks in Ostrava's parks with beautiful fall foliage and crisp autumn air.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn colors provide beautiful scenery for peaceful walks in the city parks.",
                "booking_tips": "Visit during weekdays for quieter experiences and better photo opportunities."
            },
            {
                "name": "Moravian Wine Harvest Tours",
                "type": "Food & Drink",
                "description": "Visit nearby Moravian wine regions for harvest season tours and wine tastings.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, making it the perfect time for wine region visits.",
                "booking_tips": "Book wine tours in advance and consider transportation to the wine regions."
            },
            {
                "name": "Museum Visits",
                "type": "Museum",
                "description": "Explore Ostrava's museums including the main city museum and industrial heritage museums.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Low",
                "seasonal_notes": "Autumn's cooler weather makes museums an ideal indoor activity.",
                "booking_tips": "Check for special autumn exhibitions and book guided tours for deeper insights."
            },
            {
                "name": "Cozy Café Culture",
                "type": "Café",
                "description": "Enjoy the cozy atmosphere of Ostrava's cafés with warm drinks and local pastries.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is perfect for café culture with warm drinks and cozy atmospheres.",
                "booking_tips": "Try local Czech pastries and traditional coffee preparations."
            },
            {
                "name": "Industrial Heritage Workshops",
                "type": "Workshop",
                "description": "Participate in workshops and educational programs about Ostrava's industrial heritage.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers comfortable indoor learning environments for heritage education.",
                "booking_tips": "Book workshops in advance, especially for family-friendly programs."
            },
            {
                "name": "Local Restaurant Exploration",
                "type": "Dining",
                "description": "Explore traditional Czech and Moravian restaurants featuring autumn seasonal specialties.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings hearty traditional dishes and seasonal ingredients to local restaurants.",
                "booking_tips": "Reserve tables at popular restaurants and ask for seasonal menu recommendations."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets",
                "type": "Market",
                "description": "Visit Ostrava's Christmas markets featuring traditional Czech crafts, mulled wine, and festive atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter markets offer a warm, festive atmosphere with traditional Czech holiday treats.",
                "booking_tips": "Visit in the evening for the best atmosphere and to see the festive lights."
            },
            {
                "name": "Dolní Vítkovice Winter Events",
                "type": "Cultural Event",
                "description": "Attend winter concerts and cultural events at the industrial heritage site with its unique industrial atmosphere.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers cozy indoor events in the dramatic industrial setting.",
                "booking_tips": "Book tickets in advance for popular winter performances and events."
            },
            {
                "name": "Industrial Heritage Indoor Tours",
                "type": "Historical Tour",
                "description": "Take guided tours of indoor industrial heritage sites including Michal Mine and museum exhibits.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides comfortable underground temperatures for mine tours.",
                "booking_tips": "Book tours in advance and dress warmly for underground visits."
            },
            {
                "name": "Museum and Gallery Visits",
                "type": "Museum",
                "description": "Explore Ostrava's museums and galleries offering warm indoor activities during winter months.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Winter is ideal for indoor cultural activities and museum exploration.",
                "booking_tips": "Check for special winter exhibitions and consider museum passes for multiple visits."
            },
            {
                "name": "Traditional Czech Pubs",
                "type": "Food & Drink",
                "description": "Enjoy warm Czech beer and traditional dishes in cozy traditional pubs throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter is perfect for cozy pub experiences with hearty Czech cuisine.",
                "booking_tips": "Try traditional winter dishes like goulash and hearty Czech specialties."
            },
            {
                "name": "City Hall Tower Winter Views",
                "type": "Sightseeing",
                "description": "Climb the city hall tower for panoramic winter views of Ostrava covered in snow.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Winter offers unique snowy cityscape views from the observation tower.",
                "booking_tips": "Visit on clear days for the best winter views and photography opportunities."
            },
            {
                "name": "Indoor Cultural Events",
                "type": "Cultural Event",
                "description": "Attend indoor concerts, theater performances, and cultural events throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides cozy indoor cultural experiences away from the cold.",
                "booking_tips": "Book tickets in advance for popular performances and check event calendars."
            },
            {
                "name": "Local Restaurant Winter Dining",
                "type": "Dining",
                "description": "Enjoy hearty Czech and Moravian winter dishes at local restaurants with warm, cozy atmospheres.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings traditional hearty dishes and warm dining atmospheres.",
                "booking_tips": "Reserve tables at popular restaurants and try seasonal winter specialties."
            }
        ]
    }
}