{
    "Spring": {
        "activities": [
            {
                "name": "Semana Santa (Holy Week)",
                "type": "Cultural/Religious",
                "description": "Experience Granada's solemn and haunting Easter processions featuring elaborately decorated pasos (floats) carried through the historic streets by costaleros, with accompanying penitents and traditional bands.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Dates vary each year (March-April) with processions throughout Holy Week, particularly moving on Holy Thursday and Good Friday. Granada's processions are known for their solemn beauty and impressive routes through the narrow streets of the historic center.",
                "booking_tips": "No booking required; arrive early to secure viewing spots along the official routes. Plaza Nueva and Gran Vía offer good vantage points. Book accommodation months in advance as this is peak visitor season."
            },
            {
                "name": "Festival Internacional de Música y Danza",
                "type": "Cultural",
                "description": "Attend the preview events of Granada's prestigious International Festival of Music and Dance with special performances in historic venues throughout the city in preparation for the main summer festival.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Spring features preview performances and smaller events leading up to the main festival in June/July, often including unique chamber music in historic settings.",
                "booking_tips": "Purchase tickets online through the festival website as soon as program is released. Spring performances are less crowded than the main summer festival but still popular with locals."
            },
            {
                "name": "Sierra Nevada Spring Skiing",
                "type": "Sport",
                "description": "Experience the unique opportunity to ski in the morning and visit the Alhambra or beaches in the afternoon at Europe's southernmost ski resort, offering spring skiing with spectacular views.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "March-April offers some of the best ski conditions with sunny weather, spring snow, and lower prices than winter high season. The famous 'spring snow' offers excellent skiing conditions well into April.",
                "booking_tips": "Book lift passes online for discounts; equipment rental available on-site. Accessible by bus from Granada (1 hour) or organized day trips with transportation included."
            },
            {
                "name": "Alpujarras Hiking",
                "type": "Nature",
                "description": "Explore the picturesque white villages and blooming landscapes of the Alpujarras region on the southern slopes of the Sierra Nevada, with hiking routes connecting historic Moorish settlements.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "Spring (April-May) offers comfortable temperatures, wildflowers in bloom, and green landscapes after winter rains. Cherry and almond blossoms transform the valleys in early spring.",
                "booking_tips": "No booking required for self-guided routes; maps available at tourist offices. Guided tours available with advance reservation. Accessible by daily buses from Granada to major villages like Pampaneira, Bubión, and Capileira."
            },
            {
                "name": "Día de la Cruz (Day of the Cross)",
                "type": "Cultural",
                "description": "Experience this uniquely Granadian festival where neighborhoods compete to create the most beautiful flower-adorned crosses displayed in squares throughout the city, accompanied by music, food, and drink.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Held annually on May 3rd, this colorful celebration transforms plazas and courtyards throughout Granada with elaborate floral crosses and festive atmosphere.",
                "booking_tips": "No booking required; self-guided tours possible with maps of cross locations from tourist office. The Albaicín and Realejo neighborhoods typically display the most elaborate crosses. Evening brings lively street parties around the most popular crosses."
            },
            {
                "name": "Alhambra Gardens in Bloom",
                "type": "Nature/Cultural",
                "description": "Visit the Generalife gardens and Alhambra palace complex during peak flower season when the historic gardens display their full Spanish-Islamic horticultural splendor.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "April-May brings spectacular blooms to the roses, wisteria, and many other plants in the gardens, with the Court of the Lions and Generalife particularly impressive during this season.",
                "booking_tips": "Essential to book Alhambra tickets weeks or months in advance through the official website. Morning visits offer the best light for photography and less crowded conditions. The Generalife gardens are at their peak in late April through May."
            },
            {
                "name": "Flamenco in Sacromonte",
                "type": "Cultural",
                "description": "Experience authentic flamenco performances in the cave venues of Sacromonte, the traditional gypsy quarter carved into the hillside, where this passionate art form evolved into its current form.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Spring brings pleasant evening temperatures ideal for walking to and from the cave venues, with performances shifting from winter's intimate indoor shows to include some outdoor elements.",
                "booking_tips": "Book several days in advance for authentic venues like Zambra María la Canastera or Cueva La Rocío. More authentic experiences available on weekdays; weekends can be more tourist-oriented. Walk or take taxi rather than driving, as access is limited on narrow roads."
            },
            {
                "name": "Albaicín Spring Walking Tour",
                "type": "Cultural/Nature",
                "description": "Explore Granada's UNESCO-listed Moorish quarter during spring when the carmenes (traditional houses with gardens) burst into bloom and the views across to the snow-capped Sierra Nevada are at their most spectacular.",
                "indoor": false,
                "best_time": "Morning or Late Afternoon",
                "price_range": "Free (guided tours extra)",
                "seasonal_notes": "April-May offers the perfect combination of comfortable temperatures, blooming private gardens visible from the streets, and the contrasting backdrop of snow-capped mountains behind the Alhambra.",
                "booking_tips": "Self-guided walking possible; several companies offer specialized guided tours focusing on the private gardens and hidden corners. The light in late afternoon creates the most photogenic conditions for Alhambra views from Mirador San Nicolás."
            },
            {
                "name": "Subida al Veleta (Cycling)",
                "type": "Sport",
                "description": "Challenge yourself with one of Spain's most iconic cycling climbs from Granada up to Veleta peak in the Sierra Nevada, one of Europe's highest road-accessible mountains.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (bicycle rental extra)",
                "seasonal_notes": "Late spring (May-June) offers ideal conditions after winter road closures end but before summer heat intensifies. The route passes through multiple climate zones with unique flora appearing as you climb.",
                "booking_tips": "Several shops in Granada offer quality bicycle rentals; reserve in advance for peak periods. Support vehicles or guided cycling tours available through specialized operators. Tackle the climb early morning to avoid afternoon winds and heat."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Festival Internacional de Música y Danza",
                "type": "Cultural",
                "description": "Attend world-class performances at Granada's prestigious International Festival of Music and Dance, with concerts and dance performances held in the Alhambra, Generalife, and other historic venues.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held annually in late June through mid-July, this internationally renowned festival features performances in spectacular settings including the Palace of Charles V within the Alhambra and the Gardens of the Generalife.",
                "booking_tips": "Book tickets through the festival website months in advance, particularly for headline performances in the Alhambra venues which sell out very quickly. Dress for variable evening temperatures at outdoor venues."
            },
            {
                "name": "Lorca y Granada Festival",
                "type": "Cultural",
                "description": "Experience performances inspired by Federico García Lorca, Granada's most famous poet, in the gardens of his summer home featuring flamenco, theater, and poetry readings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in July, this festival celebrates Granada's literary heritage through performances in the atmospheric gardens of the Huerta de San Vicente, Lorca's preserved summer home.",
                "booking_tips": "Purchase tickets online in advance through the festival website. Combine with a daytime visit to the Lorca House Museum for a fuller appreciation of the performances' context."
            },
            {
                "name": "Alhambra Night Visit",
                "type": "Cultural",
                "description": "Experience the magic of the Alhambra palace complex illuminated at night, when summer evening temperatures are pleasant and special lighting highlights the architectural details.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers extended evening visit hours with the Nasrid Palaces particularly atmospheric under night lighting. The summer night schedule typically allows visits until midnight.",
                "booking_tips": "Essential to book night visit tickets weeks or months in advance through the official website. Night visits offer a completely different experience from daytime tours, with limited numbers creating a more intimate atmosphere."
            },
            {
                "name": "Summer Evenings in Plaza Nueva",
                "type": "Leisure",
                "description": "Enjoy the traditional summer evening paseo (stroll) and outdoor dining in Plaza Nueva and surrounding streets, where locals gather to socialize and enjoy the cooler evening air.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (dining extra)",
                "seasonal_notes": "From June through September, Granada's main squares come alive in the evenings after the daytime heat subsides, with outdoor dining, street performers, and social atmosphere until late night.",
                "booking_tips": "No booking required for general plaza atmosphere; reservations recommended for popular restaurant terraces, especially on weekends. Activity begins around 8-9pm and continues well past midnight."
            },
            {
                "name": "Sierra Nevada Summer Hiking",
                "type": "Nature",
                "description": "Explore the high mountain trails of the Sierra Nevada National Park when they're free of snow, offering access to alpine meadows, glacial lakes, and Spain's highest peaks.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "July-August is the only time many high-altitude trails are fully accessible, with alpine flowers in bloom and wildlife active. The stark high-mountain landscape offers a complete contrast to Granada's Moorish architecture.",
                "booking_tips": "No booking required for most trails; visitor center at Hoya de la Mora provides maps and information. Start hikes very early morning to avoid afternoon thunderstorms common in summer. Guided treks available with advance reservation."
            },
            {
                "name": "Hammam Al Ándalus",
                "type": "Wellness",
                "description": "Refresh in traditional Arab baths in a beautifully restored hammam, connecting to Granada's Moorish heritage with cool marble rooms providing perfect respite from summer heat.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Summer makes this cooling, immersive experience particularly appealing, offering escape from high temperatures and continuing the tradition of Arab baths that were central to life in medieval Granada.",
                "booking_tips": "Essential to book online in advance, with afternoon sessions often filling completely during peak summer. Various packages available including massage options; the basic bath circuit without massage offers the best value."
            },
            {
                "name": "Tropical Coast Day Trip",
                "type": "Beach/Nature",
                "description": "Escape to Granada's tropical coast at Almuñécar, Salobreña or La Herradura, where Mediterranean beaches are complemented by tropical fruit plantations in one of Europe's mildest winter climates.",
                "indoor": false,
                "best_time": "Morning to Afternoon",
                "price_range": "Free (transport and dining extra)",
                "seasonal_notes": "June through September offers perfect beach conditions, though August is extremely busy with Spanish vacationers. The unique microclimate supports tropical fruits like cherimoya, avocado, and mango.",
                "booking_tips": "Accessible by regular buses from Granada bus station (1 hour journey); frequency increases in summer. Morning departures recommended to maximize beach time and avoid peak afternoon heat during the journey."
            },
            {
                "name": "Cervezas Alhambra Brewery Tour",
                "type": "Food & Drink",
                "description": "Visit the production facility of Granada's iconic local beer with guided tours explaining the brewing process followed by tastings of different varieties in air-conditioned comfort.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Summer makes this indoor, climate-controlled activity particularly appealing during peak afternoon heat, with cold beer tastings offering perfect refreshment.",
                "booking_tips": "Book through the brewery website at least several days in advance; tours available in multiple languages. Located outside the center, accessible by local bus or taxi."
            },
            {
                "name": "Summer Night at Mirador de San Nicolás",
                "type": "Scenic/Cultural",
                "description": "Experience the unforgettable view of the illuminated Alhambra against the Sierra Nevada from this famous viewpoint in the Albaicín, with street musicians and a festive atmosphere on summer evenings.",
                "indoor": false,
                "best_time": "Sunset and Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer brings extended daylight with sunset around 9:30pm, followed by the gradual illumination of the Alhambra against deepening blue skies. The views combine with a vibrant social scene of locals and visitors.",
                "booking_tips": "No booking required; arrive at least 30-45 minutes before sunset to secure a good viewing position, especially on weekends. Several nearby restaurants offer terrace dining with similar views (with advance reservations essential)."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Alhambra Without Crowds",
                "type": "Cultural",
                "description": "Experience Granada's UNESCO World Heritage masterpiece with significantly fewer visitors than summer months, allowing more contemplative exploration of the palatial complex and gardens.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October and November offer ideal visiting conditions with comfortable temperatures, autumn colors in the gardens, and dramatically reduced crowds after summer peak season.",
                "booking_tips": "Still essential to book tickets in advance through the official website, but easier to secure preferred time slots. Morning visits offer the best light for photography. Consider a combined morning General Visit and evening Nasrid Palaces ticket for two different experiences."
            },
            {
                "name": "Granada Tapas Tour",
                "type": "Food & Drink",
                "description": "Explore Granada's famous free tapas tradition when seasonal autumn ingredients like mushrooms, game, and chestnuts feature prominently on menus throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings warming seasonal dishes to tapas menus, with establishments competing to offer the most generous free tapas with drink orders. October and November see fewer tourists, creating a more authentic experience.",
                "booking_tips": "Guided tours available but self-guided exploration equally rewarding. Focus on areas around Calle Navas, Plaza Nueva, and Realejo district. Most bars serve complimentary tapas with each drink ordered; quality and generosity generally improves the further you venture from main tourist areas."
            },
            {
                "name": "Mountain Biking in Sierra Nevada",
                "type": "Adventure",
                "description": "Experience world-class mountain biking on the lower slopes of the Sierra Nevada where autumn brings perfect riding conditions and spectacular fall colors to the landscape.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate (equipment rental extra)",
                "seasonal_notes": "September-October offers ideal conditions with dry trails, comfortable temperatures, and beautiful autumn colors in forested areas. The landscape transitions from summer dryness to early autumn vibrancy.",
                "booking_tips": "Several operators in Granada offer guided rides and equipment rental; book several days in advance for weekend excursions. All skill levels catered for with appropriate route selection."
            },
            {
                "name": "Granada Film Festival",
                "type": "Cultural",
                "description": "Attend this celebration of Andalusian and international cinema held at various venues throughout the city, featuring special screenings, director talks, and cultural events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Typically held in October, this cultural event brings cinema enthusiasts to Granada during the pleasant autumn season, with both indoor and outdoor screenings depending on weather.",
                "booking_tips": "Check festival website for program and ticket information once announced; popular screenings and events should be booked in advance. Festival passes available for serious film enthusiasts."
            },
            {
                "name": "Autumn Colors in Dehesa del Generalife",
                "type": "Nature",
                "description": "Explore the ancient forest adjacent to the Alhambra where fall brings spectacular color to the woodland landscape, offering scenic walking paths with historical context.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Late October through November offers the most vibrant autumn colors, with deciduous trees providing a spectacular complement to the Alhambra's earth-toned walls.",
                "booking_tips": "No booking required; accessible through Generalife entrance or via forest paths. Less visited than the main Alhambra complex, providing a peaceful extension to a palace visit."
            },
            {
                "name": "Día de Todos los Santos",
                "type": "Cultural",
                "description": "Experience the traditional All Saints' Day celebrations when Spanish families visit cemeteries with flowers, coupled with seasonal foods like roasted chestnuts and sweet potato.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Celebrated on November 1st, this important cultural tradition offers insight into Spanish family traditions and seasonal foods that mark the heart of autumn.",
                "booking_tips": "No booking required; street vendors selling castañas (roasted chestnuts) appear throughout the city during this period. The San José Cemetery is the main location for family visits if you wish to observe traditions respectfully."
            },
            {
                "name": "Wine Harvest in Alpujarra",
                "type": "Food & Drink",
                "description": "Visit small wineries in the Contraviesa region of the Alpujarras mountains during harvest season, when this high-altitude wine region harvests unique grape varieties.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "September through early October marks harvest season in this unique wine region where vineyards at up to 1,400 meters altitude produce distinctive wines from local grape varieties.",
                "booking_tips": "Book through specialized wine tour operators in Granada or contact bodegas directly for visit arrangements. This remote region is best visited with organized transportation or a designated driver."
            },
            {
                "name": "Jazz Festival Granada",
                "type": "Music",
                "description": "Experience international and Spanish jazz performers at venues throughout the city, from intimate clubs to the elegant Isabel la Católica Theater.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Typically held in November, the festival brings warmth to autumn evenings with performances ranging from traditional to avant-garde jazz in historic venues across the city.",
                "booking_tips": "Purchase tickets through the festival website once the program is announced; popular performers and weekend shows tend to sell out first. Club venues offer more intimate jazz experiences alongside the main theater performances."
            },
            {
                "name": "Mushroom Foraging in Sierra de Huétor",
                "type": "Nature/Gastronomy",
                "description": "Join guided mushroom collecting excursions in the forests near Granada when autumn rains bring forth prized varieties like níscalos and boletus.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October and November after autumn rains create ideal conditions for mushroom growth in the pine and oak forests of this natural park just outside Granada.",
                "booking_tips": "Essential to join official guided tours with mycological experts for safety; several local ecological organizations offer seasonal excursions. Book at least a week in advance as these specialized tours fill quickly during peak mushroom season."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Sierra Nevada Skiing",
                "type": "Sport",
                "description": "Enjoy Europe's southernmost ski resort with over 100km of runs, modern facilities, and the unique ability to ski in the morning and visit the Alhambra or Mediterranean coast in the afternoon.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Season typically runs from late November through April, with January and February offering the most reliable snow conditions while maintaining Granada's characteristic sunny days.",
                "booking_tips": "Book lift passes online in advance for discounts; equipment rental available on-site. Accessible by regular buses from Granada (1 hour) or private transportation. Weekdays offer significantly better experience with shorter lift lines."
            },
            {
                "name": "Christmas in Granada",
                "type": "Cultural",
                "description": "Experience traditional Spanish Christmas with illuminations throughout the historic center, nativity scenes (belenes) in churches and public buildings, and seasonal foods and performances.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Celebrations run from early December through January 6th (Three Kings Day), with the most festive atmosphere in the week before Christmas and continuing through New Year.",
                "booking_tips": "No booking required for general festivities; guided Christmas tours available through tourist office. Nativity scene exhibition in Caja Granada Cultural Center particularly impressive and free to visit."
            },
            {
                "name": "Arab Baths and Tea Houses",
                "type": "Wellness/Cultural",
                "description": "Warm up in traditional hammams and tetería (tea houses) in the Albaicín quarter, connecting to Granada's Moorish heritage with hot mint tea and steam baths.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter makes these warming, immersive experiences particularly appealing, offering respite from cooler temperatures and connecting to Granada's Arab past.",
                "booking_tips": "Hammam Al Ándalus requires advance online booking; tea houses along Calle Calderería Nueva (known as Tea Street) don't require reservations but fill up on cold afternoons."
            },
            {
                "name": "Three Kings Parade (Cabalgata de Reyes)",
                "type": "Cultural",
                "description": "Experience Spain's most beloved Christmas tradition as the Three Kings parade through Granada on elaborate floats, distributing candy to children on the eve of Epiphany.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on January 5th, the eve of Epiphany, with the main parade starting around 6pm and continuing for several hours through central Granada.",
                "booking_tips": "No booking required; arrive early for good viewing spots along the official route, particularly on Gran Vía and around Plaza del Carmen. Bring bags for children to collect thrown candies."
            },
            {
                "name": "Alhambra in Winter Light",
                "type": "Cultural",
                "description": "Visit Granada's crown jewel during the low season when winter light creates dramatic shadows across the intricate architecture and occasional light dustings of snow create magical scenes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "December through February offers dramatically reduced crowds and unique lighting conditions. Occasional snowfall (rare but possible) transforms the experience completely.",
                "booking_tips": "Still necessary to book in advance through official website, but easier to secure tickets during winter months. Morning visits offer best light; dress warmly as much of the visit is outdoors or in unheated spaces."
            },
            {
                "name": "Museum Day (Cárdenas Palace and Fine Arts)",
                "type": "Cultural",
                "description": "Explore Granada's museums housed in historic buildings when winter weather makes indoor activities appealing, particularly the Fine Arts Museum in the Palace of Charles V within the Alhambra.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter brings fewer tourists to Granada's museums, offering a more relaxed viewing experience. The Alhambra museums remain open year-round while some smaller venues may have reduced winter hours.",
                "booking_tips": "No booking required for most museums; access to the Fine Arts Museum included with Alhambra tickets or available separately. Many museums offer free entry on Sunday afternoons."
            },
            {
                "name": "Winter Tapas and Wine Experience",
                "type": "Food & Drink",
                "description": "Discover seasonal winter specialties in Granada's tapas bars featuring hearty mountain dishes like migas (fried breadcrumbs with pork), gachas (porridge), and warming stews paired with local wines.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "December through February brings special seasonal dishes rarely found in tourist-season menus, offering a more authentic culinary experience reflecting Granada's mountain traditions.",
                "booking_tips": "No reservations needed for most tapas bars; follow locals to find the most authentic winter dishes. Bars in the Realejo district and along Calle Navas offer some of the best free tapas with drink orders."
            },
            {
                "name": "Día de San Cecilio",
                "type": "Cultural/Religious",
                "description": "Join the celebrations for Granada's patron saint with religious ceremonies at Sacromonte Abbey followed by festive activities and traditional foods at the abbey grounds and throughout the city.",
                "indoor": false,
                "best_time": "Morning to Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Celebrated on the first Sunday of February, this local holiday brings Granadinos to Sacromonte hill regardless of weather conditions, with traditional foods and festivities.",
                "booking_tips": "No booking required; special bus services typically run from the city center to Sacromonte Abbey on the festival day. Morning Mass followed by more secular celebrations throughout the day."
            },
            {
                "name": "Granada Carnival",
                "type": "Festival",
                "description": "Experience pre-Lenten celebrations with costume parades, satirical performances, and street festivities throughout the city, offering color and warmth to the winter season.",
                "indoor": false,
                "best_time": "Afternoon and Evening",
                "price_range": "Free",
                "seasonal_notes": "Held in February (dates vary by liturgical calendar), bringing costume competitions, musical groups, and street festivities to combat winter gloom before the solemnity of Lent.",
                "booking_tips": "No booking required for street celebrations; costume contests and major events typically centered around Plaza del Carmen and Teatro Isabel la Católica."
            }
        ]
    }
}