{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day",
          "notes": "New Year's Day is a public holiday with celebrations throughout the city center."
        },
        {
          "days": [2, 3, 4],
          "score": 3,
          "notes": "Off-season with fewer tourists and excellent hotel value. Cold winter months but with frequent sunny days. Sierra Nevada ski resort at its peak season."
        },
        {
          "days": [5, 6],
          "score": 4,
          "special": true,
          "event": "Three Kings Celebration",
          "notes": "Three Kings celebration features a spectacular parade through central Granada and marks the main gift-giving tradition in Spain. January 6 is a public holiday."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "The city enjoys mild winter days while Sierra Nevada offers excellent skiing conditions. Winter sales begin mid-January in all shops. Museums and cultural venues are less crowded than other times of year."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 1,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "notes": "Winter continues with cold nights but often clear, sunny days. Good conditions for Sierra Nevada skiing combined with city visits."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12],
          "score": 3,
          "special": true,
          "event": "San Cecilio",
          "notes": "San Cecilio, the patron saint of Granada, is celebrated on the first Sunday of February with pilgrimages to Sacromonte Abbey. Religious ceremonies and cultural events throughout the city."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
          "score": 3,
          "special": true,
          "event": "Carnival",
          "notes": "Carnival celebrations feature costume parades and musical performances throughout the city, usually falling in late February or early March depending on the Easter calendar."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 2,
      "tourismLevel": 4
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "notes": "Early spring brings almond blossoms in the countryside around Granada and warming temperatures. Still excellent conditions for skiing in Sierra Nevada combined with city visits."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Mid-March sees increasing temperatures and longer days. The Alhambra gardens begin showing first signs of spring blooms."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins",
          "notes": "Spring officially begins with gardens starting to bloom. Ideal time for visiting the Alhambra gardens and Generalife as flowers begin appearing. Tourism gradually increases but still before peak season."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 4,
      "tourismLevel": 5
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 5,
          "notes": "Perfect spring weather with warm days and cool evenings. Gardens in full bloom throughout the city."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14],
          "score": 5,
          "special": true,
          "event": "Semana Santa (Holy Week - varies by year)",
          "notes": "Granada's Holy Week processions feature solemn and haunting processions through the narrow streets of the historic center. The city's unique topography creates dramatic scenes as processions wind through the Albaicín and Centro districts."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Ideal time to visit before summer crowds arrive. Sierra Nevada often still offers spring skiing while the city enjoys warm weather - a unique combination. Perfect conditions for exploring all neighborhoods on foot."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 7,
      "tourismLevel": 7
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day",
          "notes": "Public holiday with events throughout the city, many locals head to parks or the countryside for picnics."
        },
        {
          "days": [2, 3],
          "score": 5,
          "special": true,
          "event": "Día de la Cruz (Day of the Cross)",
          "notes": "One of Granada's most distinctive festivals (May 3), featuring flower-adorned crosses throughout the city with competitions between neighborhoods for the most beautiful displays. Plazas and patios are decorated, and music and festivities continue throughout the day and evening."
        },
        {
          "days": [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "One of the best months to visit Granada with perfect temperatures, gardens in full bloom, and the Generalife at its most beautiful. The Alhambra's roses and other flowers create spectacular scenes. City comes alive with outdoor dining and activities."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "notes": "Early summer brings warm days but still comfortable evenings. Tourism increases but still manageable. Outdoor dining and evening activities become particularly pleasant."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Corpus Christi & Festival Internacional de Música y Danza",
          "notes": "Corpus Christi brings religious processions and celebrations. The prestigious International Festival of Music and Dance begins in late June with performances in the Alhambra, Generalife, and other historic venues throughout the city, featuring world-class musicians and dancers."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 14,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Festival Internacional de Música y Danza",
          "notes": "The prestigious festival continues with performances in unique settings including the Palace of Charles V within the Alhambra and the Generalife Gardens. Hot daytime temperatures but pleasant evenings for performances."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Lorca y Granada Festival",
          "notes": "Festival celebrating Granada's famous poet Federico García Lorca with performances, readings, and events in the gardens of his summer home, the Huerta de San Vicente. Very hot days but cool mountain evenings."
        }
      ],
      "weatherHighC": 33,
      "weatherLowC": 17,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Peak summer season with very hot temperatures and maximum tourist numbers. Many locals leave the city for coastal areas. Morning and evening activities recommended to avoid midday heat."
        },
        {
          "days": [15],
          "score": 3,
          "special": true,
          "event": "Virgen de la Asunción",
          "notes": "Public holiday with religious observances and processions in some neighborhoods."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Hottest month of the year with temperatures often exceeding 36°C during the day. Tourism remains high with international visitors. Many local businesses may close for extended holiday periods. Night visits to the Alhambra particularly popular."
        }
      ],
      "weatherHighC": 34,
      "weatherLowC": 17,
      "tourismLevel": 10
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 5,
          "notes": "Excellent time to visit as summer crowds begin to diminish while weather remains warm during the day but more comfortable, especially in the evenings. Local life returns to normal rhythm after August holidays."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Festival de Otoño",
          "notes": "Autumn cultural events begin with concerts, exhibitions, and performances throughout the city. Perfect weather for exploring the Albaicín and other neighborhoods on foot."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 14,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
          "score": 5,
          "notes": "Excellent autumn weather with warm days and cool evenings. Fall colors begin appearing in the parks and Sierra Nevada. Ideal conditions for hiking in surrounding mountains."
        },
        {
          "days": [12],
          "score": 4,
          "special": true,
          "event": "Hispanic Day",
          "notes": "National holiday commemorating Columbus's arrival in the Americas, with events in various parts of the city."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Pleasant autumn with fewer tourists, excellent time for cultural activities and museum visits. The Alhambra is less crowded and surrounding gardens show beautiful fall colors. Sierra Nevada may receive first snowfall late in the month."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 9,
      "tourismLevel": 6
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day",
          "notes": "Public holiday with traditional cemetery visits and special services. Many businesses closed."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Weather turns cooler with potential for first frosts and occasional rain. Sierra Nevada prepares for ski season with snowmaking equipment ready."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Granada Jazz Festival",
          "notes": "International jazz festival featuring performances at the Isabel la Católica Theater and venues throughout the city. Sierra Nevada ski season may begin in late November if conditions permit."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 4,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "notes": "Early winter with cold temperatures but often sunny days. Sierra Nevada ski season gaining momentum with more slopes opening."
        },
        {
          "days": [6],
          "score": 3,
          "special": true,
          "event": "Constitution Day",
          "notes": "Public holiday commemorating the Spanish Constitution. Many businesses closed."
        },
        {
          "days": [7],
          "score": 3,
          "notes": "'Puente' (bridge) holiday period between Constitution Day and Immaculate Conception."
        },
        {
          "days": [8],
          "score": 3,
          "special": true,
          "event": "Immaculate Conception",
          "notes": "Public holiday with special religious services. Many businesses closed."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "special": true,
          "event": "Christmas Preparations",
          "notes": "Granada's Christmas decorations and lights create a festive atmosphere. The traditional belén (nativity scene) displays appear throughout the city, with a large municipal belén in the Town Hall. Unique opportunity to combine skiing in Sierra Nevada with Christmas festivities in the city."
        },
        {
          "days": [25],
          "score": 3,
          "special": true,
          "event": "Christmas Day",
          "notes": "Public holiday with limited opening hours. Family celebration day."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Post-Christmas period with continued holiday atmosphere and festive decorations throughout the city. Sierra Nevada typically offers excellent skiing conditions during this period."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve",
          "notes": "Celebrations throughout the city, particularly in Plaza del Carmen, with the tradition of eating 12 grapes at midnight. Many restaurants offer special New Year's dinners."
        }
      ],
      "weatherHighC": 13,
      "weatherLowC": 2,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Semana Santa Processions in Historic Center",
      "Day of the Cross Festival throughout the City",
      "Alhambra and Generalife Gardens in Bloom",
      "Albaicín Walking Tours with Spring Mountain Views",
      "Hiking in the Alpujarras Mountain Villages",
      "Spring Skiing in Sierra Nevada",
      "Flamenco Shows in Sacromonte Cave Venues",
      "Spring Cuisine featuring Broad Beans with Ham"
    ],
    "summer": [
      "Festival Internacional de Música y Danza Performances",
      "Night Visits to the Illuminated Alhambra",
      "Evening Paseo in Plaza Nueva and Carrera del Darro",
      "Summer Musical Events in Gardens of the Generalife",
      "Albaicín Evening Tours to Escape Daytime Heat",
      "Day Trips to Granada's Tropical Coast",
      "Rooftop Bar Experiences with Alhambra Views",
      "Sunset at Mirador San Nicolás"
    ],
    "autumn": [
      "Alhambra Visits with Fall Colors and Fewer Crowds",
      "Granada Jazz Festival Performances",
      "Hiking in Sierra Nevada National Park",
      "Wine Tasting featuring Wines from the Alpujarra Region",
      "Museum Visits including Fine Arts Museum",
      "Sierra Nevada's First Snowfalls",
      "Traditional Hammam Arab Bath Experience",
      "Autumn Cuisine featuring Wild Mushrooms and Game"
    ],
    "winter": [
      "Sierra Nevada Skiing Day Trips",
      "Christmas Nativity Scene Displays",
      "Three Kings Parade Through City Center",
      "Alhambra Visits with Potential Snow Dustings",
      "Tea Houses in the Albaicín Quarter",
      "Hot Chocolate with Churros at Cafeteria Alhambra",
      "Winter Sales Shopping on Recogidas and Gran Vía",
      "New Year's Eve Celebrations in Plaza del Carmen"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to high tourism (or cold winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}