{
    "neighborhoods": [
        {
            "name": "Albaicín",
            "alternate_names": [
                "Albayzín",
                "Arab Quarter",
                "Historic Quarter"
            ],
            "character": "UNESCO World Heritage site featuring a maze of narrow, winding streets, whitewashed houses, traditional carmenes (houses with walled gardens), and spectacular views of the Alhambra, preserving Granada's Moorish heritage.",
            "location": {
                "central": true,
                "description": "Located on a hillside facing the Alhambra across the Darro Valley, north of Granada's historic center.",
                "borders": [
                    "Sacromonte",
                    "Centro",
                    "Realejo",
                    "San Pedro"
                ],
                "landmarks": [
                    "Mirador de San Nicolás",
                    "Church of San Salvador",
                    "Calle Calderería Nueva (Tea Street)"
                ]
            },
            "history": {
                "overview": "Originally a separate settlement that predates the Alhambra, developed primarily during the Nasrid dynasty (13th-15th centuries), and preserved after the Christian conquest in 1492.",
                "significance": "The most intact surviving example of medieval Islamic urban planning in Spain, representing Granada's Moorish heritage and multicultural past.",
                "notable_events": [
                    "Development as a Muslim quarter during Nasrid period (13th-15th centuries)",
                    "Christian conquest in 1492 followed by gradual cultural transformation",
                    "Morisco rebellion of 1568 and subsequent expulsion",
                    "UNESCO World Heritage designation in 1994",
                    "Gentrification and tourism development in recent decades"
                ]
            },
            "practical_info": {
                "transit": [
                    "Minibuses C1 and C2 navigate narrow streets",
                    "Walking from Centro takes 15-20 minutes uphill",
                    "Limited vehicle access, primarily for residents"
                ],
                "safety": "Generally safe, but normal precautions advised especially at night on quieter streets.",
                "best_time_to_visit": "Evening for sunset views of the Alhambra; morning for exploring streets before heat and crowds.",
                "walkability": "Entirely walkable but challenging with steep, cobblestone streets and many staircases."
            },
            "appeal": {
                "known_for": [
                    "Spectacular Alhambra views",
                    "Moorish architecture and atmosphere",
                    "Traditional carmen houses with gardens"
                ],
                "atmosphere": [
                    "Historic",
                    "Mysterious",
                    "Romantic"
                ],
                "best_for": [
                    "Photography enthusiasts",
                    "History lovers",
                    "Cultural immersion seekers"
                ]
            },
            "categories": {
                "touristy": 4,
                "residential": 5,
                "green_spaces": 3,
                "shopping": 3,
                "dining": 4,
                "nightlife": 3,
                "cultural": 5,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Mirador de San Nicolás",
                        "type": "Viewpoint",
                        "description": "Famous plaza offering the most spectacular view of the Alhambra with Sierra Nevada mountains as backdrop.",
                        "appeal": "Experience the iconic panorama that Bill Clinton called 'the most beautiful sunset in the world,' with musicians often performing as the sun sets on the Alhambra."
                    },
                    {
                        "name": "Calle Calderería Nueva",
                        "type": "Shopping Street",
                        "description": "Narrow lane known as 'Tea Street' filled with Moroccan tea houses, spice shops, and artisan crafts.",
                        "appeal": "Immerse yourself in the North African ambiance with aromatic teas, hookahs, and handcrafted goods evoking Granada's Moorish past."
                    },
                    {
                        "name": "Church of San Salvador",
                        "type": "Religious Site",
                        "description": "Church built over the former main mosque of the Albaicín, retaining its original courtyard (patio de abluciones).",
                        "appeal": "Discover the religious transformation of Granada through this building that incorporates elements from the original mosque."
                    }
                ],
                "dining": [
                    {
                        "name": "Mirador de Morayma",
                        "cuisine": "Traditional Andalusian",
                        "price_range": "€€€",
                        "known_for": "Dining in a traditional carmen with Alhambra views",
                        "atmosphere": "Romantic garden restaurant in historic house with terraced views."
                    },
                    {
                        "name": "Café Restaurante Las Tomasas",
                        "cuisine": "Mediterranean",
                        "price_range": "€€",
                        "known_for": "Terrace dining with panoramic Alhambra views",
                        "atmosphere": "Intimate restaurant with outdoor seating and spectacular vistas."
                    },
                    {
                        "name": "Tetería Al-Andalus",
                        "cuisine": "Moroccan/Middle Eastern",
                        "price_range": "€",
                        "known_for": "Authentic mint tea and Middle Eastern pastries",
                        "atmosphere": "Traditional tea house with low seating, lanterns, and Moorish décor."
                    }
                ],
                "activities": [
                    {
                        "name": "Getting Lost in the Labyrinth",
                        "type": "Exploration",
                        "description": "Wander the maze-like narrow streets, discovering hidden plazas, carmenes, and architectural details.",
                        "suitable_for": [
                            "Explorers",
                            "Photographers",
                            "History enthusiasts"
                        ]
                    },
                    {
                        "name": "Guided Cultural Tour",
                        "type": "Educational",
                        "description": "Expert-led tours revealing the history, culture and hidden aspects of this UNESCO World Heritage site.",
                        "suitable_for": [
                            "History buffs",
                            "Architecture enthusiasts",
                            "First-time visitors"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to immerse yourself in Granada's Moorish heritage and atmosphere.",
                "You prefer historic character and views over modern conveniences.",
                "You don't mind uphill walks and navigating narrow streets with luggage."
            ],
            "avoid_if": [
                "You have mobility issues (steep slopes, stairs, and cobblestones).",
                "You need easy vehicle access or parking.",
                "You're sensitive to noise (popular viewpoints can be busy until late)."
            ],
            "insider_tips": [
                "Visit Mirador San Nicolás at sunrise to experience the view without crowds.",
                "The neighborhood is best explored by wandering without a strict plan - embrace getting lost.",
                "Look for doorways that are open to reveal traditional carmen gardens not visible from the street."
            ]
        },
        {
            "name": "Realejo",
            "alternate_names": [
                "Jewish Quarter",
                "Judería"
            ],
            "character": "Former Jewish quarter with narrow streets, traditional houses decorated with street art, small squares, and a bohemian atmosphere that blends historic character with contemporary creativity.",
            "location": {
                "central": true,
                "description": "Located at the foot of the Alhambra hill, southwest of the city center, a historic quarter that slopes upward toward the monuments.",
                "borders": [
                    "Centro",
                    "Barranco del Abogado",
                    "Albaicín",
                    "Campo del Príncipe"
                ],
                "landmarks": [
                    "Plaza de Santo Domingo",
                    "Campo del Príncipe",
                    "San Matías Church"
                ]
            },
            "history": {
                "overview": "Established as Granada's Jewish quarter (Judería) during the Moorish period, transformed after the Christian conquest and Jewish expulsion of 1492.",
                "significance": "Represents the historical Jewish presence in Granada and the multicultural nature of the city before the Catholic unification.",
                "notable_events": [
                    "Development as Jewish quarter during Nasrid period",
                    "Expulsion of Jews in 1492 following Christian conquest",
                    "Conversion to Christian neighborhood with new churches and convents",
                    "Urban renewal and artistic revival in the 21st century with street art project 'El Niño de las Pinturas'"
                ]
            },
            "practical_info": {
                "transit": [
                    "Walkable from city center (10 minutes)",
                    "Local bus connections",
                    "Limited vehicle access on some streets"
                ],
                "safety": "Generally safe day and night, though normal urban precautions advised.",
                "best_time_to_visit": "Late afternoon when the light illuminates the colorful buildings and street art.",
                "walkability": "Very walkable but moderate hills; some streets have narrow or no sidewalks."
            },
            "appeal": {
                "known_for": [
                    "Street art murals",
                    "Historic Jewish heritage",
                    "Creative community and atmosphere"
                ],
                "atmosphere": [
                    "Bohemian",
                    "Artistic",
                    "Laid-back"
                ],
                "best_for": [
                    "Art lovers",
                    "Cultural explorers",
                    "Those seeking local character"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 5,
                "green_spaces": 2,
                "shopping": 3,
                "dining": 4,
                "nightlife": 4,
                "cultural": 5,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "El Niño de las Pinturas Street Art",
                        "type": "Urban Art",
                        "description": "Impressive murals throughout the neighborhood by renowned street artist El Niño de las Pinturas (Raúl Ruiz) and others.",
                        "appeal": "Discover thought-provoking street art integrated with the historic environment, creating a unique cultural contrast."
                    },
                    {
                        "name": "Campo del Príncipe",
                        "type": "Historic Plaza",
                        "description": "Charming square lined with tapas bars and restaurants, centered around a 16th-century stone cross.",
                        "appeal": "Experience the heart of the neighborhood where locals gather, with views toward the Alhambra and excellent dining options."
                    },
                    {
                        "name": "Casa de los Tiros",
                        "type": "Museum/Historic Building",
                        "description": "16th-century Renaissance palace featuring a distinctive tower, now housing a museum of Granada's history and culture.",
                        "appeal": "Explore this unique building with its impressive façade, collection of art, and insight into Granada's past."
                    }
                ],
                "dining": [
                    {
                        "name": "Bar Los Diamantes",
                        "cuisine": "Seafood Tapas",
                        "price_range": "€€",
                        "known_for": "Fresh seafood and bustling atmosphere",
                        "atmosphere": "Authentic, busy tapas bar with standing-room and few tables."
                    },
                    {
                        "name": "La Tabernilla del Darro",
                        "cuisine": "Modern Spanish",
                        "price_range": "€€",
                        "known_for": "Creative tapas with local ingredients",
                        "atmosphere": "Cozy tavern with contemporary touches and local vibe."
                    },
                    {
                        "name": "Bar Poë",
                        "cuisine": "International",
                        "price_range": "€€",
                        "known_for": "Fusion tapas and literary atmosphere",
                        "atmosphere": "Literary-themed bar with eclectic décor popular with creative types."
                    }
                ],
                "activities": [
                    {
                        "name": "Street Art Tour",
                        "type": "Cultural",
                        "description": "Self-guided or organized tour of the neighborhood's impressive collection of murals by El Niño de las Pinturas and others.",
                        "suitable_for": [
                            "Art lovers",
                            "Photographers",
                            "Urban culture enthusiasts"
                        ]
                    },
                    {
                        "name": "Tapas Crawl",
                        "type": "Culinary",
                        "description": "Visit multiple tapas bars around Campo del Príncipe and adjacent streets for authentic local dining experience.",
                        "suitable_for": [
                            "Food enthusiasts",
                            "Social travelers",
                            "Cultural experience seekers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want a central location with a more local, less touristy feel than the Albaicín.",
                "You appreciate creative, artistic neighborhoods with historical character.",
                "You enjoy good dining options and lively but not overwhelming nightlife."
            ],
            "avoid_if": [
                "You're looking for luxury accommodations (options are limited and mostly mid-range).",
                "You prefer completely flat terrain for walking.",
                "You want a quiet, secluded atmosphere."
            ],
            "insider_tips": [
                "Look up frequently while walking to spot hidden street art on upper façades and rooftops.",
                "During Holy Week, the Cristo de los Favores procession in Campo del Príncipe is one of Granada's most moving and authentic traditions.",
                "Many bars in this area still serve generous free tapas with drinks ordered - Bar Poë and Los Diamantes are particularly generous."
            ]
        },
        {
            "name": "Sacromonte",
            "alternate_names": [
                "Gypsy Quarter",
                "Cave District"
            ],
            "character": "Picturesque hillside neighborhood famous for its cave dwellings carved into the mountainside, flamenco traditions, and bohemian atmosphere, offering spectacular views across the Darro Valley.",
            "location": {
                "central": false,
                "description": "Located on Valparaíso hill northeast of the Albaicín, following the Camino del Sacromonte up from the Darro Valley.",
                "borders": [
                    "Albaicín",
                    "Darro Valley",
                    "Surrounding countryside"
                ],
                "landmarks": [
                    "Sacromonte Abbey",
                    "Cave Museum (Museo Cuevas del Sacromonte)",
                    "Flamenco Cave Venues"
                ]
            },
            "history": {
                "overview": "Established after the Christian conquest when Muslims and Jews fled the city, later becoming home to Roma (Gitano) communities who developed the cave dwelling tradition and flamenco culture.",
                "significance": "Cultural heart of Granada's flamenco tradition and Roma heritage, representing resilience and cultural preservation of marginalized communities.",
                "notable_events": [
                    "Settlement by displaced Muslims and Jews after 1492",
                    "Arrival of Roma populations in the 16th century",
                    "Development of zambra flamenco tradition in cave venues",
                    "Tourism development centered on flamenco shows beginning in the 20th century",
                    "Floods of 1963 that damaged many cave homes"
                ]
            },
            "practical_info": {
                "transit": [
                    "Minibus C2 (infrequent service)",
                    "Mostly accessed by foot from Albaicín or Darro Valley",
                    "Taxis available but limited access to upper areas"
                ],
                "safety": "Generally safe but isolated areas at night should be approached with caution.",
                "best_time_to_visit": "Evening for flamenco shows; morning for exploring the landscape and views.",
                "walkability": "Accessible only by foot on steep, sometimes rough paths; proper footwear essential."
            },
            "appeal": {
                "known_for": [
                    "Cave dwellings",
                    "Authentic flamenco",
                    "Panoramic views"
                ],
                "atmosphere": [
                    "Bohemian",
                    "Rustic",
                    "Cultural"
                ],
                "best_for": [
                    "Flamenco enthusiasts",
                    "Photography lovers",
                    "Adventure travelers"
                ]
            },
            "categories": {
                "touristy": 4,
                "residential": 3,
                "green_spaces": 3,
                "shopping": 1,
                "dining": 3,
                "nightlife": 4,
                "cultural": 5,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Museo Cuevas del Sacromonte",
                        "type": "Ethnographic Museum",
                        "description": "Museum showcasing traditional cave dwelling life with furnished cave homes, craftwork displays, and cultural exhibits.",
                        "appeal": "Learn about the unique lifestyle and history of the cave communities through well-preserved examples of traditional homes."
                    },
                    {
                        "name": "Sacromonte Abbey",
                        "type": "Religious Site",
                        "description": "17th-century abbey on the hill's summit with catacombs claimed to be where St. Caecilius, Granada's patron saint, lived.",
                        "appeal": "Discover this important religious site with spectacular views and exploration of the sacred caves beneath."
                    },
                    {
                        "name": "Zambra Flamenco Shows",
                        "type": "Cultural Performance",
                        "description": "Traditional flamenco performances in cave venues showcasing the distinctive Granada style of zambra flamenco.",
                        "appeal": "Experience the passionate, authentic form of flamenco that developed in these very caves, with performances in intimate settings."
                    }
                ],
                "dining": [
                    {
                        "name": "Venta El Gallo",
                        "cuisine": "Andalusian",
                        "price_range": "€€€",
                        "known_for": "Dinner and authentic zambra flamenco show",
                        "atmosphere": "Traditional cave venue with panoramic views and cultural performances."
                    },
                    {
                        "name": "Restaurante Juanillo",
                        "cuisine": "Traditional Spanish",
                        "price_range": "€€",
                        "known_for": "Rustic hearty dishes with Alhambra views",
                        "atmosphere": "Authentic cave restaurant with terrace overlooking the monuments."
                    },
                    {
                        "name": "El Albayzín",
                        "cuisine": "Andalusian",
                        "price_range": "€€",
                        "known_for": "Spanish cuisine with panoramic views",
                        "atmosphere": "Terrace restaurant overlooking the Albaicín and Alhambra."
                    }
                ],
                "activities": [
                    {
                        "name": "Flamenco Experience",
                        "type": "Cultural",
                        "description": "Attend an authentic zambra flamenco show in a traditional cave venue.",
                        "suitable_for": [
                            "Music lovers",
                            "Cultural experience seekers",
                            "Evening entertainment"
                        ]
                    },
                    {
                        "name": "Photography Walk",
                        "type": "Outdoor",
                        "description": "Follow the Camino del Sacromonte capturing views of the Alhambra, Albaicín, and distinctive cave houses.",
                        "suitable_for": [
                            "Photographers",
                            "Hikers",
                            "Landscape enthusiasts"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You're looking for a unique, off-the-beaten-path experience.",
                "You want to stay in a converted cave dwelling for a truly distinctive accommodation.",
                "You value cultural authenticity and don't mind basic amenities."
            ],
            "avoid_if": [
                "You have mobility issues (very steep terrain with rough paths).",
                "You want convenient access to Granada's main attractions.",
                "You prefer conventional accommodations with standard amenities."
            ],
            "insider_tips": [
                "Look beyond the commercial flamenco venues to smaller, more authentic shows where locals might attend.",
                "The full moon nights offer spectacular illumination of the Alhambra from Sacromonte viewpoints.",
                "The upper reaches of Sacromonte beyond the tourist area offer the most authentic experience of cave dwelling communities."
            ]
        },
        {
            "name": "Centro",
            "alternate_names": [
                "City Center",
                "Downtown",
                "Historic Center"
            ],
            "character": "The bustling heart of Granada combining historic monuments, shopping streets, tapas bars, and vibrant plazas that form the commercial and social center of the city.",
            "location": {
                "central": true,
                "description": "Located at the foot of the Albaicín and Alhambra hills, the flat area centered around the Cathedral and extending to Gran Vía and Recogidas.",
                "borders": [
                    "Albaicín",
                    "Realejo",
                    "Ronda District",
                    "Figares"
                ],
                "landmarks": [
                    "Granada Cathedral",
                    "Royal Chapel",
                    "Plaza Bib-Rambla"
                ]
            },
            "history": {
                "overview": "Developed primarily after the Christian conquest in 1492, replacing the old Muslim city with Renaissance and Baroque architecture centered around the Cathedral.",
                "significance": "Represents Granada's transformation from Islamic to Christian city and its development as a Spanish cultural center.",
                "notable_events": [
                    "Christian conquest in 1492",
                    "Construction of Cathedral beginning in 1518",
                    "Building of Royal Chapel (1504-1517)",
                    "19th-century urban expansions",
                    "Pedestrianization of many streets in recent decades"
                ]
            },
            "practical_info": {
                "transit": [
                    "Central bus hub at Gran Vía",
                    "Taxi stands throughout the area",
                    "Limited vehicle access in pedestrianized zones"
                ],
                "safety": "Very safe area with constant activity and police presence.",
                "best_time_to_visit": "Morning for monuments; evening for tapas and atmosphere.",
                "walkability": "Excellent with extensive pedestrian streets and flat terrain."
            },
            "appeal": {
                "known_for": [
                    "Historical monuments",
                    "Shopping streets",
                    "Tapas bars and restaurants"
                ],
                "atmosphere": [
                    "Lively",
                    "Historic",
                    "Commercial"
                ],
                "best_for": [
                    "First-time visitors",
                    "Shopping enthusiasts",
                    "Food lovers"
                ]
            },
            "categories": {
                "touristy": 5,
                "residential": 3,
                "green_spaces": 2,
                "shopping": 5,
                "dining": 5,
                "nightlife": 4,
                "cultural": 5,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Granada Cathedral",
                        "type": "Religious Site",
                        "description": "Magnificent Renaissance cathedral built over the former main mosque, with impressive façade and brilliant white interior.",
                        "appeal": "Marvel at this masterpiece of Spanish Renaissance architecture with its soaring columns, grand altar, and important artwork."
                    },
                    {
                        "name": "Royal Chapel",
                        "type": "Historic Monument",
                        "description": "Gothic mausoleum built to house the tombs of Catholic Monarchs Ferdinand and Isabella who conquered Granada in 1492.",
                        "appeal": "See the ornate marble tombs of Spain's most famous monarchs and their priceless art collection in this historic chapel."
                    },
                    {
                        "name": "Alcaicería",
                        "type": "Historic Market",
                        "description": "Reconstructed version of the old Moorish silk market with narrow lanes filled with artisan shops and souvenirs.",
                        "appeal": "Shop for traditional crafts while experiencing the atmosphere of a medieval Arab marketplace in these winding passages."
                    }
                ],
                "dining": [
                    {
                        "name": "Bodegas Castañeda",
                        "cuisine": "Traditional Tapas",
                        "price_range": "€€",
                        "known_for": "Authentic Granada tapas and local wines",
                        "atmosphere": "Historic bodega with barrels, hams hanging from ceiling, and lively crowd."
                    },
                    {
                        "name": "Chikito",
                        "cuisine": "Traditional Granadian",
                        "price_range": "€€€",
                        "known_for": "Historic restaurant once frequented by Federico García Lorca",
                        "atmosphere": "Classic Spanish restaurant with literary history and formal service."
                    },
                    {
                        "name": "Los Diamantes",
                        "cuisine": "Seafood",
                        "price_range": "€€",
                        "known_for": "Fried fish and seafood tapas",
                        "atmosphere": "Busy, standing-room tapas bar with energetic vibe and fresh seafood."
                    }
                ],
                "activities": [
                    {
                        "name": "Tapas Crawl",
                        "type": "Culinary",
                        "description": "Experience Granada's famous free tapas culture by visiting multiple bars, receiving a complimentary dish with each drink ordered.",
                        "suitable_for": [
                            "Food enthusiasts",
                            "Budget travelers",
                            "Social explorers"
                        ]
                    },
                    {
                        "name": "Historic Walking Tour",
                        "type": "Cultural",
                        "description": "Guided tour of the historic center revealing the transformation from Muslim to Christian city through its architecture and urban planning.",
                        "suitable_for": [
                            "History buffs",
                            "First-time visitors",
                            "Architecture enthusiasts"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want maximum convenience to attractions, shopping, and dining.",
                "You prefer flat, easy walking terrain with good transport connections.",
                "You enjoy being in the center of activity and nightlife."
            ],
            "avoid_if": [
                "You're seeking a quiet, peaceful atmosphere.",
                "You want to experience the more unique aspects of Granada's heritage.",
                "You're sensitive to noise (many streets remain lively late into the night)."
            ],
            "insider_tips": [
                "The area around Calle Navas offers some of Granada's best tapas bars in a concentrated zone.",
                "Visit the Corral del Carbón, a 14th-century Moorish caravanserai hidden behind an unassuming entrance on Calle Reyes Católicos.",
                "The rooftop of El Corte Inglés department store offers fantastic free views of the city and Sierra Nevada mountains."
            ]
        },
        {
            "name": "Zaidín",
            "alternate_names": [
                "Southern District",
                "Working-Class Granada"
            ],
            "character": "Authentic working-class neighborhood south of the center that offers a glimpse into everyday Granada life, with markets, affordable eateries, and local atmosphere away from tourist areas.",
            "location": {
                "central": false,
                "description": "Located south of the city center across the Genil River, a primarily residential area that developed in the mid-20th century.",
                "borders": [
                    "Figares",
                    "PTS (Health Technology Park)",
                    "Genil River",
                    "Carretera de la Sierra"
                ],
                "landmarks": [
                    "Los Cármenes Stadium (Granada FC)",
                    "Palacio de Deportes",
                    "Zaidín Market"
                ]
            },
            "history": {
                "overview": "Developed primarily in the 1950s-1970s to accommodate Granada's growing population and rural migration to the city.",
                "significance": "Represents modern, working-class Granada and the city's expansion beyond its historic core.",
                "notable_events": [
                    "Initial development in the 1950s",
                    "Major expansion during Spain's economic development in the 1960s-70s",
                    "Integration of immigrant communities in recent decades",
                    "Urban improvements and modernization in the 21st century"
                ]
            },
            "practical_info": {
                "transit": [
                    "Multiple bus lines connect to city center",
                    "20-30 minute walk to historic areas",
                    "Good parking availability compared to historic districts"
                ],
                "safety": "Generally safe area; normal urban precautions advised.",
                "best_time_to_visit": "Mornings for markets; match days for football atmosphere.",
                "walkability": "Flat terrain with regular street grid; less charm but easier walking than historic areas."
            },
            "appeal": {
                "known_for": [
                    "Authentic local life",
                    "Affordable dining",
                    "Granada FC football culture"
                ],
                "atmosphere": [
                    "Working-class",
                    "Unpretentious",
                    "Modern"
                ],
                "best_for": [
                    "Budget travelers",
                    "Long-term visitors",
                    "Football fans"
                ]
            },
            "categories": {
                "touristy": 1,
                "residential": 5,
                "green_spaces": 2,
                "shopping": 3,
                "dining": 3,
                "nightlife": 2,
                "cultural": 2,
                "historic": 1
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Nuevo Los Cármenes Stadium",
                        "type": "Sports Venue",
                        "description": "Home of Granada FC football club, hosting La Liga matches in a 19,000-seat stadium.",
                        "appeal": "Experience authentic Spanish football culture and local passion at a Granada FC match."
                    },
                    {
                        "name": "Zaidín Market",
                        "type": "Local Market",
                        "description": "Traditional neighborhood market with food stalls selling fresh local produce, meat, and seafood.",
                        "appeal": "Shop alongside locals for authentic ingredients at non-tourist prices and observe everyday Granada life."
                    },
                    {
                        "name": "Parque García Lorca",
                        "type": "Urban Park",
                        "description": "Large green space dedicated to Granada's famous poet, with gardens, fountains, and cultural venues.",
                        "appeal": "Relax in this peaceful park that honors Federico García Lorca, with his summer home museum on the grounds."
                    }
                ],
                "dining": [
                    {
                        "name": "Bar Ávila",
                        "cuisine": "Traditional Tapas",
                        "price_range": "€",
                        "known_for": "Enormous free tapas with drinks",
                        "atmosphere": "No-frills local bar with authentic vibe and generous portions."
                    },
                    {
                        "name": "Restaurante Oliver",
                        "cuisine": "Spanish",
                        "price_range": "€€",
                        "known_for": "Quality menu del día (daily set menu)",
                        "atmosphere": "Professional neighborhood restaurant popular with local workers."
                    },
                    {
                        "name": "El Pescaíto",
                        "cuisine": "Seafood",
                        "price_range": "€€",
                        "known_for": "Fresh fish and seafood at reasonable prices",
                        "atmosphere": "Bustling seafood restaurant with simple décor and local clientele."
                    }
                ],
                "activities": [
                    {
                        "name": "Local Football Match",
                        "type": "Sports",
                        "description": "Attend a Granada FC home game at Los Cármenes Stadium to experience authentic Spanish football culture.",
                        "suitable_for": [
                            "Sports fans",
                            "Cultural immersion seekers",
                            "Families"
                        ]
                    },
                    {
                        "name": "Zaidín Rock Festival",
                        "type": "Cultural Event",
                        "description": "Annual free rock music festival held in September featuring Spanish and international bands.",
                        "suitable_for": [
                            "Music lovers",
                            "Budget travelers",
                            "Young travelers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You're traveling on a tight budget and seeking affordable accommodation.",
                "You prefer to experience everyday Spanish life rather than tourist areas.",
                "You're attending a Granada FC match or events at the sports complex."
            ],
            "avoid_if": [
                "You want to be within walking distance of the main historic attractions.",
                "You're seeking atmospheric historic buildings and ambiance.",
                "You have limited time in Granada and want to focus on the key sights."
            ],
            "insider_tips": [
                "The Zaidín Rock Festival in September is one of the best free music festivals in Spain.",
                "For an authentic football experience, sit in the 'Fondo Sur' section with the most passionate local fans.",
                "The Thursday and Saturday markets offer the best selection of fresh local produce at much lower prices than tourist areas."
            ]
        }
    ]
}