{
    "Spring": {
        "activities": [
            {
                "name": "Vinitaly Wine Festival",
                "type": "Food & Wine Festival",
                "description": "One of the world's largest wine exhibitions, where thousands of Italian and international producers present their wines. Includes tastings, masterclasses, and special events throughout the city.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate-High",
                "seasonal_notes": "Typically held in April. Attracts wine professionals and enthusiasts from around the world. The city becomes very busy during this period.",
                "booking_tips": "Purchase tickets well in advance online. Consider booking accommodation months ahead if visiting during the festival."
            },
            {
                "name": "Arena di Verona Museum & Roman Theatre Tour",
                "type": "Cultural/Historical",
                "description": "Explore Verona's Roman monuments without the summer crowds. The Arena and Roman Theatre offer fascinating insights into the city's ancient past with more comfortable temperatures for exploring.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers mild temperatures ideal for exploring archaeological sites. Consider visiting in April or May before summer tourist peaks.",
                "booking_tips": "Purchase a Verona Card for entry to multiple sites. Morning visits recommended for better lighting and fewer crowds."
            },
            {
                "name": "Giardino Giusti Visit",
                "type": "Garden/Outdoor Leisure",
                "description": "Explore one of Italy's finest Renaissance gardens when its flowers and cypress trees are at their most beautiful. Climb to the belvedere for panoramic views across Verona.",
                "indoor": false,
                "best_time": "Morning/Early Afternoon",
                "price_range": "Low-Moderate",
                "seasonal_notes": "Spring brings the gardens to life with blooming flowers and vibrant greenery. April and May offer the most colorful displays.",
                "booking_tips": "Purchase tickets online to avoid queues. Allow at least 1-2 hours for a proper visit."
            },
            {
                "name": "Cycling along the Adige River",
                "type": "Outdoor Activity/Leisure",
                "description": "Rent bicycles and explore Verona and its surroundings via the scenic cycling paths that follow the Adige River, perfect for enjoying the spring weather and blossoms.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Low (rental)",
                "seasonal_notes": "Spring offers comfortable temperatures and beautiful riverside scenery. The paths are less crowded than summer months.",
                "booking_tips": "Bicycle rental shops are located throughout the city center. Some hotels also offer bicycle rentals or free loaner bikes."
            },
            {
                "name": "Spring Opera Season at Teatro Filarmonico",
                "type": "Cultural/Performing Arts",
                "description": "Attend the spring opera season at Verona's elegant indoor theater, offering world-class opera productions before the summer Arena season begins.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate-High",
                "seasonal_notes": "Programming typically runs through April and May. A more intimate alternative to summer Arena performances.",
                "booking_tips": "Book tickets through the Arena di Verona official website. Dress code is smart casual to formal depending on the event."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Arena di Verona Opera Festival",
                "type": "Cultural Festival/Performing Arts",
                "description": "Experience world-class opera productions in the spectacular 2,000-year-old Roman amphitheater under the stars, featuring monumental sets, large choruses, and international opera stars.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate-Very High",
                "seasonal_notes": "Season runs from June through early September. Performances begin after sunset. Even summer evenings can become cool.",
                "booking_tips": "Book tickets months in advance for the best seats. Bring a cushion for stone seating in less expensive sections. Arrive early to enjoy the pre-performance atmosphere."
            },
            {
                "name": "Verona Shakespeare Festival",
                "type": "Cultural Festival/Theater",
                "description": "Theater festival celebrating Shakespeare, particularly his plays set in Verona. Performances take place in atmospheric locations including the Roman Theatre and historic courtyards.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Typically runs through July and early August. Open-air performances are weather-dependent.",
                "booking_tips": "Check the festival website for programs and book in advance. English subtitles or translations are sometimes available."
            },
            {
                "name": "Lake Garda Day Trip",
                "type": "Outdoor Activity/Excursion",
                "description": "Escape the summer heat with a day trip to nearby Lake Garda. Enjoy swimming, sailing, windsurfing, or simply relaxing in picturesque lakeside towns like Bardolino, Lazise, or Sirmione.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate (transport/activities)",
                "seasonal_notes": "The lake is most lively in summer, though towns can be crowded. Water activities are ideal in warm summer weather.",
                "booking_tips": "Regular buses connect Verona to various Lake Garda towns (30-60 minutes). For more flexibility, consider renting a car or joining an organized tour."
            },
            {
                "name": "Evening Aperitivo on Piazza delle Erbe",
                "type": "Food & Drink/Social",
                "description": "Join locals and visitors for the Italian tradition of pre-dinner drinks and snacks in Verona's beautiful historic piazza, watching the sunset paint the medieval buildings golden.",
                "indoor": false,
                "best_time": "Early Evening (6-8pm)",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings offer the perfect temperature for outdoor dining and drinking. Piazzas are lively until late.",
                "booking_tips": "Arrive by 6pm to secure outdoor tables at popular spots. Be aware that tables in prime positions often come with higher prices."
            },
            {
                "name": "Verona Wine Passport Tour",
                "type": "Food & Drink/Cultural",
                "description": "Purchase a Verona Wine Passport for self-guided tours of historic wine cellars and tasting rooms throughout the city, sampling local Valpolicella, Soave, and Bardolino wines.",
                "indoor": true,
                "best_time": "Afternoon/Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Available year-round but summer offers extended evening hours and special events. Air-conditioned wine cellars provide a cool escape from summer heat.",
                "booking_tips": "Purchase the passport online or at the tourist office. Includes tastings at multiple venues and can be used over several days."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Tocatì International Festival of Street Games",
                "type": "Cultural Festival",
                "description": "Unique festival celebrating traditional games and sports from around the world. The historic center transforms into a playground with demonstrations, workshops, and competitions.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Held in mid-September. The comfortable autumn weather is perfect for outdoor activities and games.",
                "booking_tips": "No booking needed for general attendance. Check the official website for special workshops that might require registration."
            },
            {
                "name": "Valpolicella Wine Harvest Tours",
                "type": "Food & Wine/Cultural",
                "description": "Visit the nearby Valpolicella wine region during harvest season to see the production process of famous wines like Amarone and Ripasso, with special harvest events and tastings.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Moderate-High",
                "seasonal_notes": "Harvest typically takes place from mid-September through October. Some vineyards allow visitors to participate in grape picking.",
                "booking_tips": "Book cellar tours and tastings in advance. Several tour companies offer transportation from Verona to multiple wineries."
            },
            {
                "name": "Autumn Cuisine Walking Tour",
                "type": "Food & Drink/Cultural",
                "description": "Join a seasonal food tour focusing on autumn specialties of Veronese cuisine, including pumpkin-filled pasta, mushroom risotto, and newly pressed olive oil.",
                "indoor": true,
                "best_time": "Lunch or Dinner hours",
                "price_range": "Moderate-High",
                "seasonal_notes": "Autumn brings special seasonal menus to Verona's restaurants featuring local harvest products.",
                "booking_tips": "Book food tours at least a few days in advance. Look for tours that include both historic information and food tastings."
            },
            {
                "name": "Verona Minor Hierusalem",
                "type": "Cultural/Historical",
                "description": "Special autumn walking itineraries connecting Verona's lesser-known churches and religious sites, with guided tours revealing the city's sacred art and architecture.",
                "indoor": true,
                "best_time": "Morning/Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Special events often coincide with religious festivals in autumn. The cooler weather makes walking tours more comfortable.",
                "booking_tips": "Book guided tours through the official website. Some churches are only open during specific hours."
            },
            {
                "name": "San Zeno Antiques Market",
                "type": "Shopping/Cultural",
                "description": "Browse the atmospheric antiques and collectibles market held in and around Piazza San Zeno on the third weekend of each month, especially charming in the autumn light.",
                "indoor": false,
                "best_time": "Morning/Early Afternoon",
                "price_range": "Free (browsing)",
                "seasonal_notes": "The September, October, and November markets often feature unique seasonal items and fewer tourists than summer markets.",
                "booking_tips": "No booking needed. Arrive early for the best selection. Haggling is expected but should be respectful."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Verona Christmas Markets",
                "type": "Shopping/Festival",
                "description": "Experience the magic of German-style Christmas markets in Piazza dei Signori and surrounding streets, featuring handcrafted gifts, decorations, and seasonal food and drink.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Free (to browse)",
                "seasonal_notes": "Markets typically run from mid-November through December 24th. Most atmospheric in the evening when lights are on.",
                "booking_tips": "No booking required. Visit on weekdays to avoid weekend crowds. Try traditional vin brulé (mulled wine) and local Christmas sweets."
            },
            {
                "name": "International Nativity Scene Exhibition",
                "type": "Cultural/Religious",
                "description": "Visit the Arena di Verona for the magnificent annual display of nativity scenes from around the world, housed in the ancient Roman amphitheater.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Low",
                "seasonal_notes": "Runs from late November through January. The Arena interior is partially covered during this period.",
                "booking_tips": "Standard entrance tickets available at the door or online. Combined tickets with other city attractions offer good value."
            },
            {
                "name": "Winter Opera and Symphony Season",
                "type": "Cultural/Performing Arts",
                "description": "Attend opera performances, classical concerts, and ballet at the elegant Teatro Filarmonico during the winter season by the Fondazione Arena di Verona.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate-High",
                "seasonal_notes": "Season typically runs from December through April, offering a warm cultural experience during colder months.",
                "booking_tips": "Book tickets through the Arena di Verona Foundation website. Dress code is smart casual to formal depending on the performance."
            },
            {
                "name": "Lessinia Mountain Snow Excursions",
                "type": "Outdoor Activity/Nature",
                "description": "Take a day trip to the nearby Lessinia mountains for winter activities including snowshoeing, cross-country skiing, and traditional mountain cuisine.",
                "indoor": false,
                "best_time": "Morning/Early Afternoon",
                "price_range": "Moderate (transport/equipment)",
                "seasonal_notes": "Reliable snow typically from December through March. Weekday visits recommended to avoid weekend crowds from Verona.",
                "booking_tips": "Equipment rental available on-site. Several tour companies offer transportation from Verona with guides."
            },
            {
                "name": "New Year's Concert in Piazza Bra",
                "type": "Cultural/Entertainment",
                "description": "Join locals and visitors for the traditional New Year's Eve celebration in Piazza Bra, featuring live music, countdown, and midnight fireworks near the Arena.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "December 31st. Bundle up warmly as temperatures are typically cold. Event sometimes continues with DJ sets after midnight.",
                "booking_tips": "No booking required for the public celebration. Nearby restaurants offering New Year's dinners require advance reservation, often months ahead."
            },
            {
                "name": "Verona in Love",
                "type": "Festival/Romantic",
                "description": "Celebrate Valentine's Day in the city of Romeo and Juliet with this annual festival featuring romantic-themed events, special menus, concerts, and illuminations throughout the historic center.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free (most events)",
                "seasonal_notes": "Held during the week of Valentine's Day (February 14th). Special romantic packages offered by many hotels.",
                "booking_tips": "Book romantic dinners well in advance. Check the festival program for special concerts or events that may require tickets."
            }
        ]
    }
} 