{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Spring Arrival & Waterfalls",
                "details": "Witness Bergen emerging from winter. Increased daylight brightens the city, snow melts on lower mountains, and waterfalls gain strength from melting snow. Early flowers appear."
            },
            {
                "reason": "Bryggen & Outdoor Cafes",
                "details": "Enjoy the first opportunities for outdoor coffee or drinks along the historic Bryggen wharf and at cafes in the city center as they set up outdoor seating, often with blankets available."
            },
            {
                "reason": "Shoulder Season Access & Value",
                "details": "Explore Bergen's attractions like Bryggen, KODE Art Museums, and the Fish Market with fewer tourists than peak summer. Accommodation prices might be lower (outside of Easter)."
            },
            {
                "reason": "Fløibanen & Mountain Views",
                "details": "Take the Fløibanen funicular up Mount Fløyen for panoramic city views. Lower hiking trails begin to clear, offering fresh air and potentially dramatic, misty fjord views (check trail conditions)."
            },
            {
                "reason": "Fjord Cruise Season Starts (Limited)",
                "details": "Some fjord tour operators may begin offering limited sightseeing cruises towards the end of April, providing early access to the stunning surrounding landscapes."
            },
            {
                "reason": "Easter Holiday Atmosphere (if applicable)",
                "details": "If Easter falls in April, experience Norwegian traditions. Be mindful of closures as many locals travel ('påskeferie')."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Very High Chance of Rain & Wind",
                "details": "April in Bergen lives up to its rainy reputation. Expect frequent rain showers, often heavy, and potentially strong winds. Waterproof gear is absolutely essential."
            },
            {
                "reason": "Cool and Damp Temperatures",
                "details": "Average temperatures remain cool (highs ~9°C/48°F, lows ~3°C/37°F) and the dampness can make it feel colder. Pack warm, waterproof layers."
            },
            {
                "reason": "Easter Holiday Closures & Crowds (if applicable)",
                "details": "Public holidays (Good Friday, Easter Sunday/Monday) mean widespread closures (shops, Vinmonopolet). Transport runs, but attractions may have reduced hours. Busy transport pre/post holiday."
            },
            {
                "reason": "Wet & Muddy Mountain Trails",
                "details": "While lower trails on Fløyen or Ulriken might open, expect them to be very wet, muddy, and potentially slippery. Higher trails likely still have significant snow/ice. Proper waterproof hiking boots are crucial."
            },
            {
                "reason": "Limited Fjord Cruise Schedules",
                "details": "Fjord cruises are just starting; options and frequency will be limited compared to summer. The water is extremely cold."
            },
            {
                "reason": "Pollen Season Starts",
                "details": "Birch and other tree pollens begin, potentially impacting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "8°C (46°F)",
                    "low": "2°C (36°F)"
                },
                "precipitation": "High likelihood of rain, often persistent. Can vary with cloud, occasional sun, and even sleet. Nights are cold, near freezing.",
                "general_tips": "Essential packing: excellent waterproof rain jacket with hood, waterproof trousers, waterproof footwear (boots recommended), umbrella, warm layers (fleece, wool), hat, gloves."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. Generally quiet, but Easter (if it falls here) increases activity, especially around Bryggen and Fløibanen.",
                "pricing": "Shoulder season rates often apply, but significant price increases for accommodation if Easter occurs.",
                "overall_atmosphere": "Quiet transition month. City feels damp but scenic with increasing daylight. Focus on indoor museums, Bryggen, and lower mountain walks on dry spells."
            },
            "events_holidays": [
                {
                    "name": "Easter Weekend (Påske)",
                    "date": "Varies (can fall in early/mid-April)",
                    "description": "Major holiday period (Maundy Thursday, Good Friday, Easter Sunday, Easter Monday). Many Norwegians travel.",
                    "notes": "Extensive closures of shops (including groceries on some days) and Vinmonopolet. Check museum/attraction opening times. Transport operates, often on Sunday schedules."
                },
                 {
                    "name": "Outdoor Dining Tentatively Starts",
                    "date": "From April 1st (weather dependent)",
                    "description": "Cafes attempt outdoor seating ('uteservering'), especially along Bryggen and Torgallmenningen, but usage is highly dependent on rain.",
                    "notes": "Look for places with heaters and covered areas."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Bryggen Wharf (UNESCO)",
                    "where": "Bryggen",
                    "description": "Wander through the narrow alleyways of the historic Hanseatic wharf, exploring shops, galleries, and soaking in the atmosphere.",
                    "practical_tips": "Wear good shoes for cobblestones. Explore the back alleys. Visit the Hanseatic Museum (check if open after fire/renovations) or Bryggens Museum.",
                    "best_time": "Daytime, any day (less crowded early).",
                    "estimated_cost": "Free (to wander), Museum entry fees apply.",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit KODE Art Museums",
                    "where": "City Center (around Lille Lungegårdsvannet)",
                    "description": "Explore the extensive collections of art, craft, design, and music spread across several buildings, including works by Edvard Munch.",
                    "practical_tips": "Purchase a pass for multiple museums. Excellent indoor option for rainy days. Allow significant time.",
                    "best_time": "Anytime during opening hours.",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Take the Fløibanen Funicular",
                    "where": "Departs from City Center",
                    "description": "Ride the funicular up Mount Fløyen for stunning (though potentially misty or rainy) views over Bergen and the surrounding fjords and islands.",
                    "practical_tips": "Check the weather forecast for visibility. Can get busy, especially around Easter. Lower trails from the top might be walkable but expect mud.",
                    "best_time": "Daytime, clearer moments.",
                    "estimated_cost": "Moderate (round trip ticket)",
                    "weather_dependent": true
                },
                {
                    "activity": "Wander through Nordnes Peninsula",
                    "where": "Nordnes",
                    "description": "Explore the charming residential area with its traditional wooden houses, narrow streets, and the Bergen Aquarium at its tip.",
                    "practical_tips": "Offers nice harbour views. Relatively flat walking compared to the mountains.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Free (to wander), Aquarium entry fee applies.",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "10°C (50°F)",
                    "low": "4°C (39°F)"
                },
                "precipitation": "Still very likely to rain frequently, but potential for slightly longer dry or sunny spells increases. Snow highly unlikely in the city.",
                "general_tips": "Continue with full waterproof gear. Layers remain key as temperatures fluctuate. Enjoy any sunshine!"
            },
            "tourism_level": {
                "crowds": "Moderate. Gradually increasing as spring progresses, but still manageable.",
                "pricing": "Shoulder season rates generally stable.",
                "overall_atmosphere": "Spring becomes more evident, with greener landscapes (when visible through rain!). Longer daylight encourages exploration between showers."
            },
            "events_holidays": [
                 {
                    "name": "Start of Fjord Cruise Season (Limited)",
                    "date": "Late April (check operators)",
                    "description": "Some fjord sightseeing tours (e.g., towards Mostraumen) might begin operating on limited schedules.",
                    "notes": "Book in advance if available. Check specific operators (like Rødne Fjord Cruise). Prepare for cold/windy conditions on the water."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit the Fish Market (Fisketorget)",
                    "where": "City Center Harbour",
                    "description": "Experience the lively (though perhaps less bustling than summer) fish market. See local seafood, and sample some at the adjacent food stalls (some may be seasonal).",
                    "practical_tips": "Indoor section offers shelter. Prices can be high; compare before buying.",
                    "best_time": "Late morning/lunchtime.",
                    "estimated_cost": "Free (to browse), Moderate-High (to eat)",
                    "weather_dependent": false
                },
                {
                    "activity": "Take the Ulriken Cable Car (Ulriksbanen)",
                    "where": "Departs from near Haukeland Hospital (bus access)",
                    "description": "Ascend Bergen's highest mountain for potentially spectacular (or cloud-obscured) views. Higher altitude means cooler temps and higher chance of snow patches remaining.",
                    "practical_tips": "Check if operating (seasonal start). Trails at the top will likely be very wet, muddy, or snowy. Restaurant at the top.",
                    "best_time": "Clear day for views.",
                    "estimated_cost": "Moderate-High (round trip ticket)",
                    "weather_dependent": true
                },
                 {
                     "activity": "Explore the Leprosy Museum (Lepramuseet)",
                     "where": "City Center",
                     "description": "Visit St. George's Hospital, one of Europe's best-preserved leprosy hospitals, offering a unique insight into medical history.",
                     "practical_tips": "Check opening hours (may be limited in April). A sobering but fascinating indoor experience.",
                     "best_time": "During opening hours.",
                     "estimated_cost": "Moderate (entry fee)",
                     "weather_dependent": false
                 },
                {
                    "activity": "Walk around Lille Lungegårdsvannet",
                    "where": "City Center",
                    "description": "Take a gentle stroll around the central lake, surrounded by KODE museums and city buildings. See the fountain and enjoy a central green space.",
                    "practical_tips": "Flat, easy walk. Good for a quick break between museum visits.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}