{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Deep Low Season & Cozy 'Kos'",
                "details": "Experience Bergen at its quietest. Enjoy minimal crowds at KODE museums and other attractions, potentially the lowest prices for flights/hotels, and fully embrace indoor Norwegian 'kos' in warm, candlelit cafes away from the winter weather."
            },
            {
                "reason": "Dramatic Winter Scenery (Potential Snow on Mountains)",
                "details": "While snow in the city is unreliable (rain/sleet more likely), the surrounding mountains (Fløyen, Ulriken) are often snow-capped, offering dramatic views on clear days. Capture moody photos of Bryggen and the fjord."
            },
            {
                "reason": "Excellent Indoor Museums",
                "details": "Ideal conditions to delve into Bergen's cultural offerings like the KODE Art Museums, the Hanseatic Museum (check status), Bryggens Museum, and the Aquarium with virtually no queues."
            },
            {
                "reason": "Storm Watching Potential",
                "details": "February can bring powerful winter storms off the North Sea. Witnessing the dramatic weather from a safe, cozy spot indoors can be a unique experience."
            },
            {
                "reason": "Authentic Local Atmosphere",
                "details": "See Bergen without the summer tourist crowds. Observe local life, enjoy less busy cafes and restaurants, and experience a more authentic side of the city."
            },
            {
                "reason": "Early Signs of Lengthening Days",
                "details": "While still short, daylight hours noticeably increase throughout February compared to Dec/Jan, offering slightly more time for exploration during the day."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cold, Wet, and Windy Weather",
                "details": "February is typically cold, very wet (frequent rain, sleet, wet snow), and can be extremely windy in Bergen. Unpredictable and often unpleasant for extended outdoor activity."
            },
            {
                "reason": "Requires Excellent Waterproof Gear",
                "details": "Top-quality waterproof and windproof outerwear (jacket, trousers, boots) is non-negotiable. Thermal layers, hat, gloves, scarf are essential. Emphasis on WATERPROOF."
            },
            {
                "reason": "Very High Chance of Rain/Sleet",
                "details": "Bergen's winter precipitation is more often rain or sleet than picturesque snow in the city itself, leading to damp and slushy conditions."
            },
            {
                "reason": "Icy & Slippery Conditions",
                "details": "Frequent freeze-thaw cycles combined with precipitation make sidewalks, cobblestones (especially on Bryggen), and trails extremely icy and hazardous. Good grip footwear or ice grips ('brodder') vital."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "Daylight increases from ~8 to ~10 hours, but it's still limited for extensive outdoor exploration, especially mountain hikes."
            },
            {
                "reason": "Very Limited Fjord Tours & Mountain Access Issues",
                "details": "Fjord tour operators run very few, if any, trips. Mountain trails on Fløyen/Ulriken will be wet, muddy, icy, snowy, and potentially dangerous. Check funicular/cable car status and trail conditions VERY carefully."
            },
            {
                "reason": "Indoor Focus is Necessary",
                "details": "Due to weather, most of your time will likely be spent indoors exploring museums, galleries, cafes, and restaurants."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "3°C (37°F)",
                    "low": "-1°C (30°F)"
                },
                "precipitation": "High probability of precipitation, mostly as rain or sleet at sea level, potential snow higher up. Often windy and overcast. Frequent icy patches.",
                "general_tips": "Full waterproofs essential (head to toe). Warm layers underneath. Sturdy, waterproof boots with excellent grip are paramount. Consider bringing 'brodder' (ice grips). Umbrella often useful but can be difficult in wind."
            },
            "tourism_level": {
                "crowds": "Very low. Expect museums and attractions to be quiet. One of the least busy times of year.",
                "pricing": "Often the cheapest month for flights and accommodation.",
                "overall_atmosphere": "Quiet, cold, wet. Perfect for deep dives into museums and enjoying cozy indoor spaces. City feels subdued."
            },
            "events_holidays": [
                {
                    "name": "Valentine's Day (Valentinsdagen)",
                    "date": "February 14",
                    "description": "Not a public holiday, but some restaurants might offer special menus (booking advised).",
                    "notes": "Minimal impact on general tourism."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore KODE Art Museums",
                    "where": "Around Lille Lungegårdsvann lake",
                    "description": "Dedicate significant time to exploring the four KODE buildings housing vast collections of art, design, and music, practically having the galleries to yourself.",
                    "practical_tips": "Purchase a multi-day pass. An ideal way to spend a cold, wet day (or several).",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Cozy Cafe Hopping ('Kos')",
                    "where": "Various neighborhoods (e.g., City Center, Skostredet, Møhlenpris)",
                    "description": "Embrace the Norwegian concept of 'kos' by spending time in warm, candlelit cafes with coffee, hot chocolate, and pastries ('skillingsboller').",
                    "practical_tips": "Look for cafes with comfortable seating and a relaxed atmosphere. Great way to escape the weather.",
                    "best_time": "Anytime, especially during bad weather",
                    "estimated_cost": "Low-Moderate (per cafe stop)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk along Bryggen (Carefully!)",
                    "where": "Bryggen Wharf",
                    "description": "Experience the iconic wharf without the crowds, observing the historic architecture. Be extremely cautious of icy cobblestones.",
                    "practical_tips": "Wear boots with the best possible grip or use ice grips. Explore the narrow alleyways. Visit Bryggens Museum nearby for indoor context.",
                    "best_time": "Daylight hours (short window)",
                    "estimated_cost": "Free (walking), Moderate (museum entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Hanseatic Museum (Check Status)",
                    "where": "Finnegården, Bryggen (check temporary location/status due to restoration)",
                    "description": "Learn about the life of Hanseatic merchants who lived and worked on Bryggen. Offers insight into the area's history.",
                    "practical_tips": "Verify opening times and location, as the main building is under long-term restoration. Check the Schøtstuene assembly rooms as well.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "4°C (39°F)",
                    "low": "0°C (32°F)"
                },
                "precipitation": "Conditions remain similar: cold, wet, windy, with frequent rain/sleet. Daylight hours gradually increase towards 10+ hours by month end.",
                "general_tips": "Waterproofs and warm layers remain essential. Slightly more daylight might allow brief outdoor exploration between showers."
            },
            "tourism_level": {
                "crowds": "Still very low. Potential for slightly more local families at indoor attractions (like the Aquarium) if coinciding with Bergen's 'Vinterferie' (winter school break, often Week 9).",
                "pricing": "Remains low season pricing.",
                "overall_atmosphere": "Deep winter persists. Focus remains on indoor activities and enjoying the relative quiet of the city."
            },
            "events_holidays": [
                {
                    "name": "Bergen 'Vinterferie' (Winter School Break - Potential Timing)",
                    "date": "One week, often Week 9 (late Feb/early Mar)",
                    "description": "Local schools have their winter break. Expect more families at the Aquarium, VilVite Science Centre, and potentially Fløibanen.",
                    "notes": "Impact generally limited to family-focused venues."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Bergen Aquarium (Akvariet i Bergen)",
                    "where": "Nordnes Peninsula",
                    "description": "Spend a few hours exploring marine life from Norwegian coasts and elsewhere, including penguins, seals, and fish. Excellent indoor activity.",
                    "practical_tips": "Check feeding times and shows. Can be reached by walking or bus. Quieter than during peak season.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Fløibanen Funicular Ride (Check Conditions First)",
                    "where": "Departs from city center",
                    "description": "Ride the funicular up Mount Fløyen for potential views (if weather clears). The cafe/restaurant at the top offers a warm refuge.",
                    "practical_tips": "Check webcam/weather report for visibility *before* buying ticket. Trails at the top will be very wet/icy/snowy and potentially unsafe; stick to cleared areas near the station.",
                    "best_time": "Clearest part of the day (check forecast)",
                    "estimated_cost": "Moderate (funicular ticket)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Local Craft & Design Shops",
                    "where": "City Center, Skostredet, Bryggen area",
                    "description": "Browse shops selling Norwegian knitwear, ceramics, glassware, and unique local designs. Good souvenirs and indoor browsing.",
                    "practical_tips": "Look for specialist shops beyond the main tourist traps. Skostredet offers interesting independent boutiques.",
                    "best_time": "During shop opening hours",
                    "estimated_cost": "Free (browsing), Variable (purchases)",
                    "weather_dependent": false
                },
                {
                    "activity": "Warm Up with Fish Soup",
                    "where": "Various restaurants, Fish Market (indoor section)",
                    "description": "Try Bergen's famous creamy fish soup ('fiskesuppe') – a perfect way to warm up on a cold, wet day.",
                    "practical_tips": "Many cafes and restaurants offer their version. Søstrene Hagelin is a classic takeaway option. Check Fish Market indoor stall availability.",
                    "best_time": "Lunchtime or early dinner",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                }
            ]
        }
    }
}