{
    "July": {
        "reasons_to_visit": [
            {
                "reason": "Potentially Best Weather & Longest Days",
                "details": "July statistically offers Bergen's warmest temperatures (avg highs ~19°C/66°F) and maximum daylight (almost 19 hours), ideal for fjord cruises, hiking, and enjoying the outdoors – if the rain holds off."
            },
            {
                "reason": "Peak Fjord Cruise Season",
                "details": "The absolute best month for fjord cruises. Daily departures and the widest range of tours available to explore nearby fjords like Osterfjorden or longer trips like Norway in a Nutshell."
            },
            {
                "reason": "Prime Hiking Conditions (Usually)",
                "details": "Mountain trails on Fløyen and Ulriken are typically at their driest and most accessible. Long daylight allows for extended hikes with potentially spectacular panoramic views."
            },
            {
                "reason": "Vibrant City Life & Outdoor Seating",
                "details": "Experience Bergen at its liveliest. Bryggen, the Fish Market, and Torgallmenningen square buzz with activity. Enjoy bustling outdoor cafes and restaurants ('uteservering')."
            },
            {
                "reason": "Festival Atmosphere (Check Listings)",
                "details": "While Bergen doesn't have one single massive July festival like Oslo, various smaller festivals, concerts (e.g., Tall Ships Races some years), and outdoor events often occur. Check Visit Bergen listings."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Absolute Peak Tourist Crowds",
                "details": "July is the busiest month by far. Expect maximum crowds everywhere: Bryggen, Fløibanen, Ulriksbanen, Fish Market, fjord tours, popular restaurants, and transport."
            },
            {
                "reason": "Highest Prices of the Year",
                "details": "Accommodation, flights, and popular tours (especially fjord cruises) reach their peak prices. Booking months in advance is absolutely essential."
            },
            {
                "reason": "Rain is Still Very Likely",
                "details": "Despite being the 'best' month, July in Bergen still sees significant rainfall. Be prepared for showers or overcast days disrupting outdoor plans. Always pack waterproofs."
            },
            {
                "reason": "Booking Everything is Crucial",
                "details": "Accommodation, fjord tours (especially popular ones like Mostraumen or Norway in a Nutshell components), specific restaurants, and even funicular/cable car tickets should be booked far ahead."
            },
            {
                "reason": "Busy Hiking Trails",
                "details": "Popular trails on Fløyen and Ulriken can become very crowded, especially on sunny days and during peak Norwegian vacation weeks ('fellesferie')."
            }
        ],
        "first_half": {
            "date_range": "July 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "12°C (54°F)"
                },
                "precipitation": "Moderate to high chance of rain showers, but often interspersed with warmer, sunnier periods. Can be humid. Very long daylight hours (sunset around 11 PM).",
                "general_tips": "Pack layers: T-shirts, shorts for sunny days, but also a fleece/sweater and a reliable waterproof jacket and comfortable walking shoes. Sunglasses/sunscreen for good days."
            },
            "tourism_level": {
                "crowds": "Extreme peak season. Bryggen, Fløibanen, and fjord tour departures will be packed. Expect queues for popular attractions and transport.",
                "pricing": "Highest prices across the board. Book everything months in advance.",
                "overall_atmosphere": "High summer energy. City is buzzing with international tourists and Norwegians starting their holidays ('fellesferie'). Lively outdoor dining scene."
            },
            "events_holidays": [
                 {
                    "name": "Peak Fjord Cruise Season",
                    "date": "Throughout July",
                    "description": "Maximum number of daily departures for various fjord tours from Bergen harbour.",
                    "notes": "Essential to book popular tours well in advance (e.g., Rødne, Norled, Fjord Tours)."
                 },
                {
                    "name": "Ongoing Summer Events/Concerts",
                    "date": "Throughout July",
                    "description": "Check Visit Bergen or local newspapers (BT, BA) for outdoor concerts, markets, or specific events happening during your visit.",
                    "notes": "The Tall Ships Races sometimes visit Bergen in July - check yearly schedules."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Take a Fjord Cruise",
                    "where": "Departing from Bergen Harbour (various piers)",
                    "description": "Essential Bergen experience. Choose from various tours, like the popular Mostraumen cruise (half-day) or longer options exploring parts of Sognefjord or Hardangerfjord (often part of larger tours).",
                    "practical_tips": "Book well in advance! Dress in layers including wind/waterproof jacket even if sunny in Bergen, it's colder on the water. Sit outside for best views if possible.",
                    "best_time": "Check specific tour schedules (multiple daily departures likely)",
                    "estimated_cost": "High",
                    "weather_dependent": true
                },
                {
                    "activity": "Hike on Mount Fløyen",
                    "where": "Accessed via Fløibanen funicular or paths from city",
                    "description": "Take the funicular up for panoramic views, then explore well-marked trails. Walk to Skomakerdiket lake, Brushytten cabin, or further towards Blåmanen.",
                    "practical_tips": "Funicular queues can be very long; book online or consider hiking up/down (steep). Wear good walking shoes (trails can still be damp). Bring water. Can get crowded.",
                    "best_time": "Daytime or long summer evenings",
                    "estimated_cost": "Moderate (funicular) or Free (hiking up)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Bryggen & Fish Market",
                    "where": "Bergen Harbour",
                    "description": "Wander the historic Hanseatic Wharf (UNESCO site), explore the narrow alleyways, then experience the lively (and touristy) Fish Market (Fisketorget).",
                    "practical_tips": "Bryggen is best explored early morning or later evening to avoid worst crowds. Fish Market is great for photos but can be expensive to eat at; compare prices. Beware of seagulls.",
                    "best_time": "Fish Market liveliest daytime; Bryggen atmospheric anytime.",
                    "estimated_cost": "Free (walking), Moderate to Very High (eating at Fish Market)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit KODE Art Museums",
                    "where": "Around Lille Lungegårdsvann lake",
                    "description": "Escape potential rain or crowds by exploring Bergen's extensive art collections spread across four buildings, including works by Munch, Dahl, Astrup, and international artists.",
                    "practical_tips": "A pass covers entry to all open KODE buildings over two days. Allow significant time. Good option if weather turns bad.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "July 16–31",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "12°C (54°F)"
                },
                "precipitation": "Similar conditions: warm spells possible, but high chance of rain showers persists. Daylight starts to slowly decrease from its peak but still very long.",
                "general_tips": "Continue with layered clothing and always have waterproofs accessible. Comfortable shoes essential for walking."
            },
            "tourism_level": {
                "crowds": "Remains at absolute peak. Height of Norwegian 'fellesferie' (common vacation weeks) means many Norwegian tourists in addition to international visitors.",
                "pricing": "Stays at the highest level. Last-minute options virtually non-existent for popular things.",
                "overall_atmosphere": "Peak summer holiday vibe. City is very busy, especially waterfront and mountain access points. Vibrant but potentially overwhelming crowds."
            },
            "events_holidays": [
                 {
                    "name": "Fjordsteam (Occasional Event)",
                    "date": "Sometimes held late July/early August (check yearly)",
                    "description": "Festival celebrating traditional boats and coastal culture, often featuring veteran ships in the harbour.",
                    "notes": "Check Visit Bergen for specific dates if occurring."
                 },
                  {
                    "name": "Ongoing Summer Events",
                    "date": "Throughout July",
                    "description": "Continue checking local listings for concerts, markets, or special summer programming at venues like USF Verftet.",
                    "notes": "Activities are ongoing throughout the peak month."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Hike Mount Ulriken & Vidden Trail (Experienced Hikers)",
                    "where": "Accessed via Ulriksbanen cable car",
                    "description": "Take the cable car up Bergen's highest city mountain for stunning views. Experienced hikers can tackle the challenging Vidden trail across the plateau to Fløyen (approx. 5-6 hours).",
                    "practical_tips": "Check cable car status and weather forecast *carefully*. Vidden requires proper hiking boots, map/GPS, layers, food/water - it's a proper mountain hike. For casual visitors, enjoy views from the top station.",
                    "best_time": "Daytime on a clear, dry day",
                    "estimated_cost": "Moderate-High (cable car), plus bus fare",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Nordnes Peninsula & Aquarium",
                    "where": "Nordnes district",
                    "description": "Take a pleasant walk through the charming residential streets with wooden houses out to Nordnes Park and the Bergen Aquarium.",
                    "practical_tips": "Offers nice harbour views and a slightly quieter atmosphere than the absolute center. Aquarium is a good indoor option if it rains.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking), Moderate-High (Aquarium entry)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Day Trip via Express Boat (e.g., to Rosendal)",
                    "where": "Departing from Strandkai Terminal",
                    "description": "Take an express passenger boat south through the archipelago and fjords. A trip to Rosendal offers stunning Hardangerfjord scenery and the Barony Rosendal manor house.",
                    "practical_tips": "Check timetables and book tickets via operators like Norled or Skyss. Requires a full day. Pack for changing weather.",
                    "best_time": "Check boat schedules (book ahead)",
                    "estimated_cost": "High (boat tickets + expenses)",
                    "weather_dependent": true
                 },
                  {
                    "activity": "Enjoy Outdoor Dining/Drinks",
                    "where": "Bryggen, Zachariasbryggen, Skostredet, Engen",
                    "description": "Make the most of long evenings (and hope for dry weather) by enjoying food or drinks at outdoor seating areas ('uteservering') across the city center.",
                    "practical_tips": "Popular spots get very busy. Some places have heaters/blankets for cooler evenings. Zachariasbryggen offers harbour views.",
                    "best_time": "Late Afternoon / Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                 }
            ]
        }
    }
}