{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Temperatures & Lush Greenery",
                "details": "June often brings milder temperatures (avg highs ~16°C/61°F) and Bergen's surrounding mountains are vibrantly green. Ideal for hiking and enjoying the relatively long daylight hours."
            },
            {
                "reason": "Longest Daylight Hours (Solstice)",
                "details": "Experience near 24-hour daylight around the summer solstice (June 21st), allowing maximum time for fjord cruises, mountain hikes (like Fløyen or Ulriken), and exploring Bryggen."
            },
            {
                "reason": "Bergen International Festival (Festspillene)",
                "details": "If your visit overlaps late May/early June, experience Festspillene, a major international festival of music, theatre, dance, and visual arts held throughout the city."
            },
            {
                "reason": "Nattjazz Festival",
                "details": "Often running into early June, Nattjazz is a prominent jazz festival featuring Norwegian and international artists at USF Verftet."
            },
            {
                "reason": "Fjord Cruise Season Ramping Up",
                "details": "More fjord tour options become available with increased frequency compared to spring, offering fantastic opportunities to see the dramatic scenery near Bergen."
            },
            {
                "reason": "Ideal Hiking Conditions Emerging",
                "details": "Mountain trails become more accessible as snow melts higher up (though higher trails can still be wet/muddy). Perfect time for hikes like Fløyen or starting longer treks like Vidden (check conditions)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "High Chance of Rain",
                "details": "June is still very much within Bergen's rainy season. Expect frequent rain showers, sometimes heavy, that can impact outdoor plans. Waterproof gear is essential."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "June marks the start of the main tourist season. Crowds increase significantly, especially around Bryggen, Fløibanen, and popular fjord tours. Prices for flights/accommodation rise."
            },
            {
                "reason": "Festival Impact (Festspillene/Nattjazz)",
                "details": "If visiting during major festivals (late May/early June), expect higher demand and prices for accommodation, and potentially busy specific venues."
            },
            {
                "reason": "Booking Ahead Necessary",
                "details": "Accommodation, popular fjord tours (e.g., Mostraumen), festival tickets, and sought-after restaurants should be booked in advance."
            },
            {
                "reason": "Variable Mountain Conditions",
                "details": "While hiking improves, higher elevation trails (like parts of Vidden) can still have snow patches, mud, and require proper gear and caution. Always check recent conditions."
            },
            {
                "reason": "Sankthansaften (Midsummer Eve) is Low-Key",
                "details": "Midsummer Eve (June 23rd) is marked privately. Don't expect large public bonfires or events directly in the city center (sometimes smaller local ones outside). Not a public holiday."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C (61°F)",
                    "low": "9°C (48°F)"
                },
                "precipitation": "High likelihood of rain showers, but also potential for pleasant sunny spells. Temperatures are mild but variable. Long daylight hours.",
                "general_tips": "Pack layers: T-shirts, long sleeves, fleece/sweater, good waterproof jacket. Comfortable waterproof walking shoes are crucial. Sunglasses needed for sunny days."
            },
            "tourism_level": {
                "crowds": "High season begins. Busy, especially if Festspillene or Nattjazz are ongoing. Bryggen, Fløibanen will see significant visitor numbers.",
                "pricing": "High season pricing applies. Book accommodation and popular tours early, especially during festivals.",
                "overall_atmosphere": "Vibrant start to summer. City is green and lively. Potential festival buzz. Focus on hiking, fjord tours, and enjoying outdoor cafes between showers."
            },
            "events_holidays": [
                {
                    "name": "Bergen International Festival (Festspillene i Bergen)",
                    "date": "Usually ends early June (check exact dates)",
                    "description": "Major arts festival concluding its run. Features music, theatre, dance across various city venues.",
                    "notes": "Requires tickets for most events, book far in advance. High demand for accommodation during this period."
                },
                {
                    "name": "Nattjazz Festival",
                    "date": "Often runs into early June (check exact dates)",
                    "description": "Prominent jazz festival held primarily at the USF Verftet venue.",
                    "notes": "Requires tickets. Check festival program."
                },
                {
                    "name": "Pentecost / Whit Monday (Pinse - 'Andre pinsedag') (If applicable)",
                    "date": "Variable date in late May or early June",
                    "description": "Public holiday. Check specific dates yearly. Sunday schedules for public transport, some shop closures possible. Museums often open.",
                    "notes": "Minor impact generally, but check opening times if visiting on Whit Monday."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend a Festspillene or Nattjazz Event (if timing aligns)",
                    "where": "Various venues (Grieghallen, Den Nationale Scene, USF Verftet, churches etc.)",
                    "description": "Experience high-quality international or Norwegian performances during these renowned festivals.",
                    "practical_tips": "Check festival programs and book tickets WELL in advance. Adds a significant cultural dimension to a visit.",
                    "best_time": "During festival dates (late May/early June typically)",
                    "estimated_cost": "Moderate to Very High (depending on event)",
                    "weather_dependent": false
                },
                {
                    "activity": "Hike Mount Fløyen Trails",
                    "where": "Accessed via Fløibanen funicular or paths from city",
                    "description": "Enjoy improving trail conditions. Take the funicular up for views, then hike well-marked paths through lush forest, perhaps to Skomakerdiket lake or Brushytten cabin.",
                    "practical_tips": "Wear sturdy, waterproof footwear (trails can be muddy). Bring layers. Funicular can be busy; book online or hike up/down.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (funicular) or Free (hiking up)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Bryggen Wharf",
                    "where": "Bergen Harbour",
                    "description": "Wander the iconic UNESCO-listed wooden alleyways as summer season begins. Explore the small shops and galleries housed within.",
                    "practical_tips": "Getting busier; visit early or late to avoid peak crowds. Wear comfortable shoes. Visit Hanseatic Museum (check status) or Bryggens Museum for context.",
                    "best_time": "Anytime",
                    "estimated_cost": "Free (walking), Moderate (museums)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Take an Early Season Fjord Cruise (e.g., Mostraumen)",
                    "where": "Departing from Bergen Harbour",
                    "description": "Enjoy a scenic fjord cruise as schedules increase. The popular Mostraumen tour navigates narrow straits and passes waterfalls.",
                    "practical_tips": "Book tickets in advance. Dress warmly with waterproofs, as it's colder on the water. Check operators like Rødne.",
                    "best_time": "Check schedules (multiple departures likely)",
                    "estimated_cost": "High",
                    "weather_dependent": true
                 }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "17°C (63°F)",
                    "low": "10°C (50°F)"
                },
                "precipitation": "Still a high chance of rain, but potentially more frequent and longer sunny spells. Longest daylight hours around the solstice (June 21st).",
                "general_tips": "Layers and reliable waterproofs remain essential. Be prepared for both sun and showers within the same day."
            },
            "tourism_level": {
                "crowds": "High season continues to build towards July peak. Very busy at main attractions, especially on weekends.",
                "pricing": "Peak season prices apply. Book everything well ahead.",
                "overall_atmosphere": "Bright, long days (max daylight around June 21st). Lively city atmosphere. Ideal for maximizing outdoor time between rain showers."
            },
            "events_holidays": [
                {
                    "name": "Summer Solstice / Sankthansaften",
                    "date": "Around June 21st / Eve is June 23rd",
                    "description": "Longest day of the year around the 21st. Midsummer Eve (23rd) is marked privately, not a major public event in Bergen city itself.",
                    "notes": "Enjoy the extremely long daylight. Don't expect large public bonfires in central Bergen."
                },
                {
                    "name": "Bergen Pride (Potential Timing)",
                    "date": "Check yearly dates (sometimes June, sometimes later)",
                    "description": "Bergen also hosts its own Pride week and parade, though dates vary more than Oslo's. Check local listings.",
                    "notes": "If coinciding with your visit, expect related events and a parade, impacting accommodation slightly."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Hike Mount Ulriken or start the Vidden Trail",
                    "where": "Accessed via Ulriksbanen cable car",
                    "description": "Take the cable car for stunning views. Casual hikers can explore near the top station. Experienced, prepared hikers might start the Vidden trail towards Fløyen (check conditions very carefully).",
                    "practical_tips": "Check cable car status & weather. Vidden requires full hiking gear, map, supplies & awareness of potential snow/mud even in June. Not a casual walk.",
                    "best_time": "Daytime on a clear day",
                    "estimated_cost": "Moderate-High (cable car + bus)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore KODE Art Museums",
                    "where": "Around Lille Lungegårdsvann lake",
                    "description": "A great option for rainy days. Explore the diverse art collections across the four museum buildings.",
                    "practical_tips": "A multi-day pass is cost-effective. Allow ample time.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Enjoy the Long Daylight Evenings",
                    "where": "Bryggen, city viewpoints, outdoor cafes",
                    "description": "Take advantage of the incredibly long days around the solstice. Have a late dinner outdoors (weather permitting), enjoy views from Fløyen, or simply stroll as dusk takes hours to arrive.",
                    "practical_tips": "Bring layers as it still cools down eventually. Enjoy the unique light.",
                    "best_time": "Evening (light until ~11 PM)",
                    "estimated_cost": "Free to Moderate/High",
                    "weather_dependent": true
                 },
                {
                    "activity": "Visit the Fish Market (Fisketorget)",
                    "where": "Bergen Harbour",
                    "description": "Experience the bustling (and tourist-focused) market. See local seafood, try samples, perhaps have lunch at one of the stalls.",
                    "practical_tips": "Can be crowded and pricey. Good for photos and atmosphere. Indoor section available if raining.",
                    "best_time": "Daytime, particularly around lunchtime",
                    "estimated_cost": "Free (browsing), Moderate-High (eating)",
                    "weather_dependent": false
                }
            ]
        }
    }
}