{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Shoulder Season Value & Quieter Attractions",
                "details": "Benefit from lower prices for flights and accommodation compared to summer (outside potential Easter holidays). Enjoy major museums like KODE with significantly fewer crowds."
            },
            {
                "reason": "Increasing Daylight & Glimmers of Spring",
                "details": "Experience noticeably longer days (approx. 11-13 hours by month end), providing more time for exploration. First hints of spring might emerge between rain showers, especially later in March."
            },
            {
                "reason": "Borealis Festival (Experimental Music)",
                "details": "Check dates, as this contemporary music festival often takes place in early March, bringing unique performances to various venues across Bergen."
            },
            {
                "reason": "Cozy Indoor Atmosphere ('Kos')",
                "details": "The unpredictable weather makes March ideal for embracing Norwegian 'kos' – warming up in cozy cafes with coffee and pastries, escaping the wind and rain."
            },
            {
                "reason": "Dramatic Mountain Views (Weather Dependent)",
                "details": "If the weather clears, the surrounding mountains (Fløyen, Ulriken) might still have snow caps, offering dramatic contrast against the greening lower slopes or city views."
            },
            {
                "reason": "Waffle Day (Vaffeldagen)",
                "details": "Celebrate Vaffeldagen on March 25th! Enjoy traditional heart-shaped Norwegian waffles at cafes throughout Bergen, often served with jam and sour cream or brown cheese."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Highly Unpredictable & Often Wet Weather",
                "details": "March in Bergen is notoriously variable. Expect frequent rain, sleet, strong winds, and potentially wet snow. It's often cold and damp, not truly spring-like yet."
            },
            {
                "reason": "Very Icy & Slippery Conditions",
                "details": "Frequent precipitation combined with temperatures hovering around freezing makes sidewalks, cobblestones (Bryggen!), and especially mountain trails extremely icy and hazardous. Excellent grip footwear (+ ice grips) essential."
            },
            {
                "reason": "Limited Outdoor Activities & Hiking Challenges",
                "details": "Mountain trails will be very wet, muddy, icy, and snowy, requiring proper gear and caution; many higher routes remain unsafe. Fjord tours are very limited."
            },
            {
                "reason": "Requires Robust Waterproof Gear",
                "details": "High-quality waterproofs (jacket, trousers, boots) are non-negotiable. Pack warm layers underneath (thermals, fleece), hat, gloves, scarf."
            },
            {
                "reason": "Easter Holiday Closures (If Applicable)",
                "details": "If Easter falls in late March, Maundy Thursday, Good Friday, and Easter Monday mean widespread closures (shops, Vinmonopolet, some museums). Check dates yearly."
            },
            {
                "reason": "Transition Month - Neither Full Winter nor Spring",
                "details": "Lacks the reliable snow of deep winter and the reliable warmth/greenery of late spring. Can feel like a long, damp shoulder season."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "5°C (41°F)",
                    "low": "0°C (32°F)"
                },
                "precipitation": "High likelihood of rain, sleet, or wet snow. Strong winds possible. Frequent freeze-thaw cycles lead to very icy conditions. Daylight increasing significantly.",
                "general_tips": "Pack excellent waterproofs (head-to-toe), warm layers (thermals, wool/fleece), hat, gloves, scarf. Waterproof boots with superb grip essential; carry ice grips ('brodder')."
            },
            "tourism_level": {
                "crowds": "Low season. Museums and indoor attractions are quiet, except possibly during Borealis Festival if occurring.",
                "pricing": "Good value for flights/accommodation, but check for Borealis Festival price impacts if applicable.",
                "overall_atmosphere": "Late winter/early transition feel. Often grey and wet. Ideal for museum focus, enjoying cafes, and potentially catching the Borealis festival."
            },
            "events_holidays": [
                {
                    "name": "Borealis - A Festival for Experimental Music",
                    "date": "Often early March (check exact dates yearly)",
                    "description": "Festival showcasing contemporary and experimental music, sound art, and related performances at various venues in Bergen.",
                    "notes": "Check festival program and book tickets for specific events. Attracts a dedicated audience."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend Borealis Festival Events (If Applicable)",
                    "where": "Various venues (USF Verftet, concert halls, galleries)",
                    "description": "Experience cutting-edge sound art and contemporary music performances during this unique Bergen festival.",
                    "practical_tips": "Check the festival schedule and venue locations. Book tickets in advance for specific performances.",
                    "best_time": "During festival dates (typically early March)",
                    "estimated_cost": "Moderate to High (per event ticket)",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore KODE Art Museums",
                    "where": "Around Lille Lungegårdsvann lake",
                    "description": "Spend hours exploring the extensive art, craft, and design collections across the four KODE buildings, escaping the unpredictable weather.",
                    "practical_tips": "A multi-day pass offers good value. Check opening hours.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Cozy Up in a Café",
                    "where": "City Center, Skostredet, Møhlenpris",
                    "description": "Embrace 'kos' by finding a warm café. Enjoy hot coffee or tea and a Norwegian pastry ('skillingsbolle') while watching the weather outside.",
                    "practical_tips": "Look for cafes with comfortable seating and good atmosphere. Perfect refuge from rain and wind.",
                    "best_time": "Anytime",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": false
                },
                 {
                    "activity": "Walk Bryggen (Very Carefully)",
                    "where": "Bryggen Wharf",
                    "description": "Stroll along the historic wharf, admiring the architecture. Be extremely cautious as cobblestones can be incredibly slippery with ice/wetness.",
                    "practical_tips": "Essential to wear footwear with excellent grip or use ice grips. Visit the indoor Bryggens Museum or Hanseatic Museum (check status) for context.",
                    "best_time": "Daylight hours",
                    "estimated_cost": "Free (walking), Moderate (museums)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "7°C (45°F)",
                    "low": "1°C (34°F)"
                },
                "precipitation": "Still very high chance of rain and wind. Snow less likely in the city itself, but possible. Temperatures slightly milder but often damp. Ice remains a hazard.",
                "general_tips": "Waterproofs and layers are still key. Good grip boots remain essential. Daylight hours now significantly longer (approaching 13 hours by month end)."
            },
            "tourism_level": {
                "crowds": "Remains low, but check for impact of Easter holidays if they fall in late March (can increase domestic travel slightly).",
                "pricing": "Shoulder season pricing continues, but potential surge if Easter occurs.",
                "overall_atmosphere": "Transition continues. Hints of spring may appear (early flowers) but still feels damp and cool. Brighter days offer more exploration time."
            },
            "events_holidays": [
                 {
                    "name": "Waffle Day (Vaffeldagen)",
                    "date": "March 25",
                    "description": "Celebrate by enjoying traditional heart-shaped Norwegian waffles at local cafes, often served with jam/sour cream or brown cheese.",
                    "notes": "A fun, simple tradition. Look for 'Vafler' signs."
                 },
                 {
                    "name": "Easter Weekend (Påske) (Potential - Check Dates)",
                    "date": "Varies (can fall late March)",
                    "description": "If Easter is late March, expect public holidays (Maundy Thursday, Good Friday, Easter Monday) with widespread closures (shops, Vinmonopolet, some museums/restaurants).",
                    "notes": "Check dates yearly. Plan carefully around closures. Book accommodation/travel early if visiting during Easter week."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Celebrate Waffle Day",
                    "where": "Cafes throughout Bergen",
                    "description": "Join the locals in enjoying delicious Norwegian waffles on their dedicated day, March 25th.",
                    "practical_tips": "Find a cozy spot and try the classic toppings. Some places might offer specials.",
                    "best_time": "Afternoon on March 25th",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Bergen Aquarium",
                    "where": "Nordnes Peninsula",
                    "description": "Excellent indoor activity featuring penguins, seals, fish from local waters, and tropical species.",
                    "practical_tips": "Check opening times (may vary seasonally). Good way to spend a few hours, especially on a wet day.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Fløibanen Funicular Ride (Check Conditions)",
                    "where": "Departs from city center",
                    "description": "Ride up Mount Fløyen for views, potentially seeing snow on higher ground contrasting with the city below. Check visibility before going.",
                    "practical_tips": "Webcams available online show summit conditions. Trails at the top will still be very wet/icy/muddy - stick to viewpoints near the station unless properly equipped for challenging conditions.",
                    "best_time": "Daytime, during a clear spell",
                    "estimated_cost": "Moderate (funicular ticket)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Explore Independent Shops",
                    "where": "Skostredet, Marken, Bryggen side streets",
                    "description": "Discover unique local crafts, knitwear, design items, and souvenirs by exploring the smaller streets and independent boutiques.",
                    "practical_tips": "Good way to duck indoors between showers and find unique gifts.",
                    "best_time": "During shop opening hours",
                    "estimated_cost": "Free (browsing), Variable (purchases)",
                    "weather_dependent": false
                 }
            ]
        }
    }
}