{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Syttende Mai (May 17th) in Bergen!",
                "details": "Experience Norway's Constitution Day in Bergen! Witness the unique morning processions ('Morgenprosesjonen'), the main parade ('Hovedprosesjonen'), and the flag parade ('Flaggtoget'). See streets filled with people in traditional 'bunad' costumes and enjoy the city-wide festive atmosphere."
            },
            {
                "reason": "Bergen International Festival (Festspillene)",
                "details": "One of Northern Europe's premier arts festivals often starts in late May, bringing world-class music, theatre, dance, and visual arts performances to venues across the city."
            },
            {
                "reason": "Spring Blooms & Greening Mountains",
                "details": "Experience Bergen as it bursts into green. See rhododendrons bloom (often late May) and enjoy the increasingly lush landscapes on Mount Fløyen and Ulriken. Pleasant temperatures for exploring (when not raining!)."
            },
            {
                "reason": "Increasingly Accessible Hiking",
                "details": "Lower mountain trails (Fløyen, parts of Ulriken) become much more pleasant for hiking as snow recedes further. Enjoy longer daylight hours for extended walks with improving views."
            },
            {
                "reason": "Outdoor Cafes & Lively Bryggen",
                "details": "Outdoor seating ('uteservering') becomes common along Bryggen, at the Fish Market, and throughout the city center. Enjoy the returning warmth and vibrant atmosphere."
            },
            {
                "reason": "More Fjord Tour Options",
                "details": "Fjord cruise operators increase their schedules, offering more frequent departures for popular tours like the Mostraumen cruise, taking advantage of the improving weather and longer days."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "May 17th & Festspillene Crowds/Prices",
                "details": "Constitution Day (May 17th) and the start of Bergen International Festival (late May) bring HUGE crowds. Accommodation and flights are extremely expensive and book out months in advance."
            },
            {
                "reason": "Still Very Rainy!",
                "details": "May is statistically one of Bergen's drier months, but that's relative! Expect frequent rain showers and changeable weather. Excellent waterproofs are still essential."
            },
            {
                "reason": "Multiple Public Holidays = Closures",
                "details": "May often includes May 1st (Labor Day), Ascension Day, and May 17th (Constitution Day). Expect widespread closures (shops, Vinmonopolet, banks) on these days."
            },
            {
                "reason": "Booking Ahead is Critical",
                "details": "Due to holidays, festivals, and the start of tourist season, booking accommodation, festival tickets, specific tours, and popular restaurants far in advance is crucial."
            },
            {
                "reason": "Pollen Season Peaks",
                "details": "Birch and other tree pollen levels are typically very high in May, significantly impacting allergy sufferers."
            },
            {
                "reason": "Mountain Trails Still Wet/Muddy",
                "details": "While more accessible, expect trails, especially higher up or less used ones, to be wet, muddy, and require waterproof footwear with good grip."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "13°C (55°F)",
                    "low": "5°C (41°F)"
                },
                "precipitation": "High chance of rain showers, but also increasing sunny spells. Can feel cool, especially with wind or in the evenings. Daylight hours increase rapidly.",
                "general_tips": "Pack layers: T-shirts, sweaters, waterproof jacket essential. Comfortable, waterproof walking shoes vital. Sunglasses needed. Allergy medication potentially useful."
            },
            "tourism_level": {
                "crowds": "Moderate but increasing significantly. Very busy around May 1st holiday. Buildup towards May 17th and festival season.",
                "pricing": "Shoulder/High season prices. Book well in advance, especially if dates include May 1st or Ascension Day weekend.",
                "overall_atmosphere": "City awakening fully for spring. Green landscapes emerge. Lively when sunny. Plan around May 1st closures."
            },
            "events_holidays": [
                {
                    "name": "May Day / Labor Day (Første mai)",
                    "date": "May 1",
                    "description": "Public holiday. Potential for parades/demonstrations in the city center. Widespread closures of shops, Vinmonopolet, banks.",
                    "notes": "Check opening status for museums/attractions. Transport runs on Sunday schedule."
                },
                {
                    "name": "Ascension Day (Kristi Himmelfartsdag) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often early/mid May)",
                    "description": "Public holiday, creating a long weekend. Expect closures.",
                    "notes": "Check date yearly. Increased domestic travel possible. Book ahead if traveling this weekend."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Hike on Mount Fløyen",
                    "where": "Accessed via Fløibanen funicular or paths from city center",
                    "description": "Enjoy improving hiking conditions. Ride the funicular up for views, then explore trails like the walk around Skomakerdiket lake as the forest greens up.",
                    "practical_tips": "Wear waterproof footwear as trails will likely be wet/muddy. Funicular queues start building; consider booking online. Check webcam for visibility.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (funicular) or Free (hiking up)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Bryggen & Hanseatic Museum Area",
                    "where": "Bryggen Wharf",
                    "description": "Wander the iconic wooden alleyways. Visit the Hanseatic Museum (check status) or Bryggens Museum to learn about the history before peak crowds arrive.",
                    "practical_tips": "Quieter than later in the month (except holidays). Explore the back passages. Wear comfortable shoes.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking), Moderate (museums)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Enjoy First Outdoor Coffees/Drinks",
                    "where": "Bryggen, Zachariasbryggen, City Center Cafes",
                    "description": "As weather permits, cafes set up more outdoor seating ('uteservering'). Grab a coffee or drink and enjoy the spring atmosphere.",
                    "practical_tips": "Look for spots with heaters or blankets if it's cool. People-watching along the harbour front.",
                    "best_time": "Mid-morning or Afternoon when sunny/dry",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": true
                 },
                {
                    "activity": "Visit KODE Art Museums",
                    "where": "Around Lille Lungegårdsvann lake",
                    "description": "Explore Bergen's extensive art collections, a perfect activity for rainy May days. See works by Munch, Dahl, Astrup, and Picasso.",
                    "practical_tips": "A KODE pass covers entry to all open buildings over two days. Allow several hours or split over two days.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "15°C (59°F)",
                    "low": "7°C (45°F)"
                },
                "precipitation": "Still a good chance of rain, but often brighter and milder than early May. Long daylight hours. Rhododendrons may start blooming profusely.",
                "general_tips": "Layers plus waterproof jacket remain essential. Comfortable walking shoes. Pack festive attire if experiencing May 17th!"
            },
            "tourism_level": {
                "crowds": "EXTREMELY high around May 17th & during Festspillene start. Otherwise high season crowds building towards summer peak.",
                "pricing": "Peak prices around May 17th / Festspillene. High season rates otherwise. Book EVERYTHING far in advance.",
                "overall_atmosphere": "Dominated by Constitution Day buzz and potentially the start of the Bergen International Festival. Very festive, very crowded."
            },
            "events_holidays": [
                 {
                    "name": "Norway's Constitution Day (Syttende Mai / Grunnlovsdagen)",
                    "date": "May 17",
                    "description": "Bergen hosts unique traditions: early morning processions, the main parade (Hovedprosesjonen), Flag Parade (Flaggtoget). Streets packed with people in 'bunad', marching bands ('buekorps'). City-wide celebration.",
                    "notes": "Public holiday. Most shops closed. Transport runs but routes altered. Book accommodation MONTHS ahead. Arrive early for parade spots."
                 },
                 {
                    "name": "Bergen International Festival (Festspillene i Bergen)",
                    "date": "Usually starts late May (check exact dates)",
                    "description": "Major international arts festival begins, featuring music, theatre, dance, opera, visual arts at numerous venues.",
                    "notes": "Requires tickets for most events, book far ahead. Significantly impacts accommodation availability/prices."
                 },
                 {
                    "name": "Ascension Day (Kristi Himmelfartsdag) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often mid/late May)",
                    "description": "Public holiday. Expect closures.",
                    "notes": "Check date yearly. Book ahead if traveling this long weekend."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Syttende Mai (May 17th) in Bergen",
                    "where": "City Center (Festplassen, Torgallmenningen, Bryggen)",
                    "description": "Witness the unique Bergen parades (morning processions, main parade, flag parade), admire the 'bunader', listen to the 'buekorps' drumming, and soak up the incredible atmosphere.",
                    "practical_tips": "Plan viewing spots early. Be prepared for immense crowds. Enjoy ice cream ('is') and hot dogs ('pølse'). Dress smartly if possible to blend in.",
                    "best_time": "All day on May 17th",
                    "estimated_cost": "Free (watching), Low (street food)",
                    "weather_dependent": true
                },
                {
                    "activity": "Attend a Bergen International Festival Event (if timing aligns)",
                    "where": "Various venues (Grieghallen, Den Nationale Scene, etc.)",
                    "description": "Catch an early performance of this prestigious arts festival showcasing top Norwegian and international talent.",
                    "practical_tips": "Check the Festspillene program and book tickets ASAP. Wide range of genres and price points.",
                    "best_time": "During festival opening days (late May typically)",
                    "estimated_cost": "Moderate to Very High (depending on event)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Take a Fjord Cruise",
                    "where": "Departing from Bergen Harbour",
                    "description": "Enjoy increased departure frequency for scenic fjord cruises (e.g., Mostraumen) amidst greening landscapes and potentially powerful waterfalls fed by spring melt.",
                    "practical_tips": "Book ahead, especially around holidays/festivals. Bring waterproofs/layers regardless of weather.",
                    "best_time": "Check schedules",
                    "estimated_cost": "High",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Hike Higher on Fløyen/Ulriken (Check Conditions)",
                    "where": "Fløyen or Ulriken mountains",
                    "description": "With longer daylight and potentially clearing snow, explore further on the mountain trails. Enjoy panoramic views and blooming nature.",
                    "practical_tips": "Trails will still be wet/muddy; wear waterproof hiking boots. Check trail status (ut.no, Fløyen/Ulriken websites). Bring water/snacks.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (funicular/cable car) or Free (hiking up)",
                    "weather_dependent": true
                 }
            ]
        }
    }
}