{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Spring Weather",
                "details": "June offers ideal temperatures in Le Havre with warm, pleasant days and cool evenings. It's perfect for exploring the city on foot, enjoying outdoor dining, and taking day trips to nearby coastal destinations without the intense summer heat."
            },
            {
                "reason": "Norman Cultural Celebrations",
                "details": "June features various cultural celebrations and festivals leading up to summer, including traditional music performances and folk festivals that showcase authentic Norman heritage and hospitality."
            },
            {
                "reason": "Blooming City Parks",
                "details": "Le Havre's parks, especially the reconstructed city center and waterfront areas, are lush and green. The beach area becomes particularly beautiful with perfect conditions for outdoor activities along the English Channel."
            },
            {
                "reason": "Coastal Access Season",
                "details": "June marks the beginning of optimal beach season for the Normandy coast and nearby coastal destinations. The 2-kilometer beach and surrounding coastal trails offer excellent conditions for day trips and outdoor adventures."
            },
            {
                "reason": "Vibrant Café Culture",
                "details": "The famous French café culture reaches its peak in June as outdoor terraces fill with locals enjoying long conversations over coffee, creating the perfect atmosphere for cultural immersion."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Growing Tourist Numbers",
                "details": "June marks the beginning of peak tourist season in Normandy, so while still manageable, popular attractions and restaurants may start to get busier, especially on weekends."
            },
            {
                "reason": "Rising Accommodation Prices",
                "details": "As summer approaches, hotel rates begin to increase from their winter lows, though they remain relatively affordable compared to major French cities."
            },
            {
                "reason": "Occasional Spring Storms",
                "details": "June can still experience sudden afternoon showers and occasional rainy days due to the maritime climate, which might disrupt outdoor plans temporarily."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "14°C"
                },
                "precipitation": "Moderate rainfall with occasional afternoon showers. Generally sunny days with fresh, comfortable sea air from the English Channel.",
                "general_tips": "Pack light layers for temperature variations. Carry a light rain jacket or umbrella for sudden showers. Comfortable walking shoes essential for exploring the reconstructed city center."
            },
            "tourism_level": {
                "crowds": "Low to moderate, with increasing numbers toward mid-month. Major attractions still easily accessible without long waits.",
                "pricing": "Transitioning from low season to high season rates, but still excellent value with many early summer deals available.",
                "overall_atmosphere": "Energetic and optimistic as the city prepares for summer. Locals spend more time outdoors, creating vibrant street life along the waterfront."
            },
            "events_holidays": [
                {
                    "name": "Norman Spring Folk Festival",
                    "date": "June 5-8, 2025",
                    "description": "Traditional Norman folk music and dance festival featuring performers from across Normandy, held in various venues throughout the city.",
                    "notes": "Many performances are free in public squares. Great opportunity to experience authentic Norman culture and traditional costumes."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the 2-Kilometer Beach",
                    "where": "Le Havre Beach, waterfront",
                    "description": "Enjoy the beautiful sandy beach with clear views of the English Channel, perfect for walking, sunbathing, and early summer beach activities.",
                    "practical_tips": "Perfect weather for beach activities. Bring layers as it can be breezy by the sea. Several beach cafes available.",
                    "best_time": "Morning",
                    "estimated_cost": "Free (beach access), €5-€15 for beach equipment rental",
                    "weather_dependent": true
                },
                {
                    "activity": "Picnic in the Reconstructed City Center",
                    "where": "UNESCO World Heritage site",
                    "description": "Enjoy a relaxing picnic in Le Havre's modernist architectural masterpiece, complete with beautiful squares, walking paths, and cultural landmarks.",
                    "practical_tips": "Bring food from local markets or buy from city center cafes. Perfect weather for outdoor dining. Weekend cultural events available.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free (food extra)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit MuMa Museum",
                    "where": "Waterfront",
                    "description": "Discover the Museum of Modern Art André Malraux with its impressive collection of Impressionist works and maritime art.",
                    "practical_tips": "Allow 2-3 hours. English audio guides available. Perfect for rainy days. Photography permitted in most areas.",
                    "best_time": "Late morning",
                    "estimated_cost": "€8-€12",
                    "weather_dependent": false
                },
                {
                    "activity": "Traditional Coffee Experience in Saint-François",
                    "where": "Saint-François District",
                    "description": "Experience authentic French café culture in the historic Saint-François area, known for its traditional architecture and maritime heritage.",
                    "practical_tips": "Try café au lait or French espresso. Perfect for people watching. Cafes are social centers.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€3-€6",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore Church of Saint-Joseph and City Hall",
                    "where": "City center",
                    "description": "Visit the beautiful modernist church designed by Auguste Perret and the iconic City Hall for panoramic city views.",
                    "practical_tips": "Dress appropriately for church. Free entry but donations appreciated. City Hall tours available.",
                    "best_time": "Morning",
                    "estimated_cost": "Free (tours may have fees)",
                    "weather_dependent": false
                },
                {
                    "activity": "French Wine Tasting",
                    "where": "Various wine bars",
                    "description": "Sample excellent French wines including local Norman varieties paired with traditional appetizers and local cheese.",
                    "practical_tips": "Book tastings in advance. French wines are world-renowned. Try with local Norman cheeses.",
                    "best_time": "Evening",
                    "estimated_cost": "€25-€50",
                    "weather_dependent": false
                },
                {
                    "activity": "Volcan Cultural Center",
                    "where": "City center",
                    "description": "Explore the modern cultural center designed by Oscar Niemeyer, showcasing contemporary performances and exhibitions.",
                    "practical_tips": "Check schedule for performances. Modern architecture. Allow 2 hours. Excellent for cultural enrichment.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€8-€15",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll Through Halles Centrales",
                    "where": "Central market area",
                    "description": "Explore the traditional covered market area with trendy cafes, restaurants, and shops selling local products and crafts.",
                    "practical_tips": "Great for lunch and souvenir shopping. Mix of traditional and modern. Several excellent restaurants.",
                    "best_time": "Late morning",
                    "estimated_cost": "Varies",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "24°C",
                    "low": "16°C"
                },
                "precipitation": "Less rainfall than early June, with more consistent sunny days. Occasional late afternoon showers provide dramatic but brief cooling. The maritime climate brings refreshing sea breezes.",
                "general_tips": "Light summer clothing suitable. Bring sun protection and light evening layers. Perfect weather for outdoor dining and evening strolls along the waterfront."
            },
            "tourism_level": {
                "crowds": "Moderate to high, especially at popular attractions and during weekends. Restaurant reservations recommended for popular spots.",
                "pricing": "Summer season rates in effect, though still relatively affordable by French standards. Book accommodations in advance.",
                "overall_atmosphere": "Festive and lively as summer officially begins. Extended daylight hours and warm evenings create vibrant street life along the English Channel."
            },
            "events_holidays": [
                {
                    "name": "Le Havre Summer Solstice Festival",
                    "date": "June 21, 2025",
                    "description": "City-wide celebration marking the longest day of the year with outdoor concerts, street performances, and traditional celebrations in the reconstructed city center.",
                    "notes": "Free events throughout the city. Traditional Norman music and dance. Perfect for evening exploration."
                },
                {
                    "name": "Norman Coastal Festival",
                    "date": "Late June (June 25-28, 2025)",
                    "description": "Celebration of Norman coastal culture with beach events, traditional coastal cuisine, and folk music from maritime regions.",
                    "notes": "Some events held along the waterfront. Free bus transportation often provided. Great introduction to Norman maritime culture."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Sunset Walk Along the Waterfront",
                    "where": "Waterfront promenade",
                    "description": "Enjoy a peaceful evening stroll along the beautiful waterfront with landscaped walking paths and English Channel views.",
                    "practical_tips": "Recently renovated area perfect for evening walks. Several cafes along the route. Beautiful lighting after sunset.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Étretat Medieval Cliffs",
                    "where": "Étretat (30km north)",
                    "description": "Visit the historic white cliffs and traditional Norman architecture, including the famous natural arches and coastal views.",
                    "practical_tips": "Perfect day trip weather. Take early bus to avoid afternoon heat. Combine with traditional lunch in coastal setting.",
                    "best_time": "Morning departure",
                    "estimated_cost": "€20-€50 including transport",
                    "weather_dependent": true
                },
                {
                    "activity": "Traditional Norman Cooking Class",
                    "where": "Various culinary schools",
                    "description": "Learn to prepare classic Norman dishes like traditional stews, seafood dishes, and French pastries with local ingredients.",
                    "practical_tips": "Book in advance as classes fill up. Usually includes market visit and full meal. Great cultural experience.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "€60-€120",
                    "weather_dependent": false
                },
                {
                    "activity": "Experience Traditional French Tea House",
                    "where": "Historic district",
                    "description": "Visit authentic tea houses serving traditional French tea, Norman herbal teas, and local sweets in historic settings.",
                    "practical_tips": "Perfect for afternoon relaxation. Try Norman herbal tea with local honey. Great for cultural conversations with locals.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€5-€10",
                    "weather_dependent": false
                },
                {
                    "activity": "Appartement Témoin Museum",
                    "where": "City center",
                    "description": "Explore the museum apartment showing how Le Havre was reconstructed after World War II, housed in a historic building.",
                    "practical_tips": "Powerful and educational experience. English information available. Allow 1.5 hours. Air-conditioned comfort.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€5-€8",
                    "weather_dependent": false
                },
                {
                    "activity": "Deauville Beach Day Trip",
                    "where": "25km east of Le Havre",
                    "description": "Escape to this beautiful coastal resort offering sandy beaches, pristine nature, and opportunities for swimming and picnicking.",
                    "practical_tips": "Perfect June weather for coastal activities. Bring picnic supplies and swimwear. Several beach options available.",
                    "best_time": "Morning departure",
                    "estimated_cost": "€15-€30 including transport",
                    "weather_dependent": true
                },
                {
                    "activity": "Attend Traditional Norman Opera",
                    "where": "Volcan Cultural Center",
                    "description": "Experience Norman cultural performances in the beautiful modern theater, often featuring traditional and contemporary works.",
                    "practical_tips": "Check schedule for performances. Tickets relatively affordable. Dress smart casual. Great air-conditioned venue.",
                    "best_time": "Evening",
                    "estimated_cost": "€15-€40",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Le Havre's Art Galleries",
                    "where": "Various locations",
                    "description": "Explore the growing contemporary art scene in Le Havre's galleries, featuring both Norman and international artists.",
                    "practical_tips": "Many galleries clustered in city center. Free or low-cost entry. Perfect for afternoon cultural exploration.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free to €10",
                    "weather_dependent": false
                }
            ]
        }
    }
}