{
  "overview_paragraph": "Le Havre is at its best in spring (April–June) and early fall (September–October), when café terraces hum around the reconstructed city center, coastal landscapes bloom with wildflowers, and touring weather is ideal. July brings long evenings and vibrant festivals—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days, local patisserie stops, and twinkling holiday lights—while March begins to warm with the odd shower and blooming trees around the modernist squares.",
  "January": [
    "MuMa without the lines, steaming French hot chocolate, and misty walks between cozy local shops around the reconstructed city center.",
    "Winter light on the waterfront, snug restaurants in the Saint-François district, and vintage hunts in Halles Centrales."
  ],
  "February": [
    "Saint-François district at golden hour, romantic views from the Church of Saint-Joseph tower, and traditional Norman music nights in local venues.",
    "Shared local pastries, candlelit restaurants, and strolls past secret courtyards in the Old Town."
  ],
  "March": [
    "First wildflowers in the reconstructed city center, terrace tables returning around the waterfront, and modernist bookshop wanders.",
    "Morning croissants, museum afternoons, and blue-hour walks welcoming spring back to Le Havre."
  ],
  "April": [
    "Wildflowers in bloom around the coastal countryside, flaky French pastries, and walks from the waterfront to the reconstructed city center.",
    "Spring light on Church of Saint-Joseph, gallery-hopping in MuMa, sunset views over the English Channel."
  ],
  "May": [
    "Picnics in the modernist squares, markets brimming with local color, and twilight strolls around the reconstructed city center.",
    "Flowered promenades, open-air café moments along the waterfront, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, coastal aperitifs, and the city humming for Fête de la Musique.",
    "Sun-splashed walking trails, garden picnics, and late sunsets that turn every waterfront viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over the harbor, lazy afternoons exploring the Normandy coast, and moonlit modernist walks.",
    "Summer markets, outdoor terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet coastal trails, easy museum days, and peaceful evenings with breezes off the English Channel.",
    "Shaded gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits, lively terraces, and wine-tinted evenings in the reconstructed city center.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering irresistible."
  ],
  "October": [
    "Autumn colors in the coastal landscapes, restaurants aglow, and the local harvest festival in the modernist squares.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the coastal views."
  ],
  "November": [
    "Local wine toasts, cozy restaurants, and MuMa afternoons while the city slows to a hush.",
    "Foggy coastal mornings, French antiquities indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Reconstructed city center lights, Christmas markets, and strolling beneath grand modernist façades.",
    "Vin chaud in hand, church bells, and winter sparkle from city center to coastal peaks."
  ]
}

