{
    "Spring": {
        "activities": [
            {
                "name": "Visit the Royal Greenhouses of Laeken",
                "type": "Garden",
                "description": "Explore the stunning glasshouses filled with exotic plants and flowers, open to the public only in April and May.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The greenhouses are only open to the public during spring, showcasing a vibrant array of blossoming flora.",
                "booking_tips": "Tickets can be purchased online or at the entrance; visiting during weekdays might be less crowded."
            },
            {
                "name": "Brussels Jazz Marathon",
                "type": "Festival",
                "description": "An annual jazz festival featuring over 700 musicians across various venues in Brussels, including outdoor stages and intimate bars.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held in late May, this festival celebrates the return of warmer weather with lively music performances.",
                "booking_tips": "No tickets required; check the schedule online to plan which performances to attend."
            },
            {
                "name": "Flower Carpet at the Grand Place",
                "type": "Cultural Event",
                "description": "Every two years in spring, a massive flower carpet is laid out in the Grand Place, creating a breathtaking floral tapestry.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The event usually occurs in August, but preparations and smaller displays can be seen in spring.",
                "booking_tips": "Arrive early in the morning to avoid the crowds and get the best views."
            },
            {
                "name": "Atomium Visit",
                "type": "Landmark",
                "description": "Iconic building from the 1958 World Expo featuring exhibitions and panoramic views of Brussels.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers clear skies for better panoramic views from the top spheres.",
                "booking_tips": "Purchase tickets online to skip the lines, and check for any special exhibitions."
            },
            {
                "name": "Parc du Cinquantenaire",
                "type": "Park",
                "description": "A large public park with beautiful gardens, museums, and the iconic Triumphal Arch, perfect for picnics and leisurely walks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The park is particularly beautiful in spring when the flowers bloom and the weather is mild.",
                "booking_tips": "Bring a picnic and enjoy a relaxing afternoon; no reservations are needed."
            },
            {
                "name": "Art Brussels",
                "type": "Art Fair",
                "description": "A leading contemporary art fair that brings together galleries and artists from around the world each April.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Held annually in spring, Art Brussels is a must-visit for art enthusiasts.",
                "booking_tips": "Purchase tickets in advance online, and consider attending the VIP preview for exclusive access."
            },
            {
                "name": "Brussels Food Tour",
                "type": "Tour",
                "description": "A culinary walking tour exploring Brussels' best chocolate shops, beer breweries, and local delicacies.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring weather is ideal for walking tours, and seasonal treats are often featured.",
                "booking_tips": "Book the tour online in advance, and wear comfortable walking shoes."
            },
            {
                "name": "Easter Market at Place Flagey",
                "type": "Market",
                "description": "A vibrant market offering Easter-themed crafts, gifts, and local delicacies.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Held around Easter, the market captures the festive spirit of spring.",
                "booking_tips": "Visit early in the morning to avoid crowds and have the best selection of goods."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Bruxelles Les Bains",
                "type": "Beach Festival",
                "description": "An urban beach festival along the Brussels canal featuring sand, deck chairs, and cultural events.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Open during the summer months, bringing a beach vibe to the city center.",
                "booking_tips": "No reservations needed. Arrive early to secure a good spot on the sand."
            },
            {
                "name": "Ommegang Festival",
                "type": "Historical Event",
                "description": "A historical reenactment of a 16th-century pageant, featuring costumes, music, and processions.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in July, this event celebrates Brussels' rich history and traditions.",
                "booking_tips": "Tickets can be purchased online. Seating in the Grand Place is limited, so early booking is recommended."
            },
            {
                "name": "Fête de la Musique",
                "type": "Music Festival",
                "description": "A city-wide music festival marking the start of summer with free concerts and performances.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Coinciding with the summer solstice, it features diverse music genres and artists.",
                "booking_tips": "No tickets required. Check the event schedule online to plan your day."
            },
            {
                "name": "Couleur Café Festival",
                "type": "Music Festival",
                "description": "A multicultural music festival showcasing a mix of hip-hop, reggae, and world music.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held in late June, this festival is a vibrant celebration of cultural diversity.",
                "booking_tips": "Purchase tickets online in advance, as they sell out quickly."
            },
            {
                "name": "Brussels Summer Festival",
                "type": "Music Festival",
                "description": "A multi-day music festival featuring international and local artists across various genres.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Taking place in August, the festival is a highlight of the summer cultural calendar.",
                "booking_tips": "Buy tickets early for the best prices and access to all performances."
            },
            {
                "name": "Enjoying Parc Leopold",
                "type": "Park",
                "description": "A picturesque park perfect for picnics, with a pond and plenty of shady spots to relax.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer is ideal for outdoor relaxation and enjoying the lush greenery.",
                "booking_tips": "No booking required. Bring a blanket and some snacks for a perfect afternoon."
            },
            {
                "name": "Atomium Light Show",
                "type": "Light Show",
                "description": "A nightly light display illuminating the iconic Atomium structure in vibrant colors.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer nights are perfect for watching the light show under the clear sky.",
                "booking_tips": "Visit after dark for the full effect. No tickets are needed for the light show."
            },
            {
                "name": "Visit the Abbey of La Cambre",
                "type": "Historical Site",
                "description": "A serene 13th-century abbey surrounded by beautiful gardens, offering a peaceful retreat from the city.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The gardens are in full bloom during summer, enhancing the abbey's tranquil atmosphere.",
                "booking_tips": "No entry fee required. Consider a guided tour to learn more about its history."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Brussels Art Square",
                "type": "Art Event",
                "description": "An annual art event where galleries in the Sablon district open their doors to the public.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held in September, it's a great opportunity to explore local and international art.",
                "booking_tips": "No tickets required. Check the event map online for participating galleries."
            },
            {
                "name": "Visit the Comic Strip Center",
                "type": "Museum",
                "description": "A museum dedicated to the history and art of Belgian comics, featuring famous characters like Tintin.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is perfect for indoor activities, with the museum offering warmth and entertainment.",
                "booking_tips": "Buy tickets at the entrance or online to avoid queues during peak times."
            },
            {
                "name": "Eat! Brussels, Drink! Bordeaux",
                "type": "Food Festival",
                "description": "A gastronomic festival celebrating Brussels' culinary diversity alongside Bordeaux wines.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in September, the festival pairs well with the crisp autumn air.",
                "booking_tips": "Purchase tasting tickets at the entrance. Arrive early to explore all stalls."
            },
            {
                "name": "Autumn Walk in Bois de la Cambre",
                "type": "Nature Walk",
                "description": "A scenic walk through the forested park, enjoying the vibrant autumn foliage.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The park is especially beautiful in autumn when the leaves change color.",
                "booking_tips": "Wear comfortable shoes and dress warmly. No reservations needed."
            },
            {
                "name": "Visit the Magritte Museum",
                "type": "Museum",
                "description": "A museum dedicated to the surrealist works of René Magritte, showcasing his most famous paintings.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is ideal for museum visits, avoiding the summer tourist rush.",
                "booking_tips": "Book tickets online for timed entry to avoid long waits."
            },
            {
                "name": "Brussels Design September",
                "type": "Design Festival",
                "description": "A month-long festival celebrating design in all its forms, with exhibitions, workshops, and talks.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Held each September, the festival showcases innovative design against the backdrop of autumn.",
                "booking_tips": "Most events are free, but check specific workshops for registration requirements."
            },
            {
                "name": "Taste Brussels' Autumn Beer",
                "type": "Food & Drink",
                "description": "Explore Brussels' rich beer culture by sampling seasonal autumn brews at local pubs.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings special beer brews with rich, warming flavors.",
                "booking_tips": "No reservations necessary for most pubs; ask locals for recommendations."
            },
            {
                "name": "European Film Festival",
                "type": "Film Festival",
                "description": "An annual film festival showcasing European cinema, featuring screenings and discussions across Brussels.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in November, it's a cozy cultural escape during cooler autumn evenings.",
                "booking_tips": "Tickets can be purchased online; check the festival schedule for film times."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Winter Wonders and Christmas Market",
                "type": "Market",
                "description": "A festive market with over 200 stalls, ice skating, a Ferris wheel, and a light show.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held from late November to early January, it captures the magic of the holiday season.",
                "booking_tips": "No entry fee, but arrive early for skating or the Ferris wheel to avoid long lines."
            },
            {
                "name": "Visit the Royal Palace of Brussels",
                "type": "Historical Site",
                "description": "The official palace of the Belgian royal family, open for tours during certain times.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "While tours are limited in winter, the palace's interiors offer a warm retreat.",
                "booking_tips": "Check opening times in advance, as the palace is not always open to the public."
            },
            {
                "name": "Magical Winter Moments in the Domain of the Caves of Han",
                "type": "Nature & Light Show",
                "description": "A spectacular light and sound show in the stunning caves, transformed into a winter wonderland.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "The unique cave setting enhances the winter magic of the event.",
                "booking_tips": "Tickets must be booked online in advance due to limited capacity."
            },
            {
                "name": "Ice Magic - Ice Sculpture Festival",
                "type": "Art Festival",
                "description": "Experience incredible ice sculptures crafted by artists from around the world.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Held in December, the festival adds an artistic edge to winter's chill.",
                "booking_tips": "Dress warmly and buy tickets in advance to avoid disappointment."
            },
            {
                "name": "Visit the Musical Instruments Museum",
                "type": "Museum",
                "description": "A museum housing a vast collection of musical instruments, with an interactive audio tour.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect for a cozy indoor visit when the weather is cold outside.",
                "booking_tips": "Purchase tickets online for quicker entry; the rooftop café offers panoramic views."
            },
            {
                "name": "Try Belgian Hot Chocolate",
                "type": "Food & Drink",
                "description": "Warm up with a rich, creamy hot chocolate at one of Brussels' many charming cafés.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "A comforting treat perfect for chilly winter days in Brussels.",
                "booking_tips": "No reservations needed; explore various cafés for their unique recipes."
            },
            {
                "name": "Attend a Concert at the Bozar",
                "type": "Concert",
                "description": "Enjoy classical music performances at Brussels' renowned Centre for Fine Arts.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter concerts provide a cultural escape from the cold.",
                "booking_tips": "Book tickets online as concerts often sell out quickly."
            },
            {
                "name": "Visit the Horta Museum",
                "type": "Museum",
                "description": "Explore the former home of Art Nouveau architect Victor Horta, showcasing his design genius.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "The museum offers a warm, inspiring retreat from the winter chill.",
                "booking_tips": "Tickets are available at the entrance; visiting during weekdays is less crowded."
            }
        ]
    }
}