{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day",
          "notes": "New Year's Day is a public holiday throughout Belgium. Most attractions, shops, and restaurants are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. Museums like the Royal Museums of Fine Arts typically reopen on January 2nd. Grand Place's Christmas decorations remain up, creating a festive atmosphere for the first day of the year."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 2,
          "notes": "Early January brings winter cold and the post-holiday period. This is indoor museum season with fewer tourists, making it ideal for visiting the Royal Museums of Fine Arts, Magritte Museum, and the Musical Instrument Museum without crowds. The European Quarter tours are particularly popular during this quieter period. Many restaurants offer special winter menus featuring traditional Belgian comfort foods."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "Late January continues the low season with fewer crowds but steady cultural offerings. The Belgian chocolate workshops make for excellent indoor activities during cold days. Brussels' historic cafés around Grand Place provide cozy refuges with traditional hot chocolate and Belgian specialties. The Cathedral of St. Michael and St. Gudula hosts winter concert series with excellent acoustics in the magnificent Gothic interior."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 2,
          "notes": "Early February brings continued winter conditions, making indoor activities preferable. The Royal Museums of Fine Arts offer special winter exhibitions focusing on Belgian masters. The Magritte Museum showcases its collection of surrealist art in ideal viewing conditions. The city's historic churches provide cultural refuges with architectural splendor and art collections. The Belgian Comic Strip Center highlights winter-themed comic art exhibitions."
        },
        {
          "days": [14],
          "score": 3,
          "special": true,
          "event": "Valentine's Day",
          "notes": "Valentine's Day brings special events at chocolate museums and boutiques throughout Brussels, with special tastings and romantic experiences. Many of Brussels' finest restaurants offer special Valentine's menus featuring Belgian culinary specialties. The Grand Place and Galeries Royales Saint-Hubert create romantic settings with special lighting. Evening walks through the illuminated historic center offer romantic perspectives. Special Valentine's concerts take place at various venues throughout the city."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
          "score": 2,
          "special": true,
          "event": "Carnival",
          "notes": "Late February brings Carnival celebrations to Brussels, particularly in the Saint-Gilles district with parades and costume events. Winter conditions continue making museums, chocolate workshops, and historic pubs popular destinations. The BOZAR cultural center typically presents winter performances during this period. Local folklore events may include traditional mask-making workshops at cultural centers. The historic center's cafés offer warm refuge with traditional Belgian beers and snacks."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early March brings the first signs of spring with gradually warming temperatures. This marks the beginning of outdoor café season as establishments begin setting up terraces around Grand Place and Place du Grand Sablon. The Parc du Cinquantenaire shows the first spring blooms, particularly early bulbs and flowering shrubs. The historic neighborhoods start to come alive with more street activity and open-air markets. The European Quarter becomes more pleasant for walking tours."
        },
        {
          "days": [15, 16, 17, 18, 19, 20],
          "score": 3,
          "notes": "Mid-March sees spring beginning in earnest throughout Brussels. The Parc du Cinquantenaire's collection of early spring flowers starts to bloom. Riverside walks along the canal become increasingly popular as temperatures rise. The terraces around Grand Place fill with locals enjoying the first consistent sunshine. The Atomium and Mini-Europe begin their spring season with extended hours. The fashion district launches spring collections in boutique windows."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Art Brussels Week",
          "notes": "Late March hosts Art Brussels Week, one of Europe's most important contemporary art fairs. International galleries present works at Tour & Taxis and other venues throughout the city. Special exhibitions appear in museums and cultural centers across Brussels. Art tours explore the city's public art installations and galleries. Spring truly arrives with blossoming trees throughout the city parks and increasing outdoor activities. The Royal Greenhouses of Laeken typically open for their limited spring season."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 3,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "notes": "Early April brings spring flowers throughout Brussels, with pleasant temperatures ideal for exploring. Easter period typically falls in this timeframe, bringing special church services at Cathedral of St. Michael and St. Gudula and other historic churches. The Parc du Cinquantenaire and other city parks are at their spring best with flowering trees and active wildlife. Chocolate shops create elaborate Easter displays showcasing the artistry of Belgian chocolatiers. The city's parks become lively with locals enjoying the spring sunshine."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "special": true,
          "event": "Brussels International Fantastic Film Festival",
          "notes": "Mid-April features the Brussels International Fantastic Film Festival with international screenings and cinema events throughout the city. Historic theaters and modern multiplexes participate with special programs and retrospectives. Belgian cinema receives special focus with directors and actors attending discussion panels. Documentary sections highlight social issues and cultural trends with expert-led conversations. Evening events combine film screenings with culinary experiences at partner restaurants. The Magritte Museum often coordinates special exhibitions aligned with the festival themes."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27],
          "score": 4,
          "notes": "Late April brings ideal spring weather with increasing temperatures perfect for outdoor exploration. The historic city center becomes increasingly vibrant with street performers and outdoor dining. The Parc du Cinquantenaire is particularly beautiful as spring foliage provides changing backdrops to the monuments. Bicycle tours of the city's green spaces become popular with visitors. The European Quarter offers unique perspectives on the city's modern architecture. Fashion district boutiques display full spring collections from Belgian designers."
        },
        {
          "days": [28, 29, 30],
          "score": 4,
          "special": true,
          "event": "King's Day",
          "notes": "King's Day brings national holiday celebrations to Brussels with special events in public spaces. Monarchy-themed exhibitions may appear at history museums and cultural centers. The Royal Palace and government buildings feature special decorations and ceremonial guards. Some businesses may have limited hours, but tourist attractions remain open with festive atmosphere. Music performances and cultural events take place in major squares throughout the city center."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 5,
      "tourismLevel": 6
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "Labor Day",
          "notes": "Labor Day is a public holiday throughout Belgium with many businesses closed but special events taking place. Traditional labor demonstrations and parades occur in central Brussels, particularly around Place de la Monnaie. Cultural institutions often offer special May Day programs highlighting workers' history and social progress. Public parks become filled with picnickers and families enjoying the spring holiday. Evening concerts often feature traditional and contemporary Belgian music in public squares."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "notes": "Early May brings excellent spring weather with blooming gardens throughout the city. The Parc du Cinquantenaire showcases late spring flowering collections in spectacular display. The terraces of Grand Place and surrounding squares fill with visitors enjoying Belgian beer in sunshine. Bicycle paths along the canal become busy with locals and tourists exploring the waterfront. The Atomium and Mini-Europe offer excellent perspectives on the city under ideal weather conditions."
        },
        {
          "days": [15, 16, 17, 18, 19, 20],
          "score": 5,
          "special": true,
          "event": "Brussels Jazz Weekend",
          "notes": "Mid-May hosts the Brussels Jazz Weekend, transforming the city with music performances throughout the historic center. The main stages draw thousands to central squares with international jazz artists. Cultural institutions offer special exhibitions highlighting jazz history and art throughout the city. Concerts, workshops, and community events take place in venues from historic squares to contemporary art spaces. Jazz Village at Place de la Monnaie becomes a central information point and gathering space for festival participants."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Iris Festival",
          "notes": "Late May features the Iris Festival, Brussels' regional holiday celebration. The city comes alive with cultural events, music performances, and street entertainment. The Grand Place hosts major concerts and light shows. The Parc du Cinquantenaire becomes a hub of activities with food stalls and family entertainment. The European Quarter features special exhibitions and open houses. The festival culminates with spectacular fireworks over the city center."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 8,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 5,
          "notes": "Early June brings excellent weather with long daylight hours perfect for exploring Brussels. Outdoor markets throughout the city expand with local produce and artisanal products. The historic city center buzzes with activity from morning until late evening. The Parc du Cinquantenaire becomes popular for picnics with spectacular views of the Triumphal Arch. The Royal Greenhouses typically close their spring season with special events. The outdoor swimming facilities at various city pools open for the summer season."
        },
        {
          "days": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "special": true,
          "event": "Fête de la Musique",
          "notes": "Mid-June features the Fête de la Musique with performances throughout Brussels. The summer solstice brings the year's longest days with special sunset celebrations at various venues. Open-air concerts take place in historic squares and park amphitheaters across the city. Art installations appear in public spaces, particularly along the canal. Cultural venues extend their hours with special programming and performances. The city's urban beach venues open along the canal with lounge areas and summer bars."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Brussels Summer Festival",
          "notes": "Late June marks the beginning of the Brussels Summer Festival with outdoor events, music, and cultural activities. The festival transforms various city locations with cultural events. Pop-up summer bars appear throughout the city, particularly in park spaces and along the waterfront. Brussels' historic squares create cooling spaces during warm days. Guided architectural tours become popular, exploring the city's mix of medieval, Renaissance, and contemporary buildings. The fashion district features summer collections at designer boutiques and concept stores."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 4,
          "notes": "Early July brings summer weather perfect for outdoor activities throughout Brussels. The Brussels Summer Festival continues with performances in parks and unique urban venues. Open-air cinema screenings take place in various locations, particularly at outdoor amphitheaters. Canal cruises operate at full capacity with special sunset and dinner cruises available. The city beaches along the canal become social hubs with outdoor bars and weekend DJs. The historic center remains active into late evening with outdoor dining and street performances."
        },
        {
          "days": [10, 11],
          "score": 4,
          "special": true,
          "event": "Flemish Holiday",
          "notes": "Flemish Community Day brings cultural celebrations to Brussels with special exhibitions highlighting Flemish history, art, and cultural contributions throughout the city. Traditional music and dance performances take place in historic squares and cultural venues. Flemish culinary specialties feature prominently at restaurants and food markets. Some government offices may be closed, but all tourist attractions remain open with festive atmosphere."
        },
        {
          "days": [12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Mid-July is peak tourist season with warm weather and international visitors throughout Brussels. Boat tours of the canal operate on extended schedules with multiple daily departures. The Royal Museums of Fine Arts welcome visitors to see their collection of masterpieces in summer light. The historic center becomes busy, particularly around Grand Place and Place du Grand Sablon. The Atomium rooftop provides spectacular panoramic views of the city. The Parc du Cinquantenaire hosts weekend events with food trucks and recreational activities."
        },
        {
          "days": [21],
          "score": 5,
          "special": true,
          "event": "Belgian National Day",
          "notes": "Belgian National Day celebrates the country's independence with special events throughout Brussels. Military and civic parades take place in central locations with patriotic displays and music. The royal family makes appearances at official ceremonies broadcast throughout the city. Fireworks displays illuminate the city skyline in evening celebrations. Belgian flags decorate public buildings and streets throughout the historic center. Most government offices and some businesses close, but tourist attractions remain open with festive activities."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Bruxelles les Bains",
          "notes": "Late July features Bruxelles les Bains, the city's urban beach festival along the canal. Concert venues range from historic squares to contemporary performance spaces and parks. International performers join local artists for diverse programming across multiple genres. Outdoor stages appear in unexpected locations, activating different neighborhoods beyond the tourist center. Evening performances take advantage of long summer twilight with outdoor events running late. The waterfront becomes particularly active with performances against the backdrop of the canal."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 13,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early August continues summer weather with many locals on vacation away from the city. International tourism reaches its peak, particularly from neighboring European countries. The Brussels Summer Festival continues with cultural events throughout the city. Urban beaches and swimming facilities operate at full capacity during hot days. The historic center remains lively with outdoor dining into late evening hours. The European Quarter welcomes international visitors with multilingual tours and exhibitions."
        },
        {
          "days": [15],
          "score": 3,
          "special": true,
          "event": "Assumption Day",
          "notes": "Assumption Day is a religious holiday throughout Belgium with special services at Cathedral of St. Michael and St. Gudula and other churches. This Catholic feast day brings processions in some historic neighborhoods. Some businesses may have limited hours, but most tourist attractions remain open. Traditional family gatherings make local restaurants busy, particularly for lunch services. The holiday creates a brief mid-week pause during the busy summer tourism season."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Late August brings pleasant summer weather and the approach of autumn, perfect for outdoor exploration. The outdoor café culture reaches its peak with all terraces open throughout the historic center. Brussels' parks host weekend events with food trucks and live music. The Parc du Cinquantenaire is particularly beautiful with late summer foliage complementing the monuments. Canal cruises operate on extended schedules with sunset tours becoming increasingly popular. The fashion district launches early autumn collections in boutique displays."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 13,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 5,
          "special": true,
          "event": "Belgian Beer Weekend",
          "notes": "Early September features the Belgian Beer Weekend, a major beer festival at Grand Place. Over 50 Belgian breweries showcase their traditional beers in the historic square. The festival highlights Belgium's brewing heritage with special tastings and educational events. Local chefs prepare traditional Belgian dishes designed to pair with the regional beers. Brewing demonstrations and beer history exhibitions educate visitors about Belgium's beer culture. Food stalls showcase local specialties including Belgian fries, waffles, and cheese."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16],
          "score": 5,
          "notes": "Mid-September offers excellent post-peak season conditions with warm weather continuing but fewer tourists. The Brussels Summer Festival concludes with final performances in venues throughout the city. Schools resume, returning a more local atmosphere to many neighborhoods and attractions. Canal cruises continue to operate regular schedules with pleasant temperatures for sightseeing. The fashion district prepares for the autumn season with new collections appearing in boutiques. Museum exhibitions change as cultural institutions launch their autumn programs."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Brussels Comic Strip Festival",
          "notes": "Late September hosts the Brussels Comic Strip Festival, celebrating the city's status as a global comic art center. Special exhibitions appear throughout the city highlighting Belgian comic art heritage. The Comic Strip Route becomes particularly popular with guided tours of the city's comic murals. International comic artists present their works with signings and panel discussions. Pop-up exhibitions appear throughout the city center. The Belgian Comic Strip Center offers extended hours and special exhibitions."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "European Heritage Days",
          "notes": "The end of September features European Heritage Days when normally closed historic buildings open to visitors. Architectural treasures that are usually private become accessible with special guided tours and exhibitions. Historical preservation experts offer insights into restoration projects throughout the city. The Royal Palace opens its doors to the public for a limited period. Private mansions in the historic center reveal their magnificent interiors and art collections. Religious buildings open their restricted areas including towers, crypts, and private chapels."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "notes": "Early October brings beautiful fall colors and comfortable temperatures perfect for cultural exploration. The Royal Museums of Fine Arts and other cultural institutions launch their major autumn exhibitions. The Parc du Cinquantenaire and other city parks transform with spectacular autumn foliage. The Magritte Museum becomes especially popular as indoor cultural attractions gain visitors. The cultural season begins in earnest with theater, dance, and musical performances throughout the city. Coffee houses and traditional Belgian chocolate shops see increased activity as the weather cools."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
          "score": 4,
          "special": true,
          "event": "Brussels Chocolate Week",
          "notes": "Mid-October features Brussels Chocolate Week with chocolate tastings, workshops, and tours throughout the city. Historic chocolate shops and modern chocolatiers participate with special events and demonstrations. Belgian chocolate masters offer insights into traditional techniques and modern innovations. Chocolate-themed walking tours explore the city's sweet history. Evening events combine chocolate tastings with wine pairings at partner restaurants. The Chocolate Museum offers special exhibitions and extended hours during the festival."
        },
        {
          "days": [29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Halloween Events",
          "notes": "Late October brings Halloween celebrations with special themed events throughout Brussels. Historic locations like the Grand Place and Galeries Royales Saint-Hubert host atmospheric tours with local folklore. The Atomium organizes family-friendly Halloween activities during daytime hours. Museum Night tours offer special spooky-themed explorations of cultural institutions after hours. Belgian chocolate shops create elaborate Halloween-themed displays and special edition treats. Bars and restaurants in the historic center host costume parties and themed menus."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 7,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day",
          "notes": "All Saints' Day is an important religious holiday in Belgium with special services at major churches. The Cathedral of St. Michael and St. Gudula holds particular ceremonies honoring saints and remembering the deceased. Many businesses are closed as families traditionally visit cemeteries to honor ancestors. Museums and cultural attractions generally remain open but may have adjusted hours. The day marks the beginning of the autumn-winter transition in local cultural calendars."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 3,
          "notes": "Early November brings full autumn atmosphere with cooling temperatures and occasional mist along the canal. Indoor cultural venues become increasingly popular, particularly museums and historic house tours. The Magritte Museum and Royal Museums of Fine Arts offer engaging exhibitions ideal for cooler days. Traditional Belgian restaurants feature seasonal game dishes and autumn specialties. The fall foliage reaches its peak in park areas, particularly at Parc du Cinquantenaire and the Royal Park."
        },
        {
          "days": [11],
          "score": 3,
          "special": true,
          "event": "Armistice Day",
          "notes": "Armistice Day commemorates the end of World War I with ceremonies at war memorials throughout Brussels. Official remembrance events take place at the city's main memorials with military honor guards. The European Quarter holds special significance due to Brussels' role in post-war European integration. Museums may feature special exhibitions related to Belgium's war history and peace efforts. Some government offices and businesses observe a moment of silence at 11:00 AM."
        },
        {
          "days": [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "Mid-to-late November sees cooler weather making museums and indoor activities increasingly attractive. The Royal Museums of Fine Arts showcase their Belgian Masters collection in ideal viewing conditions. The Musical Instrument Museum welcomes music enthusiasts to its historic building and collections. Belgian chocolate workshops become particularly popular as the holiday season approaches. The European Quarter offers insights into Brussels' role in international politics with Christmas shopping beginning. Historic cafés and traditional pubs provide cozy environments with seasonal Belgian beers."
        },
        {
          "days": [30],
          "score": 3,
          "special": true,
          "event": "Winter Wonders begins",
          "notes": "The end of November marks the beginning of Winter Wonders preparations throughout Brussels. The first Advent Sunday typically falls near this date, beginning the Christmas season officially. Christmas market stalls begin construction in Grand Place, Place de la Monnaie, and other central squares. Light installations appear throughout the historic center with testing and final adjustments underway. Department stores and boutiques reveal their holiday window displays with elaborate decorations. The ice rink installation begins at Place de la Monnaie."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "special": true,
          "event": "Winter Wonders Christmas Market",
          "notes": "December transforms Brussels with the Winter Wonders Christmas Market spreading across the historic center in a winter wonderland. Over 200 wooden chalets in Grand Place, Place de la Monnaie, and surrounding streets sell crafts, gifts, and seasonal food. The historic facades of the Grand Place guildhalls provide a spectacular backdrop illuminated with seasonal projections. Place de la Monnaie features a large ice skating rink surrounded by food stalls and warming stations. Belgian specialties like glühwein, jenever (gin), waffles, and speculoos cookies are available throughout the market. Special events include choir performances, visit from Saint Nicholas (December 6), and Three Kings celebrations. The aroma of roasting chestnuts and freshly made waffles fills the air as visitors explore the illuminated historic streets."
        },
        {
          "days": [24, 25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas",
          "notes": "The Christmas period brings a festive atmosphere to Brussels though many venues have limited hours. Christmas Eve (December 24) sees early closures as Belgians prepare for family celebrations in the evening. The Cathedral of St. Michael and St. Gudula holds special Christmas services including midnight mass with exceptional musical programs. Christmas Day (December 25) finds most businesses closed as families gather for traditional meals and celebrations. December 26 (Boxing Day) is also observed with limited openings and continued family gatherings. The Christmas markets remain closed during these days but the light installations throughout the city create a magical atmosphere for evening walks."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year's sees Brussels in a quieter but still festive mood. Major museums including the Royal Museums of Fine Arts, Magritte Museum, and Musical Instrument Museum reopen with normal hours. Winter sales begin at boutiques along Rue Neuve and the Galeries Royales Saint-Hubert. The ice skating rink at Place de la Monnaie continues operation with fewer crowds than pre-Christmas period. Restaurants offer special holiday menus featuring Belgian winter specialties. The city's historic churches display elaborate nativity scenes and seasonal decorations."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve",
          "notes": "New Year's Eve brings celebrations throughout Brussels with the main festivities centered at Grand Place. Fireworks displays illuminate the city skyline at midnight. Live music performances and DJ sets entertain crowds in the main squares before and after midnight. Restaurants offer special fixed-price New Year's Eve menus (reservations essential). Canal cruises provide unique perspectives on the fireworks with champagne and dining packages. The historic city center becomes the focal point for both locals and visitors celebrating the year's end."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 1,
      "tourismLevel": 6
    }
  },
  "activityTypes": {
    "spring": [
      "Art Brussels Week (late March)",
      "Royal Greenhouses of Laeken Limited Opening (April)",
      "Parc du Cinquantenaire Spring Blooms (March through May)",
      "European Quarter Spring Tours and Exhibitions",
      "Cathedral of St. Michael and St. Gudula Spring Concert Series",
      "Parc du Cinquantenaire in Bloom",
      "Brussels International Fantastic Film Festival (April)",
      "Canal-side Cycling Tours"
    ],
    "summer": [
      "Brussels Summer Festival (June through August)",
      "Open-Air Cinema throughout the City",
      "Bruxelles les Bains Urban Beach (July)",
      "Brussels Urban Beaches and Waterfront Bars",
      "Canal Cruises and European Quarter Tours",
      "Belgian National Day Celebrations (July 21)",
      "Parc du Cinquantenaire Summer Activities and Water Features",
      "City Center Swimming Pools (June through September)"
    ],
    "autumn": [
      "Brussels Comic Strip Festival (September)",
      "European Heritage Days (late September)",
      "Brussels Chocolate Week (October)",
      "Cultural Season Openings at Theater and Concert Venues",
      "Magritte Museum Autumn Exhibitions",
      "Belgian Beer Tasting Tours in Historic Pubs",
      "Rue Neuve Shopping Boulevard Autumn Collections",
      "Musical Instrument Museum Special Exhibitions"
    ],
    "winter": [
      "Winter Wonders Christmas Market (late November to December 23)",
      "Ice Skating at Place de la Monnaie (December through January)",
      "Winter in Brussels Festival Light Installations",
      "Cathedral Concerts and Holiday Performances",
      "Royal Museums of Fine Arts Winter Exhibitions",
      "Belgian Chocolate Workshops and Tastings",
      "European Quarter Holiday Shopping and Special Tours",
      "New Year's Eve Celebrations at Grand Place"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to high tourism",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very high crowds",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or limited activities"
  }
}