{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Neujahrstag)",
          "notes": "New Year's Day is a public holiday throughout Switzerland. Most attractions and shops in Lucerne operate with limited hours. The city is relatively quiet as residents recover from New Year's Eve celebrations. Cold winter temperatures averaging around 0°C (32°F) and short daylight hours characterize this period. Lake Lucerne often has a mystical atmosphere with morning fog and snow-capped mountains creating a picturesque winter landscape."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 2,
          "special": true,
          "event": "Berchtold's Day (January 2) & Three Kings Day (January 6)",
          "notes": "Berchtold's Day (January 2) is observed in parts of Switzerland, extending the New Year holiday. Three Kings Day (January 6) marks the end of the Christmas season with special pastries and traditions. Many shops and attractions may have limited hours during this period. The illuminated Christmas decorations often remain until this date."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14],
          "score": 2,
          "notes": "Mid-January is typically cold in Lucerne with temperatures between -2°C and 3°C (28°F to 37°F). Daylight is limited to around 8-9 hours. This is low season for tourism, so major attractions like the Swiss Museum of Transport and the Rosengart Collection have fewer crowds. Winter fog sometimes blankets the lake in the mornings, creating atmospheric views. The covered Chapel Bridge maintains its charm in winter conditions, sometimes dusted with snow. Hotel rates are at their lowest during this period."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Lilu Light Festival Lucerne",
          "notes": "The last half of January features the Lilu Light Festival, which transforms Lucerne with artistic light installations illuminating buildings, bridges, squares, and the lakefront. The festival creates a magical winter atmosphere in the city, with light artists from around the world presenting their works. This innovative event brings color and vibrancy to the darkest month of the year. Temperatures remain cold, but the festival provides an excellent reason to explore the city after dark."
        }
      ],
      "weatherHighC": 3,
      "weatherLowC": -2,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11],
          "score": 3,
          "notes": "Early February continues with winter conditions but sometimes features slightly milder days than January. Tourism remains low, making it an excellent time to enjoy indoor attractions like the Rosengart Collection and Swiss Museum of Transport without crowds. February is perfect for day trips to nearby winter destinations like Mount Pilatus, Rigi, or Titlis for snow activities. This is a great month to experience authentic Swiss fondue on a dinner cruise around Lake Lucerne or at traditional restaurants in the Old Town."
        },
        {
          "days": [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "special": true,
          "event": "Lucerne Carnival (Fasnacht)",
          "notes": "The highlight of February is the famous Lucerne Carnival (Fasnacht), one of Switzerland's most vibrant carnival celebrations. The exact dates vary each year (based on the Catholic calendar) but typically fall in February or early March. The festivities officially begin with the 'Urknall' (big bang) at 5am on Fat Thursday (Schmutziger Donnerstag) and continue until Ash Wednesday. The medieval Old Town fills with costumed revelers, confetti, and distinctive brass bands called Guggenmusiken playing energetic (and intentionally cacophonous) music. The celebration features decorated floats, street parties, and costumed revelers. Valentine's Day (February 14) is also celebrated with special menus at romantic restaurants overlooking Lake Lucerne and the mountains."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": -2,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
          "score": 3,
          "special": true,
          "event": "FUMETTO International Comics Festival",
          "notes": "March brings the first signs of spring to Lucerne, with temperatures gradually rising and daylight hours increasing noticeably. Early spring flowers begin to appear in lakeside gardens and parks. In mid-to-late March, the FUMETTO International Comics Festival transforms Lucerne into a hub for comic art enthusiasts, with exhibitions spread throughout venues across the city. The festival showcases international comic artists, graphic novelists, and illustrators through exhibitions, workshops, and competitions. This is still a relatively quiet tourist season, offering good value for accommodations and easy access to popular attractions."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring Equinox & Easter (if in March)",
          "notes": "Late March sees Lucerne awakening from winter. Easter celebrations may occur in late March (date varies yearly), bringing special church services at the Hofkirche (Church of St. Leodegar), decorated fountains, and festive markets. As spring progresses, cafe terraces along the lake and river promenades begin to open on warmer days, creating a pleasant atmosphere. Lake cruise schedules expand with more frequent departures. The Musegg Wall and towers typically reopen for the season in late March after winter closure."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 1,
      "tourismLevel": 3
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "special": true,
          "event": "Easter Celebrations (date varies) & Lucerne Spring Festival",
          "notes": "Early April often hosts Easter celebrations in Lucerne. The magnificent Hofkirche (Church of St. Leodegar) holds special services with music performances, while the Old Town features spring decorations and Easter markets. The weather becomes noticeably milder, making outdoor activities more pleasant. The prestigious Lucerne Spring Festival brings world-class orchestral performances to the renowned Culture and Congress Center (KKL), attracting classical music enthusiasts."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Mid-to-late April sees spring truly arriving in Lucerne. Lakeside gardens begin to show beautiful blooms while offering spectacular views over Lake Lucerne and the surrounding mountains. Boat cruises on Lake Lucerne become highly recommended as the mountain scenery is enhanced by spring colors and often still snow-capped peaks. The historical cogwheel railways to Rigi and Pilatus usually resume full service if they had limited winter schedules. Tourist numbers start to rise, but the city is still relatively uncrowded. Rain showers are common but typically don't last long, and they contribute to the lush spring colors throughout the region."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Tag der Arbeit)",
          "notes": "May 1st is Labor Day and may be observed with some events in Lucerne, though it's not always a full public holiday throughout Switzerland. This is also a day for spring celebrations as the weather continues to improve, with many locals gathering in parks and along the lakefront promenades."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Ascension Day & Early Tourist Season",
          "notes": "May brings reliably good weather to Lucerne with average temperatures between 10°C and 19°C (50-66°F). The lake and mountain activities become fully operational, with the famous 'Golden Round Trip' to Mount Pilatus (combining boat, cogwheel railway, and cable cars) available in its complete form. Ascension Day (40 days after Easter) is a public holiday in Switzerland with special events. This is the beginning of the tourist season, but before the summer peak, making it an excellent time to visit with good weather and manageable crowds. Lake water temperatures are still too cold for comfortable swimming, but lakeside promenades are perfect for strolling and cycling. The outdoor terraces at lakefront restaurants like Bürgenstock or the elegant hotels along the shoreline become popular for dining with spectacular Alpine views."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 8,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 5,
          "special": true,
          "event": "Pentecost & Early Summer Activities",
          "notes": "Early June brings the beginning of summer weather to Lucerne. Pentecost (Whit Monday) is a public holiday falling 50 days after Easter. Lake Lucerne begins to warm up enough for swimming at locations like Ufschötti Beach and the Lido, though the water remains refreshingly cool. Outdoor dining becomes extremely popular along the lake at restaurants like those in the elegant lakeside hotels. Mountain excursions operate at full capacity with all hiking trails becoming accessible as snow retreats to higher elevations."
        },
        {
          "days": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Mid-to-late June brings long daylight hours (up to 16 hours), pleasant temperatures, and the true beginning of Lucerne's summer season. The summer solstice is marked with various events. Lake Lucerne temperatures rise enough to make swimming comfortable, and beaches like Ufschötti and the Lido fill with locals and visitors enjoying water activities. This is a perfect time for boat cruises on vintage paddle steamers, hiking on the surrounding mountains for panoramic views, and enjoying the lively atmosphere of outdoor cafes and bars throughout the city. Tourism increases but remains manageable. The lake's crystal-clear waters provide perfect refreshment on warm days."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 12,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Blue Balls Festival & Swiss National Day Preparations",
          "notes": "July is one of the warmest months in Lucerne with temperatures averaging 24°C (75°F) but sometimes reaching 30°C (86°F) or higher. This is peak tourist season with visitors from around the world. The highlight is the Blue Balls Festival, a vibrant music and arts festival featuring performances across multiple genres at venues along the lakefront and throughout the city. Lake swimming is at peak popularity, with the clean Alpine waters offering perfect refreshment on hot days. Ufschötti Beach becomes a social hub for locals and visitors alike. Boat cruises are running at maximum frequency, and mountain excursions to Pilatus, Rigi, and Titlis are in high demand. Outdoor dining along the lake becomes a quintessential Lucerne experience. Swiss National Day preparations become visible toward the end of the month as the August 1st celebration approaches."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 14,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Swiss National Day (Bundesfeier)",
          "notes": "August 1st is Swiss National Day, celebrating the founding of the Swiss Confederation in 1291. Lucerne hosts significant events including fireworks over the lake, boat parades, traditional performances, and official ceremonies. The illuminated Chapel Bridge and Water Tower create a magical backdrop for the celebrations. The Rütli Meadow on Lake Lucerne, considered the birthplace of Switzerland, holds special commemorative events. Most businesses close for the holiday, but tourist attractions remain open. This is one of the most festive days in the Swiss calendar, with Lucerne offering particularly spectacular celebrations due to its lakeside setting and historic connection to Swiss nationhood."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Lucerne Festival in Summer",
          "notes": "August continues with ideal summer weather. The prestigious Lucerne Festival in Summer, one of the world's premier classical music festivals, begins in mid-August and runs into September. The festival features top orchestras, conductors, and soloists performing in the acoustically perfect KKL Concert Hall. This internationally renowned event draws classical music enthusiasts from around the world. Lake activities remain extremely popular, with swimming, boating, and water sports at their peak. The numerous hiking trails in the surrounding mountains offer spectacular alpine experiences with wildflowers in bloom at higher elevations. Accommodations should be booked well in advance during this peak season. Despite high tourism, the relaxed atmosphere and excellent infrastructure ensure Lucerne remains a pleasant destination. This is considered high season for good reason - the combination of perfect weather, cultural events, and full operation of all attractions makes it ideal for experiencing Lucerne at its best."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 14,
      "tourismLevel": 10
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Lucerne Festival Continues",
          "notes": "Early September continues with the Lucerne Festival in Summer, offering world-class classical music performances. The weather remains pleasant with average temperatures around 20°C (68°F). Lake swimming is still enjoyable as the water retains its summer warmth. The crowds begin to thin slightly as European summer holidays end, creating a good balance of atmosphere without overwhelming tourism. The surrounding mountains offer excellent hiking with stable weather conditions typically prevailing. This is widely considered one of the best times to visit Lucerne."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Early Autumn Season",
          "notes": "Late September brings autumn to Lucerne with pleasant temperatures around 17°C (63°F) and beautiful fall colors beginning to appear around the lake and in the surrounding mountains. Tourism decreases further, making this an excellent time to visit with good weather and fewer crowds. The cultural season begins with new exhibitions at museums like the Rosengart Collection and Swiss Museum of Transport. Lake cruises continue with less crowded boats, offering more peaceful experiences. Mountain excursions like the Golden Round Trip to Pilatus remain fully operational but with fewer visitors. Lake swimming becomes less common but is still possible on warmer days. The UNESCO-listed Old Town and Chapel Bridge take on beautiful golden hues as autumn begins. This period offers many of the advantages of summer with fewer tourists and more moderate temperatures."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Autumn Fair (Lozärner Määs) & Fall Foliage",
          "notes": "October brings autumn colors to their peak in Lucerne, with the trees around the lake and mountains showing stunning foliage. Temperatures cool significantly with averages around 8-15°C (46-59°F). The highlight is the Autumn Fair (Lozärner Määs), a 500-year-old traditional event featuring carnival rides, market stalls, food vendors, and festive traditions across several city locations. This is a good time for museum visits, with the Rosengart Collection, Swiss Museum of Transport, and Richard Wagner Museum particularly popular. Tourism continues to decrease, creating good opportunities for value accommodation and uncrowded attractions. Boat cruises operate on reduced autumn schedules but offer beautiful perspectives of fall colors reflecting in the lake. Rigi and other mountains surrounding the lake offer spectacular autumn hiking experiences with golden forests and clear mountain views. Morning fog over the lake creates magical photography opportunities. This is an excellent month for visitors seeking natural beauty, cultural experiences, and fewer crowds."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 6,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day (Allerheiligen)",
          "notes": "All Saints' Day on November 1st is observed in Catholic parts of Switzerland. The impressive Hofkirche (Church of St. Leodegar) in Lucerne holds special services, and some people visit cemeteries to honor deceased family members."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "special": true,
          "event": "Lucerne Blues Festival & Pre-Winter Season",
          "notes": "November brings increasingly cold conditions to Lucerne, with temperatures around 5-10°C (41-50°F) and daylight hours significantly reduced. This is low season for tourism, though the city maintains a vibrant local atmosphere with cultural events and cozy indoor activities. The Lucerne Blues Festival is a highlight, featuring international artists performing in intimate venues throughout the city. Traditional winter foods appear on restaurant menus, with fondue and raclette becoming particularly popular. Mountain excursions may have limited operation depending on weather conditions, but the Swiss Museum of Transport and other indoor attractions remain excellent options. Fog is common, sometimes shrouding the lake for days at a time, but when it clears, the views of the first snow on the surrounding mountains can be spectacular. Hotel rates are lower, making this a good value time to visit despite the cooler, sometimes gray weather. Toward the end of November, Christmas markets begin to open, creating a magical atmosphere in the medieval Old Town."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 2,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "special": true,
          "event": "Christmas Markets Begin",
          "notes": "Early December brings winter conditions with temperatures around 0-5°C (32-41°F) and very short daylight hours. Christmas markets open throughout the city, with the market at Franziskanerplatz being particularly atmospheric. These markets offer traditional crafts, decorations, and seasonal foods like raclette, Swiss sausages, and Glühwein (mulled wine). The compact nature of Lucerne's Old Town creates an intimate, cozy market atmosphere. The medieval setting with decorative lights and Alpine backdrop is particularly enchanting after dusk."
        },
        {
          "days": [6],
          "score": 4,
          "special": true,
          "event": "St. Nicholas Day (Samichlaus)",
          "notes": "December 6th is St. Nicholas Day, when Samichlaus (Swiss German for St. Nicholas) and his helper Schmutzli visit children, bringing nuts, fruits, and small gifts. Various events for children take place throughout the city, and special treats appear in bakeries. This traditional celebration is particularly charming in Lucerne's historic setting."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "notes": "Mid-December sees Lucerne at its most festive, with decorations, lights, and special events throughout the UNESCO-listed Old Town. The illuminated Chapel Bridge creates a particularly magical Christmas scene reflected in the waters of the Reuss River. Shopping areas in the Old Town are beautifully decorated and buzzing with activity. Cultural events like Christmas concerts take place in Lucerne's churches, particularly the Hofkirche. Fog, snow, and crisp cold days all create different but equally atmospheric winter experiences. Winter boat cruises on Lake Lucerne offer unique perspectives of the snow-dusted mountains. Special Christmas-themed fondue cruises combine two Swiss winter traditions. Mount Pilatus and Rigi offer winter sports and activities when snow conditions permit."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Heiligabend & Weihnachten)",
          "notes": "Christmas is celebrated both on Christmas Eve (December 24) and Christmas Day (December 25) in Switzerland. Christmas Eve typically features family gatherings and traditional meals, while Christmas Day is a public holiday with continued celebrations. Boxing Day (December 26) is also observed in many Swiss cantons. Many restaurants and attractions close early on Christmas Eve and may remain closed on Christmas Day. The illuminated Old Town creates a magical atmosphere, especially with snow. Public transportation runs on limited schedules."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees Lucerne quieter but still festive. Winter activities like mountain excursions to see snow on Pilatus or Rigi and visits to museums are popular among tourists. Many restaurants and shops reopen after brief Christmas closures. This can be a good time to find post-Christmas shopping deals and enjoy the winter atmosphere with fewer crowds than earlier in December."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Silvester)",
          "notes": "New Year's Eve celebrations take place throughout Lucerne's Old Town, with restaurants offering special menus (advance reservation essential), while hotels and cultural venues host celebration events. The lakefront becomes a gathering place for viewing informal fireworks displays reflected in Lake Lucerne. The historic backdrop of the UNESCO-listed Old Town and Chapel Bridge creates a uniquely atmospheric setting for welcoming the New Year. The KKL often hosts a prestigious New Year's concert for a more cultural celebration. The combination of winter scenery, festive atmosphere, and the magical lakeside setting makes Lucerne a romantic destination for New Year celebrations."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": -1,
      "tourismLevel": 4
    }
  },
  "activityTypes": {
    "spring": [
      "Cruising on Lake Lucerne as nature awakens and mountains emerge from winter snow",
      "Attending the Lucerne Spring Festival for world-class orchestral performances",
      "Exploring the Musegg Wall and towers as they reopen after winter",
      "Visiting Alpine gardens to see the first mountain flowers blooming",
      "Taking the cogwheel railway up Rigi or Pilatus for spectacular spring views",
      "Attending the FUMETTO International Comics Festival",
      "Cycling along Lake Lucerne's scenic shoreline paths",
      "Enjoying outdoor 'café culture' as lakeside terraces reopen for the season",
      "Taking boat trips to scenic villages around Lake Lucerne"
    ],
    "summer": [
      "Swimming in Lake Lucerne at Ufschötti Beach or the Lido",
      "Experiencing the prestigious Lucerne Festival in Summer at the KKL",
      "Taking the 'Golden Round Trip' to Mount Pilatus (boat, cogwheel railway, cable car)",
      "Swiss National Day celebrations (August 1) with fireworks over the lake",
      "Attending the Blue Balls Festival for diverse music performances",
      "Hiking on surrounding mountains with trails fully accessible",
      "Village-hopping by boat to explore charming settlements around Lake Lucerne",
      "Dining at outdoor restaurants along the lake and river",
      "Sunset cruises on historic paddle steamers on Lake Lucerne"
    ],
    "autumn": [
      "Enjoying the spectacular fall foliage around Lake Lucerne and on Mount Rigi",
      "Attending the traditional Autumn Fair (Lozärner Määs)",
      "Experiencing the Lucerne Blues Festival",
      "Exploring Lucerne's outstanding museums as the cultural season begins",
      "Savoring seasonal game dishes at traditional restaurants",
      "Photographing morning fog on the lake with mountains beyond",
      "Hiking in surrounding mountains with golden autumn forests",
      "Wine tasting of local Swiss varieties during harvest season",
      "Taking advantage of reduced crowds at major attractions"
    ],
    "winter": [
      "Exploring the Christmas markets at Franziskanerplatz and other locations",
      "Experiencing the Lilu Light Festival with illuminations throughout the city",
      "Participating in Lucerne Carnival (Fasnacht) activities if visiting in February",
      "Taking a winter excursion to snow-covered Mount Titlis",
      "Enjoying a fondue dinner cruise on Lake Lucerne",
      "Attending concerts at the world-class KKL Concert Hall",
      "Photographing the Chapel Bridge and Water Tower in winter conditions",
      "Day trips to nearby ski resorts in central Switzerland",
      "Warming up in historic cafes with hot chocolate and pastries"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, cold or wet weather, very low tourism (some business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, limited activities or accessibility"
  }
}