{
    "Spring": {
        "activities": [
            {
                "name": "Visit Keukenhof Gardens (nearby)",
                "type": "Day Trip/Nature/Flowers",
                "description": "Experience the world-famous Keukenhof Gardens in nearby Lisse, showcasing millions of tulips, daffodils, and hyacinths in breathtaking displays. A quintessential Dutch spring experience.",
                "indoor": false,
                "best_time": "Daytime (Late March to Mid-May)",
                "price_range": "Moderate to High (Entry + Transport)",
                "seasonal_notes": "Only open for approx. 8 weeks in spring. Peak bloom varies slightly each year but is usually mid-April.",
                "booking_tips": "Book tickets and transport (e.g., combi-ticket with bus from Haarlem/Schiphol) well in advance, especially for weekends and peak bloom. Go early on a weekday to avoid the biggest crowds."
            },
            {
                "name": "King's Day (Koningsdag) in Haarlem",
                "type": "National Holiday/Festival",
                "description": "Haarlem celebrates King's Day with enthusiasm! Enjoy city-wide flea markets ('vrijmarkt'), live music, decorated boats on the Spaarne, orange-clad crowds, and street parties.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free (activities/market browsing)",
                "seasonal_notes": "April 27th (or 26th if 27th is a Sunday). Busy and festive atmosphere, especially around the Grote Markt and along the Spaarne.",
                "booking_tips": "Wear orange! Explore different areas like the Grote Markt and Vijfhoek. City center access is limited."
            },
            {
                "name": "Bloemencorso Bollenstreek (Flower Parade)",
                "type": "Parade/Festival",
                "description": "Witness the spectacular annual flower parade travelling from Noordwijk to Haarlem, featuring floats adorned with thousands of flowers.",
                "indoor": false,
                "best_time": "One Saturday in April (check specific date)",
                "price_range": "Free (to watch along the route)",
                "seasonal_notes": "The parade arrives in Haarlem in the evening, creating a festive atmosphere. The floats are often displayed in Haarlem the following day.",
                "booking_tips": "Find a viewing spot along the route in Haarlem early, especially near the city center. Check the official route and timings."
            },
            {
                "name": "Enjoy Haarlemmerhout Park",
                "type": "Nature/Recreation",
                "description": "Stroll through the oldest public park in the Netherlands as it bursts into spring bloom. Enjoy the deer park, pavilions, and walking paths.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Beautiful awakening of nature in a historic park setting.",
                "booking_tips": "Combine with a visit to the adjacent Frans Hals Museum (Hal location) or nearby neighborhoods."
            },
            {
                "name": "Terrace Season Opening in Haarlem",
                "type": "Food & Drink/Social",
                "description": "Haarlem's charming terraces on the Grote Markt, Botermarkt, and along the Spaarne river reopen. Enjoy the first al fresco drinks and bites.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Varies (Budget to Moderate)",
                "seasonal_notes": "Starts gaining popularity from March/April as weather permits.",
                "booking_tips": "Pick a spot with a view of St. Bavo's or the Spaarne. Sunny spots fill quickly."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Beach Day at Zandvoort or Bloemendaal aan Zee",
                "type": "Day Trip/Recreation/Beach",
                "description": "Take a short train or bike ride to the nearby coastal towns. Enjoy swimming, sunbathing, beach clubs, watersports, and the North Sea breeze.",
                "indoor": false,
                "best_time": "Daytime (Warm weather)",
                "price_range": "Budget (transport/own snacks) to High (fancy beach clubs)",
                "seasonal_notes": "Very popular during summer. Bloemendaal often has more trendy beach clubs, Zandvoort is a larger resort town.",
                "booking_tips": "Go early on sunny weekends as trains and beaches get crowded. Consider renting a bike in Haarlem for a scenic ride through the dunes."
            },
            {
                "name": "Haarlem Jazz & More Festival",
                "type": "Music Festival",
                "description": "Free multi-day music festival featuring jazz, soul, funk, and related genres on stages across the city center, mainly around the Grote Markt.",
                "indoor": false,
                "best_time": "Evenings (Several days in August - check dates)",
                "price_range": "Free",
                "seasonal_notes": "Creates a fantastic, lively atmosphere in the heart of Haarlem.",
                "booking_tips": "Check the performance schedule and wander between stages. Grab drinks from surrounding bars."
            },
            {
                "name": "Canal Cruise or Boat Rental on the Spaarne",
                "type": "Activity/Sightseeing",
                "description": "Enjoy Haarlem from the water. Take a guided canal cruise or rent a small electric boat ('sloep') to explore the Spaarne river and canals at your own pace.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate (Cruise or Rental costs)",
                "seasonal_notes": "Ideal way to see the city's gables, bridges, and waterside life in summer.",
                "booking_tips": "Book boat rentals in advance, especially on weekends. Cruises depart regularly near Teylers Museum."
            },
            {
                "name": "Outdoor Dining & Drinks (Grote Markt, Botermarkt)",
                "type": "Food & Drink/Social",
                "description": "Peak season for Haarlem's vibrant terrace culture. Enjoy long summer evenings dining and drinking outdoors on the main squares and charming side streets.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Varies",
                "seasonal_notes": "The city buzzes with outdoor activity. Botermarkt often has a slightly more local feel than Grote Markt.",
                "booking_tips": "Reservations recommended for dinner, especially at popular spots."
            },
            {
                "name": "Cycle Tour through Zuid-Kennemerland National Park",
                "type": "Day Trip/Nature/Activity",
                "description": "Rent bikes and explore the beautiful dune landscapes between Haarlem and the coast. Trails wind through forests, dunes, and past small lakes.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget to Moderate (Bike rental)",
                "seasonal_notes": "A refreshing escape from the city heat, chance to see wildlife (like Highland cattle or deer).",
                "booking_tips": "Plan your route using park maps. Combine with a beach visit."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Visit Museums (Frans Hals, Teylers)",
                "type": "Culture/History/Art",
                "description": "Ideal weather for delving into Haarlem's world-class museums. Explore the Dutch Masters at the Frans Hals Museum or the unique collections at Teylers Museum.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect for cooler or rainy days. Check for temporary exhibitions.",
                "booking_tips": "Book tickets online to save time, especially for weekend visits."
            },
            {
                "name": "Explore Hofjes in Autumn Light",
                "type": "Sightseeing/Cultural",
                "description": "Discover Haarlem's hidden almshouse courtyards, which take on a special atmosphere with autumn colors and softer light.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Quieter than summer, offering a peaceful exploration experience. Remember to respect residents' privacy.",
                "booking_tips": "Grab a hofjes walking route map from the tourist information office (VVV)."
            },
            {
                "name": "Cozy Cafes & Pubs",
                "type": "Social/Food & Drink",
                "description": "Enjoy the 'gezelligheid' of Haarlem's cafes with warm drinks and apple pie, or settle into a traditional pub for local beers and snacks ('borrelhapjes').",
                "indoor": true,
                "best_time": "Afternoon/Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Perfect for escaping chilly weather. Many pubs feature seasonal 'bokbier'.",
                "booking_tips": "Explore side streets off the Grote Markt for charming, less crowded options."
            },
            {
                "name": "Shopping in the 'Gouden Straatjes'",
                "type": "Shopping/Retail",
                "description": "Browse the unique boutiques, antique shops, and specialty stores in Haarlem's famed 'Golden Streets' (e.g., Kleine Houtstraat, Warmoesstraat) as they prepare for the festive season.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Varies",
                "seasonal_notes": "A pleasant indoor activity with unique finds.",
                "booking_tips": "Allow ample time for browsing these charming shopping streets."
            },
            {
                "name": "Attend Concerts at Philharmonie or Patronaat",
                "type": "Music/Culture",
                "description": "Check the autumn schedules for classical concerts at the Philharmonie or contemporary music gigs at the renowned Patronaat venue.",
                "indoor": true,
                "best_time": "Evenings",
                "price_range": "Moderate to High",
                "seasonal_notes": "The main cultural season kicks off in autumn.",
                "booking_tips": "Book tickets online in advance for popular acts or performances."
            }
        ]
    },
    "Winter": {
        "activities": [
             {
                "name": "Christmas Market & Winter Atmosphere",
                "type": "Market/Festival/Ambiance",
                "description": "Haarlem hosts one of the largest and most atmospheric Christmas markets in the Netherlands, typically over one weekend in December. Enjoy hundreds of stalls, festive lights, music, and glühwein.",
                "indoor": false, 
                "best_time": "One Weekend in early/mid-December (check dates)",
                "price_range": "Free (entry) / Varies (purchases)",
                "seasonal_notes": "The entire city center transforms into a festive wonderland. Very popular and crowded.",
                "booking_tips": "Check the official dates well in advance. Visit earlier in the day for slightly smaller crowds. Book accommodation early if staying overnight."
            },
             {
                "name": "Ice Skating (Temporary Rink)",
                "type": "Recreation",
                "description": "Often, a temporary outdoor ice skating rink is set up on one of the main squares (location can vary) during the winter months.",
                "indoor": false,
                "best_time": "Daytime/Evening (during operating season)",
                "price_range": "Budget to Moderate (entry + skate rental)",
                "seasonal_notes": "Availability and location depend on yearly organisation. Check local announcements.",
                "booking_tips": "Usually no booking needed, pay at the entrance. Dress warmly."
            },
            {
                "name": "Sinterklaas Arrival (Intocht) in Haarlem",
                "type": "Traditional/Family Event",
                "description": "Welcome Sinterklaas and his helpers as they arrive by boat on the Spaarne river, usually followed by a festive parade through the city.",
                "indoor": false,
                "best_time": "One Saturday Morning in mid-November",
                "price_range": "Free",
                "seasonal_notes": "A magical event primarily for children, marking the start of the Sinterklaas gift-giving season.",
                "booking_tips": "Find a good viewing spot along the Spaarne or the parade route early."
            },
            {
                "name": "Warm Up in Museums and Cafes",
                "type": "Culture/Food & Drink",
                "description": "Escape the cold by visiting Haarlem's excellent museums (Frans Hals, Teylers, Museum van de Geest) or enjoying hot chocolate and pastries in cozy cafes.",
                "indoor": true,
                "best_time": "Daytime/Afternoon",
                "price_range": "Budget (cafes) to Moderate (museum entry)",
                "seasonal_notes": "Perfect way to spend a cold or wet winter day.",
                "booking_tips": "Check museum opening times, especially around holidays."
            },
            {
                "name": "New Year's Dive (Nieuwjaarsduik) at Zandvoort",
                "type": "Tradition/Event (nearby)",
                "description": "Join thousands of brave souls for the traditional Dutch New Year's Dive into the chilly North Sea at nearby Zandvoort beach.",
                "indoor": false,
                "best_time": "Midday, January 1st",
                "price_range": "Free (to watch) / Small fee (often, to participate, includes hat)",
                "seasonal_notes": "A unique, albeit cold, Dutch tradition. Spectating is also popular.",
                "booking_tips": "Check the official Zandvoort event details for timing and registration if participating. Dress VERY warmly if spectating!"
            },
            {
                "name": "Enjoy Oliebollen and Winter Treats",
                "type": "Food & Drink",
                "description": "Find street stalls ('kramen') selling traditional Dutch winter treats like 'oliebollen' (doughnuts) and 'appelflappen' (apple turnovers), especially prevalent around Christmas and New Year.",
                "indoor": false,
                "best_time": "Late November to Early January",
                "price_range": "Budget",
                "seasonal_notes": "A delicious warm treat on a cold day.",
                "booking_tips": "Look for stalls near shopping areas or the Grote Markt. Best enjoyed fresh and warm."
            }
        ]
    }
} 