{
    "Spring": {
        "activities": [
            {
                "name": "Semana Santa (Holy Week)",
                "type": "Cultural/Religious",
                "description": "Experience Seville's world-famous Holy Week processions, featuring ornate religious floats (pasos), traditional music, and dramatic religious imagery through the historic streets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Dates vary each year (March-April) with processions throughout Holy Week, particularly impressive on Holy Thursday and Good Friday. Seville's processions are among the most elaborate in Spain.",
                "booking_tips": "Book accommodation months in advance. Arrive early to secure viewing spots along the official routes. Plaza de San Francisco and Avenida de la Constitución offer good vantage points."
            },
            {
                "name": "Feria de Abril (April Fair)",
                "type": "Cultural",
                "description": "Experience Seville's most famous festival, featuring traditional flamenco dresses, horse parades, fairground attractions, and casetas (tents) with food and drink.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Held two weeks after Holy Week, this week-long celebration transforms the city with traditional Andalusian culture and festivities.",
                "booking_tips": "Book accommodation months in advance. Many casetas are private but some are public. Arrive early for the daily horse parade."
            },
            {
                "name": "Alcázar Spring Gardens",
                "type": "Nature",
                "description": "Explore the stunning spring blooms in the Real Alcázar's historic gardens, featuring fountains, orange trees, and seasonal flower displays.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring (April-May) brings spectacular blooms, particularly in the English Garden and around the Mercury Pond. The gardens are at their most beautiful during this season.",
                "booking_tips": "Purchase tickets online in advance. Arrive early to avoid crowds. Weekday mornings offer the most peaceful experience."
            },
            {
                "name": "Seville Marathon",
                "type": "Sport",
                "description": "Participate in or watch Seville's annual marathon, which takes runners through the city's most iconic landmarks and streets.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to watch, Moderate to participate",
                "seasonal_notes": "Held in February, offering ideal running conditions with mild temperatures and clear skies.",
                "booking_tips": "Register months in advance if participating. Spectators can watch from various points along the route; Plaza de España offers a great vantage point."
            },
            {
                "name": "Seville Flamenco Biennial",
                "type": "Cultural",
                "description": "Experience one of Spain's most important flamenco festivals, featuring performances, workshops, and cultural events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held every two years in spring, showcasing the best of flamenco music and dance.",
                "booking_tips": "Purchase tickets online when the program is announced. Popular performances sell out quickly."
            },
            {
                "name": "Seville Cocktail Week",
                "type": "Food & Drink",
                "description": "Sample creative cocktails from Seville's best bars during this week-long celebration of mixology.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in May, featuring special cocktail menus and events at participating bars throughout the city.",
                "booking_tips": "Purchase a wristband for access to special events and discounted cocktails. Some events require advance booking."
            },
            {
                "name": "Seville Design Festival",
                "type": "Cultural",
                "description": "Experience exhibitions, installations, and events celebrating design in all its forms across various venues in Seville.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Spring edition focuses on contemporary design with exhibitions, workshops, and talks throughout the city.",
                "booking_tips": "Check the festival website for program details. Some events require advance registration."
            },
            {
                "name": "Spring Art Week",
                "type": "Cultural",
                "description": "Visit galleries and art spaces participating in this city-wide celebration of contemporary art.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Held in May, featuring special exhibitions and events at galleries throughout Seville.",
                "booking_tips": "Download the official map of participating venues. Many galleries offer extended hours during the festival."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Noche en Blanco (White Night)",
                "type": "Cultural",
                "description": "Experience Seville's annual cultural night festival, featuring extended hours at museums, galleries, and cultural venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Held in June, transforming the city with cultural activities and special events throughout the night.",
                "booking_tips": "Check the program in advance. Some venues may require advance registration."
            },
            {
                "name": "Seville Pride",
                "type": "Festival",
                "description": "Join one of Andalusia's largest LGBTQ+ celebrations featuring parades, concerts, and cultural events.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Held in June, transforming the city with rainbow colors and celebrations.",
                "booking_tips": "Book accommodation months in advance. Many events are free but some parties require tickets."
            },
            {
                "name": "Veranos de Sevilla",
                "type": "Cultural",
                "description": "Enjoy open-air concerts, theater performances, and cultural events in various venues across Seville.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer-long festival offering cultural entertainment in outdoor venues throughout the city.",
                "booking_tips": "Purchase tickets online when the program is announced. Popular events sell out quickly."
            },
            {
                "name": "Guadalquivir River Activities",
                "type": "Outdoor Recreation",
                "description": "Enjoy river activities including boat tours, kayaking, and riverside events along the Guadalquivir.",
                "indoor": false,
                "best_time": "Morning/Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Summer brings various activities and events to the river, including sunset cruises and water sports.",
                "booking_tips": "Book boat tours in advance. Early morning or evening activities are recommended to avoid heat."
            },
            {
                "name": "Seville Foodie Week",
                "type": "Food & Drink",
                "description": "Sample special menus and culinary events at participating restaurants throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer edition features special menus and culinary events showcasing Seville's dining scene.",
                "booking_tips": "Reserve tables in advance at participating restaurants. Special menus often require advance booking."
            },
            {
                "name": "Seville Jazz Festival",
                "type": "Music",
                "description": "Experience jazz performances in various venues across the city, from intimate clubs to outdoor stages.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings jazz performances to various venues, including outdoor concerts in parks.",
                "booking_tips": "Purchase tickets online for specific performances. Some venues offer season passes."
            },
            {
                "name": "Seville's Rooftop Bars",
                "type": "Food & Drink",
                "description": "Enjoy drinks and views at Seville's rooftop bars, which come alive during summer evenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Summer evenings offer perfect conditions for rooftop dining and drinking with spectacular city views.",
                "booking_tips": "Reserve tables in advance, especially for sunset views. Popular spots include Doña María Hotel and Hotel Alfonso XIII."
            },
            {
                "name": "Seville's Summer Sales",
                "type": "Shopping",
                "description": "Take advantage of summer sales at major shopping areas including Calle Sierpes and various malls.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "Major sales begin in July with significant discounts at stores throughout the city.",
                "booking_tips": "Visit early in the morning to avoid crowds. Many stores offer online shopping with in-store pickup."
            },
            {
                "name": "Seville's Summer Cinema",
                "type": "Entertainment",
                "description": "Watch movies under the stars at various outdoor cinema venues throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings outdoor cinema screenings to various locations, including parks and cultural centers.",
                "booking_tips": "Purchase tickets online in advance. Bring blankets or chairs for comfortable viewing."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Seville International Film Festival",
                "type": "Cultural",
                "description": "Experience one of Spain's most important film festivals, featuring premieres, retrospectives, and special events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in November, showcasing international and Spanish cinema with red carpet events and screenings.",
                "booking_tips": "Purchase tickets online when the program is announced. Popular screenings sell out quickly."
            },
            {
                "name": "Seville Wine Week",
                "type": "Food & Drink",
                "description": "Sample wines from across Andalusia at various events and tastings throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings wine-focused events and tastings, celebrating Andalusia's wine culture.",
                "booking_tips": "Purchase tickets for specific tastings in advance. Many events require advance registration."
            },
            {
                "name": "Seville Fashion Week",
                "type": "Cultural",
                "description": "Experience Andalusia's premier fashion event, featuring runway shows and industry events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn edition showcases upcoming spring/summer collections with various events and shows.",
                "booking_tips": "Tickets are primarily for industry professionals, but some events are open to the public with advance booking."
            },
            {
                "name": "Seville's Autumn Parks",
                "type": "Nature",
                "description": "Enjoy the autumn colors in Seville's parks, particularly María Luisa Park and Alamillo Park.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "October-November brings beautiful autumn colors to Seville's parks and gardens.",
                "booking_tips": "No booking required; visit on weekdays for fewer crowds. Early morning offers the best light for photography."
            },
            {
                "name": "Seville's Autumn Gastronomy",
                "type": "Food & Drink",
                "description": "Sample seasonal dishes and participate in food events celebrating autumn ingredients.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings seasonal specialties including mushrooms, game, and traditional stews.",
                "booking_tips": "Reserve tables at participating restaurants. Many offer special autumn tasting menus."
            },
            {
                "name": "Seville's Autumn Art Exhibitions",
                "type": "Cultural",
                "description": "Visit major art exhibitions at Seville's museums and galleries during the autumn season.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings major exhibitions to Seville's museums, including the Museum of Fine Arts and CAAC.",
                "booking_tips": "Purchase tickets online in advance. Many museums offer combined tickets for multiple exhibitions."
            },
            {
                "name": "Seville's Autumn Theater Season",
                "type": "Cultural",
                "description": "Attend performances at Seville's theaters as the new season begins.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn marks the beginning of the theater season with new productions and performances.",
                "booking_tips": "Purchase tickets online in advance. Many theaters offer season subscriptions."
            },
            {
                "name": "Seville's Autumn Markets",
                "type": "Shopping",
                "description": "Browse seasonal products at various markets throughout the city.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Autumn brings seasonal products and special markets featuring local produce and crafts.",
                "booking_tips": "No booking required; arrive early for the best selection. Many markets offer guided tours."
            },
            {
                "name": "Seville's Autumn Music Scene",
                "type": "Music",
                "description": "Enjoy concerts and performances at various venues throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings various music events and performances to Seville's concert halls and venues.",
                "booking_tips": "Purchase tickets online in advance. Many venues offer season subscriptions."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Lights in Seville",
                "type": "Cultural",
                "description": "Experience Seville's spectacular Christmas light displays along major streets and squares.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Displayed from late November through early January, with synchronized light shows and festive decorations.",
                "booking_tips": "No booking required; shows typically run from 6pm to midnight. Most crowded on weekends and holidays."
            },
            {
                "name": "Three Kings Parade (Cabalgata de Reyes)",
                "type": "Cultural",
                "description": "Witness the traditional Three Kings parade through Seville's streets on January 5th.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on January 5th, featuring elaborate floats and candy distribution to children.",
                "booking_tips": "Arrive early for good viewing spots along the route. Bring bags for collecting candy."
            },
            {
                "name": "Seville's Christmas Markets",
                "type": "Shopping",
                "description": "Browse traditional Christmas markets throughout the city, particularly in Plaza Nueva.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Open from late November through December, featuring traditional crafts and holiday items.",
                "booking_tips": "Visit on weekdays to avoid crowds. Plaza Nueva's market is the most traditional."
            },
            {
                "name": "Seville's Winter Museums",
                "type": "Cultural",
                "description": "Explore Seville's world-class museums during the quieter winter season.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers fewer crowds and special exhibitions at Seville's major museums.",
                "booking_tips": "Many museums offer free entry on certain days. Check schedules for special winter hours."
            },
            {
                "name": "Seville's Winter Gastronomy",
                "type": "Food & Drink",
                "description": "Sample traditional winter dishes and seasonal specialties at restaurants throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings traditional dishes like rabo de toro and seasonal specialties.",
                "booking_tips": "Reserve tables in advance, especially for traditional restaurants. Many offer special winter menus."
            },
            {
                "name": "Seville's Winter Theater",
                "type": "Cultural",
                "description": "Attend performances at Seville's theaters during the winter season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings various performances and productions to Seville's theaters.",
                "booking_tips": "Purchase tickets online in advance. Many theaters offer winter season subscriptions."
            },
            {
                "name": "Seville's Winter Parks",
                "type": "Nature",
                "description": "Enjoy Seville's parks during the quieter winter season, particularly María Luisa Park.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter offers peaceful walks and unique perspectives of Seville's parks.",
                "booking_tips": "No booking required; visit on sunny days for the best experience."
            },
            {
                "name": "Seville's Winter Shopping",
                "type": "Shopping",
                "description": "Take advantage of winter sales and shopping opportunities throughout the city.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "January brings major sales with significant discounts at stores throughout Seville.",
                "booking_tips": "Visit early in the morning to avoid crowds. Many stores offer online shopping with in-store pickup."
            },
            {
                "name": "Seville's Winter Sports",
                "type": "Sport",
                "description": "Watch winter sports events or participate in indoor sports activities.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings various sports events and activities to Seville's venues.",
                "booking_tips": "Purchase tickets online in advance for specific events. Many venues offer winter sports packages."
            }
        ]
    }
} 