{
    "sites": [
        {
            "name": "Acropolis of Athens (including Parthenon)",
            "type": "UNESCO World Heritage Site/Ancient Citadel",
            "description": "The Acropolis is an ancient citadel located on a rocky outcrop above the city of Athens, containing the remains of several historically significant ancient buildings, the most famous being the Parthenon. Symbolizing the foundation of democracy and Western civilization, it includes structures like the Propylaea, the Erechtheion, and the Temple of Athena Nike. Offers breathtaking views of Athens.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. Extremely crowded and hot in summer midday; visit early morning or late afternoon. Winter offers fewer crowds but potentially less pleasant weather. Spring and autumn are ideal.",
            "booking_tips": "Purchase the combo ticket online in advance to save money and skip lines (covers Acropolis and other sites). Wear sturdy, comfortable shoes, sunscreen, and a hat. Allow 3-4 hours. Consider a guided tour for context. Water is essential, especially in summer. Note that the terrain is uneven and involves uphill walking.",
            "ratings": {
                "cost_estimate": 20,
                "suggested_duration_hours": 3.5,
                "cultural_significance": 5
            },
            "latitude": 37.9715,
            "longitude": 23.7267
        },
        {
            "name": "Acropolis Museum",
            "type": "Archaeological Museum",
            "description": "Located at the foot of the Acropolis, this modern museum houses artifacts found on the Acropolis rock and its surrounding slopes, from the Greek Bronze Age to Roman and Byzantine Greece. Highlights include the Parthenon Marbles gallery, archaic statues (Kore), and finds from the Erechtheion. The building itself is an architectural marvel with glass floors revealing archaeological excavations below.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled indoor environment. Busier during peak tourist season (summer) and weekends. Check website for occasional evening openings.",
            "booking_tips": "Book tickets online to avoid queues. Allow 2-3 hours. Photography without flash is usually permitted in most galleries. Cafe on site offers Acropolis views. Consider visiting after the Acropolis site itself for context.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 37.9685,
            "longitude": 23.7281
        },
        {
            "name": "Ancient Agora of Athens",
            "type": "Archaeological Site/Historic Marketplace",
            "description": "The heart of ancient Athens, serving as the political, commercial, administrative, and social activity center. Explore ruins of administrative buildings, temples, and shops. Key sites include the well-preserved Temple of Hephaestus and the reconstructed Stoa of Attalos, which houses the Agora Museum.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. Exposed site, can be very hot in summer. Visit early or late. Stoa of Attalos museum offers indoor respite.",
            "booking_tips": "Included in the Acropolis combo ticket. Allow 2-3 hours. Wear comfortable shoes and sun protection. Combine with a visit to the nearby Roman Agora and Kerameikos.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 37.9750,
            "longitude": 23.7225
        },
        {
            "name": "Plaka District",
            "type": "Historic Neighborhood/Shopping/Dining",
            "description": "Nestled under the Acropolis, Plaka is Athens' oldest neighborhood. Known as the 'Neighborhood of the Gods', its labyrinthine streets are filled with neoclassical architecture, small shops selling souvenirs and crafts, traditional tavernas, and cafes. Features charming squares and hidden corners. Includes the area of Anafiotika, with Cycladic-style houses.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Free",
            "seasonal_notes": "Vibrant year-round. Lively atmosphere, especially in the evenings during warmer months. Can be very crowded.",
            "booking_tips": "Free to wander. Best explored on foot. Wear comfortable shoes for cobblestones. Ideal for souvenir shopping and experiencing traditional Greek food and atmosphere. Be aware of tourist traps; venture off the main streets.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 3
            },
            "latitude": 37.9726,
            "longitude": 23.7300
        },
        {
            "name": "National Archaeological Museum",
            "type": "Major Archaeological Museum",
            "description": "One of the world's greatest museums, housing the richest collection of artifacts from Greek antiquity worldwide. Its collections span from prehistory to late antiquity, featuring iconic sculptures (like the bronze Poseidon/Zeus of Artemision, the Jockey of Artemision, the Mask of Agamemnon), pottery, frescoes, jewellery, and the Antikythera Mechanism.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled indoor environment. Open year-round, check reduced winter hours. Can be crowded, especially school groups.",
            "booking_tips": "Allow at least 3-4 hours for a comprehensive visit. Consider focusing on specific collections if time is limited. Located slightly outside the main Plaka/Acropolis tourist hub, reachable by metro (Victoria or Omonia station). Check website for opening times.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 3.5,
                "cultural_significance": 5
            },
            "latitude": 37.9890,
            "longitude": 23.7325
        },
        {
            "name": "Temple of Olympian Zeus",
            "type": "Ancient Ruins/Temple",
            "description": "Once a colossal temple dedicated to Zeus, king of the Olympian gods. Though construction began in the 6th century BC, it was completed by Roman Emperor Hadrian in the 2nd century AD. It was one of the largest temples in the ancient world. Only a few of the massive Corinthian columns remain standing today, but they give a sense of the structure's immense scale. Hadrian's Arch stands nearby.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. Exposed site, offers little shade. Best visited early or late in summer.",
            "booking_tips": "Included in the Acropolis combo ticket. Allow 30-60 minutes. Located near Plaka and the Acropolis Museum. Offers good views of the Acropolis.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 0.75,
                "cultural_significance": 4
            },
            "latitude": 37.9695,
            "longitude": 23.7331
        },
        {
            "name": "Panathenaic Stadium (Kallimarmaro)",
            "type": "Historic Stadium/Olympic Venue",
            "description": "A classical cultural and touristic landmark of Athens, and the only stadium in the world built entirely of marble (Pentelic marble). Originally built in the 4th century BC, it was restored to host the first modern Olympic Games in 1896. It was also used as an Olympic venue in 2004 and is the finishing point for the annual Athens Classic Marathon.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. Marble can be bright and reflect heat in summer.",
            "booking_tips": "Small entrance fee includes an audio guide. Allow 45-60 minutes. You can run on the track. Offers views towards the Acropolis and Lycabettus Hill. Located behind the National Garden.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 4
            },
            "latitude": 37.9684,
            "longitude": 23.7410
        },
        {
            "name": "Monastiraki Square & Flea Market",
            "type": "Public Square/Market",
            "description": "A vibrant square and one of the main shopping and gathering spots in Athens. Known for its bustling flea market (especially on Sundays), selling everything from antiques and crafts to clothing and souvenirs. Features the Ottoman-era Tzistarakis Mosque, Hadrian's Library ruins nearby, and offers direct views of the Acropolis.",
            "indoor": false,
            "best_time": "Daytime",
            "price_range": "Free",
            "seasonal_notes": "Busy year-round, especially weekends. Market is most extensive on Sunday mornings.",
            "booking_tips": "Free to explore. A major transport hub (metro station). Be mindful of crowds and pickpockets. Bargaining is common in the flea market. Many cafes and restaurants surround the square.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 37.9760,
            "longitude": 23.7256
        },
        {
            "name": "Mount Lycabettus",
            "type": "Hill/Viewpoint/Chapel",
            "description": "The highest point in central Athens, offering stunning panoramic 360-degree views of the entire city, the Acropolis, the port of Piraeus, and the Aegean Sea. At the summit (277 meters), there is the small Chapel of St. George, a cafe, and a restaurant. Accessible by foot via winding paths or by the Lycabettus Funicular.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round. Sunset views are spectacular but popular (crowded). Can be windy at the top. Paths can be slippery after rain.",
            "booking_tips": "Walking up takes about 20-30 minutes (steep in parts). Funicular (teleferik) runs frequently from Kolonaki district (costs ~€7-10 round trip). Allow 1-1.5 hours at the top. Restaurant/cafe can be pricey.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 37.9819,
            "longitude": 23.7435
        },
        {
            "name": "Syntagma Square",
            "type": "Central Square/Government Building",
            "description": "The central square of Athens, located in front of the Old Royal Palace, which now houses the Greek Parliament. Site of the Tomb of the Unknown Soldier, guarded by the Evzones (Presidential Guard) in traditional uniform. Witness the ceremonial Changing of the Guard, which occurs every hour (a more elaborate ceremony takes place on Sunday mornings).",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. Changing of the Guard takes place regardless of weather.",
            "booking_tips": "Free to visit. Arrive 10-15 minutes before the hour for a good view of the Changing of the Guard. The main Syntagma Metro station is underneath the square, showcasing archaeological finds discovered during construction. Starting point for many walking tours and access point to the National Garden.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 37.9756,
            "longitude": 23.7341
        },
        {
            "name": "Kerameikos Archaeological Site and Museum",
            "type": "Archaeological Site/Ancient Cemetery/Museum",
            "description": "Site of the ancient deme (suburb) of Kerameis and the city's most important cemetery from the Proto-Geometric period onwards. Includes part of the Themistoclean Wall, the Dipylon Gate (main entrance to ancient Athens), and the Sacred Gate. Features impressive funerary monuments and stelai (grave markers). A small onsite museum displays finds from the excavations.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. Can be hot in summer. Museum offers indoor space.",
            "booking_tips": "Included in the Acropolis combo ticket. Allow 1-1.5 hours. Less crowded than other major sites. Located northwest of the Ancient Agora, easily combined.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 37.9783,
            "longitude": 23.7178
        },
        {
            "name": "Roman Agora & Tower of the Winds",
            "type": "Archaeological Site/Historic Structure",
            "description": "The Roman-era marketplace of Athens, distinct from the older Ancient Agora. Features the Gate of Athena Archegetis and the remarkably well-preserved Tower of the Winds (Horologion of Andronikos Kyrrhestes), an octagonal Pentelic marble clocktower, sundial, and water clock believed to be the world's first meteorological station.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. Exposed site.",
            "booking_tips": "Included in the Acropolis combo ticket. Allow 30-60 minutes. Located adjacent to Plaka and near the Ancient Agora. Often viewed quickly in passing.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 0.75,
                "cultural_significance": 4
            },
            "latitude": 37.9746,
            "longitude": 23.7260
        },
        {
            "name": "National Garden",
            "type": "Urban Park",
            "description": "A large public park located directly behind the Greek Parliament building (Syntagma Square), extending southwards to the Zappeion Mansion area. Formerly the Royal Garden, it offers a shaded, green oasis in the city center with diverse flora, ponds, winding paths, a small zoo, a botanical museum, and ancient ruins scattered within.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open year-round from sunrise to sunset. Provides welcome shade in summer. Pleasant in spring and autumn.",
            "booking_tips": "Free entry. Multiple entrances (main one on Amalias Avenue). Allow 1-2 hours for a leisurely stroll. A peaceful escape from the city bustle. Connects Syntagma Square area with the Panathenaic Stadium and Temple of Olympian Zeus.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 2
            },
            "latitude": 37.9725,
            "longitude": 23.7375
        },
        {
            "name": "Benaki Museum of Greek Culture",
            "type": "History & Art Museum",
            "description": "Housed in the Benaki family mansion, this museum presents a panoramic view of Greek history and art from prehistoric times to the 20th century. Collections include prehistoric, ancient Greek and Roman art, Byzantine art, post-Byzantine and Neo-Hellenic art, historical heirlooms, and extensive collections of Greek regional costumes and decorative arts.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled. Check website for opening hours (often closed Tuesdays, may have late opening one day).",
            "booking_tips": "Allow 2-3 hours. Located near Syntagma Square and the National Garden. Often less crowded than the National Archaeological Museum. Rooftop cafe offers pleasant views. The Benaki foundation has several other museum branches in Athens focusing on specific areas (e.g., Islamic Art, Toys).",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 37.9742,
            "longitude": 23.7390
        },
        {
            "name": "Museum of Cycladic Art",
            "type": "Archaeological & Art Museum",
            "description": "Dedicated to the study and promotion of ancient cultures of the Aegean and Cyprus, with special emphasis on Cycladic Art of the 3rd millennium BC. Features one of the world's most important collections of the iconic, minimalist Cycladic marble figurines. Also includes significant collections of Ancient Greek Art (Bronze Age to Roman) and Cypriot Art.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled. Check website for specific opening hours (often closed Tuesdays).",
            "booking_tips": "Allow 1.5-2 hours. Located in the upscale Kolonaki district, near the Benaki Museum and Lycabettus Funicular base. Well-curated exhibitions in a modern setting. Cafe available.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 4
            },
            "latitude": 37.9758,
            "longitude": 23.7418
        }
    ]
}