{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Protochronia)",
          "notes": "New Year's Day is a public holiday throughout Greece. Most attractions, shops, and restaurants in Athens operate with limited hours. Traditional Greek New Year's celebrations include the cutting of the Vasilopita cake with a hidden coin bringing luck to whoever finds it. The city is relatively quiet as residents recover from New Year's Eve celebrations."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 2,
          "notes": "Early January in Athens is winter with cooler temperatures averaging 13°C (55°F) and increased chances of rainfall. This is low season for tourism, so you'll find fewer crowds at major attractions like the Acropolis and Ancient Agora. Many archaeological sites and museums have reduced winter hours but remain open. Winter sales begin in shops throughout Athens, particularly in the Ermou Street and Monastiraki areas."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
          "score": 3,
          "notes": "Mid-January brings typical winter conditions to Athens. While cooler than most of the year, Athens winters are mild compared to northern Europe. Indoor cultural attractions such as the National Archaeological Museum and the Museum of Cycladic Art are excellent options during occasional rainy days. The lack of tourist crowds makes this a good time to explore the historic neighborhoods of Plaka and Anafiotika at a leisurely pace."
        },
        {
          "days": [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Preparation for Epiphany Celebrations",
          "notes": "Late January sees preparations for the celebration of Epiphany (if it falls in early February). Athens experiences some of its coolest temperatures of the year, but winter days can often be sunny and pleasant for exploring the city. Local tavernas offer hearty winter dishes like fasolada (bean soup) and stifado (beef stew) that are perfect for the season."
        }
      ],
      "weatherHighC": 13,
      "weatherLowC": 7,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "February continues with winter conditions but frequently features beautiful, clear days with mild temperatures. Athens' famous light creates stunning photography opportunities at ancient sites like the Acropolis, particularly in the golden hours. Tourism remains low, making it an excellent time to enjoy the National Gardens, Zappeion, and other outdoor spaces when the weather is favorable. February is almond blossom season in Athens and the surrounding Attica region, adding touches of beauty to parks and green spaces."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 7,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and occasional rainfall. This shoulder season is ideal for exploring both archaeological sites and cultural attractions with very manageable crowds. The city begins to show signs of spring with flowers appearing in parks and the National Gardens becoming increasingly colorful. Cafes start to set up outdoor seating areas as the weather improves."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Greek Independence Day (Ikostí Pémpti Martíou)",
          "notes": "March 25th is a major national holiday celebrating Greek Independence Day. A large military parade takes place in central Athens, particularly along Syntagma Square and Amalias Avenue. Museums and archaeological sites may have modified hours but typically remain open. Many restaurants offer special menus featuring traditional Greek foods, particularly bakaliaros (fried cod) and skordalia (garlic sauce), which are traditionally eaten on this day."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Easter Preparations",
          "notes": "Late March may include Easter preparations (if Easter falls in March/early April). The weather becomes increasingly pleasant with spring temperatures averaging around 17°C (63°F). If Easter falls in late March/early April, expect increased activity in churches around Athens, particularly the Metropolitan Cathedral of Athens, with special services and preparations for Holy Week."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 9,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Holy Week & Easter (Megali Evdomada & Pascha)",
          "notes": "If Easter falls in April, Athens observes Holy Week with solemn processions and religious ceremonies at the city's churches. Good Friday features evening processions of the Epitaphios (Christ's funeral bier) through neighborhoods across Athens. Easter Sunday is celebrated with special services, particularly the midnight Resurrection service on Saturday night with candles and fireworks. April brings reliable spring weather with wildflowers blooming throughout Athens' hills and archaeological sites. Archaeological sites extend their opening hours as tourist season begins. The Athens Authentic Marathon events sometimes include spring races and related athletic events in April."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 11,
      "tourismLevel": 6
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Ergatiki Protomagia)",
          "notes": "May 1st is International Workers' Day and a public holiday in Greece. Traditional celebrations include collecting flowers and making wreaths to hang on doors. Many Athenians also use this holiday for excursions to nearby countryside areas. There may be organized labor demonstrations in central Athens, particularly around Syntagma Square."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "May brings ideal weather with warm, sunny days averaging 24°C (75°F) and minimal rainfall. Tourism increases but hasn't yet reached summer peak levels. This is considered one of the best months to visit Athens with perfect conditions for exploring archaeological sites like the Acropolis, Ancient Agora, and Temple of Olympian Zeus. The Athens Festival begins to announce its summer program of performances at the Odeon of Herodes Atticus. Outdoor dining becomes extremely popular in neighborhoods like Plaka, Monastiraki, and Psiri."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 15,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 5,
          "special": true,
          "event": "Athens & Epidaurus Festival Season Begins",
          "notes": "Early June brings warm summer weather to Athens. The prestigious Athens and Epidaurus Festival officially begins, featuring world-class performances of theater, music, and dance at venues like the Odeon of Herodes Atticus and other historic locations. This is an excellent time to visit Athens before the peak heat of July and August, with temperatures typically around 28°C (82°F). Coastal areas like Vouliagmeni and Glyfada become increasingly popular for swimming and beach activities."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Summer Solstice & European Music Day",
          "notes": "Late June brings the summer solstice and European Music Day celebrations (June 21) with free concerts throughout Athens' public spaces. Athens' rooftop bars and restaurants become extremely popular, offering spectacular views of the illuminated Acropolis. Many Athenians begin to take weekend trips to nearby islands, though the city remains lively, especially in the evenings when temperatures cool slightly."
        }
      ],
      "weatherHighC": 28,
      "weatherLowC": 19,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Athens & Epidaurus Festival Continues",
          "notes": "July brings high summer with temperatures reaching 33°C (91°F) and virtually no rainfall. Tourism peaks as European summer holidays begin. The Athens & Epidaurus Festival continues with high-profile performances at ancient venues. Morning hours are best for visiting archaeological sites before the midday heat. Coastal tram routes to Athens' beaches become extremely popular for afternoon cooling off. Evening activities dominate, with outdoor cinemas, rooftop dining, and cultural performances starting after sunset. Many locals leave Athens for islands during August, but July still sees a lively mix of residents and visitors."
        }
      ],
      "weatherHighC": 33,
      "weatherLowC": 22,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early August brings Athens' hottest temperatures, often exceeding 35°C (95°F). Many Athenians leave the city for annual vacations, particularly around the August 15th holiday. Some small, family-owned restaurants and shops may close for vacations, particularly in residential areas. Tourism remains at peak levels despite the heat, with visitors from around the world exploring the ancient sites, preferably in early morning or evening hours."
        },
        {
          "days": [15],
          "score": 4,
          "special": true,
          "event": "Dormition of the Virgin Mary (Koimisis tis Theotokou)",
          "notes": "August 15th is a major religious holiday celebrating the Dormition (Assumption) of the Virgin Mary. This is one of the most important feast days in the Greek Orthodox calendar. Special services are held at churches throughout Athens, particularly at the Metropolitan Cathedral and churches dedicated to the Virgin Mary. Many Athenians return to ancestral villages for this holiday, so Athens may feel slightly less crowded than expected for mid-August."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Late August maintains high summer conditions with hot temperatures. The Athens & Epidaurus Festival continues with performances at the Odeon of Herodes Atticus and other venues. Evening activities dominate city life, with open-air cinemas, cultural events, and dining typically starting after 8 PM when temperatures begin to cool. Athens' nearby beaches remain extremely popular for daytime cooling off, with organized beaches at Vouliagmeni, Varkiza, and Glyfada offering facilities and water sports."
        }
      ],
      "weatherHighC": 34,
      "weatherLowC": 23,
      "tourismLevel": 9
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "September brings ideal conditions with warm temperatures around 29°C (84°F) but without the extreme heat of summer. Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather but fewer crowds. Local life returns to normal as Athenians come back from summer vacations and schools reopen. The Athens & Epidaurus Festival concludes its summer program. This is widely considered one of the best months to visit Athens, with pleasant temperatures for exploring archaeological sites and enjoying outdoor dining. The sea remains warm enough for swimming at Athens' coastal areas."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 19,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27],
          "score": 5,
          "notes": "October brings pleasant autumn weather with temperatures around 23°C (73°F). Tourism continues to decrease, creating ideal conditions for exploring the city without crowds. This is an excellent month for hiking in nearby areas like Mount Hymettus and Mount Lycabettus with comfortable temperatures and clear views of the city and surroundings. Cultural life intensifies with new exhibitions at museums and galleries, and the start of the winter theater and music season."
        },
        {
          "days": [28],
          "score": 5,
          "special": true,
          "event": "Ohi Day (Epéteios tou Óhi)",
          "notes": "October 28th is 'Ohi Day' ('No' Day), commemorating Greece's refusal to surrender to Axis powers in 1940. A major military parade takes place in central Athens, particularly along Amalias Avenue and Syntagma Square. Most museums and archaeological sites remain open, though some may have modified hours. Patriotic celebrations and events take place throughout the city."
        },
        {
          "days": [29, 30, 31],
          "score": 5,
          "notes": "Late October continues with pleasant autumn weather and the possibility of occasional rainfall. Athens' urban parks and the National Garden show beautiful autumn colors. This is an excellent time for exploring the city's museums, including the Acropolis Museum, National Archaeological Museum, and Benaki Museum without summer crowds."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 15,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
          "score": 4,
          "notes": "Early November brings autumn weather with cooler temperatures around 18-19°C (64-66°F) and increased chances of rainfall. This is low season for tourism, though Athens maintains a vibrant local atmosphere with cultural events, exhibitions, and performances. Indoor attractions like the Museum of Cycladic Art, Byzantine Museum, and Benaki Museum are excellent options during occasional wet days. Traditional tavernas offer seasonal autumn specialties featuring wild mushrooms, game, and new wine production."
        },
        {
          "days": [18, 19, 20, 21],
          "score": 4,
          "special": true,
          "event": "Athens Marathon",
          "notes": "Mid-November typically features the Athens Authentic Marathon, following the historic route from Marathon to Athens that commemorates Pheidippides' run in 490 BCE. The race finishes at the Panathenaic Stadium (Kallimarmaro), the site of the first modern Olympics. The event brings increased activity and international visitors to the city for this historic sporting event. Related exhibitions and athletics events take place throughout the city."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late November weather becomes cooler with temperatures around 17°C (63°F) and increased chances of rainfall. This is an excellent time for cultural experiences including theater, music, and the vibrant café culture that characterizes Athens in cooler months. Late November sees the beginning of Christmas preparations with decorations starting to appear throughout the city center, particularly around Syntagma Square and Ermou Street."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 12,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "special": true,
          "event": "Christmas Celebrations",
          "notes": "Throughout December, Athens hosts Christmas markets and festivities in the central areas, particularly at Syntagma Square which features a large Christmas tree and holiday decorations. The city center, especially Ermou Street, Monastiraki, and Plaka, is beautifully decorated with Christmas lights. Special cultural events, concerts, and performances take place at venues throughout the city, including the Athens Concert Hall (Megaron) and the National Theater of Greece. December brings winter weather with temperatures around 15°C (59°F) and occasional rainfall, though clear, sunny winter days are also common."
        },
        {
          "days": [24, 25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Paramoni Christougennon & Christougenna)",
          "notes": "Christmas is celebrated throughout Athens with special services at churches, particularly at the Metropolitan Cathedral. Many restaurants offer special Christmas menus, though some may close for family celebrations on Christmas Day. Most major archaeological sites and museums remain open during the holiday period but may have reduced hours on Christmas Eve and Day. The Christmas season in Greece traditionally extends through January 6 (Epiphany), so celebrations continue past Christmas Day."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year is festive in Athens, with holiday decorations, special events, and a generally celebratory atmosphere. Shopping areas remain busy with winter sales beginning at some stores. Major tourist attractions maintain normal winter hours, and the city's cultural life continues with special holiday performances and events."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "New Year's Eve (Paramoni Protochronias)",
          "notes": "New Year's Eve celebrations center around Syntagma Square with midnight countdowns, music, and fireworks. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. A unique Greek New Year's tradition is the smashing of a pomegranate on the doorstep at midnight for good luck. The city maintains a festive atmosphere with families and friends gathering to welcome the New Year."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 9,
      "tourismLevel": 4
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the Acropolis and ancient sites with ideal temperatures",
      "Visiting the Acropolis Museum and Archaeological Museum",
      "Botanical walks in the National Garden during spring blooms",
      "Athens Food Tours featuring seasonal spring ingredients",
      "Walking tours of historic neighborhoods like Plaka and Anafiotika",
      "Day trips to Cape Sounion and the Temple of Poseidon",
      "Greek Easter celebrations and traditions (when applicable)",
      "Outdoor café culture in Kolonaki and Exarchia",
      "Photography excursions capturing spring light on ancient monuments"
    ],
    "summer": [
      "Early morning visits to archaeological sites before peak heat",
      "Athens & Epidaurus Festival performances at ancient venues",
      "Evening rooftop dining with views of the illuminated Acropolis",
      "Day trips to nearby beaches via coastal tram",
      "Open-air cinema experiences showing films under the stars",
      "Athens Riviera excursions to Vouliagmeni Lake and beaches",
      "Summer cultural events in pedestrianized areas around Monastiraki",
      "Evening walking tours when temperatures cool",
      "Day trips to nearby islands like Aegina, Hydra, and Spetses"
    ],
    "autumn": [
      "Perfect weather for extended exploration of archaeological sites",
      "Athens Authentic Marathon events (November)",
      "Museum visits to the Benaki Museum and Museum of Cycladic Art",
      "Wine tasting featuring new harvest Greek wines",
      "Hiking on nearby Mount Hymettus with panoramic city views",
      "Seasonal gastronomy featuring autumn ingredients at local tavernas",
      "Cultural performances at the Athens Concert Hall (Megaron)",
      "Photography walks capturing golden autumn light on monuments",
      "Day trips to Delphi or Meteora with ideal weather conditions"
    ],
    "winter": [
      "Athens Christmas Market at Syntagma Square",
      "New Year's celebrations and traditions",
      "Winter shopping along Ermou Street and in boutique areas",
      "Museum explorations during occasional rainy days",
      "Traditional winter cuisine featuring seasonal specialties",
      "Cozy café culture centered around Greek coffee and pastries",
      "Winter views from Mount Lycabettus on clear days",
      "Indoor cultural performances at historic theaters",
      "Greek Orthodox Christmas and Epiphany traditions"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or mild, occasionally wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}