{
    "Spring": {
        "activities": [
            {
                "name": "Orthodox Easter Celebrations (Megali Evdomada & Pascha)",
                "type": "Cultural/Religious Festival",
                "description": "Experience the most important religious holiday in Greece. Witness solemn Holy Week (Megali Evdomada) processions like the Epitaphios on Good Friday, the spectacular Anastasi midnight service on Holy Saturday with fireworks, followed by feasting (lamb on the spit) on Easter Sunday (Pascha).",
                "indoor": false,
                "best_time": "Holy Week (dates vary, typically April/May)",
                "price_range": "Free (Observing processions/services)",
                "seasonal_notes": "The pinnacle of the Greek Orthodox calendar, transforming the city with unique traditions, candlelit processions, and festive atmosphere. Dates differ from Western Easter.",
                "booking_tips": "Book accommodation and travel well in advance. Many Athenians leave the city, but observing traditions in local churches (e.g., Plaka, Mets) is special. Restaurants may have special menus or closures; check ahead."
            },
            {
                "name": "Hike Filopappou or Lycabettus Hill",
                "type": "Nature/Viewpoint",
                "description": "Enjoy pleasant spring weather and wildflowers while hiking up Athens' central hills. Filopappou offers iconic Acropolis views amidst pine trees and ancient pathways, while Lycabettus provides panoramic 360-degree city views.",
                "indoor": false,
                "best_time": "Morning/Late Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings greenery and blooming flowers to the hills, making it the most picturesque time for these walks before the summer heat.",
                "booking_tips": "No booking needed. Wear comfortable shoes. Lycabettus also accessible via funicular from Kolonaki. Filopappou paths are gentler."
            },
            {
                "name": "Outdoor Cafe Culture",
                "type": "Leisure/Social",
                "description": "Relax at outdoor cafes in vibrant neighborhoods like Plaka, Thissio, Koukaki, or Agia Irini Square. Enjoy Greek coffee (freddo espresso/cappuccino), pastries, or light meals while soaking up the pleasant spring sunshine and people-watching.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Spring marks the return of comfortable outdoor seating weather, a key part of Athenian social life.",
                "booking_tips": "No booking needed for most cafes, though popular spots can get busy on weekends. Explore different squares and pedestrian streets to find your favorite vibe."
            },
            {
                "name": "Visit Ancient Sites Before Peak Season",
                "type": "Cultural/Historical",
                "description": "Explore major archaeological sites like the Acropolis, Ancient Agora, Roman Agora, and Temple of Olympian Zeus in comfortable temperatures and with relatively fewer crowds compared to summer.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate (Combo ticket recommended)",
                "seasonal_notes": "Ideal weather conditions for exploring exposed archaeological sites without the intense summer heat.",
                "booking_tips": "Purchase the multi-site combo ticket online in advance to save time and money. Arrive early (opening time) at the Acropolis to beat tour groups."
            },
            {
                "name": "Day Trip to Sounion (Temple of Poseidon)",
                "type": "Sightseeing/Excursion",
                "description": "Take a scenic coastal drive or bus trip to Cape Sounion to visit the stunning Temple of Poseidon perched dramatically above the Aegean Sea. Especially magical at sunset.",
                "indoor": false,
                "best_time": "Late Afternoon/Sunset",
                "price_range": "Moderate (Transportation + Site Entry)",
                "seasonal_notes": "Clear spring skies often provide spectacular sunset views over the Aegean from the temple site.",
                "booking_tips": "Public buses (KTEL Attikis) run from central Athens. Organized tours are also available. Allow ample time for the journey (1.5-2 hours each way). Check temple closing times, especially if aiming for sunset."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Athens & Epidaurus Festival Performances",
                "type": "Cultural Festival/Performing Arts",
                "description": "Attend world-class theatre, music, and dance performances at iconic venues, primarily the ancient Odeon of Herodes Atticus below the Acropolis and the ancient Theatre of Epidaurus (requires excursion).",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Major cultural event running from June to August, featuring renowned Greek and international artists in unforgettable settings.",
                "booking_tips": "Book tickets well in advance online via the official festival website, especially for popular performances or shows at Epidaurus. Dress code is smart casual for the Odeon."
            },
            {
                "name": "Enjoy Rooftop Bars",
                "type": "Nightlife/Viewpoint",
                "description": "Escape the heat and enjoy stunning Acropolis views from one of Athens' many rooftop bars in areas like Monastiraki, Syntagma, or Plaka. Sip cocktails and watch the sunset or the illuminated Parthenon at night.",
                "indoor": false,
                "best_time": "Sunset/Evening",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Rooftop bars are quintessential Athenian summer experiences, offering breezes and spectacular views.",
                "booking_tips": "Reservations highly recommended, especially for tables with prime views at popular bars (e.g., A for Athens, 360, Couleur Locale). Some have minimum spend."
            },
            {
                "name": "Open-Air Cinemas ('Therina Cinema')",
                "type": "Leisure/Entertainment",
                "description": "Experience a beloved Athenian summer tradition: watching movies (often classic or independent films, sometimes new releases) under the stars in charming open-air cinemas, often with jasmine-scented gardens and snack bars.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Runs typically from May/June to September. A nostalgic and relaxing way to spend a warm summer evening.",
                "booking_tips": "Check listings online (e.g., Athinorama.gr). Tickets usually bought at the door. Popular spots include Cine Thissio (Acropolis view), Cine Paris (Plaka rooftop), Dexameni (Kolonaki)."
            },
            {
                "name": "Visit the Athens Riviera Beaches",
                "type": "Beach/Leisure",
                "description": "Cool off at the beaches along the Athenian coastline, accessible via tram or bus. Options range from free public beaches to organized beach clubs with loungers, umbrellas, cafes, and water sports (e.g., Glyfada, Voula, Vouliagmeni, Varkiza).",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Public beaches)/Moderate (Organized clubs/transport)",
                "seasonal_notes": "Peak beach season. Weekends can be very crowded. Water temperatures are ideal for swimming.",
                "booking_tips": "Take the T3 or T5 tram from Syntagma/Neos Kosmos towards the coast. Organized beaches may have entrance fees or minimum consumption. Lake Vouliagmeni offers a unique thermal spa lake experience (higher entrance fee)."
            },
            {
                "name": "August Moon Festival (Selected Date)",
                "type": "Cultural Event",
                "description": "On the night of the August full moon, many archaeological sites and museums across Greece, including some in Athens, offer free admission and host special events like concerts or tours.",
                "indoor": false,
                "best_time": "Evening (August Full Moon night)",
                "price_range": "Free",
                "seasonal_notes": "A unique opportunity to experience ancient sites under the moonlight, often with a festive atmosphere.",
                "booking_tips": "Check the Ministry of Culture website closer to the date for participating sites and event schedules. Expect large crowds at popular locations like the Acropolis (if participating)."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "'Oxi Day' (No Day) Parade",
                "type": "National Holiday/Parade",
                "description": "Witness the military parade commemorating Greece's refusal of Mussolini's ultimatum in 1940. Major parades take place in Athens (typically Syntagma area) and Thessaloniki on October 28th.",
                "indoor": false,
                "best_time": "Morning (October 28th)",
                "price_range": "Free",
                "seasonal_notes": "A major national holiday. Expect street closures and crowds along the parade route. Many shops and some sites may be closed.",
                "booking_tips": "Find a spot along the parade route early. Check local news for exact timings and route details. Public transport may be affected."
            },
            {
                "name": "Athens Authentic Marathon",
                "type": "Sporting Event",
                "description": "Experience the atmosphere or participate in the Athens Authentic Marathon, tracing the legendary route from Marathon to the Panathenaic Stadium in Athens. Includes shorter races and associated events.",
                "indoor": false,
                "best_time": "Race Day (Typically early November)",
                "price_range": "Free (Spectating)/Expensive (Participation fee)",
                "seasonal_notes": "A major international sporting event attracting thousands of runners and spectators. Weather is usually ideal for running.",
                "booking_tips": "Register months in advance to participate. Spectators can line the route or cheer at the finish line in the Panathenaic Stadium (entry may be ticketed or limited). Expect road closures."
            },
            {
                "name": "Explore Museums Comfortably",
                "type": "Cultural/Historical",
                "description": "Visit world-class museums like the National Archaeological Museum, Benaki Museum of Greek Culture, Museum of Cycladic Art, or Byzantine & Christian Museum with pleasant temperatures and fewer crowds than summer.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Ideal season for in-depth museum exploration. Check opening hours as winter schedules might apply later in autumn.",
                "booking_tips": "Allocate sufficient time (e.g., 3-4 hours for National Archaeological Museum). Some museums offer free admission days (check websites). Consider audio guides."
            },
            {
                "name": "Enjoy Nightlife as Locals Return",
                "type": "Nightlife/Social",
                "description": "Experience the vibrant Athenian nightlife in areas like Psyrri, Gazi, or Koukaki as locals return from summer holidays, filling bars, tavernas, and live music venues.",
                "indoor": true,
                "best_time": "Evening/Night",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Autumn sees the city's energy ramp up again after the summer lull, with a more local crowd dominating the nightlife scene.",
                "booking_tips": "Explore different neighborhoods for different vibes: Psyrri for alternative/live music, Gazi for clubs, Kolonaki for chic bars, Koukaki for relaxed spots."
            },
            {
                "name": "Hiking Near Athens (Mt Parnitha/Hymettus)",
                "type": "Nature/Hiking",
                "description": "Take advantage of cooler autumn weather to hike on the mountains surrounding Athens, like Mount Parnitha (National Park) or Mount Hymettus, offering trails, nature, monasteries, and city views.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Hiking)/Budget (Transportation)",
                "seasonal_notes": "Crisp air and changing foliage make autumn a great time for hiking. Ensure you check weather conditions before setting out.",
                "booking_tips": "Accessible via public transport (bus) or car. Research trails beforehand (difficulty, length). Wear appropriate hiking gear and carry water."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Decorations & Events",
                "type": "Festival/Celebration",
                "description": "See Athens adorned with festive lights and decorations, especially around Syntagma Square which usually hosts the city's main Christmas tree and various events, ice rinks, or small markets.",
                "indoor": false,
                "best_time": "Evening (December)",
                "price_range": "Free (Viewing)/Moderate (Activities like skating)",
                "seasonal_notes": "Athens has a festive atmosphere in December, though typically milder than northern Europe. Christmas is celebrated on Dec 25th.",
                "booking_tips": "Check the City of Athens website for official event schedules. Stroll down Ermou Street for festive shopping windows. Little Kook cafe in Psyrri has famously extravagant decorations."
            },
            {
                "name": "New Year's Eve Fireworks & Celebrations",
                "type": "Celebration/Fireworks",
                "description": "Ring in the New Year with public celebrations, often including concerts and fireworks displays, traditionally with views towards the Acropolis (check specific year's plans). Many restaurants and bars offer special NYE packages.",
                "indoor": false,
                "best_time": "Late Evening (Dec 31st)",
                "price_range": "Free (Public areas)/Expensive (Parties/Dinners)",
                "seasonal_notes": "A festive night to celebrate. Public transport often runs later.",
                "booking_tips": "Book restaurants or parties well in advance. Good public viewing spots for fireworks (if happening over Acropolis) include Filopappou Hill, Lycabettus Hill, or rooftop bars (reservations essential)."
            },
            {
                "name": "Cozy Taverna Dining",
                "type": "Food/Cultural",
                "description": "Enjoy hearty Greek winter cuisine in traditional, cozy tavernas in areas like Plaka or Psyrri. Savor dishes like Fasolada (bean soup), Lahanodolmades (cabbage rolls), slow-cooked meats, and enjoy house wine.",
                "indoor": true,
                "best_time": "Lunch/Dinner",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Winter is perfect for enjoying the warmth and comfort food of traditional Greek tavernas.",
                "booking_tips": "Reservations recommended for popular tavernas, especially on weekend evenings. Look for places with fireplaces for extra coziness."
            },
            {
                "name": "Museum Hopping with Fewer Crowds",
                "type": "Cultural/Historical",
                "description": "Take advantage of the low season to explore Athens' major museums (National Archaeological, Acropolis, Benaki, etc.) in relative peace, allowing for more leisurely viewing of exhibits.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Winter generally sees the fewest tourists, making it ideal for museum lovers.",
                "booking_tips": "Check winter opening hours, which may be shorter than summer. Consider multi-day museum passes if planning several visits."
            },
            {
                "name": "Apokries (Carnival Season)",
                "type": "Cultural Festival",
                "description": "Experience the Greek carnival season (usually Feb/March) leading up to Lent. While Patras has the most famous carnival, Athens sees costume parties, festive events, and the tradition of Tsiknopempti ('Smoky Thursday') with widespread meat grilling.",
                "indoor": true,
                "best_time": "Evenings (Weekends during Apokries)",
                "price_range": "Varies (Free street events/Paid parties)",
                "seasonal_notes": "A fun, less solemn festival period before Easter preparations begin. Dates vary based on the Orthodox Easter calendar.",
                "booking_tips": "Look for themed parties at bars and clubs. On Tsiknopempti, expect streets (especially Psyrri) to be filled with the smell of grilled meat from tavernas and pop-up grills."
            }
        ]
    }
}