{
    "sites": [
      {
        "name": "Palais des Festivals et des Congrès",
        "type": "Convention Center",
        "description": "The iconic venue of the prestigious Cannes Film Festival, this modern convention center hosts world-class events year-round. Walk the famous red steps where movie stars have made their mark, and explore the surrounding area filled with luxury shops and restaurants.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Most exciting during the Film Festival in May. Outside film festival season, visitors can freely walk around and take photos on the famous steps.",
        "booking_tips": "Free to visit exterior and lobby areas. Guided tours available during certain periods. Check festival schedule to avoid crowds.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 43.5514,
        "longitude": 7.0175
      },
      {
        "name": "La Croisette",
        "type": "Promenade",
        "description": "Cannes' famous palm-lined promenade stretches along the Mediterranean coast, offering stunning sea views, luxury hotels, boutiques, and restaurants. This glamorous boulevard is perfect for people-watching and enjoying the French Riviera lifestyle.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most vibrant during summer months. Evening strolls offer the best atmosphere with stunning sunset views over the Mediterranean.",
        "booking_tips": "No booking required. Best enjoyed at a leisurely pace with stops at beachside cafés. Parking can be expensive and difficult to find.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 43.5506,
        "longitude": 7.0244
      },
      {
        "name": "Le Suquet (Old Town)",
        "type": "Historic District",
        "description": "Cannes' charming old quarter perched on a hill overlooking the bay. This picturesque area features narrow cobblestone streets, historic buildings, local restaurants, and the ancient church Notre-Dame de l'Espérance with panoramic views.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Pleasant year-round, though summer can be hot for walking uphill. Spring and autumn offer ideal temperatures for exploring.",
        "booking_tips": "Wear comfortable shoes for cobblestone streets and hills. Many restaurants don't take reservations - arrive early for dinner.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 5
        },
        "latitude": 43.5493,
        "longitude": 7.0117
      },
      {
        "name": "Musée de la Castre",
        "type": "Museum",
        "description": "Located in Le Suquet's medieval castle, this museum houses diverse collections including Mediterranean antiquities, ethnographic objects from around the world, and musical instruments. The museum's tower offers spectacular panoramic views of Cannes and the coast.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Perfect for hot summer afternoons. The tower views are especially stunning during golden hour.",
        "booking_tips": "Combined tickets with other municipal museums available. Check opening hours as they vary by season.",
        "ratings": {
          "cost_estimate": 6,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.5497,
        "longitude": 7.0112
      },
      {
        "name": "Îles de Lérins",
        "type": "Islands",
        "description": "Two peaceful islands just off Cannes' coast: Île Sainte-Marguerite with its fort and nature trails, and Île Saint-Honorat with its active monastery. These islands offer a tranquil escape with beautiful beaches, hiking paths, and historic sites.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Best visited in spring and summer for ferry access and pleasant weather. Île Saint-Honorat produces wine available for tasting.",
        "booking_tips": "Ferry tickets can be purchased at the port. Bring water and snacks as options are limited on the islands. Last ferries return in late afternoon.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 4,
          "cultural_significance": 4
        },
        "latitude": 43.5219,
        "longitude": 7.0456
      },
      {
        "name": "Plage de la Croisette",
        "type": "Beach",
        "description": "Cannes' main beach along the famous Croisette boulevard features both public and private sections. The beach offers fine sand, clear Mediterranean waters, and views of the Lérins Islands. Private beach clubs provide luxury amenities.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Varies",
        "seasonal_notes": "Peak season is July-August when beaches are crowded. May-June and September offer pleasant weather with fewer crowds.",
        "booking_tips": "Public beach areas are free. Private beach clubs require reservations and fees. Arrive early for best public spots during summer.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 3
        },
        "latitude": 43.5501,
        "longitude": 7.0275
      },
      {
        "name": "Marché Forville",
        "type": "Market",
        "description": "Cannes' vibrant covered market offering fresh produce, local specialties, flowers, and regional delicacies. This authentic Provençal market provides insight into local food culture and is perfect for picnic supplies or souvenirs.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Varies",
        "seasonal_notes": "Best selection early in the morning. Closed on Mondays. Summer offers the greatest variety of fresh fruits and vegetables.",
        "booking_tips": "No booking required. Bring cash for smaller vendors. Market closes around noon, so visit early for best selection.",
        "ratings": {
          "cost_estimate": 10,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 43.5515,
        "longitude": 7.0145
      },
      {
        "name": "Villa Domergue",
        "type": "Museum/Garden",
        "description": "This beautiful Art Deco villa and garden was the former home and studio of painter Jean-Gabriel Domergue. The villa showcases period art and furniture while offering stunning panoramic views over Cannes bay from its hillside location.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "The gardens are particularly beautiful in spring and early summer. Air-conditioned interior provides relief during hot summer days.",
        "booking_tips": "Check opening hours as the villa has seasonal schedules. Photography may be restricted in certain areas.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 43.5559,
        "longitude": 7.0086
      },
      {
        "name": "Port Pierre Canto",
        "type": "Marina",
        "description": "A modern marina hosting luxury yachts and sailing boats with waterfront restaurants and bars. During the Film Festival, this becomes a hub of activity with many events and parties. Great for yacht watching and evening dining.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most active during summer months and film festival season. Evening aperitif time offers the best atmosphere for yacht watching.",
        "booking_tips": "Free to walk around. Restaurant reservations recommended during peak season and festival periods.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3
        },
        "latitude": 43.5462,
        "longitude": 7.0327
      },
      {
        "name": "Boulevard de la Croisette",
        "type": "Street",
        "description": "The heart of Cannes' luxury district featuring high-end boutiques, designer stores, art galleries, and prestigious hotels like the Carlton and Martinez. Perfect for window shopping and experiencing Cannes' glamorous atmosphere.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Most shops are open year-round. Summer crowds can make browsing challenging. Early afternoon offers a good balance of activity and accessibility.",
        "booking_tips": "No booking required for browsing. Many luxury stores welcome visitors even if not purchasing. Some offer complimentary services during quiet periods.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 43.5510,
        "longitude": 7.0200
      },
      {
        "name": "Plage du Midi",
        "type": "Beach",
        "description": "A more local and less crowded beach on the western side of Cannes, popular with residents and budget-conscious visitors. This sandy beach offers the same beautiful Mediterranean waters with a more relaxed, authentic atmosphere.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Less crowded than Croisette beaches year-round. Parking is easier and less expensive. Perfect for families with children.",
        "booking_tips": "Free access. Limited facilities compared to Croisette beaches. Bring your own refreshments and beach equipment.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 2
        },
        "latitude": 43.5456,
        "longitude": 6.9994
      },
      {
        "name": "Église Notre-Dame de l'Espérance",
        "type": "Church",
        "description": "This historic church in Le Suquet dates back to the 16th century and offers one of the best panoramic views over Cannes, the bay, and the Lérins Islands. The church features beautiful religious art and provides insight into local religious heritage.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Peaceful atmosphere in early morning hours. The terrace offers stunning views that are particularly beautiful during golden hour.",
        "booking_tips": "Free entry. Respectful attire required. The climb up through Le Suquet is steep but rewarding.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 43.5499,
        "longitude": 7.0115
      },
      {
        "name": "Rue d'Antibes",
        "type": "Shopping Street",
        "description": "Cannes' main shopping street running parallel to La Croisette, featuring a mix of international brands, local boutiques, restaurants, and cafés. This pedestrian-friendly street offers a more accessible shopping experience than the luxury Croisette.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Varies",
        "seasonal_notes": "Active year-round with shops open most days. Summer brings street performers and outdoor dining. Less crowded than La Croisette.",
        "booking_tips": "No booking required. Many shops offer tax-free shopping for tourists. Cafés are perfect for people-watching breaks.",
        "ratings": {
          "cost_estimate": 5,
          "suggested_duration_hours": 2,
          "cultural_significance": 3
        },
        "latitude": 43.5521,
        "longitude": 7.0178
      },
      {
        "name": "Plage de la Bocca",
        "type": "Beach",
        "description": "A long stretch of sandy beach in the La Bocca district, popular with locals and offering a more authentic French Riviera experience. The beach features several beach clubs and restaurants with views toward the Esterel mountains.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Excellent for summer swimming and sunbathing. Less touristy atmosphere. Spring and autumn are perfect for beach walks.",
        "booking_tips": "Free public access. Several beach restaurants offer day-use facilities. Parking is easier and cheaper than central Cannes.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 2
        },
        "latitude": 43.5389,
        "longitude": 6.9714
      },
      {
        "name": "Quartier de la Californie",
        "type": "Residential District",
        "description": "An upscale hillside neighborhood offering stunning views over Cannes and the Mediterranean. This area features beautiful Belle Époque villas, quiet streets perfect for walking, and several viewpoints for photography.",
        "indoor": false,
        "best_time": "Sunset",
        "price_range": "Free",
        "seasonal_notes": "Beautiful year-round, though summer evenings offer the most spectacular sunset views. Spring brings blooming gardens in the villas.",
        "booking_tips": "Free to explore. Wear comfortable walking shoes for hilly terrain. Best accessed by car or taxi as it's quite steep.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 3
        },
        "latitude": 43.5564,
        "longitude": 7.0364
      },
      {
        "name": "Casino Barrière Cannes",
        "type": "Casino",
        "description": "A glamorous casino in the heart of Cannes offering gaming tables, slot machines, and entertainment. The casino embodies the luxury and excitement of the French Riviera and hosts events throughout the year.",
        "indoor": true,
        "best_time": "Evening",
        "price_range": "Varies",
        "seasonal_notes": "Most active during evening hours and weekend nights. Special events during film festival season and summer months.",
        "booking_tips": "Dress code enforced - smart casual required. Must be 18+ with valid ID. Restaurant reservations recommended for dinner.",
        "ratings": {
          "cost_estimate": 20,
          "suggested_duration_hours": 2,
          "cultural_significance": 3
        },
        "latitude": 43.5508,
        "longitude": 7.0186
      },
      {
        "name": "Médiathèque de Cannes",
        "type": "Library/Cultural Center",
        "description": "A modern cultural center and library featuring contemporary architecture, exhibitions, events, and beautiful reading spaces. The building offers cultural programming and serves as a peaceful retreat from the bustling city.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Air-conditioned space perfect for hot summer days. Regular cultural events and exhibitions throughout the year.",
        "booking_tips": "Free entry. Check the events calendar for special exhibitions and cultural programming. WiFi available for visitors.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 3
        },
        "latitude": 43.5530,
        "longitude": 7.0156
      },
      {
        "name": "Parc de la Croix des Gardes",
        "type": "Park",
        "description": "A large natural park on a hill overlooking Cannes, offering hiking trails, picnic areas, and panoramic views of the city, coast, and surrounding mountains. The park provides a natural escape from the urban environment.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Best visited during cooler months for hiking. Spring offers wildflowers and mild temperatures. Summer visits should be early morning.",
        "booking_tips": "Free access. Bring water and wear appropriate hiking shoes. Some trails can be challenging - check difficulty levels.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 3
        },
        "latitude": 43.5356,
        "longitude": 6.9889
      },
      {
        "name": "Allées de la Liberté",
        "type": "Square/Promenade",
        "description": "A charming tree-lined square in the heart of Cannes featuring a traditional pétanque court where locals gather to play the classic French game. Surrounded by cafés and shops, it offers authentic Provençal atmosphere.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most active during evening hours when locals play pétanque. Summer brings outdoor dining and increased activity.",
        "booking_tips": "No booking required. Perfect for watching pétanque games while enjoying a drink at nearby cafés. Very authentic local experience.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 43.5520,
        "longitude": 7.0150
      },
      {
        "name": "Pointe de l'Aiguille",
        "type": "Natural Site",
        "description": "A scenic coastal point offering beautiful views of the Mediterranean Sea and the Esterel massif. This less-visited spot provides excellent photography opportunities and peaceful moments away from the crowds.",
        "indoor": false,
        "best_time": "Sunset",
        "price_range": "Free",
        "seasonal_notes": "Stunning sunset views year-round. Can be windy, especially during winter months. Spring and autumn offer ideal conditions.",
        "booking_tips": "Free access. Wear appropriate footwear for walking on rocky terrain. Best reached by car or bike.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3
        },
        "latitude": 43.5206,
        "longitude": 6.9456
      }
    ]
  }