{
    "sites": [
        {
            "name": "La Croisette",
            "type": "Boulevard",
            "description": "This iconic palm-lined promenade stretches for 2 kilometers along the Cannes coastline. Famous for its luxury hotels, designer boutiques, and beautiful beaches, La Croisette is the heart of Cannes glamour and offers stunning views of the Mediterranean and the Lérins Islands.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Most spectacular at sunset. In summer, the beaches are packed with sunbathers. Winter offers peaceful walks with fewer crowds.",
            "booking_tips": "No booking required. The public beaches are free, while private beaches charge for loungers and umbrellas.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 43.5500,
            "longitude": 7.0322
        },
        {
            "name": "Palais des Festivals et des Congrès",
            "type": "Conference Center",
            "description": "Home to the world-famous Cannes Film Festival, this modern building with its iconic red carpet steps is a symbol of cinema and glamour. The building hosts numerous events throughout the year and features the Allée des Stars (Cannes Walk of Fame) with handprints of film celebrities.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Extremely busy during the Film Festival in May. Guided tours are available year-round except during major events.",
            "booking_tips": "Book guided tours in advance. During the Film Festival, public access is restricted without accreditation.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 43.5505,
            "longitude": 7.0172
        },
        {
            "name": "Le Suquet (Old Town)",
            "type": "District",
            "description": "The historic heart of Cannes, perched on a hill overlooking the bay. This charming quarter features narrow winding streets, ancient buildings, and excellent restaurants. At the top sits the medieval Château de la Castre museum and the Notre-Dame d'Espérance church with panoramic views of the city.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "The climb can be hot in summer afternoons. Evening offers beautiful city lights and a lively restaurant scene.",
            "booking_tips": "No booking required for exploring the district. Museum has a separate entrance fee.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 43.5508,
            "longitude": 7.0100
        },
        {
            "name": "Musée de la Castre",
            "type": "Museum",
            "description": "Located in a medieval castle atop Le Suquet hill, this museum houses an eclectic collection of primitive art, Mediterranean antiquities, pre-Columbian ceramics, and 19th-century Provençal landscape paintings. The square tower offers spectacular panoramic views of Cannes.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Less crowded on weekdays. The tower climb is particularly rewarding on clear days.",
            "booking_tips": "No advance booking required. Combined tickets available with other Cannes museums.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.5511,
            "longitude": 7.0103
        },
        {
            "name": "Îles de Lérins",
            "type": "Islands",
            "description": "This group of four Mediterranean islands lies just offshore from Cannes. The two largest, Sainte-Marguerite and Saint-Honorat, are accessible by ferry. Sainte-Marguerite features a fortress where the Man in the Iron Mask was imprisoned, while Saint-Honorat is home to a working monastery producing wine and honey.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Ferries run more frequently in summer. The islands are less crowded in spring and fall. Bring water and sun protection.",
            "booking_tips": "Ferry tickets can be purchased at the port. The last return ferry is often early evening, so check the schedule.",
            "ratings": {
                "cost_estimate": 18,
                "suggested_duration_hours": 5,
                "cultural_significance": 5
            },
            "latitude": 43.5167,
            "longitude": 7.0500
        },
        {
            "name": "Marché Forville",
            "type": "Market",
            "description": "Cannes' main covered market is a feast for the senses, offering local Provençal produce, fresh seafood, cheeses, flowers, and prepared foods. Popular with both locals and chefs from prestigious restaurants, it provides an authentic glimpse into daily life and regional gastronomy.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open Tuesday to Sunday mornings, with Sunday being the busiest. Closed Mondays. The market is replaced by a flea market on Mondays.",
            "booking_tips": "No booking required. Arrive early for the best selection. Bring cash as not all vendors accept cards.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.5517,
            "longitude": 7.0117
        },
        {
            "name": "Centre d'Art La Malmaison",
            "type": "Art Gallery",
            "description": "Housed in the former games pavilion of the Grand Hôtel, this elegant art center hosts temporary exhibitions of modern and contemporary art. Located on La Croisette, it has featured works by Picasso, Matisse, and numerous contemporary artists.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Exhibitions change several times a year. The gallery is air-conditioned, making it a good refuge on hot summer days.",
            "booking_tips": "No advance booking required. Closed between exhibition changes, so check the schedule before visiting.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.5500,
            "longitude": 7.0276
        },
        {
            "name": "Rue d'Antibes",
            "type": "Street",
            "description": "Running parallel to La Croisette, this is the main shopping street in Cannes. Less exclusive than La Croisette, it offers a mix of mainstream brands, local boutiques, gourmet food shops, and cafés. The street extends for about 1 kilometer through the heart of the city.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Busiest during summer and festival periods. Many shops close for lunch between 12:30-2:30 PM. Winter sales (January) and summer sales (July) offer good bargains.",
            "booking_tips": "No booking required. Most shops are closed on Sundays except in high summer.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 43.5519,
            "longitude": 7.0231
        },
        {
            "name": "Notre-Dame d'Espérance",
            "type": "Church",
            "description": "This 16th-century Gothic church stands at the summit of Le Suquet hill. Its simple exterior contrasts with the ornate wood paneling and artwork inside. The church remains an active place of worship and offers stunning views from its forecourt.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Quiet and cool in the mornings. The church hosts concerts during various festivals.",
            "booking_tips": "No booking required. Respect services if visiting during worship times.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 43.5516,
            "longitude": 7.0103
        },
        {
            "name": "Plage du Midi",
            "type": "Beach",
            "description": "Located west of the Old Port, this sandy public beach stretches for nearly a kilometer and is popular with locals. Less crowded than the beaches along La Croisette, it offers a more relaxed atmosphere and beautiful views toward the Esterel mountains.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Less crowded in the mornings. High season (July-August) brings more beachgoers. Showers and toilets available in summer.",
            "booking_tips": "No booking required. Bring your own towels and beach equipment.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 2
            },
            "latitude": 43.5468,
            "longitude": 7.0082
        },
        {
            "name": "Villa Domergue",
            "type": "Historical Villa",
            "description": "This stunning Hispano-Moorish villa was built in the 1930s by artist Jean-Gabriel Domergue and his wife. Set in beautiful gardens with fountains and Mediterranean plants, it hosts art exhibitions and serves as a jury venue during the Cannes Film Festival.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open only during specific exhibitions and events. Gardens are particularly beautiful in spring.",
            "booking_tips": "Check the calendar for open days, as the villa is not open year-round. Special events often require advance booking.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.5553,
            "longitude": 7.0314
        },
        {
            "name": "Fort Royal (Île Sainte-Marguerite)",
            "type": "Historical Monument",
            "description": "Located on the largest of the Lérins Islands, this 17th-century fort is famous for imprisoning the mysterious Man in the Iron Mask. Today it houses the Musée de la Mer, displaying artifacts from shipwrecks and the fort's history. The island also features eucalyptus forests and walking paths.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "The ferry ride can be windy; mornings typically offer calmer seas. The island gets hot in summer, so bring water and sun protection.",
            "booking_tips": "Ferry tickets purchased separately from fort entry. Allow time for both the fort and island exploration.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 43.5186,
            "longitude": 7.0489
        },
        {
            "name": "Monastère Fortifié (Île Saint-Honorat)",
            "type": "Monastery",
            "description": "On the smaller Lérins island, this fortified monastery has been home to Cistercian monks since 1869. The current community continues the tradition of wine production. Visitors can tour the monastery's fortress, church, and grounds, with limited access to areas where monks maintain their contemplative life.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "The monastery shop sells monk-produced wine and honey. Respect quiet zones. The island is less crowded than Sainte-Marguerite.",
            "booking_tips": "Ferry tickets purchased separately. Check monastery visiting hours as they change seasonally.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 43.5069,
            "longitude": 7.0478
        },
        {
            "name": "Allées de la Liberté",
            "type": "Market Square",
            "description": "This picturesque square near the Old Port features plane trees, fountains, and flower markets (Tuesday-Sunday mornings). A popular meeting point, it connects the old and new parts of Cannes and offers views of the marina and Lérins Islands.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Flower market is most vibrant on weekends. The square is beautifully lit in the evening, especially during festivals.",
            "booking_tips": "No booking required. The square hosts an antiques market on Mondays.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 43.5514,
            "longitude": 7.0133
        },
        {
            "name": "Port Pierre Canto",
            "type": "Marina",
            "description": "Located at the eastern end of La Croisette, this modern marina is home to luxury yachts and pleasure boats. A pleasant promenade surrounds the port, offering views of the boats and continuing to Palm Beach beyond.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Especially beautiful at sunset when yacht lights create a magical atmosphere. The summer season brings more impressive vessels.",
            "booking_tips": "No booking required for viewing. Boat tours and charters available from operators at the marina.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 2
            },
            "latitude": 43.5403,
            "longitude": 7.0383
        },
        {
            "name": "Musée d'Art Classique de Mougins",
            "type": "Museum",
            "description": "Located in nearby Mougins (15 minutes from Cannes), this unique museum juxtaposes ancient Greek and Roman art with works by modern masters such as Picasso, Matisse, and Chagall. The collection highlights how classical antiquity has inspired artists throughout the centuries.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Expensive",
            "seasonal_notes": "Open year-round. The village of Mougins itself is worth exploring, known for its culinary scene and artistic heritage.",
            "booking_tips": "No advance booking required. Can be combined with dining in Mougins, known for its fine restaurants.",
            "ratings": {
                "cost_estimate": 25,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 43.6000,
            "longitude": 6.9954
        },
        {
            "name": "La Californie",
            "type": "District",
            "description": "This hillside residential area east of Cannes center is known for its magnificent Belle Époque villas and luxury residences. A drive or walk through the neighborhood offers glimpses of architectural splendor and stunning sea views.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "The winding streets can be explored year-round. Summer evenings offer beautiful light for photographers.",
            "booking_tips": "No booking required. The area can be explored independently or as part of guided tours of Cannes' historic neighborhoods.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 43.5564,
            "longitude": 7.0361
        },
        {
            "name": "Palm Beach",
            "type": "Beach/District",
            "description": "Located at the eastern tip of the Croisette peninsula, this area combines public beaches, upscale residences, and the Palm Beach casino. The beaches here are generally less crowded than those in central Cannes and offer excellent swimming.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "The protected location makes swimming safer than other beaches. Summer weekends bring local families to the beaches.",
            "booking_tips": "No booking required for the public beach. The casino requires entry fee and proper attire.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 2
            },
            "latitude": 43.5375,
            "longitude": 7.0428
        },
        {
            "name": "Eglise Notre-Dame de Bon Voyage",
            "type": "Church",
            "description": "This neoclassical church near the Cannes train station was built in 1840 to serve travelers. Its simple exterior contrasts with the colorful interior featuring marble and painted frescoes. As the main parish church of Cannes, it plays a central role in local religious life.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "A cool refuge in summer. Special services during Easter and Christmas attract larger crowds.",
            "booking_tips": "No booking required. Respect quiet during services.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 43.5530,
            "longitude": 7.0191
        },
        {
            "name": "Mur des Célébrités",
            "type": "Landmark",
            "description": "Located near the Palais des Festivals, this 'Wall of Fame' features hand imprints and signatures from international film stars who have attended the Cannes Film Festival. Similar to Hollywood's Walk of Fame, it allows visitors to compare their hands to those of cinema icons.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Always accessible. During the Film Festival in May, new handprints may be added in special ceremonies.",
            "booking_tips": "No booking required. Can be busy with photographers during the Film Festival.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 43.5505,
            "longitude": 7.0177
        }
    ]
}