{
    "sites": [
      {
        "name": "La Croisette",
        "type": "Boulevard",
        "description": "This iconic palm-lined promenade stretches for 2 kilometers along the Cannes coastline. Famous for its luxury hotels, designer boutiques, and beautiful beaches, La Croisette is the heart of Cannes glamour and offers stunning views of the Mediterranean and the Lérins Islands. The boulevard features elegant Belle Époque architecture, manicured gardens, and the famous red carpet steps of the Palais des Festivals.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Most spectacular at sunset. In summer, the beaches are packed with sunbathers. Winter offers peaceful walks with fewer crowds. Spring brings the Film Festival crowds and excitement.",
        "booking_tips": "No booking required. The public beaches are free, while private beaches charge for loungers and umbrellas. Beach clubs require advance reservations during peak season.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 5,
          "photography_opportunity": 5,
          "accessibility": 5
        },
        "latitude": 43.5500,
        "longitude": 7.0322,
        "address": "Boulevard de la Croisette, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (15 min walk)",
          "parking": "Multiple paid parking lots along the boulevard"
        },
        "nearby_amenities": [
          "Luxury hotels",
          "Designer boutiques",
          "Beach clubs",
          "Restaurants",
          "Cafés"
        ],
        "historical_context": "Originally a simple coastal path, La Croisette was developed in the 19th century as wealthy visitors discovered Cannes. The boulevard became a symbol of the French Riviera's elegance and continues to attract celebrities and luxury travelers worldwide."
      },
      {
        "name": "Palais des Festivals et des Congrès",
        "type": "Conference Center",
        "description": "Home to the world-famous Cannes Film Festival, this modern building with its iconic red carpet steps is a symbol of cinema and glamour. The building hosts numerous events throughout the year and features the Allée des Stars (Cannes Walk of Fame) with handprints of film celebrities. The venue includes multiple auditoriums, exhibition halls, and the famous red carpet that has been walked by countless film stars.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Extremely busy during the Film Festival in May. Guided tours are available year-round except during major events. The building is also used for other international conferences and exhibitions.",
        "booking_tips": "Book guided tours in advance. During the Film Festival, public access is restricted without accreditation. Tours are available in multiple languages.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5,
          "photography_opportunity": 5,
          "accessibility": 4
        },
        "latitude": 43.5505,
        "longitude": 7.0172,
        "address": "1 Boulevard de la Croisette, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (10 min walk)",
          "parking": "Underground parking available"
        },
        "nearby_amenities": [
          "Luxury hotels",
          "Restaurants",
          "Shopping",
          "Beach access"
        ],
        "historical_context": "Built in 1982, the Palais des Festivals replaced the original 1949 building. It has hosted the Cannes Film Festival since 1983 and has become an iconic symbol of international cinema and glamour."
      },
      {
        "name": "Le Suquet (Old Town)",
        "type": "District",
        "description": "The historic heart of Cannes, perched on a hill overlooking the bay. This charming quarter features narrow winding streets, ancient buildings, and excellent restaurants. At the top sits the medieval Château de la Castre museum and the Notre-Dame d'Espérance church with panoramic views of the city. The area retains its authentic Provençal character with traditional architecture and local atmosphere.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "The climb can be hot in summer afternoons. Evening offers beautiful city lights and a lively restaurant scene. Spring and autumn provide the most pleasant temperatures for exploring.",
        "booking_tips": "No booking required for exploring the district. Museum has a separate entrance fee. Wear comfortable shoes for the steep cobblestone streets.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 5,
          "photography_opportunity": 5,
          "accessibility": 3
        },
        "latitude": 43.5508,
        "longitude": 7.0100,
        "address": "Le Suquet, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2"],
          "train": "Cannes station (15 min walk)",
          "parking": "Limited street parking available"
        },
        "nearby_amenities": [
          "Traditional restaurants",
          "Art galleries",
          "Historic sites",
          "Viewpoints"
        ],
        "historical_context": "Le Suquet dates back to Roman times and was originally a fortified settlement protecting the coast from invasions. It evolved into a fishing village before Cannes became a luxury resort destination in the 19th century."
      },
      {
        "name": "Musée de la Castre",
        "type": "Museum",
        "description": "Located in a medieval castle atop Le Suquet hill, this museum houses an eclectic collection of primitive art, Mediterranean antiquities, pre-Columbian ceramics, and 19th-century Provençal landscape paintings. The square tower offers spectacular panoramic views of Cannes and the Mediterranean. The museum also features musical instruments from around the world and temporary exhibitions.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Less crowded on weekdays. The tower climb is particularly rewarding on clear days. Air-conditioned interior provides relief from summer heat.",
        "booking_tips": "No advance booking required. Combined tickets available with other Cannes museums. The tower has narrow stairs and may not be suitable for those with mobility issues.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4,
          "photography_opportunity": 5,
          "accessibility": 3
        },
        "latitude": 43.5511,
        "longitude": 7.0103,
        "address": "Le Suquet, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2"],
          "train": "Cannes station (15 min walk)",
          "parking": "Limited parking in Le Suquet"
        },
        "nearby_amenities": [
          "Restaurants",
          "Historic sites",
          "Viewpoints",
          "Art galleries"
        ],
        "historical_context": "The castle was built in the 11th century by the monks of Lérins Abbey. It served as a defensive structure and later became a museum in 1919, showcasing the diverse cultural heritage of the region."
      },
      {
        "name": "Îles de Lérins",
        "type": "Islands",
        "description": "This group of four Mediterranean islands lies just offshore from Cannes. The two largest, Sainte-Marguerite and Saint-Honorat, are accessible by ferry. Sainte-Marguerite features a fortress where the Man in the Iron Mask was imprisoned, while Saint-Honorat is home to a working monastery producing wine and honey. The islands offer pristine beaches, hiking trails, and crystal-clear waters perfect for swimming and snorkeling.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Ferries run more frequently in summer. The islands are less crowded in spring and fall. Bring water and sun protection. Winter visits offer peaceful exploration but limited ferry schedules.",
        "booking_tips": "Ferry tickets can be purchased at the port. The last return ferry is often early evening, so check the schedule. Book in advance during peak season.",
        "ratings": {
          "cost_estimate": 18,
          "suggested_duration_hours": 5,
          "cultural_significance": 5,
          "photography_opportunity": 5,
          "accessibility": 4
        },
        "latitude": 43.5167,
        "longitude": 7.0500,
        "address": "Îles de Lérins, 06400 Cannes, France",
        "transportation": {
          "ferry": "From Cannes harbor",
          "duration": "15-20 minutes",
          "frequency": "Multiple daily departures"
        },
        "nearby_amenities": [
          "Beaches",
          "Hiking trails",
          "Restaurant (Sainte-Marguerite)",
          "Monastery shop (Saint-Honorat)"
        ],
        "historical_context": "The islands have been inhabited since Roman times. Sainte-Marguerite's fortress was built in the 17th century, while Saint-Honorat has been home to monks since the 5th century. The islands played important roles in Mediterranean trade and defense."
      },
      {
        "name": "Marché Forville",
        "type": "Market",
        "description": "Cannes' main covered market is a feast for the senses, offering local Provençal produce, fresh seafood, cheeses, flowers, and prepared foods. Popular with both locals and chefs from prestigious restaurants, it provides an authentic glimpse into daily life and regional gastronomy. The market building dates from 1964 and features a distinctive Mediterranean architecture.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Open Tuesday to Sunday mornings, with Sunday being the busiest. Closed Mondays. The market is replaced by a flea market on Mondays. Seasonal produce varies throughout the year.",
        "booking_tips": "No booking required. Arrive early for the best selection. Bring cash as not all vendors accept cards. The market is busiest on weekends.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4,
          "photography_opportunity": 4,
          "accessibility": 5
        },
        "latitude": 43.5517,
        "longitude": 7.0117,
        "address": "Place Forville, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8"],
          "train": "Cannes station (10 min walk)",
          "parking": "Nearby parking available"
        },
        "nearby_amenities": [
          "Restaurants",
          "Cafés",
          "Historic sites",
          "Shopping"
        ],
        "historical_context": "The market has been a central part of Cannes' daily life for over a century. The current building was designed by architect Roger Séassal and opened in 1964, replacing the original 19th-century market hall."
      },
      {
        "name": "Centre d'Art La Malmaison",
        "type": "Art Gallery",
        "description": "Housed in the former games pavilion of the Grand Hôtel, this elegant art center hosts temporary exhibitions of modern and contemporary art. Located on La Croisette, it has featured works by Picasso, Matisse, and numerous contemporary artists. The building itself is a work of art with its Belle Époque architecture and beautiful gardens.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Exhibitions change several times a year. The gallery is air-conditioned, making it a good refuge on hot summer days. Check the website for current exhibitions.",
        "booking_tips": "No advance booking required. Closed between exhibition changes, so check the schedule before visiting. Guided tours available in French and English.",
        "ratings": {
          "cost_estimate": 10,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4,
          "photography_opportunity": 3,
          "accessibility": 5
        },
        "latitude": 43.5500,
        "longitude": 7.0276,
        "address": "47 Boulevard de la Croisette, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (15 min walk)",
          "parking": "Nearby parking available"
        },
        "nearby_amenities": [
          "Luxury hotels",
          "Restaurants",
          "Shopping",
          "Beach access"
        ],
        "historical_context": "The building was originally part of the Grand Hôtel, built in 1903. It was converted into an art center in 1983 and has since hosted numerous prestigious exhibitions of modern and contemporary art."
      },
      {
        "name": "Rue d'Antibes",
        "type": "Street",
        "description": "Running parallel to La Croisette, this is the main shopping street in Cannes. Less exclusive than La Croisette, it offers a mix of mainstream brands, local boutiques, gourmet food shops, and cafés. The street extends for about 1 kilometer through the heart of the city and is pedestrian-friendly with numerous shopping opportunities.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Busiest during summer and festival periods. Many shops close for lunch between 12:30-2:30 PM. Winter sales (January) and summer sales (July) offer good bargains.",
        "booking_tips": "No booking required. Most shops are closed on Sundays except in high summer. The street is pedestrianized, making it perfect for leisurely shopping.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 3,
          "photography_opportunity": 3,
          "accessibility": 5
        },
        "latitude": 43.5519,
        "longitude": 7.0231,
        "address": "Rue d'Antibes, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (10 min walk)",
          "parking": "Multiple parking options nearby"
        },
        "nearby_amenities": [
          "Shopping",
          "Restaurants",
          "Cafés",
          "Banks"
        ],
        "historical_context": "Rue d'Antibes has been a central shopping street since the 19th century when Cannes began developing as a resort destination. The street has evolved from local shops to include international brands while maintaining its authentic character."
      },
      {
        "name": "Notre-Dame d'Espérance",
        "type": "Church",
        "description": "This 16th-century Gothic church stands at the summit of Le Suquet hill. Its simple exterior contrasts with the ornate wood paneling and artwork inside. The church remains an active place of worship and offers stunning views from its forecourt. The church features beautiful stained glass windows and a historic organ.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Quiet and cool in the mornings. The church hosts concerts during various festivals. Respect services if visiting during worship times.",
        "booking_tips": "No booking required. Respect services if visiting during worship times. Photography may be restricted during services.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 4,
          "photography_opportunity": 4,
          "accessibility": 3
        },
        "latitude": 43.5516,
        "longitude": 7.0103,
        "address": "Place de la Castre, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2"],
          "train": "Cannes station (15 min walk)",
          "parking": "Limited parking in Le Suquet"
        },
        "nearby_amenities": [
          "Museum",
          "Restaurants",
          "Viewpoints",
          "Historic sites"
        ],
        "historical_context": "Built between 1521 and 1627, the church was originally dedicated to Saint Honorat. It has served as the parish church of Le Suquet for centuries and remains an important spiritual and cultural center for the local community."
      },
      {
        "name": "Plage du Midi",
        "type": "Beach",
        "description": "Located west of the Old Port, this sandy public beach stretches for nearly a kilometer and is popular with locals. Less crowded than the beaches along La Croisette, it offers a more relaxed atmosphere and beautiful views toward the Esterel mountains. The beach features clear waters and is perfect for swimming and sunbathing.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Less crowded in the mornings. High season (July-August) brings more beachgoers. Showers and toilets available in summer. The beach is quieter than central Cannes beaches.",
        "booking_tips": "No booking required. Bring your own towels and beach equipment. There are some beach bars and restaurants nearby.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 2,
          "photography_opportunity": 4,
          "accessibility": 4
        },
        "latitude": 43.5468,
        "longitude": 7.0082,
        "address": "Plage du Midi, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8"],
          "train": "Cannes station (15 min walk)",
          "parking": "Street parking available"
        },
        "nearby_amenities": [
          "Beach bars",
          "Restaurants",
          "Public toilets",
          "Showers"
        ],
        "historical_context": "Plage du Midi has been a popular local beach since the early 20th century. It offers a more authentic beach experience compared to the more tourist-focused beaches along La Croisette."
      },
      {
        "name": "Villa Domergue",
        "type": "Historical Villa",
        "description": "This stunning Hispano-Moorish villa was built in the 1930s by artist Jean-Gabriel Domergue and his wife. Set in beautiful gardens with fountains and Mediterranean plants, it hosts art exhibitions and serves as a jury venue during the Cannes Film Festival. The villa features unique architecture and spectacular views of the Mediterranean.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Moderate",
        "seasonal_notes": "Open only during specific exhibitions and events. Gardens are particularly beautiful in spring. The villa is not open year-round, so check the schedule before visiting.",
        "booking_tips": "Check the calendar for open days, as the villa is not open year-round. Special events often require advance booking. Photography may be restricted.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4,
          "photography_opportunity": 5,
          "accessibility": 3
        },
        "latitude": 43.5553,
        "longitude": 7.0314,
        "address": "Avenue Fiesole, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2"],
          "train": "Cannes station (20 min walk)",
          "parking": "Limited street parking"
        },
        "nearby_amenities": [
          "Gardens",
          "Viewpoints",
          "Historic sites",
          "Residential area"
        ],
        "historical_context": "Built in 1934 by artist Jean-Gabriel Domergue and his wife Odette Maugendre, the villa combines Hispano-Moorish architecture with Mediterranean influences. It has hosted numerous cultural events and exhibitions since its construction."
      },
      {
        "name": "Fort Royal (Île Sainte-Marguerite)",
        "type": "Historical Monument",
        "description": "Located on the largest of the Lérins Islands, this 17th-century fort is famous for imprisoning the mysterious Man in the Iron Mask. Today it houses the Musée de la Mer, displaying artifacts from shipwrecks and the fort's history. The island also features eucalyptus forests and walking paths with stunning coastal views.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "The ferry ride can be windy; mornings typically offer calmer seas. The island gets hot in summer, so bring water and sun protection. The fort provides shade and cool interiors.",
        "booking_tips": "Ferry tickets purchased separately from fort entry. Allow time for both the fort and island exploration. Book ferry tickets in advance during peak season.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 2,
          "cultural_significance": 5,
          "photography_opportunity": 5,
          "accessibility": 3
        },
        "latitude": 43.5186,
        "longitude": 7.0489,
        "address": "Île Sainte-Marguerite, 06400 Cannes, France",
        "transportation": {
          "ferry": "From Cannes harbor",
          "duration": "15 minutes",
          "frequency": "Multiple daily departures"
        },
        "nearby_amenities": [
          "Museum",
          "Beaches",
          "Walking trails",
          "Restaurant"
        ],
        "historical_context": "The fort was built in the 17th century by Richelieu to protect the coast from Spanish attacks. It became famous for imprisoning the mysterious Man in the Iron Mask from 1687 to 1698. The fort has served various military and civilian purposes throughout its history."
      },
      {
        "name": "Monastère Fortifié (Île Saint-Honorat)",
        "type": "Monastery",
        "description": "On the smaller Lérins island, this fortified monastery has been home to Cistercian monks since 1869. The current community continues the tradition of wine production. Visitors can tour the monastery's fortress, church, and grounds, with limited access to areas where monks maintain their contemplative life. The island offers peaceful walking trails and beautiful coastal views.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "The monastery shop sells monk-produced wine and honey. Respect quiet zones. The island is less crowded than Sainte-Marguerite. The monks maintain strict visiting hours.",
        "booking_tips": "Ferry tickets purchased separately. Check monastery visiting hours as they change seasonally. Respect the monks' privacy and quiet zones.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 3,
          "cultural_significance": 5,
          "photography_opportunity": 4,
          "accessibility": 3
        },
        "latitude": 43.5069,
        "longitude": 7.0478,
        "address": "Île Saint-Honorat, 06400 Cannes, France",
        "transportation": {
          "ferry": "From Cannes harbor",
          "duration": "15 minutes",
          "frequency": "Multiple daily departures"
        },
        "nearby_amenities": [
          "Monastery shop",
          "Walking trails",
          "Beaches",
          "Historic sites"
        ],
        "historical_context": "The monastery was founded in the 5th century by Saint Honorat. The current fortified structure dates from the 11th century and has been continuously inhabited by monks. The monastery has played a crucial role in the religious and cultural history of the region."
      },
      {
        "name": "Allées de la Liberté",
        "type": "Market Square",
        "description": "This picturesque square near the Old Port features plane trees, fountains, and flower markets (Tuesday-Sunday mornings). A popular meeting point, it connects the old and new parts of Cannes and offers views of the marina and Lérins Islands. The square is particularly beautiful during the Christmas season when it hosts a festive market.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Flower market is most vibrant on weekends. The square is beautifully lit in the evening, especially during festivals. Christmas market runs from late November to early January.",
        "booking_tips": "No booking required. The square hosts an antiques market on Mondays. The flower market is busiest on weekends.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 3,
          "photography_opportunity": 4,
          "accessibility": 5
        },
        "latitude": 43.5514,
        "longitude": 7.0133,
        "address": "Allées de la Liberté, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8"],
          "train": "Cannes station (10 min walk)",
          "parking": "Nearby parking available"
        },
        "nearby_amenities": [
          "Flower market",
          "Cafés",
          "Shopping",
          "Marina"
        ],
        "historical_context": "The square was created in the 19th century as part of Cannes' development as a resort destination. It has served as a central gathering place for locals and visitors ever since, hosting various markets and events throughout the year."
      },
      {
        "name": "Port Pierre Canto",
        "type": "Marina",
        "description": "Located at the eastern end of La Croisette, this modern marina is home to luxury yachts and pleasure boats. A pleasant promenade surrounds the port, offering views of the boats and continuing to Palm Beach beyond. The marina features modern facilities and is a popular spot for yacht watching and maritime photography.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Especially beautiful at sunset when yacht lights create a magical atmosphere. The summer season brings more impressive vessels. The marina is quieter in winter but still picturesque.",
        "booking_tips": "No booking required for viewing. Boat tours and charters available from operators at the marina. The promenade is perfect for evening strolls.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 2,
          "photography_opportunity": 4,
          "accessibility": 5
        },
        "latitude": 43.5403,
        "longitude": 7.0383,
        "address": "Port Pierre Canto, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8"],
          "train": "Cannes station (20 min walk)",
          "parking": "Marina parking available"
        },
        "nearby_amenities": [
          "Marina facilities",
          "Restaurants",
          "Beach access",
          "Walking paths"
        ],
        "historical_context": "The marina was developed in the 1970s as part of Cannes' expansion as a luxury destination. It has become a prestigious location for luxury yachts and is a symbol of the city's maritime heritage and modern development."
      },
      {
        "name": "Musée d'Art Classique de Mougins",
        "type": "Museum",
        "description": "Located in nearby Mougins (15 minutes from Cannes), this unique museum juxtaposes ancient Greek and Roman art with works by modern masters such as Picasso, Matisse, and Chagall. The collection highlights how classical antiquity has inspired artists throughout the centuries. The museum is housed in a beautiful 19th-century building with gardens.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Expensive",
        "seasonal_notes": "Open year-round. The village of Mougins itself is worth exploring, known for its culinary scene and artistic heritage. The museum is air-conditioned and perfect for hot summer days.",
        "booking_tips": "No advance booking required. Can be combined with dining in Mougins, known for its fine restaurants. The museum is easily accessible by car or taxi from Cannes.",
        "ratings": {
          "cost_estimate": 25,
          "suggested_duration_hours": 2,
          "cultural_significance": 4,
          "photography_opportunity": 3,
          "accessibility": 4
        },
        "latitude": 43.6000,
        "longitude": 6.9954,
        "address": "32 Rue Commandeur, 06250 Mougins, France",
        "transportation": {
          "car": "15 minutes from Cannes",
          "taxi": "Available from Cannes",
          "bus": "Limited service"
        },
        "nearby_amenities": [
          "Restaurants",
          "Art galleries",
          "Historic village",
          "Gardens"
        ],
        "historical_context": "The museum was founded in 2008 by Christian Levett, a British collector. It is housed in a 19th-century building that was once a private residence. The collection demonstrates the enduring influence of classical art on modern masters."
      },
      {
        "name": "La Californie",
        "type": "District",
        "description": "This hillside residential area east of Cannes center is known for its magnificent Belle Époque villas and luxury residences. A drive or walk through the neighborhood offers glimpses of architectural splendor and stunning sea views. The area is particularly famous for its association with artists and celebrities who have lived here.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "The winding streets can be explored year-round. Summer evenings offer beautiful light for photographers. The area is quieter than central Cannes and offers a more residential atmosphere.",
        "booking_tips": "No booking required. The area can be explored independently or as part of guided tours of Cannes' historic neighborhoods. Respect private property when taking photographs.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3,
          "photography_opportunity": 4,
          "accessibility": 3
        },
        "latitude": 43.5564,
        "longitude": 7.0361,
        "address": "La Californie, 06400 Cannes, France",
        "transportation": {
          "car": "Recommended",
          "bus": ["Lines 1, 2"],
          "taxi": "Available"
        },
        "nearby_amenities": [
          "Residential area",
          "Viewpoints",
          "Historic villas",
          "Gardens"
        ],
        "historical_context": "La Californie was developed in the late 19th century as wealthy visitors sought private retreats above the growing resort town. It became known for its prestigious villas and artistic residents, including Pablo Picasso who lived here in the 1950s."
      },
      {
        "name": "Palm Beach",
        "type": "Beach/District",
        "description": "Located at the eastern tip of the Croisette peninsula, this area combines public beaches, upscale residences, and the Palm Beach casino. The beaches here are generally less crowded than those in central Cannes and offer excellent swimming. The area features a more relaxed atmosphere while maintaining the elegance of Cannes.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "The protected location makes swimming safer than other beaches. Summer weekends bring local families to the beaches. The area is quieter than central Cannes but still offers all amenities.",
        "booking_tips": "No booking required for the public beach. The casino requires entry fee and proper attire. Beach clubs may require reservations during peak season.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 2,
          "photography_opportunity": 4,
          "accessibility": 4
        },
        "latitude": 43.5375,
        "longitude": 7.0428,
        "address": "Palm Beach, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8"],
          "train": "Cannes station (25 min walk)",
          "parking": "Street parking available"
        },
        "nearby_amenities": [
          "Beaches",
          "Casino",
          "Restaurants",
          "Marina"
        ],
        "historical_context": "Palm Beach was developed later than central Cannes, becoming popular in the mid-20th century as a fashionable extension of the resort area. The Palm Beach Casino opened in the 1920s and has been a landmark ever since."
      },
      {
        "name": "Eglise Notre-Dame de Bon Voyage",
        "type": "Church",
        "description": "This neoclassical church near the Cannes train station was built in 1840 to serve travelers. Its simple exterior contrasts with the colorful interior featuring marble and painted frescoes. As the main parish church of Cannes, it plays a central role in local religious life. The church features beautiful stained glass and a historic organ.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "A cool refuge in summer. Special services during Easter and Christmas attract larger crowds. The church is particularly beautiful during religious holidays.",
        "booking_tips": "No booking required. Respect quiet during services. Photography may be restricted during worship times.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 3,
          "photography_opportunity": 3,
          "accessibility": 5
        },
        "latitude": 43.5530,
        "longitude": 7.0191,
        "address": "Rue Notre-Dame, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (5 min walk)",
          "parking": "Nearby parking available"
        },
        "nearby_amenities": [
          "Train station",
          "Shopping",
          "Restaurants",
          "Banks"
        ],
        "historical_context": "Built in 1840, the church was designed to serve the growing population of Cannes as it developed into a resort destination. The name 'Notre-Dame de Bon Voyage' reflects its role in blessing travelers and fishermen."
      },
      {
        "name": "Mur des Célébrités",
        "type": "Landmark",
        "description": "Located near the Palais des Festivals, this 'Wall of Fame' features hand imprints and signatures from international film stars who have attended the Cannes Film Festival. Similar to Hollywood's Walk of Fame, it allows visitors to compare their hands to those of cinema icons. The wall is a popular photo opportunity for film enthusiasts.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Always accessible. During the Film Festival in May, new handprints may be added in special ceremonies. The wall is particularly busy during the festival period.",
        "booking_tips": "No booking required. Can be busy with photographers during the Film Festival. Visit early morning or evening for fewer crowds.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 0.5,
          "cultural_significance": 3,
          "photography_opportunity": 4,
          "accessibility": 5
        },
        "latitude": 43.5505,
        "longitude": 7.0177,
        "address": "Near Palais des Festivals, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (10 min walk)",
          "parking": "Nearby parking available"
        },
        "nearby_amenities": [
          "Palais des Festivals",
          "Shopping",
          "Restaurants",
          "Beach access"
        ],
        "historical_context": "The Mur des Célébrités was created to commemorate the stars who have attended the Cannes Film Festival. It serves as a permanent tribute to the festival's history and the celebrities who have graced the red carpet."
      },
      {
        "name": "Casino Barrière Le Croisette",
        "type": "Casino",
        "description": "A glamorous casino located on the iconic La Croisette, offering a high-end gaming experience alongside luxury dining and live entertainment. A popular destination during the Cannes Film Festival and throughout the summer season. The casino features elegant interiors and a sophisticated atmosphere.",
        "indoor": true,
        "best_time": "Evening",
        "price_range": "Expensive",
        "seasonal_notes": "Very busy during the Cannes Film Festival and summer nights. Dress code applies. The casino is open year-round and offers entertainment throughout the year.",
        "booking_tips": "No advance booking required for gaming. Check event schedules for live shows and dining reservations. Dress code is strictly enforced.",
        "ratings": {
          "cost_estimate": 20,
          "suggested_duration_hours": 2,
          "cultural_significance": 3,
          "photography_opportunity": 2,
          "accessibility": 4
        },
        "latitude": 43.5510,
        "longitude": 7.0325,
        "address": "50 Boulevard de la Croisette, 06400 Cannes, France",
        "transportation": {
          "bus": ["Lines 1, 2, 8, 9"],
          "train": "Cannes station (15 min walk)",
          "parking": "Casino parking available"
        },
        "nearby_amenities": [
          "Luxury hotels",
          "Restaurants",
          "Shopping",
          "Beach access"
        ],
        "historical_context": "The Casino Barrière Le Croisette is part of the prestigious Barrière group of casinos. It has been a landmark of La Croisette since its opening, offering entertainment and gaming in an elegant setting that reflects the glamour of the French Riviera."
      }
    ]
  }
  