{
    "Spring": {
        "activities": [
            {
                "name": "Cannes Film Festival Preparation",
                "type": "Cultural Experience",
                "description": "Experience the excitement building up to the world-famous Cannes Film Festival. Walk the red carpet steps, visit the Palais des Festivals, and soak in the pre-festival atmosphere.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "May is when Cannes transforms into the world's film capital. The city buzzes with anticipation and preparation.",
                "booking_tips": "Visit early morning to avoid crowds. The red carpet is accessible year-round for photos."
            },
            {
                "name": "Spring Flower Market at Marché Forville",
                "type": "Market Experience",
                "description": "Experience the vibrant spring flower market with colorful blooms, local produce, and the authentic atmosphere of Cannes' main market.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the most beautiful flowers and fresh seasonal produce. Market is most lively on Tuesday, Thursday, and Saturday mornings.",
                "booking_tips": "Arrive early for best selection. Bring a camera for the colorful displays. Try free samples from vendors."
            },
            {
                "name": "Coastal Walking on La Croisette",
                "type": "Outdoor Activity",
                "description": "Enjoy pleasant spring weather while strolling along the famous palm-lined promenade, taking in Mediterranean views and the elegant atmosphere.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Perfect spring temperatures for walking. Fewer crowds than summer, making it ideal for photography and people-watching.",
                "booking_tips": "Start early to avoid afternoon heat. Perfect time for photography with soft spring light."
            },
            {
                "name": "Le Suquet Historic Walking Tour",
                "type": "Cultural Tour",
                "description": "Explore Cannes' charming old town with comfortable spring weather. Visit the medieval castle, historic church, and narrow cobblestone streets.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring offers ideal temperatures for exploring the hilly historic quarter. Beautiful light for photography.",
                "booking_tips": "Wear comfortable shoes for the steep cobblestone streets. Visit the church terrace for panoramic views."
            },
            {
                "name": "Spring Beach Day at Plage de la Croisette",
                "type": "Beach Activity",
                "description": "Enjoy the beaches before the summer crowds arrive. Perfect weather for sunbathing, swimming, and beachside dining.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers pleasant temperatures and fewer crowds. Water may still be cool but beaches are peaceful.",
                "booking_tips": "Beach clubs open in spring with better prices than peak season. Bring layers for changing temperatures."
            },
            {
                "name": "Provençal Cooking Workshop",
                "type": "Culinary Experience",
                "description": "Learn to cook traditional Provençal dishes using spring ingredients like fresh herbs, seasonal vegetables, and local olive oil.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring provides the best seasonal ingredients for authentic Provençal cuisine. Perfect time to learn local culinary traditions.",
                "booking_tips": "Book in advance with local cooking schools. Often includes market visits and full meal preparation."
            },
            {
                "name": "Island Day Trip to Île Sainte-Marguerite",
                "type": "Nature Excursion",
                "description": "Take advantage of spring weather to visit the peaceful island with its historic fort, nature trails, and beautiful beaches.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers ideal conditions for island exploration. Fewer tourists and pleasant temperatures for hiking.",
                "booking_tips": "Book ferry tickets in advance. Bring water and snacks as island facilities are limited."
            },
            {
                "name": "Spring Photography at Pointe de l'Aiguille",
                "type": "Photography",
                "description": "Capture stunning spring landscapes at this scenic coastal point with views of the Mediterranean and Esterel massif.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Spring light provides excellent photography conditions. Wildflowers bloom along the coastal paths.",
                "booking_tips": "Best light is 1-2 hours before sunset. Bring tripod for long exposures. Watch for coastal winds."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Cannes Film Festival",
                "type": "Cultural Festival",
                "description": "Experience the world's most prestigious film festival with red carpet premieres, celebrity sightings, and the glamorous atmosphere that defines Cannes.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Expensive",
                "seasonal_notes": "The highlight of Cannes' cultural calendar, usually held in May. The city transforms into a global film capital.",
                "booking_tips": "Book accommodations and restaurants months in advance. Many events require official accreditation."
            },
            {
                "name": "Beach Club Experience",
                "type": "Luxury Beach Activity",
                "description": "Enjoy the exclusive beach clubs along La Croisette with private beach access, water sports, gourmet dining, and celebrity spotting.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer is peak season for beach clubs. Perfect weather for swimming, sunbathing, and luxury beach experiences.",
                "booking_tips": "Reserve beach beds and dining well in advance. Dress codes may apply at upscale clubs."
            },
            {
                "name": "Sunset Sailing on the Mediterranean",
                "type": "Boat Experience",
                "description": "Charter a yacht or join a sailing excursion to experience the stunning Mediterranean sunset from the water, with views of the French Riviera coastline.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular sunsets and calm sea conditions. Perfect for romantic experiences.",
                "booking_tips": "Book private charters or group excursions in advance. Sunset tours are most popular."
            },
            {
                "name": "La Croisette Evening Stroll",
                "type": "Cultural Experience",
                "description": "Experience the glamorous evening atmosphere along the famous promenade, with luxury boutiques, elegant hotels, and the Mediterranean backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings are magical with warm temperatures and vibrant atmosphere. Perfect for people-watching.",
                "booking_tips": "No booking required. Best atmosphere during sunset and early evening. Many boutiques stay open late."
            },
            {
                "name": "Water Sports at Plage du Midi",
                "type": "Adventure Activity",
                "description": "Enjoy water sports including jet skiing, paddleboarding, and parasailing at this local beach with excellent facilities.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers perfect water temperatures and calm conditions for water sports. Professional instructors available.",
                "booking_tips": "Book water sports activities in advance during peak season. Equipment rental available on-site."
            },
            {
                "name": "Provençal Wine Tasting",
                "type": "Wine Experience",
                "description": "Visit local vineyards in the Provence wine region to taste rosé wines and learn about French Riviera winemaking traditions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer harvest season offers insights into winemaking. Indoor tastings provide relief from afternoon heat.",
                "booking_tips": "Book vineyard tours in advance. Often includes transportation and food pairings. Designated driver required."
            },
            {
                "name": "Evening Aperitif Culture",
                "type": "Social Experience",
                "description": "Experience authentic French Riviera social life with evening aperitifs at waterfront cafés, watching the sunset over the Mediterranean.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor socializing. Experience the relaxed Mediterranean lifestyle.",
                "booking_tips": "No booking needed for most cafés. Best spots along the waterfront. Try local rosé wine and pastis."
            },
            {
                "name": "Casino Barrière Cannes",
                "type": "Entertainment",
                "description": "Experience the glamour of Cannes' famous casino with gaming tables, entertainment, and the sophisticated atmosphere of the French Riviera.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer brings increased activity and special events. Perfect for evening entertainment and people-watching.",
                "booking_tips": "Dress code enforced - smart casual required. Must be 18+ with valid ID. Restaurant reservations recommended."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Post-Festival Cultural Exploration",
                "type": "Cultural Activity",
                "description": "Explore Cannes' cultural offerings after the summer crowds disperse. Visit museums, galleries, and historic sites in peaceful autumn atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers fewer crowds and pleasant temperatures for cultural exploration. Museums are more accessible.",
                "booking_tips": "Check for special autumn exhibitions. Many cultural venues offer reduced rates during off-season."
            },
            {
                "name": "Autumn Market at Marché Forville",
                "type": "Market Experience",
                "description": "Experience the autumn harvest at Cannes' main market with seasonal produce, local specialties, and authentic Provençal atmosphere.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings seasonal specialties like truffles, mushrooms, and autumn fruits. Market is less crowded than summer.",
                "booking_tips": "Visit early for best selection. Try seasonal specialties and local autumn products."
            },
            {
                "name": "Coastal Hiking to Cap d'Antibes",
                "type": "Outdoor Activity",
                "description": "Enjoy perfect hiking weather to explore the scenic coastal paths leading to Cap d'Antibes with stunning Mediterranean views.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Ideal hiking temperatures without summer heat. Crystal clear autumn air provides spectacular coastal views.",
                "booking_tips": "Start early to avoid afternoon heat. Bring camera and comfortable hiking shoes. Some trails require good fitness."
            },
            {
                "name": "Provençal Truffle Season",
                "type": "Culinary Experience",
                "description": "Experience the start of truffle season in Provence, with special menus at local restaurants and truffle markets in nearby villages.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Truffle season begins in autumn. Many restaurants feature special truffle menus during this period.",
                "booking_tips": "Reserve at restaurants known for truffle dishes. Consider truffle hunting experiences in nearby Provence."
            },
            {
                "name": "Wine Harvest in Provence",
                "type": "Agricultural Experience",
                "description": "Join local vineyards during harvest season to pick grapes and learn about traditional Provençal winemaking.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September to October is harvest season. Experience authentic agricultural traditions and seasonal rhythms.",
                "booking_tips": "Contact local vineyards directly. Often includes meals and wine tasting. Advance booking essential."
            },
            {
                "name": "Storm Watching at Pointe de l'Aiguille",
                "type": "Natural Phenomenon",
                "description": "Experience the dramatic autumn storms and wild seas from the safety of the coastal viewpoint, watching powerful waves crash against the rocks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings more dramatic weather and spectacular storm watching opportunities. Impressive wave action.",
                "booking_tips": "Check weather conditions for safety. Best during windy days. Dress warmly and bring rain protection."
            },
            {
                "name": "Traditional Craft Workshops",
                "type": "Cultural Workshop",
                "description": "Learn traditional Provençal crafts like pottery, textile work, or olive oil production from local artisans.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is perfect for learning indoor crafts. Many artisans offer workshops as tourist season winds down.",
                "booking_tips": "Book with local artisan associations. Often includes take-home pieces. Great for unique souvenirs."
            },
            {
                "name": "Mushroom Foraging in Provence",
                "type": "Nature Activity",
                "description": "Join guided foraging trips to discover edible mushrooms in Provençal forests, learning about local varieties and traditional uses.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Peak mushroom season in Provençal forests. Important part of traditional Provençal cuisine and culture.",
                "booking_tips": "Must join guided tours for safety. Often includes cooking session. Check weather for recent rain."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Market on Allées de la Liberté",
                "type": "Holiday Market",
                "description": "Experience the charming Christmas market featuring local Provençal crafts, seasonal treats, and holiday decorations in the heart of Cannes.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Brings festive warmth to winter evenings. Features unique Provençal holiday traditions and locally made gifts.",
                "booking_tips": "No booking required. Best atmosphere in evening when lights are on. Try local holiday specialties."
            },
            {
                "name": "Indoor Museum Marathon",
                "type": "Cultural Activity",
                "description": "Spend winter days exploring Cannes' excellent museums including Musée de la Castre and Villa Domergue during cooler weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect weather for indoor cultural exploration. Museums are less crowded and offer deeper exploration opportunities.",
                "booking_tips": "Consider museum passes for multiple visits. Many offer guided tours. Combine with café stops for warmth."
            },
            {
                "name": "Traditional Provençal Winter Meals",
                "type": "Culinary Experience",
                "description": "Enjoy hearty winter meals featuring Provençal specialties, truffles, and other traditional winter foods in cozy local restaurants.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Peak season for traditional winter foods. Many restaurants feature special winter menus with seasonal ingredients.",
                "booking_tips": "Reserve at traditional restaurants. Try pairing with local Provençal wines and aged cheeses."
            },
            {
                "name": "Thermal Springs in Provence",
                "type": "Wellness Activity",
                "description": "Warm up in natural thermal springs in nearby Provence, a perfect winter retreat offering relaxation and therapeutic benefits.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Natural hot springs provide warmth during cooler months. Beautiful winter Provençal scenery surrounding the springs.",
                "booking_tips": "Check access conditions in winter. Bring towels and warm clothes for changing. Natural pools with no facilities."
            },
            {
                "name": "Storm Photography and Coastal Views",
                "type": "Photography",
                "description": "Capture dramatic winter storms and moody Mediterranean seascapes from coastal viewpoints and waterfront locations.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and stormy seas perfect for photography. Clear post-storm days offer incredible visibility.",
                "booking_tips": "Dress warmly and protect camera equipment. Best after storms when light is dramatic. Check wind conditions for safety."
            },
            {
                "name": "Cozy Wine Bar Evenings",
                "type": "Social Activity",
                "description": "Warm up in traditional wine bars with local Provençal vintages, charcuterie platters, and the company of locals during long winter evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect season for indoor socializing. Wine bars offer warmth, local atmosphere, and seasonal food pairings.",
                "booking_tips": "No reservations usually needed. Learn basic French phrases for better interaction. Try different neighborhoods for variety."
            },
            {
                "name": "Winter Beach Walks",
                "type": "Nature Activity",
                "description": "Enjoy peaceful winter walks along the beaches with dramatic winter light, fewer crowds, and the therapeutic sound of winter waves.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter beaches offer peaceful solitude and dramatic natural beauty. Perfect for reflection and photography.",
                "booking_tips": "Dress warmly and wear appropriate footwear. Best during low tide for beach exploration."
            },
            {
                "name": "Provençal Olive Oil Tasting",
                "type": "Culinary Experience",
                "description": "Visit local olive mills during the winter harvest season to taste fresh olive oil and learn about traditional production methods.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is olive harvest season in Provence. Experience the production of one of the region's most important products.",
                "booking_tips": "Book tours in advance with local olive mills. Often includes tastings and product purchases."
            }
        ]
    }
}