{
    "Spring": {
        "activities": [
            {
                "name": "Heidelberg Spring Festival",
                "type": "Cultural/Festival",
                "description": "Experience Heidelberg's vibrant spring festival at the Marktplatz, featuring traditional music, cultural performances, and local wine specialties in the historic city center.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free (food and activities extra)",
                "seasonal_notes": "Taking place annually in April, this festival celebrates spring with traditional music, cultural performances, and local specialties. The historic market square transforms into a celebration of spring with food stalls, cultural events, and family activities.",
                "booking_tips": "No tickets needed for general admission. Some performances may require advance booking. Accessible via tram to Marktplatz. Best to visit on weekdays for smaller crowds."
            },
            {
                "name": "Philosopher's Walk Cherry Blossoms",
                "type": "Nature",
                "description": "Experience the stunning cherry blossom season along Heidelberg's historic Philosopher's Walk, where classical architecture meets natural beauty.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Late March to mid-April brings spectacular cherry blossoms to the Philosopher's Walk and surrounding gardens. The contrast between pink blossoms and historic architecture creates perfect photo opportunities.",
                "booking_tips": "No booking required. Best viewed early morning for photography. Accessible via multiple paths from the old town. Consider combining with castle visit."
            },
            {
                "name": "Heidelberg Zoo Spring Awakening",
                "type": "Nature/Cultural",
                "description": "Visit Heidelberg's historic zoo as it comes alive in spring, featuring blooming gardens, historic architecture, and special spring animal activities.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings spectacular flowering displays and increased animal activity. The historic zoo showcases magnificent spring blooms and the awakening of the gardens against historic architecture.",
                "booking_tips": "Purchase tickets online to avoid queues. Accessible via tram to Zoo. Morning visits offer best animal viewing and photography opportunities."
            },
            {
                "name": "Heidelberg Literature Festival",
                "type": "Cultural/Literature",
                "description": "Experience Heidelberg's major literary festival, featuring international authors, readings, and literary events throughout the city.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings this major literary event to Heidelberg, with opportunities to meet authors, attend readings, and explore new publications in historic venues.",
                "booking_tips": "Book tickets in advance. Various venues throughout city center. Some events require separate tickets. Consider multi-day passes for full experience."
            },
            {
                "name": "Kurpfälzisches Museum Spring Exhibitions",
                "type": "Cultural/Art",
                "description": "Visit special spring exhibitions at the Kurpfälzisches Museum, featuring contemporary and classical art in this historic building.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings special exhibitions and art events to the museum. The historic architecture offers perfect conditions for exploring art history regardless of weather.",
                "booking_tips": "Book tickets online to avoid queues. Accessible via tram to Marktplatz. Special exhibitions may require additional tickets. Free guided tours available."
            },
            {
                "name": "Botanical Garden Spring Bloom",
                "type": "Nature/Leisure",
                "description": "Experience Heidelberg's historic botanical garden as it comes alive in spring, featuring spectacular flower displays and special spring events.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring transforms this historic garden with thousands of spring flowers. The garden's unique design and hillside location offer stunning views and peaceful walks.",
                "booking_tips": "No booking required. Accessible via tram to Universität. Consider joining guided botanical tours available on weekends."
            },
            {
                "name": "Heidelberg Castle Spring Events",
                "type": "Cultural/Performance",
                "description": "Experience special spring events at Heidelberg Castle, featuring cultural performances and historic tours in this iconic setting.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Spring season brings special events and performances to one of Germany's most famous castles. The historic setting provides a perfect backdrop for cultural evenings.",
                "booking_tips": "Book tickets well in advance, especially for special events. Accessible via funicular or walking. Evening performances often include castle illumination."
            },
            {
                "name": "Historic Streets Spring Market",
                "type": "Cultural/Shopping",
                "description": "Explore Heidelberg's historic streets during spring markets, featuring local artisans, food vendors, and cultural performances in historic surroundings.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free (purchases extra)",
                "seasonal_notes": "Spring brings special markets and events to these historic streets, with local artisans and food vendors creating a vibrant atmosphere in the historic setting.",
                "booking_tips": "No booking required. Located in central Heidelberg, walking distance from Marktplatz. Many shops and galleries offer extended hours during market days."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Heidelberg Summer Festival",
                "type": "Cultural/Festival",
                "description": "Experience Heidelberg's largest summer celebration, featuring outdoor concerts, cultural performances, and wine festivals throughout the city center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Early August brings this vibrant festival to Heidelberg's center, transforming Marktplatz and surrounding areas into a cultural celebration with multiple stages and events.",
                "booking_tips": "Most events are free, but some concerts require tickets. Book special performances in advance. Multiple venues throughout city center, all accessible by public transport."
            },
            {
                "name": "Heidelberg Castle Festival",
                "type": "Cultural/Music",
                "description": "Experience one of Germany's most prestigious open-air festivals, featuring performances in the historic castle courtyard.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Summer brings this major festival to Heidelberg Castle, celebrating the city's rich cultural heritage with performances in the historic castle courtyard.",
                "booking_tips": "Book tickets well in advance. Located at Heidelberg Castle. Festival passes available for multiple events. Some performances may be moved indoors in bad weather."
            },
            {
                "name": "Open-Air Cinema at Neckarwiese",
                "type": "Cultural/Entertainment",
                "description": "Enjoy outdoor film screenings along the Neckar River, featuring international films and special events throughout summer.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings transform the Neckarwiese into an open-air cinema, with the castle and old town providing a stunning backdrop for film screenings under the stars.",
                "booking_tips": "Book tickets online in advance. Bring blankets or rent seats on-site. Films shown in original language with subtitles. Screenings may be canceled in bad weather."
            },
            {
                "name": "Neckar River Summer Experience",
                "type": "Nature/Cultural",
                "description": "Experience Heidelberg's river culture with boat tours, riverside events, and special summer activities along the Neckar.",
                "indoor": false,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings special events and increased river activity, with boat tours and riverside venues creating a vibrant atmosphere.",
                "booking_tips": "Book boat tours in advance. Multiple access points along the river. Evening events often include food and drink options. Consider combining with castle visit."
            },
            {
                "name": "Heidelberg Beer Gardens",
                "type": "Cultural/Food & Drink",
                "description": "Experience Heidelberg's traditional beer garden culture, with numerous venues offering local beers, food, and city views.",
                "indoor": false,
                "best_time": "Afternoon to Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is peak season for Heidelberg's beer gardens, with many venues offering perfect settings for enjoying local beers and traditional food.",
                "booking_tips": "No reservations needed for most beer gardens. Popular venues include various locations along the Neckar. Evening sessions can be busy, especially on weekends."
            },
            {
                "name": "Student Quarter Summer Events",
                "type": "Cultural/Entertainment",
                "description": "Experience summer events in Heidelberg's historic student quarter, featuring cultural performances and traditional student celebrations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Summer brings various events to the student quarter, with traditional student pubs and cultural venues creating a vibrant atmosphere.",
                "booking_tips": "No advance booking needed. Located in historic student quarter. Evening events often include food and drink options. Consider visiting multiple venues."
            },
            {
                "name": "Heidelberg Zoo Summer Experience",
                "type": "Nature/Cultural",
                "description": "Experience Heidelberg Zoo's summer attractions, including special exhibits and summer animal activities.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings special events and increased animal activity to the zoo, with indoor exhibits offering a cool escape on hot days.",
                "booking_tips": "Purchase tickets online to avoid queues. Accessible via tram to Zoo. Early morning visits offer best animal viewing. Special summer evening events available."
            },
            {
                "name": "Botanical Garden Summer Tours",
                "type": "Nature/Cultural",
                "description": "Explore Heidelberg's historic botanical garden through guided tours, learning about plant collections while enjoying summer blooms.",
                "indoor": false,
                "best_time": "Morning to Afternoon",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Summer offers perfect conditions for exploring the botanical garden's extensive collections, with guided tours explaining plant diversity and garden history.",
                "booking_tips": "Book guided tours in advance through the garden. Tours available in multiple languages. Wear appropriate walking shoes. Some tours include special collections."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Heidelberg Wine Festival",
                "type": "Cultural/Festival",
                "description": "Experience Heidelberg's major wine festival, featuring local wines, cultural events, and traditional celebrations in the historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings this major wine festival to Heidelberg, celebrating the region's rich wine culture with tastings and cultural events.",
                "booking_tips": "No advance booking needed for general admission. Located around Marktplatz. Wine tastings and special events may require tickets. Consider wine tours."
            },
            {
                "name": "Heidelberg Jazz Festival",
                "type": "Cultural/Music",
                "description": "Experience international jazz performances throughout Heidelberg's venues, from historic theaters to modern clubs.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Autumn brings world-class jazz performances to various venues throughout Heidelberg, creating perfect indoor entertainment as temperatures cool.",
                "booking_tips": "Book tickets in advance for popular performances. Various venues throughout city center. Festival passes available for multiple events."
            },
            {
                "name": "Autumn Colors at Heidelberg Castle",
                "type": "Nature/Cultural",
                "description": "Experience the spectacular autumn transformation of Heidelberg Castle's gardens, with special seasonal displays and cultural events.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings stunning colors to the castle's gardens, while special events and guided tours offer unique perspectives of the historic site.",
                "booking_tips": "Purchase tickets online to avoid queues. Accessible via funicular or walking. Special autumn guided tours available on weekends."
            },
            {
                "name": "Kurpfälzisches Museum Autumn Exhibitions",
                "type": "Cultural/Art",
                "description": "Visit autumn special exhibitions at the Kurpfälzisches Museum, featuring unique displays and events in this historic building.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings special exhibitions and events focusing on art history and contemporary works, perfect for cooler days.",
                "booking_tips": "Book tickets online to avoid queues. Accessible via tram to Marktplatz. Special exhibitions may require additional tickets."
            },
            {
                "name": "Heidelberg Literature Festival",
                "type": "Cultural",
                "description": "Experience international literary events, readings, and discussions throughout Heidelberg's cultural venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Autumn brings literary celebrations to various venues, with international authors and local writers creating diverse cultural programs.",
                "booking_tips": "Book tickets for specific events in advance. Various venues throughout city center. Some readings in original languages with translations."
            },
            {
                "name": "Historic Streets Autumn Market",
                "type": "Cultural/Shopping",
                "description": "Explore Heidelberg's historic streets during autumn markets, featuring seasonal products, artisanal crafts, and cultural events.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free (purchases extra)",
                "seasonal_notes": "Autumn brings special markets to these historic streets, with seasonal products and traditional crafts creating a festive atmosphere.",
                "booking_tips": "No booking required. Located in central Heidelberg, walking distance from Marktplatz. Many shops offer special autumn collections."
            },
            {
                "name": "Heidelberg Castle Season Opening",
                "type": "Cultural/Performance",
                "description": "Experience special autumn events at Heidelberg Castle, featuring cultural performances and historic tours.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Autumn marks the beginning of special castle events, with prestigious productions and cultural performances in the historic setting.",
                "booking_tips": "Book tickets well in advance, especially for special events. Located at Heidelberg Castle. Evening dress recommended for premieres."
            },
            {
                "name": "Bergheim Autumn Festival",
                "type": "Cultural/Festival",
                "description": "Experience autumn celebrations in Heidelberg's historic Bergheim district, featuring cultural events, food, and historic tours.",
                "indoor": false,
                "best_time": "Afternoon to Evening",
                "price_range": "Free (food and activities extra)",
                "seasonal_notes": "Autumn brings special celebrations to this historic district, with cultural events and traditional activities creating a festive atmosphere.",
                "booking_tips": "No advance booking needed. Located in Bergheim, accessible via tram. Evening events often include food and drink options."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Heidelberg Christmas Market",
                "type": "Cultural/Festival",
                "description": "Experience one of Germany's most beautiful Christmas markets, featuring over 140 decorated stalls around the historic Marktplatz and surrounding streets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (purchases extra)",
                "seasonal_notes": "Late November through December transforms Heidelberg's center into a magical Christmas wonderland, with historic buildings providing a stunning backdrop for traditional market stalls.",
                "booking_tips": "No booking required. Most atmospheric in evening hours. Located around Marktplatz and historic streets. Weekday afternoons less crowded than weekends."
            },
            {
                "name": "Heidelberg Castle Winter Experience",
                "type": "Nature/Cultural",
                "description": "Experience the winter transformation of Heidelberg Castle, featuring special illuminations and winter cultural events.",
                "indoor": true,
                "best_time": "Afternoon to Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings special illuminations and events to Heidelberg Castle, with the historic setting offering a magical atmosphere during the holiday season.",
                "booking_tips": "Purchase tickets online for special events. Accessible via funicular or walking. Special winter guided tours available. Evening illuminations particularly magical."
            },
            {
                "name": "New Year's Eve at Marktplatz",
                "type": "Cultural/Festival",
                "description": "Celebrate New Year's Eve in Heidelberg's historic center, with fireworks, live music, and festivities around the Market Square.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (food and drinks extra)",
                "seasonal_notes": "December 31st brings spectacular celebrations to Heidelberg's center, with the historic buildings providing a stunning backdrop for fireworks.",
                "booking_tips": "No tickets needed for public celebrations. Book restaurants well in advance. Special public transport services available. Arrive early for best viewing spots."
            },
            {
                "name": "Heidelberg Winter Wine Tastings",
                "type": "Cultural/Food & Drink",
                "description": "Experience cozy wine tastings in Heidelberg's historic cellars and wine bars, featuring local wines and seasonal specialties.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for exploring Heidelberg's wine culture in warm, historic settings, with special tastings of regional varieties.",
                "booking_tips": "Book tastings in advance. Various locations throughout city center. Some venues offer food pairings. Special winter wine tours available."
            },
            {
                "name": "Heidelberg Castle Winter Events",
                "type": "Cultural/Performance",
                "description": "Experience special winter events at Heidelberg Castle, including traditional holiday performances and cultural events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Winter brings special performances including holiday classics to one of Germany's most famous castles.",
                "booking_tips": "Book well in advance, especially for holiday performances. Located at Heidelberg Castle. Evening dress recommended for special events."
            },
            {
                "name": "Historic Streets Winter Shopping",
                "type": "Cultural/Shopping",
                "description": "Experience Heidelberg's historic streets with special winter events, seasonal specialties, and cultural performances.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Free (purchases extra)",
                "seasonal_notes": "Winter brings special events and seasonal products to these historic streets, providing a warm, cultural shopping experience.",
                "booking_tips": "No booking required. Located in city center. Best selection in morning hours. Special events often on weekends."
            },
            {
                "name": "Kurpfälzisches Museum Winter Exhibitions",
                "type": "Cultural/Art",
                "description": "Visit winter special exhibitions at the Kurpfälzisches Museum, featuring unique displays and events in this historic building.",
                "indoor": true,
                "best_time": "Morning to Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings special exhibitions and events focusing on art history and contemporary works, perfect for cold days.",
                "booking_tips": "Book tickets online to avoid queues. Accessible via tram to Marktplatz. Special exhibitions may require additional tickets."
            },
            {
                "name": "Student Quarter Winter Events",
                "type": "Cultural/Entertainment",
                "description": "Experience winter events in Heidelberg's historic student quarter, featuring cultural performances and traditional student celebrations.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Winter brings various events to the student quarter, with traditional student pubs and cultural venues creating a warm atmosphere.",
                "booking_tips": "No advance booking needed. Located in historic student quarter. Evening events often include food and drink options. Consider visiting multiple venues."
            }
        ]
    }
} 