{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Neujahrstag)",
          "notes": "New Year's Day is a public holiday throughout Germany. Most attractions, shops, and restaurants are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations at Marktplatz. Museums like the Kurpfälzisches Museum typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "special": true,
          "event": "Three Kings Day (Heilige Drei Könige)",
          "notes": "Epiphany (January 6) is a public holiday in Baden-Württemberg. Christmas decorations remain up until this date. Special services are held in Heidelberg's churches including the Church of the Holy Spirit. The Kurpfälzisches Museum typically hosts special winter exhibitions during this period."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Off-season with few tourists and excellent hotel value. Cold winter weather with occasional snow. Limited daylight hours (approximately 8.5-9 hours). Winter sales (Winterschlussverkauf) begin mid-January, particularly along Hauptstraße. Kurpfälzisches Museum and German Pharmacy Museum offer excellent indoor experiences during this quiet season. The Heidelberg Castle winter events are in full swing."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": -1,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
          "score": 3,
          "notes": "Winter continues with cold weather but slightly longer days (approximately 9.5-10 hours of daylight). Heidelberg's low tourism season continues, making it ideal for museum visits and indoor cultural activities without crowds. The Heidelberg Zoo provides a warm escape during cold days."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21],
          "score": 4,
          "special": true,
          "event": "Heidelberg Carnival (Fasching/Fastnacht)",
          "notes": "Heidelberg's Carnival celebrations feature parades and events throughout the city, particularly in the historic center. The exact dates vary yearly based on Easter, but typically mid-February sees the height of festivities with the Fastnachtumzug parade. The Fasching Tuesday (Faschingsdienstag) is particularly lively."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "Late winter brings gradually improving conditions. The Heidelberg Castle often premieres new exhibitions during this period. The Botanical Garden begins showing early signs of spring with snowdrops and winter aconite. The historic streets offer a colorful respite from winter with regional and international delicacies."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Early spring brings warming temperatures and longer days (11-12 hours of daylight). Magnolias and camellias begin blooming at the Botanical Garden around mid-March, and early spring flowers appear along the Philosopher's Walk and in the city center. The historic gardens start showing first signs of life."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Frühlingsanfang)",
          "notes": "Spring officially begins, bringing cherry blossoms to the Philosopher's Walk and historic districts by late March. Perfect time for visiting Heidelberg's historic attractions. Easter markets appear at Marktplatz if Easter falls in late March. The Kurpfälzisches Museum often introduces special spring exhibitions."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 3,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter and Early Spring",
          "notes": "Easter celebrations typically fall in April, with Good Friday and Easter Monday as public holidays. Easter markets operate at Marktplatz in the week before Easter. Spring blooms peak throughout the city's parks, especially at the Botanical Garden and along the Philosopher's Walk. Outdoor cafés begin setting up seating areas."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Heidelberg Spring Festival",
          "notes": "The Heidelberg Spring Festival begins in mid-April at Marktplatz, featuring cultural performances, food stalls, and family activities. The historic market square transforms into a celebration of spring. The Botanical Garden shows spectacular spring blooms. Ideal time for exploring Heidelberg's historic districts and parks."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 6,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day (Tag der Arbeit)",
          "notes": "Labor Day is a public holiday with demonstrations and events throughout Heidelberg, particularly at Marktplatz. Many businesses are closed, but outdoor festivities and special museum exhibitions are available. Traditional May Day celebrations include maypoles in suburban districts."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Castle Festival and Ascension Day",
          "notes": "May brings perfect spring weather and international music events. The Castle Festival typically runs mid-to-late May. Ascension Day (40 days after Easter) is a public holiday with outdoor excursions popular. The city's parks and gardens are lush green, ideal for walking and cultural activities. The Heidelberg Castle typically presents its spring gala."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 5,
          "special": true,
          "event": "Whitsun/Pentecost (Pfingsten)",
          "notes": "Whitsun weekend (50 days after Easter) brings a long holiday weekend with Whit Monday as a public holiday. Many locals take extended breaks. Perfect time for visiting Heidelberg Zoo, Botanical Garden, and historic districts with fewer crowds than high summer."
        },
        {
          "days": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "special": true,
          "event": "Corpus Christi and Summer Festival Season",
          "notes": "Corpus Christi (Fronleichnam, typically mid-June) is a public holiday in Baden-Württemberg with religious processions. The summer festival season begins with various cultural events. Beer gardens and outdoor venues are in full swing, especially along the Neckar River and in the historic center."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Open-Air Cinema Season",
          "notes": "The open-air cinema season begins at Neckarwiese and other locations, offering evening film screenings against the backdrop of the castle and old town. Summer solstice brings the longest days of the year with approximately 16 hours of daylight. The Long Night of Museums typically occurs in late June."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 13,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Peak summer with warm temperatures. Excellent time for visiting beer gardens and outdoor attractions. The city's historic streets offer cool respite from summer heat. Baden-Württemberg school holidays typically begin in late July, increasing visitors to family-friendly attractions like Heidelberg Zoo."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Heidelberg Summer Festival",
          "notes": "The Heidelberg Summer Festival typically runs from late July to early August, transforming the city center with cultural performances at multiple venues. Open-air concerts take place at Marktplatz and Neckarwiese. Perfect weather for evening events and outdoor dining."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 15,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "special": true,
          "event": "Summer Festivals",
          "notes": "Summer festivities continue with cultural events and outdoor concerts. Perfect time for visiting Heidelberg's historic attractions and parks. The Castle Festival features special summer events. The Light Festival illuminates Heidelberg's historic buildings in mid-August. School holidays continue, making family attractions busier."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Heidelberg Castle Festival",
          "notes": "The Castle Festival begins in late August, celebrating Heidelberg's rich cultural heritage with performances in the historic castle courtyard. The festival transforms the city into a celebration of classical music. Early harvesting begins in the surrounding wine regions."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 15,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 5,
          "special": true,
          "event": "Castle Festival continues",
          "notes": "The Castle Festival continues into early September. Perfect weather for outdoor activities and cultural events. Tourism begins to decrease while weather remains beautiful. Baden-Württemberg schools typically reopen in mid-September."
        },
        {
          "days": [11, 12],
          "score": 4,
          "special": true,
          "event": "Day of Open Monuments (Tag des offenen Denkmals)",
          "notes": "European Heritage Days (second weekend of September) opens normally inaccessible historical buildings throughout Heidelberg, including historic student buildings, industrial sites, and architectural landmarks."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Heidelberg Literature Festival",
          "notes": "The autumn edition of Heidelberg's major literary festival brings literary events and cultural programs to the city. Perfect autumn weather for festival activities and exploring the historic city center."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 11,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3],
          "score": 5,
          "special": true,
          "event": "German Unity Day and Literature Festival",
          "notes": "The Literature Festival continues through early October. October 3rd is German Unity Day (Tag der Deutschen Einheit), a nationwide holiday with commemorative events at Marktplatz. Government offices and most businesses are closed, but tourist attractions remain open with festival atmosphere."
        },
        {
          "days": [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
          "score": 4,
          "special": true,
          "event": "Autumn Cultural Season",
          "notes": "Perfect autumn weather for exploring Heidelberg's historic districts and parks. Special cultural events and harvest festivals in the surrounding wine regions. Fall colors transform the city's parks and gardens. Heidelberg Literature Festival typically runs throughout October."
        },
        {
          "days": [29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Halloween and Reformation Day",
          "notes": "Reformation Day (October 31) is a public holiday in Baden-Württemberg with special events at Protestant churches. Halloween celebrations have become increasingly popular in recent years, with themed events at attractions and restaurants. School fall holidays typically begin in late October/early November."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 7,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day (Allerheiligen)",
          "notes": "All Saints' Day is a public holiday in Baden-Württemberg. Most businesses are closed but major tourist attractions remain open. Weather turns cooler with occasional fog. Traditional cemetery visits and remembrance ceremonies take place."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 3,
          "notes": "Full autumn with cooler temperatures. Excellent time for museum visits and indoor cultural activities. The historic streets become particularly appealing. The fall foliage peaks in early November at the Botanical Garden and the city's historic gardens."
        },
        {
          "days": [11],
          "score": 3,
          "special": true,
          "event": "St. Martin's Day (Martinstag)",
          "notes": "St. Martin's Day celebrations include children's lantern processions (Laternenumzüge) through Heidelberg's neighborhoods, particularly in residential districts. Traditional goose dinners (Martinsgans) are served at many restaurants throughout the city."
        },
        {
          "days": [12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 3,
          "notes": "Mid-November sees cooling temperatures. Indoor attractions like the Kurpfälzisches Museum and German Pharmacy Museum offer special exhibitions. The Heidelberg Castle winter season begins. Special fall concerts are presented at various venues."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Advent Season begins",
          "notes": "The city prepares for its famous Christmas Market. Decorations appear throughout the city center, particularly around Marktplatz and the historic streets. The first Advent Sunday (four Sundays before Christmas) typically falls in late November, marking the official start of the Christmas season. Advent concerts begin at Heidelberg's churches."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Heidelberg Christmas Market (Weihnachtsmarkt)",
          "notes": "One of Germany's most beautiful Christmas markets transforms Heidelberg's center from late November until December 23rd. Over 140 decorated stalls spread across multiple locations including Marktplatz and the historic streets, featuring traditional crafts, food, and Glühwein. The historic buildings provide a stunning backdrop with special light projections. December 6 brings Nikolaustag celebrations with special children's events."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Heiligabend)",
          "notes": "Christmas Eve is the main celebration day for most German families. Many businesses close by early afternoon. The Christmas Market ends. Heidelberg's churches hold special services, including midnight mass at the Church of the Holy Spirit. Restaurants that remain open often require advance reservations for special Christmas Eve dinners."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Days (Weihnachtstage)",
          "notes": "December 25 (First Christmas Day) and December 26 (Second Christmas Day) are both public holidays. Most businesses, restaurants, and attractions are closed or operate with limited hours. A quiet time in the city with the Philosopher's Walk and winter garden walks popular for locals."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is quiet. Major museums including Kurpfälzisches Museum, German Pharmacy Museum, and the City History Museum remain open. Good time for winter sales shopping along Hauptstraße. The Heidelberg Castle typically performs special year-end productions."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Silvester)",
          "notes": "New Year's Eve celebrations center around Marktplatz with fireworks at midnight. The official city celebration includes live music performances and light shows. Many restaurants offer special fixed-price Silvester menus (advance reservation essential), and hotels host celebration events. The historic city center provides a spectacular backdrop for festivities."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 6
    }
  },
  "activityTypes": {
    "spring": [
      "Heidelberg Spring Festival at Marktplatz (mid-April)",
      "Cherry Blossom Viewing on Philosopher's Walk (late March to mid-April)",
      "Botanical Garden Spring Blooms (March through May)",
      "Kurpfälzisches Museum Special Spring Exhibitions",
      "Historic District Walking Tours",
      "Castle Garden Flower Shows (tulips in April, roses begin in May)",
      "Heidelberg Castle Spring Events (March through June)",
      "Historic Streets Spring Markets (beginning in late May)"
    ],
    "summer": [
      "Heidelberg Summer Festival (late July to early August)",
      "Open-Air Cinema at Neckarwiese (late June through August)",
      "Castle Festival (late August to early September)",
      "Beer Garden Season (May through September)",
      "Neckar River Events and Boat Tours",
      "Heidelberg Zoo Summer Experience",
      "Historic District Tours and Cultural Events",
      "Jazz Festival (mid-July)"
    ],
    "autumn": [
      "Heidelberg Literature Festival (September)",
      "Cultural Festival Season (September-October)",
      "Heidelberg Wine Festival (October)",
      "Autumn Colors at Castle Gardens and Botanical Garden (October-November)",
      "Heidelberg Castle Season Opening (September)",
      "Historic Streets Autumn Markets",
      "Day of Open Monuments (second weekend of September)",
      "Fall Concert Season at Various Venues"
    ],
    "winter": [
      "Heidelberg Christmas Market (late November to December 23)",
      "New Year's Eve Celebration at Marktplatz (December 31)",
      "Winter Garden Tours at Botanical Garden",
      "Heidelberg Castle Winter Events",
      "Historic Streets Winter Shopping",
      "Museum Special Exhibitions at Kurpfälzisches Museum",
      "Winter Wine Tastings in historic cellars",
      "Advent Concerts at Church of the Holy Spirit"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or cold winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
} 