{
  "sites": [
    {
      "name": "Uppsala Cathedral (Uppsala domkyrka)",
      "type": "Cathedral",
      "description": "Scandinavia's largest cathedral, dating from the late 13th century. Seat of the Archbishop of the Church of Sweden. Contains the tombs of notable figures like King Gustav Vasa and Carl Linnaeus. Features impressive Gothic architecture and stained glass.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Check visitor hours as it may close for services, concerts, or events. Dress respectfully.",
      "booking_tips": "Free entry. Guided tours often available (may have a fee). Allow 1-1.5 hours. Located centrally near the university.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 59.8581,
      "longitude": 17.6335
    },
    {
      "name": "Uppsala Castle (Uppsala slott)",
      "type": "Castle",
      "description": "A 16th-century royal castle initiated by King Gustav Vasa. Played a significant role in Swedish history. Now houses the Uppsala Art Museum, Peace Museum (Fredsmuseum), and Vasaborgen ruins. Offers panoramic views of the city.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Museums within the castle have their own opening hours, check individually. Castle grounds are accessible year-round.",
      "booking_tips": "Separate entrance fees for museums within the castle. Combination tickets might be available. Allow 2-3 hours to explore museums and grounds.",
      "ratings": {
        "cost_estimate": 150,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 59.8545,
      "longitude": 17.6358
    },
    {
      "name": "Gamla Uppsala (Old Uppsala)",
      "type": "Historic Site",
      "description": "Major archaeological site north of the city, the political and religious centre of Sweden in the Iron Age and Viking Age. Features large royal burial mounds, Gamla Uppsala Church (formerly the cathedral), and the Gamla Uppsala Museum.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Site accessible year-round. Museum has seasonal hours (check website). Outdoor site best enjoyed in good weather.",
      "booking_tips": "Site is free to explore. Museum has an entrance fee. Consider the Disagården open-air museum nearby (seasonal). Allow 2-3 hours.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 59.8978,
      "longitude": 17.6342
    },
    {
      "name": "Gustavianum (Uppsala University Museum)",
      "type": "Museum",
      "description": "Uppsala University's oldest preserved building, housing university collections including Nordic antiquities, Egyptian artifacts (Victoria Museum), and the unique 17th-century Anatomical Theatre.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, check website for specific hours (often closed Mondays).",
      "booking_tips": "Entrance fee required. Guided tours available. Located opposite Uppsala Cathedral. Allow 1.5-2 hours.",
      "ratings": {
        "cost_estimate": 100,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 59.8583,
      "longitude": 17.6319
    },
    {
      "name": "The Linnaeus Garden (Linnéträdgården)",
      "type": "Garden",
      "description": "Restored botanical garden based on Carl Linnaeus's 1745 design. Features around 1,300 species known to be cultivated by Linnaeus. Includes the Linnaeus Museum located in his former home.",
      "indoor": false,
      "best_time": "Late Spring/Summer (May-Sep)",
      "price_range": "Budget",
      "seasonal_notes": "Garden and Museum open seasonally (typically May-September). Peak bloom varies.",
      "booking_tips": "Entrance fee required for garden & museum. Check opening times. Allow 1.5-2 hours. Café available.",
      "ratings": {
        "cost_estimate": 120,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 59.8620,
      "longitude": 17.6350
    },
    {
      "name": "Botanical Garden (Botaniska trädgården)",
      "type": "Garden",
      "description": "Uppsala University's main botanical garden, located near the Castle. Features extensive grounds with a Baroque garden, Orangery (Linneanum), tropical greenhouse, and diverse plant collections from around the world.",
      "indoor": false,
      "best_time": "Spring/Summer",
      "price_range": "Free",
      "seasonal_notes": "Park open year-round. Tropical greenhouse and Orangery have limited hours and entrance fees. Blooms peak in spring/summer.",
      "booking_tips": "Park entry is free. Fees apply for greenhouses. Check opening hours for specific buildings. Allow 2-3 hours.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 59.8520,
      "longitude": 17.6280
    },
    {
      "name": "Carolina Rediviva (Uppsala University Library)",
      "type": "Library",
      "description": "Sweden's oldest and largest university library. Houses invaluable collections, including the 6th-century Codex Argenteus (Silver Bible) and Carta Marina. Features reading rooms and exhibition halls.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Building open year-round. Exhibition hall hours may vary, check website.",
      "booking_tips": "Free entry to public areas and exhibition hall. Access to reading rooms may be restricted. Check exhibition details online. Allow 1 hour.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 4
      },
      "latitude": 59.8560,
      "longitude": 17.6310
    },
    {
      "name": "Museum of Evolution (Evolutionsmuseet)",
      "type": "Museum",
      "description": "Part of Uppsala University, consists of Palaeontology, Zoology, and Mineralogy sections located in different buildings. Houses Scandinavia's largest collection of dinosaur skeletons and extensive natural history specimens.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Budget",
      "seasonal_notes": "Check opening hours for each section (Paleontology, Zoology, Mineralogy) as they may differ and have limited opening times.",
      "booking_tips": "Entrance fee required. Popular with families. Sections are in separate locations within the Evolutionary Biology Centre (EBC). Allow 1.5-2 hours per visited section.",
      "ratings": {
        "cost_estimate": 60,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 59.8425,
      "longitude": 17.6465
    },
    {
      "name": "Linnaeus' Hammarby",
      "type": "Historic Site",
      "description": "Carl Linnaeus's well-preserved 18th-century summer estate located southeast of Uppsala. Offers insight into his private life and work, surrounded by a park with many plants he cultivated.",
      "indoor": true,
      "best_time": "Summer (May-Sep)",
      "price_range": "Budget",
      "seasonal_notes": "Open seasonally (typically May-September). Requires travel outside the city centre.",
      "booking_tips": "Entrance fee required. Check opening times. Consider guided tours. Café available. Accessible by bus (requires walk) or car. Allow 2-3 hours including travel.",
      "ratings": {
        "cost_estimate": 120,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 59.8167,
      "longitude": 17.7667
    },
    {
      "name": "Fyris River (Fyrisån)",
      "type": "Nature",
      "description": "The river flowing through Uppsala, dividing the historic west side from the modern east side. Lined with parks, cafes, and walkways. Popular for walks, cycling, and boat tours in summer.",
      "indoor": false,
      "best_time": "Anytime (Walks), Summer (Boat Tours)",
      "price_range": "Free",
      "seasonal_notes": "Walkways accessible year-round. Boat tours operate seasonally. River events like Walpurgis raft race occur.",
      "booking_tips": "Free to walk along. Look for cafes with riverside seating. Boat tour details and booking online or at departure points.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 59.8580,
      "longitude": 17.6380 
    },
    {
      "name": "Uppsala Art Museum (Uppsala konstmuseum)",
      "type": "Museum",
      "description": "Located within Uppsala Castle, focusing on Swedish and international modern and contemporary art. Also features collections related to Uppsala's history.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Budget",
      "seasonal_notes": "Check opening hours, typically closed Mondays. Included in some castle ticket options.",
      "booking_tips": "Entrance fee required (may be part of castle ticket). Check current exhibitions online. Allow 1-1.5 hours.",
      "ratings": {
        "cost_estimate": 80,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 59.8548,
      "longitude": 17.6360
    },
    {
      "name": "Bror Hjorths Hus",
      "type": "Museum",
      "description": "The former home and studio of Swedish modernist artist Bror Hjorth (1894–1968). Displays his sculptures, paintings, and drawings, offering a unique insight into his life and work.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Budget",
      "seasonal_notes": "Open year-round, check website for specific opening days and times (often limited hours).",
      "booking_tips": "Entrance fee required. Small museum, allow about 1 hour. Located near the Botanical Garden.",
      "ratings": {
        "cost_estimate": 70,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 59.8511,
      "longitude": 17.6255
    },
    {
      "name": "Uppland Museum (Upplandsmuseet)",
      "type": "Museum",
      "description": "Regional museum covering the history and culture of Uppsala and the Uppland province, from prehistory to modern times. Housed in the former Academy Mill by the Fyris River.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round, check website for hours (often closed Mondays).",
      "booking_tips": "Free entrance. Features permanent and temporary exhibitions. Allow 1.5-2 hours.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 59.8591,
      "longitude": 17.6358
    },
    {
      "name": "Uppsala University (Uppsala universitet)",
      "type": "Educational Institution",
      "description": "Scandinavia's oldest university, founded in 1477. Historic buildings spread throughout Uppsala's city center, with the main university building (Universitetshuset) featuring stunning architecture and ceremonial halls.",
      "indoor": true,
      "best_time": "Academic Year (Sep-May)",
      "price_range": "Free",
      "seasonal_notes": "Main university building open to visitors outside ceremonies and events. Campus buildings have various access restrictions during academic year.",
      "booking_tips": "Free to explore campus grounds. Main building often open to public (check schedule). University museums have separate hours and fees.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 4
      },
      "latitude": 59.8586,
      "longitude": 17.6340
    },
    {
      "name": "English Park (Engelska parken)",
      "type": "Park",
      "description": "Beautiful park area housing Uppsala University's Humanities Center and several academic departments. Features historic buildings, green spaces, and the Thunberg Lane with old botanical specimens.",
      "indoor": false,
      "best_time": "Spring/Summer",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Most beautiful in spring/summer when greenery is in full bloom.",
      "booking_tips": "Free to visit. Buildings house academic departments with limited public access. Allow 30-45 minutes for a stroll through the park.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.75,
        "cultural_significance": 2
      },
      "latitude": 59.8553,
      "longitude": 17.6322
    },
    {
      "name": "Uppsala City Theatre (Uppsala Stadsteater)",
      "type": "Theatre",
      "description": "Modern theatre hosting a variety of performances including drama, comedy, and dance. A cultural hub for the city with both locally produced shows and visiting productions.",
      "indoor": true,
      "best_time": "Evenings",
      "price_range": "Moderate",
      "seasonal_notes": "Performance season typically runs September to May. Summer schedule may be limited.",
      "booking_tips": "Book tickets in advance online or at box office. Student discounts available. Check language of performance (many in Swedish).",
      "ratings": {
        "cost_estimate": 350,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 3
      },
      "latitude": 59.8586,
      "longitude": 17.6417
    },
    {
      "name": "Pelle Svanslös' Garden (Pelle Svanslös Gård)",
      "type": "Attraction",
      "description": "Children's attraction dedicated to the beloved Swedish children's book character Pelle Svanslös (Peter-No-Tail), the tailless cat. Located in the area where the stories are set with character statues and play areas.",
      "indoor": false,
      "best_time": "Daytime (Summer)",
      "price_range": "Free",
      "seasonal_notes": "Outdoor site accessible year-round. Special events during summer and holidays.",
      "booking_tips": "Free to visit. Popular with families. Located in Carolinaparken/Engelska parken. Allow 30-45 minutes.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 2
      },
      "latitude": 59.8560,
      "longitude": 17.6325
    },
    {
      "name": "Disagården Open-Air Museum",
      "type": "Museum",
      "description": "Open-air museum in Gamla Uppsala showing rural life in Uppland during the 18th and 19th centuries. Features historic buildings, traditional crafts, and occasional cultural events and demonstrations.",
      "indoor": false,
      "best_time": "Summer (Jun-Aug)",
      "price_range": "Budget",
      "seasonal_notes": "Open seasonally (typically June-August). May have special holiday openings.",
      "booking_tips": "Entrance fee applies. Located near Gamla Uppsala Museum. Check for guided tours and events. Allow 1-1.5 hours.",
      "ratings": {
        "cost_estimate": 60,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 59.8989,
      "longitude": 17.6331
    },
    {
      "name": "Biotopia",
      "type": "Museum",
      "description": "Natural history museum focusing on Uppsala County's nature and wildlife. Features interactive exhibits, dioramas of local ecosystems, and educational activities for children and families.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round, check website for specific hours (typically closed Mondays).",
      "booking_tips": "Free entrance. Popular with families. Located in Vasaparken. Allow 1-1.5 hours.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 59.8549,
      "longitude": 17.6233
    },
    {
      "name": "Walpurgis Night (Valborg)",
      "type": "Event",
      "description": "Major annual celebration in Uppsala, especially among students. Features the traditional 'donning of the caps' ceremony, choirs, raft races on the Fyris River, bonfires, and outdoor festivities throughout the city.",
      "indoor": false,
      "best_time": "April 30th",
      "price_range": "Free",
      "seasonal_notes": "Only occurs on April 30th annually. Main events include Champagne Breakfast, Carolina Slope gathering, rafting, concerts, and bonfires.",
      "booking_tips": "No booking required for public celebrations. Some student events restricted. Accommodation books quickly—reserve months in advance. Major crowds expected.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 8.0,
        "cultural_significance": 5
      },
      "latitude": 59.8581,
      "longitude": 17.6350
    },
    {
      "name": "Pumphuset",
      "type": "Cultural Venue",
      "description": "Historic water pump house converted into an exhibition space and cultural venue. Hosts art exhibitions, performances, and events with a focus on contemporary culture.",
      "indoor": true,
      "best_time": "Varies by Exhibition",
      "price_range": "Budget/Free",
      "seasonal_notes": "Opening hours and events vary throughout the year. Check current program online.",
      "booking_tips": "Some exhibitions free, others have entrance fee. Special events may require advance booking. Located by the Fyris River.",
      "ratings": {
        "cost_estimate": 50,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 59.8622,
      "longitude": 17.6383
    },
    {
      "name": "Uppsala Concert & Congress Hall (Uppsala Konsert & Kongress)",
      "type": "Concert Hall",
      "description": "Modern concert and conference venue opened in 2007. Distinctive architectural landmark hosting classical and contemporary music performances, conferences, and cultural events.",
      "indoor": true,
      "best_time": "Evenings (Performances)",
      "price_range": "Moderate/Expensive",
      "seasonal_notes": "Event schedule varies throughout the year. Main concert season typically September-May.",
      "booking_tips": "Book performance tickets in advance online or at box office. Building can be viewed from outside anytime. Restaurant on premises.",
      "ratings": {
        "cost_estimate": 400,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 3
      },
      "latitude": 59.8580,
      "longitude": 17.6460
    },
    {
      "name": "Ulva Mill (Ulva Kvarn)",
      "type": "Historic Site",
      "description": "Historic mill site outside Uppsala dating from the 16th century. Now houses craft shops, studios, and cafés showcasing local artisans and their work in traditional crafts.",
      "indoor": true,
      "best_time": "Summer/Autumn",
      "price_range": "Free",
      "seasonal_notes": "Shops typically open spring-autumn. Some cafes and stores may be open year-round but with limited hours in winter.",
      "booking_tips": "Free entrance to area. Located ~8km northwest of Uppsala. Accessible by bus or bicycle. Allow 2-3 hours including travel time.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 59.9050,
      "longitude": 17.5839
    },
    {
      "name": "Uppsala Military Museum (Militärmuseet Hammarhof)",
      "type": "Museum",
      "description": "Small museum focusing on Swedish military history, particularly infantry equipment and uniforms from the 19th century onward. Run by volunteers with personal connections to military history.",
      "indoor": true,
      "best_time": "Weekends (Summer)",
      "price_range": "Budget",
      "seasonal_notes": "Limited opening hours, typically weekends during summer. Check schedule before visiting.",
      "booking_tips": "Small entrance fee. Located outside city center. Call ahead to confirm opening. Allow 1 hour.",
      "ratings": {
        "cost_estimate": 50,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 59.8420,
      "longitude": 17.6482
    }
  ]
}