{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing in Uppsala Botanical Garden",
                "type": "Nature/Leisure",
                "description": "Experience the beautiful spring blooms at Uppsala University's Botanical Garden, particularly lovely during late April and May. The garden features various flowering trees and plants creating spectacular displays of color throughout the vast grounds.",
                "indoor": false,
                "best_time": "Late April-May (daytime)",
                "price_range": "Free",
                "seasonal_notes": "Blooming periods are weather-dependent and typically peak in May. The Orangery (Linneanum) and tropical greenhouse have separate opening hours and entrance fees.",
                "booking_tips": "No booking needed. Garden is open daily and free to enter. Visit on weekdays for fewer crowds. Check opening hours for the greenhouses which may have admission fees."
            },
            {
                "name": "Walpurgis Night (Valborg) Celebrations",
                "type": "Cultural Festival/Community Event",
                "description": "Uppsala hosts Sweden's most magnificent Walpurgis Night celebration on April 30th. This ancient tradition welcomes spring with bonfires, student festivities, choral singing, floating rafts on the Fyris River, and the famous 'donning of the caps' ceremony at Carolina Rediviva.",
                "indoor": false,
                "best_time": "All day and evening (April 30th)",
                "price_range": "Free (Public events)",
                "seasonal_notes": "A major Uppsala tradition with activities throughout the city. The event transforms the entire city with students in white caps and celebratory atmosphere.",
                "booking_tips": "Plan your day with key events: champagne breakfast (morning), raft race on Fyris River (around 10 AM), cap-donning ceremony at Carolina Rediviva (3 PM), and bonfires in the evening. Book accommodations months in advance as the city fills with visitors."
            },
            {
                "name": "Explore Linnaeus' Garden and Museum",
                "type": "Nature/Cultural/Historical",
                "description": "Visit the restored Linnaeus Garden (Linnéträdgården) as it bursts into spring bloom. This historic botanical garden, based on Carl Linnaeus's 1745 design, showcases around 1,300 species he cultivated. Includes a visit to the Linnaeus Museum located in his former home.",
                "indoor": false,
                "best_time": "May-June (garden opens seasonally)",
                "price_range": "Budget",
                "seasonal_notes": "The garden and museum typically open in May for the season and display early spring plants that Linnaeus himself studied and classified.",
                "booking_tips": "Entrance fee required for garden and museum. Check seasonal opening times before visiting. Guided tours available. The garden café opens when weather permits."
            },
            {
                "name": "Boat Tours on Fyris River",
                "type": "Recreation/Sightseeing",
                "description": "Experience Uppsala from the water as the spring boat tour season begins on the Fyris River. Guided tours offer unique perspectives of the cathedral, castle, and historic buildings from the gentle waterway that divides the city.",
                "indoor": false,
                "best_time": "Daytime (Late April/May when service begins)",
                "price_range": "Moderate",
                "seasonal_notes": "Boat services typically begin in late spring dependent on weather conditions. Early season offers views of budding trees along the riverbanks.",
                "booking_tips": "Check current schedules online. Tours depart from central locations along the river. Some tours include historical commentary about Uppsala's landmarks."
            },
            {
                "name": "Cycling Through Uppsala's Spring Landscapes",
                "type": "Recreation/Nature",
                "description": "Rent bicycles and explore Uppsala's extensive cycling paths as they come alive with spring greenery. Routes along the Fyris River, through Stadsskogen city forest, or out to nearby natural areas like Hågadalen-Nåsten offer beautiful spring scenery.",
                "indoor": false,
                "best_time": "Daytime (April-June)",
                "price_range": "Budget (bike rental)",
                "seasonal_notes": "Spring brings increasingly warm days perfect for cycling. Paths may be muddy in early spring after winter thaw.",
                "booking_tips": "Bicycle rentals available throughout the city. Pick up a cycling map from the tourist office. The flat terrain makes Uppsala ideal for casual cyclists of all fitness levels."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Midsummer Celebrations (Midsommar)",
                "type": "Cultural Festival/Holiday",
                "description": "Celebrate the summer solstice according to Swedish tradition with flower wreaths, maypole dancing, and festive meals featuring herring, potatoes, and strawberries. Public celebrations can be found at Disagården open-air museum in Gamla Uppsala, offering a traditional rural setting.",
                "indoor": false,
                "best_time": "Midsummer's Eve (Friday between June 19-25)",
                "price_range": "Free (Public events)/Moderate (Food)",
                "seasonal_notes": "A major holiday; expect reduced opening hours for shops and attractions. Many Swedes leave cities for countryside celebrations.",
                "booking_tips": "Disagården offers authentic rural celebrations. Some restaurants serve special Midsummer menus but require advance booking. For countryside celebrations outside Uppsala, transportation planning is necessary."
            },
            {
                "name": "Outdoor Swimming at Lyssnaängen",
                "type": "Nature/Swimming/Leisure",
                "description": "Enjoy Uppsala's popular lake beach at Lyssnaängen on Lake Mälaren, located in Sunnersta south of the city. This family-friendly beach offers clean swimming waters, sandy shores, and beautiful natural surroundings perfect for summer days.",
                "indoor": false,
                "best_time": "Daytime (June-August)",
                "price_range": "Free",
                "seasonal_notes": "Peak swimming season with warmest water in July/August. Lifeguards may be present during peak season weekends. Facilities include changing rooms and toilets.",
                "booking_tips": "Accessible by city bus or bicycle from central Uppsala (about 8 km). Bring your own food and drinks as there are limited services nearby. Can get crowded on hot summer days."
            },
            {
                "name": "Fjällnora Recreation Area",
                "type": "Nature/Outdoor Activities",
                "description": "Explore this expansive outdoor recreation area offering swimming beaches, hiking trails, canoe/kayak rentals, BBQ spots, and adventure course activities. Located about 20 km east of Uppsala, this natural park becomes a hub of summer activity.",
                "indoor": false,
                "best_time": "Daytime (June-August)",
                "price_range": "Free (entry)/Budget (equipment rentals)",
                "seasonal_notes": "All facilities open during summer. Water temperatures pleasant for swimming by late June. Some activities require booking.",
                "booking_tips": "Accessible by car or special summer bus service from Uppsala. The adventure course and equipment rentals may require advance booking, especially for groups. Restaurant and kiosk available for refreshments."
            },
            {
                "name": "Uppsala Festival Season",
                "type": "Cultural/Entertainment",
                "description": "Enjoy Uppsala's vibrant summer festival scene with various music, arts, and cultural events throughout the warmer months. From classical concerts in the Botanical Garden to contemporary performances at Uppsala Castle, the city offers diverse cultural experiences.",
                "indoor": false,
                "best_time": "Varies by event (June-August)",
                "price_range": "Free-Moderate (varies by event)",
                "seasonal_notes": "Check the city's cultural calendar for specific events and festival dates which vary annually.",
                "booking_tips": "Popular performances may require advance ticket purchase. Many outdoor concerts take place in parks and public spaces and are free to attend. Uppsala University often hosts cultural events during summer months."
            },
            {
                "name": "Gamla Uppsala Archaeological Site",
                "type": "Historical/Educational",
                "description": "Visit the ancient royal burial mounds and historical site at Gamla Uppsala when summer weather allows for optimal exploration. This significant archaeological area features royal burial mounds from the Migration/Viking Period, a medieval church, and museum with artifacts.",
                "indoor": false,
                "best_time": "Daytime (May-September)",
                "price_range": "Free (grounds)/Budget (museum)",
                "seasonal_notes": "Summer brings ideal conditions for exploring the extensive outdoor site. The Gamla Uppsala Museum hosts special summer activities and demonstrations.",
                "booking_tips": "Accessible by city bus or bicycle from central Uppsala. Combine with a visit to the adjacent Disagården open-air museum. Check for summer events like historical reenactments or guided tours."
            },
            {
                "name": "Castle Parks and Gardens",
                "type": "Leisure/Cultural",
                "description": "Explore the beautifully maintained castle grounds (Slottsbacken) and adjacent Botanical Garden during their summer prime. The castle hill offers panoramic views of Uppsala while the surrounding parks provide perfect settings for picnics, reading, or simply relaxing.",
                "indoor": false,
                "best_time": "Daytime/Evening (May-September)",
                "price_range": "Free",
                "seasonal_notes": "Gardens are at their most beautiful during summer months with full blooms and lush greenery. Evening light in summer creates magical ambiance due to Sweden's long daylight hours.",
                "booking_tips": "No booking required. Castle grounds are always accessible. The Botanical Garden has specific opening hours but is free to enter. Bring a picnic to enjoy in the peaceful surroundings."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Autumn Colors in Uppsala's Parks and Forests",
                "type": "Nature/Walking",
                "description": "Experience spectacular fall foliage in Uppsala's many green spaces. Stadsskogen urban forest, the Botanical Garden, and University Park offer beautiful displays of autumn colors. The castle gardens and areas along the Fyris River are particularly scenic with golden and red leaves.",
                "indoor": false,
                "best_time": "Daytime (Late September-October)",
                "price_range": "Free",
                "seasonal_notes": "Peak foliage timing varies yearly based on weather patterns. Early morning light creates stunning effects on the colorful leaves.",
                "booking_tips": "Self-guided walking tours available through the tourist office. Photography enthusiasts should visit during morning golden hour for best light. Comfortable walking shoes recommended."
            },
            {
                "name": "Uppsala University Museum Exploration",
                "type": "Cultural/Educational",
                "description": "Take advantage of quieter autumn days to visit Gustavianum (Uppsala University Museum) with its famous Anatomical Theatre, Egyptian artifacts, and university historical collections. The Museum of Evolution and other specialized university museums also offer fascinating exhibits.",
                "indoor": true,
                "best_time": "Daytime (museum hours)",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "Less crowded than during summer tourist season. Student life returns to the city, creating authentic university atmosphere.",
                "booking_tips": "Check current opening hours as they may be reduced during off-peak season. Some museums close on Mondays. University museums often offer combination tickets for multiple sites."
            },
            {
                "name": "Kulturnatten (Culture Night)",
                "type": "Cultural Festival",
                "description": "Participate in Uppsala's largest cultural festival typically held in September. This city-wide celebration features hundreds of events including concerts, exhibitions, lectures, theater performances, and activities for all ages across nearly 200 venues throughout Uppsala.",
                "indoor": true,
                "best_time": "All day and evening (Second Saturday in September)",
                "price_range": "Free (most events)",
                "seasonal_notes": "A major annual event attracting around 100,000 participants with over 650 program activities throughout the city.",
                "booking_tips": "Get a program/map to plan your route. Most venues are within walking distance in the city center. Some performances may require tickets or have limited capacity."
            },
            {
                "name": "Apple and Harvest Festivals",
                "type": "Food/Cultural",
                "description": "Celebrate autumn harvests at local markets and festivals featuring regional produce from the fertile Uppland countryside. Sample and purchase local apples, mushrooms, berries, and vegetables, along with artisanal food products from local producers.",
                "indoor": false,
                "best_time": "Daytime (September-October)",
                "price_range": "Free entry (purchases extra)",
                "seasonal_notes": "Autumn is peak harvest season in Sweden. Regional specialties include apples, pears, root vegetables, and wild mushrooms.",
                "booking_tips": "Check local event calendars for specific market dates and locations. Farmers markets often take place in central squares. Some producers offer pick-your-own experiences at farms outside the city."
            },
            {
                "name": "Cozy Café Culture",
                "type": "Leisure/Social",
                "description": "Experience the Swedish tradition of 'fika' (coffee break with pastries) in Uppsala's charming cafés as autumn brings cooler weather perfect for indoor coziness. Historic cafes around the cathedral and university areas offer traditional pastries like kanelbullar (cinnamon buns) and cardamom buns.",
                "indoor": true,
                "best_time": "Afternoon/Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn specials often feature seasonal ingredients like apple, cardamom, and cinnamon. The concept of 'mysigt' (coziness) comes alive in autumn with candles and warm interiors.",
                "booking_tips": "Cafés like Ofvandahls, Güntherska Hovkonditoriet, and Stationen are local favorites with historic atmospheres. University area cafés fill with students as the academic year begins."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets in Uppsala",
                "type": "Shopping/Cultural/Festive",
                "description": "Experience Uppsala's charming Christmas markets offering crafts, decorations, and traditional Swedish holiday foods. Markets can be found at the Grand Square (Stora Torget), in the courtyard of Uppsala Castle, and at Disagården open-air museum for a more traditional rural experience.",
                "indoor": false,
                "best_time": "Late November-December (Check specific dates/hours)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases)",
                "seasonal_notes": "Markets are beautifully illuminated as darkness falls early in Swedish winter. Snow adds to the atmosphere but is not guaranteed in early December.",
                "booking_tips": "No booking needed. Combine with visits to nearby cafés for warming glögg (mulled wine) and pepparkakor (ginger cookies). Dress very warmly as markets are primarily outdoors."
            },
            {
                "name": "Ice Skating in Uppsala",
                "type": "Sport/Recreation",
                "description": "Enjoy winter ice skating at various locations around Uppsala. Options include artificial ice rinks at Studenternas and city parks, or when conditions permit, natural ice at Svandammen in the city center. For natural lake skating, try the tracks at Fjällnora recreation area when thoroughly frozen.",
                "indoor": false,
                "best_time": "Daytime (December-February, weather permitting)",
                "price_range": "Free (most public rinks)/Budget (skate rental)",
                "seasonal_notes": "Natural ice conditions depend entirely on winter temperatures. Artificial rinks have longer operating seasons regardless of weather.",
                "booking_tips": "Check ice conditions before visiting natural sites. Equipment rental available at several locations or at sports shops like Stadium. Fjällnora offers tour skating equipment rental when conditions permit."
            },
            {
                "name": "Lucia Celebrations",
                "type": "Cultural/Music/Religious",
                "description": "Experience the enchanting Lucia tradition on December 13th when processions of white-robed singers with candle crowns perform in Uppsala Cathedral, churches, schools and public spaces throughout the city. This light festival brightens the darkest time of year with beautiful singing and candlelight.",
                "indoor": true,
                "best_time": "Morning/Evening (December 13th, some events on nearby dates)",
                "price_range": "Free (many events)/Moderate (cathedral concerts)",
                "seasonal_notes": "A treasured Swedish winter tradition celebrating light during the darkest time of year. Traditionally accompanied by saffron buns (lussekatter) and gingerbread.",
                "booking_tips": "Major Lucia concerts at Uppsala Cathedral require advance tickets and sell out quickly. Many free Lucia processions take place in public spaces, schools and institutional buildings. Check local events calendar for times and locations."
            },
            {
                "name": "Winter Skiing at Sunnerstabacken",
                "type": "Sport/Recreation",
                "description": "Visit Uppsala's local ski slope at Sunnerstabacken, located in the southern part of the city. While modest in size, it offers several runs suitable for beginners and intermediate skiers, a terrain park for freestyle enthusiasts, and equipment rental on site.",
                "indoor": false,
                "best_time": "Daytime (December-March, snow conditions permitting)",
                "price_range": "Moderate (lift passes and equipment rental)",
                "seasonal_notes": "Operation depends on snow conditions. Artificial snow used when possible to extend the season. Illuminated for evening skiing during dark winter afternoons.",
                "booking_tips": "Check current snow conditions and opening status before visiting. Accessible by city bus or car from central Uppsala. Lessons available for beginners. The site also offers popular sledding hills for non-skiers."
            },
            {
                "name": "Cross-Country Skiing in Uppsala",
                "type": "Sport/Recreation",
                "description": "Explore Uppsala's winter landscape on cross-country skis using the city's extensive network of prepared ski trails. Illuminated tracks in Stadsskogen and Gränby allow for evening skiing, while longer trails at Fjällnora and Hammarskog recreation areas offer more extensive winter experiences.",
                "indoor": false,
                "best_time": "Daytime/Early Evening (December-March)",
                "price_range": "Free (trails)/Budget (equipment rental)",
                "seasonal_notes": "Trail preparation depends on snow conditions. Artificial snow track at Sunnersta/Graneberg extends the season during mild winters.",
                "booking_tips": "Equipment rental available at Aktivt Uteliv and at Fjällnora during winter season. Check trail status online before heading out. City tracks are accessible by public transport while recreation area trails may require car access."
            }
        ]
    }
}