{
    "Spring": {
        "activities": [
            {
                "name": "Visit Tivoli Gardens",
                "type": "Amusement Park",
                "description": "Tivoli Gardens is one of the oldest amusement parks in the world, offering a mix of thrilling rides, beautiful gardens, and live performances.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Springtime sees the gardens in full bloom, making it a perfect time to enjoy the park's floral beauty.",
                "booking_tips": "Purchase tickets online to avoid queues and check the schedule for special spring events."
            },
            {
                "name": "Cherry Blossom at Bispebjerg Cemetery",
                "type": "Park",
                "description": "Experience the breathtaking sight of cherry blossoms in full bloom at Bispebjerg Cemetery, a local favorite for springtime strolls.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The cherry blossoms typically bloom in April, creating a picturesque and serene environment.",
                "booking_tips": "Visit early in the morning to avoid crowds and capture the best photos."
            },
            {
                "name": "Copenhagen Spring Jazz Festival",
                "type": "Festival",
                "description": "This annual festival showcases a variety of jazz performances across multiple venues in the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring marks the start of the festival season in Copenhagen, with jazz music filling the air.",
                "booking_tips": "Purchase tickets in advance and explore different venues for a diverse experience."
            },
            {
                "name": "Explore Nyhavn",
                "type": "Historic District",
                "description": "Nyhavn is a vibrant waterfront area known for its colorful buildings, historic ships, and lively atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The mild spring weather makes it an ideal time to explore the outdoor cafes and restaurants.",
                "booking_tips": "Arrive early to secure a spot at a popular café and enjoy the view."
            },
            {
                "name": "Frederiksberg Garden Picnic",
                "type": "Park",
                "description": "Enjoy a relaxing picnic in Frederiksberg Garden, a large park with beautiful landscapes and a serene lake.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring is perfect for outdoor picnics as the weather warms up and flowers bloom.",
                "booking_tips": "Prepare your picnic supplies in advance and bring a blanket for comfort."
            },
            {
                "name": "Copenhagen Sakura Festival",
                "type": "Festival",
                "description": "Held annually in Langelinie Park, this festival celebrates Japanese culture with food stalls, performances, and traditional ceremonies.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "The festival coincides with the cherry blossom season, adding to the festive atmosphere.",
                "booking_tips": "Check the schedule for specific events and arrive early to participate in workshops."
            },
            {
                "name": "Botanical Garden Visit",
                "type": "Garden",
                "description": "Explore the extensive collection of plants at the Botanical Garden, featuring greenhouses and themed gardens.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is an ideal time to see the garden's wide variety of plants begin to bloom.",
                "booking_tips": "Guided tours are available; check the schedule to join one."
            },
            {
                "name": "Copenhagen Marathon",
                "type": "Sports Event",
                "description": "Join or watch the Copenhagen Marathon, a major event attracting runners from around the world.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The event takes place in May, benefiting from the cool spring weather.",
                "booking_tips": "Register early if participating, and plan your viewing spot along the route."
            },
            {
                "name": "Visit the National Museum of Denmark",
                "type": "Museum",
                "description": "Discover Danish history and culture through extensive exhibits, including Viking artifacts and royal collections.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring showers make indoor museum visits a pleasant option.",
                "booking_tips": "Weekdays are less crowded. Check for any special spring exhibitions."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Copenhagen Zoo",
                "type": "Zoo",
                "description": "Home to over 3,000 animals, the Copenhagen Zoo offers a fun and educational experience for visitors of all ages.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "The longer summer days provide ample time to explore the entire zoo.",
                "booking_tips": "Purchase tickets online for discounts and check feeding schedules in advance."
            },
            {
                "name": "Roskilde Festival",
                "type": "Music Festival",
                "description": "One of Europe's largest music festivals, Roskilde features a diverse lineup of artists and a vibrant atmosphere.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Expensive",
                "seasonal_notes": "Held in late June to early July, the festival is a highlight of the Danish summer.",
                "booking_tips": "Tickets sell out quickly, so book early and consider camping on-site for the full experience."
            },
            {
                "name": "Beach Day at Amager Strandpark",
                "type": "Beach",
                "description": "Amager Strandpark is Copenhagen's largest beach, offering sandy shores, swimming areas, and water sports.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer temperatures make it perfect for a refreshing dip in the sea.",
                "booking_tips": "Bring a picnic and sunscreen, and check for windsurfing lessons if interested."
            },
            {
                "name": "Canal Tour",
                "type": "Boat Tour",
                "description": "Explore Copenhagen from the water with a guided canal tour, offering views of iconic landmarks like the Little Mermaid and Christiansborg Palace.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer's clear skies provide the best visibility for sightseeing.",
                "booking_tips": "Book tickets online to secure a spot and bring a hat for sun protection."
            },
            {
                "name": "Copenhagen Jazz Festival",
                "type": "Festival",
                "description": "A city-wide festival featuring hundreds of jazz concerts in various venues, both indoor and outdoor.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held every July, the festival captures the lively summer spirit of the city.",
                "booking_tips": "Check the program for free concerts and consider purchasing a festival pass for multiple events."
            },
            {
                "name": "Tivoli Gardens Summer Nights",
                "type": "Amusement Park",
                "description": "Experience Tivoli Gardens after dark with live music, fireworks, and illuminated rides.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are magical at Tivoli, with extended opening hours.",
                "booking_tips": "Buy a multi-ride ticket for savings if you plan to enjoy many attractions."
            },
            {
                "name": "Street Food at Reffen",
                "type": "Market",
                "description": "Reffen is a popular street food market located on the industrial Refshaleøen island, offering diverse international cuisines.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings are perfect for enjoying food and drinks outdoors with a view of the harbor.",
                "booking_tips": "Go with a group to try a variety of dishes and arrive early for a good seat."
            },
            {
                "name": "Visit the Louisiana Museum of Modern Art",
                "type": "Museum",
                "description": "Located north of Copenhagen, this museum offers stunning modern art exhibits and beautiful views over the Øresund Strait.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer allows visitors to enjoy the museum's sculpture garden and outdoor installations.",
                "booking_tips": "Consider a combined train and museum ticket for a convenient trip from Copenhagen."
            },
            {
                "name": "Cycling Tour of Copenhagen",
                "type": "Outdoor Activity",
                "description": "Join a guided cycling tour to explore Copenhagen's bike-friendly streets, historic sites, and green spaces.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "The warm, sunny summer weather makes cycling the ideal way to see the city.",
                "booking_tips": "Wear comfortable clothing and book in advance to ensure a spot on a popular tour."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Visit the Glyptoteket",
                "type": "Museum",
                "description": "Explore a collection of ancient and modern art at the Ny Carlsberg Glyptotek, including works by Rodin and Degas.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is great for museum visits as the weather cools, offering a cozy retreat.",
                "booking_tips": "Visit on a Tuesday for free entry and consider using the audio guide for detailed insights."
            },
            {
                "name": "Copenhagen Cooking & Food Festival",
                "type": "Festival",
                "description": "A celebration of Nordic cuisine, featuring cooking workshops, gourmet tastings, and food markets.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Expensive",
                "seasonal_notes": "Held in late August to early September, it's ideal for experiencing seasonal Danish flavors.",
                "booking_tips": "Purchase event tickets early, as popular workshops sell out quickly."
            },
            {
                "name": "Autumn Leaves at Frederiksberg Palace Gardens",
                "type": "Park",
                "description": "Stroll through the picturesque gardens of Frederiksberg Palace, known for its stunning autumn foliage.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn transforms the gardens into a vibrant tapestry of colors, perfect for photography.",
                "booking_tips": "Visit on weekdays to enjoy a quieter experience and capture the best light in the morning."
            },
            {
                "name": "Copenhagen Art Week",
                "type": "Festival",
                "description": "A city-wide celebration of contemporary art, featuring exhibitions, performances, and talks across various venues.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held in September, it's a cultural highlight as the city embraces the arts in the fall.",
                "booking_tips": "Check the program for free events and guided tours, and plan your itinerary in advance."
            },
            {
                "name": "Carlsberg Brewery Tour",
                "type": "Tour",
                "description": "Learn about the history of Carlsberg and the beer-making process on a guided tour of the brewery.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is a great time to enjoy a cozy indoor activity like a brewery tour.",
                "booking_tips": "Book your tour online to ensure availability, and don't miss the tasting session at the end."
            },
            {
                "name": "Halloween at Tivoli Gardens",
                "type": "Amusement Park",
                "description": "Experience spooky decorations, haunted houses, and special Halloween-themed rides at Tivoli Gardens.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Tivoli transforms into a Halloween wonderland during October, offering festive fun for all ages.",
                "booking_tips": "Purchase your tickets in advance and consider a multi-ride pass for savings."
            },
            {
                "name": "Visit Rosenborg Castle",
                "type": "Historic Site",
                "description": "Discover Danish royal history at Rosenborg Castle, home to the crown jewels and beautiful royal gardens.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "The castle provides a warm refuge on crisp autumn days, with fewer crowds than in summer.",
                "booking_tips": "Purchase a combined ticket with Amalienborg Palace for a complete royal experience."
            },
            {
                "name": "Kayaking in the Canals",
                "type": "Outdoor Activity",
                "description": "Explore Copenhagen from the water on a guided kayaking tour through its historic canals.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers a peaceful time to kayak, with the canals less crowded than in summer.",
                "booking_tips": "Wear layers to stay warm and book in advance to ensure a spot on the tour."
            },
            {
                "name": "Visit the Design Museum Denmark",
                "type": "Museum",
                "description": "Discover Danish design history and innovation at this museum, featuring furniture, fashion, and industrial design.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is perfect for exploring indoor cultural attractions as the city cools down.",
                "booking_tips": "Check for temporary exhibitions and visit on a weekday for a quieter experience."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Copenhagen Christmas Markets",
                "type": "Market",
                "description": "Explore the festive Christmas markets at Tivoli Gardens, Nyhavn, and Højbro Plads, offering holiday treats, crafts, and gifts.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter is the perfect time to enjoy the cozy atmosphere and holiday spirit of Copenhagen's Christmas markets.",
                "booking_tips": "Visit on weekday evenings to avoid weekend crowds and bring cash for small purchases."
            },
            {
                "name": "Ice Skating at Frederiksberg Runddel",
                "type": "Outdoor Activity",
                "description": "Enjoy ice skating at this charming outdoor rink located near Frederiksberg Gardens, a winter favorite for locals.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The rink is open during the winter months, providing a fun and active way to embrace the cold weather.",
                "booking_tips": "Rent skates on-site and dress warmly in layers to stay comfortable."
            },
            {
                "name": "Ny Carlsberg Glyptotek Winter Exhibitions",
                "type": "Museum",
                "description": "Visit the Glyptotek for its winter exhibitions, featuring a rich collection of sculptures and paintings in a beautiful historic setting.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is ideal for exploring Copenhagen's museums, offering warmth and cultural enrichment.",
                "booking_tips": "Check for special winter exhibitions and free admission days."
            },
            {
                "name": "New Year's Eve Fireworks at Tivoli",
                "type": "Event",
                "description": "Celebrate New Year's Eve with a spectacular fireworks display at Tivoli Gardens, a beloved Copenhagen tradition.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Tivoli's New Year's celebrations are a highlight of the winter season, drawing locals and tourists alike.",
                "booking_tips": "Purchase tickets in advance, as this event sells out quickly, and arrive early for the best view."
            },
            {
                "name": "Bakken Winter Opening",
                "type": "Amusement Park",
                "description": "Experience the winter season at Bakken, the world's oldest amusement park, with special winter-themed attractions and entertainment.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Bakken offers a unique winter experience with festive decorations and seasonal activities.",
                "booking_tips": "Check the opening dates and consider a rides pass for access to all attractions."
            },
            {
                "name": "Warm Up at a Copenhagen Café",
                "type": "Culinary",
                "description": "Enjoy a cozy break at one of Copenhagen's charming cafés, such as The Living Room or Café Norden, known for their hygge atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is the perfect time to embrace hygge culture, with warm drinks and cozy settings.",
                "booking_tips": "Visit during off-peak hours to secure a comfortable spot by the fire."
            },
            {
                "name": "Visit Frederiksborg Castle",
                "type": "Historic Site",
                "description": "Explore the grandeur of Frederiksborg Castle, featuring beautiful Baroque architecture and extensive art collections.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides a quieter time to visit the castle, with fewer tourists and a serene landscape.",
                "booking_tips": "Take a train from Copenhagen and consider a guided tour for in-depth insights."
            },
            {
                "name": "Copenhagen Light Festival",
                "type": "Festival",
                "description": "Marvel at the art installations and light displays that illuminate the city during the Copenhagen Light Festival.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held in February, the festival brightens the long winter nights with stunning visual displays.",
                "booking_tips": "Dress warmly and plan your route to see the most iconic installations."
            },
            {
                "name": "Winter Bathing at Helgoland",
                "type": "Outdoor Activity",
                "description": "Join the local tradition of winter bathing at Helgoland, a bathing club at Amager Strand, for a refreshing and invigorating experience.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter bathing is a popular Danish activity, believed to boost circulation and mood.",
                "booking_tips": "Bring a warm towel and change of clothes, and check club hours for visitor access."
            }
        ]
    }
}