{
    "Spring": {
        "activities": [
            {
                "name": "Daffodil Bloom at the Beguinage",
                "type": "Nature/Cultural",
                "description": "Experience the Princely Beguinage Ten Wijngaarde when its central courtyard transforms into a carpet of golden daffodils, creating one of Bruges' most photogenic spring scenes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Daffodils typically bloom from March to early April, creating a spectacular sea of yellow.",
                "booking_tips": "No booking required. Visit early morning to avoid crowds and get the best light for photos."
            },
            {
                "name": "Tour of Flanders Cycling Event",
                "type": "Sporting Event",
                "description": "Experience the start of Belgium's most famous cycling race in Bruges, with professional cyclists gathering in the Markt Square before departing on their challenging route through Flanders.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Held annually in early April, usually the first Sunday of the month.",
                "booking_tips": "Arrive early to secure a good viewing spot near the start line in Markt Square."
            },
            {
                "name": "Canal Boat Tour",
                "type": "Sightseeing",
                "description": "Glide through Bruges' network of medieval canals on a guided boat tour, offering unique perspectives of the city's historic architecture and secret gardens coming to life in spring.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers blooming gardens along the canals and fewer tourists than summer months.",
                "booking_tips": "No advance booking needed; simply show up at one of the five embarkation points. Tours operate every 30 minutes."
            },
            {
                "name": "Chocolate Workshop Experience",
                "type": "Culinary Workshop",
                "description": "Learn the art of Belgian chocolate-making from master chocolatiers, creating your own pralines and truffles to take home as delicious souvenirs.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "A perfect indoor activity during spring showers.",
                "booking_tips": "Book at least a week in advance through the Choco-Story Museum or specialized chocolate workshop providers."
            },
            {
                "name": "Procession of the Holy Blood",
                "type": "Religious Festival",
                "description": "Witness Bruges' most important religious and cultural event where a relic believed to contain Christ's blood is carried through the historic streets in an elaborate procession.",
                "indoor": false,
                "best_time": "Morning to Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held annually on Ascension Day (40 days after Easter), typically in May.",
                "booking_tips": "No booking required, but arrive early to secure a viewing spot along the procession route."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Cactus Festival",
                "type": "Music Festival",
                "description": "Enjoy three days of diverse music performances at this intimate festival set in the beautiful Minnewater Park, featuring international and local artists in a relaxed atmosphere.",
                "indoor": false,
                "best_time": "Afternoon and Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held annually in early July, often the second weekend of the month.",
                "booking_tips": "Purchase tickets online in advance as the festival frequently sells out."
            },
            {
                "name": "Canal Swimming",
                "type": "Outdoor Recreation",
                "description": "Join locals for the unique experience of swimming in Bruges' clean canals during the summer months, with designated areas and facilities provided.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Available from June to August, weather permitting, usually from 1 PM to 9 PM.",
                "booking_tips": "No booking required. Bring your own towel and remember there are no changing rooms, so wear your swimsuit under your clothes."
            },
            {
                "name": "Musica Antiqua Festival",
                "type": "Music Festival",
                "description": "Immerse yourself in medieval and early music concerts held in historic venues throughout Bruges, featuring performances by world-renowned early music specialists.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held annually in early August, spanning approximately 10 days.",
                "booking_tips": "Book tickets online in advance, especially for headline performances in prestigious venues."
            },
            {
                "name": "WECANDANCE Festival",
                "type": "Music Festival",
                "description": "Experience Belgium's stylish beach festival combining electronic music, fashion, and food in Zeebrugge, just a short trip from Bruges city center.",
                "indoor": false,
                "best_time": "Afternoon and Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held over two weekends in August at the Zeebrugge event plateau.",
                "booking_tips": "Purchase tickets well in advance and consider transportation options from Bruges to Zeebrugge."
            },
            {
                "name": "Bike Tour to Damme",
                "type": "Cycling Tour",
                "description": "Cycle along the scenic canal path connecting Bruges to the charming village of Damme, passing windmills and countryside scenery on this perfect summer excursion.",
                "indoor": false,
                "best_time": "Morning or Late Afternoon",
                "price_range": "Free (if using own bike) to Budget (if renting)",
                "seasonal_notes": "Most enjoyable in summer when the towpath is dry and cafes in Damme have outdoor terraces.",
                "booking_tips": "Rent bikes from numerous rental shops in Bruges; no booking needed for the path itself."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Beer Festival Bruges",
                "type": "Culinary Festival",
                "description": "Sample a vast selection of Belgian beers from traditional Trappist ales to innovative craft brews at Bruges' celebrated beer festival in the heart of the city.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in September or early October at the Bruges Meeting & Convention Centre.",
                "booking_tips": "Purchase tasting packages online in advance for best value and to avoid entrance queues."
            },
            {
                "name": "Autumn Canal Tour",
                "type": "Sightseeing",
                "description": "Experience Bruges' famous canal boat tours surrounded by autumn colors, with historic buildings reflected in the still waters under seasonal golden light.",
                "indoor": false,
                "best_time": "Late Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers spectacular foliage colors and fewer tourists than summer months.",
                "booking_tips": "Tours run less frequently in autumn; check the last departure time at boat stations."
            },
            {
                "name": "Bruges Triennial Art Route",
                "type": "Art Exhibition",
                "description": "Explore contemporary art installations placed throughout the historic center of Bruges as part of the city's internationally renowned art triennial.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The exhibition runs from spring through autumn every three years.",
                "booking_tips": "Download the free route map from the Triennial website or pick one up at the visitor center."
            },
            {
                "name": "Chocolate Line Factory Tour",
                "type": "Culinary Tour",
                "description": "Visit the workshop of Dominique Persoone, Bruges' celebrity chocolatier, to see how his avant-garde chocolates are created and sample seasonal autumn flavors.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn introduces seasonal flavors like spiced pumpkin and chestnut in many chocolate shops.",
                "booking_tips": "Book directly through The Chocolate Line website several weeks in advance."
            },
            {
                "name": "Zandfeesten (Sand Feasts) Antique Market",
                "type": "Market",
                "description": "Browse Belgium's largest antique and vintage market held in the spacious 't Zand Square, featuring dealers from across Belgium and neighboring countries.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to enter",
                "seasonal_notes": "Held on Sundays in autumn, with specific dates varying each year.",
                "booking_tips": "Arrive early for the best selection; bring cash as many vendors don't accept cards."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Winter Glow Festival",
                "type": "Holiday Festival",
                "description": "Experience Bruges transformed into a winter wonderland with this festival featuring a light experience trail, Christmas markets, ice skating, and seasonal decorations throughout the historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (some attractions have fees)",
                "seasonal_notes": "Runs from late November to early January, with the city at its most festive.",
                "booking_tips": "No booking required for the light trail, but ice skating may require reservations during peak times."
            },
            {
                "name": "Ice Skating on Minnewater",
                "type": "Winter Recreation",
                "description": "Glide across the ice on a specially constructed rink on the scenic Lake of Love (Minnewater), surrounded by festive decorations and historic buildings.",
                "indoor": false,
                "best_time": "Afternoon or Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Part of the Winter Glow Festival from late November to early January.",
                "booking_tips": "Weekday mornings are least crowded; skate rental included in the entrance fee."
            },
            {
                "name": "Christmas Markets",
                "type": "Holiday Market",
                "description": "Wander through Bruges' enchanting Christmas markets at Markt Square and Simon Stevinplein, featuring wooden chalets selling handcrafted gifts, seasonal food, and warming drinks.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to enter",
                "seasonal_notes": "Open from late November to early January as part of Winter Glow.",
                "booking_tips": "Visit on weekdays or early in the day on weekends to avoid the largest crowds."
            },
            {
                "name": "Bruges Beer Festival",
                "type": "Culinary Festival",
                "description": "Warm up at this winter beer festival showcasing over 400 Belgian beers from classic abbey brews to innovative craft creations, with opportunities to meet brewers.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Usually held in February, making it a perfect winter activity.",
                "booking_tips": "Purchase tickets online in advance and consider the Sunday session for smaller crowds."
            },
            {
                "name": "New Year's Eve in Bruges",
                "type": "Holiday Celebration",
                "description": "Ring in the New Year in medieval surroundings with special events throughout the city, including a free concert and festive atmosphere in the historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (public celebrations)",
                "seasonal_notes": "December 31st celebrations, with many venues offering special New Year's packages.",
                "booking_tips": "Reserve restaurants and special events well in advance; many hotels offer package deals."
            }
        ]
    }
}