{
    "Spring": {
        "activities": [
            {
                "name": "Easter Markets in Upper Square",
                "type": "Market",
                "description": "Traditional Easter markets featuring hand-painted eggs, willow branches, local crafts, and seasonal Czech treats like mazanec (Easter bread) and beránek (lamb-shaped cake).",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the most important Czech holiday with colorful traditions and family celebrations.",
                "booking_tips": "Visit early morning for the best selection of handcrafted items and traditional Easter decorations."
            },
            {
                "name": "Cherry Blossom Viewing at Bezručovy Sady",
                "type": "Park",
                "description": "Enjoy the beautiful cherry blossoms in full bloom at Bezručovy Sady park, offering scenic views of the city and peaceful walking paths.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is perfect for enjoying the cherry blossoms, which typically bloom from late March to mid-April.",
                "booking_tips": "Bring a picnic blanket and arrive early to enjoy the peaceful atmosphere before crowds arrive."
            },
            {
                "name": "Visit to the Archbishop's Palace",
                "type": "Historical Site",
                "description": "Explore the magnificent Archbishop's Palace, the residence of the Archbishop of Olomouc, featuring beautiful Baroque architecture and historic interiors.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring rains can be unpredictable, making indoor historical sites an ideal activity.",
                "booking_tips": "Check opening hours in advance and consider a guided tour for deeper historical insights."
            },
            {
                "name": "Spring Walks Along the Morava River",
                "type": "Outdoor Activity",
                "description": "Take leisurely walks along the Morava River promenade, enjoying the spring greenery and views of the historic city center.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The riverbanks come alive in spring with blooming flowers and pleasant weather.",
                "booking_tips": "Wear comfortable walking shoes and bring a camera to capture the scenic views."
            },
            {
                "name": "Student Cultural Festival",
                "type": "Cultural Event",
                "description": "Experience the vibrant student culture at Palacký University's spring festival, featuring music performances, art exhibitions, and academic events.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Spring brings renewed energy to the university district with various cultural activities.",
                "booking_tips": "Check the university's event calendar for specific dates and performances."
            },
            {
                "name": "Traditional Czech Easter Celebrations",
                "type": "Cultural Event",
                "description": "Participate in traditional Czech Easter celebrations including the pomlázka (whipping) tradition, egg decorating workshops, and Easter Sunday services.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Easter is the most important spring holiday in Czech culture with unique traditions.",
                "booking_tips": "Respect local customs and consider attending a traditional Easter service at St. Wenceslas Cathedral."
            },
            {
                "name": "Spring Photography Tour",
                "type": "Photography",
                "description": "Capture the beauty of Olomouc's Baroque architecture and spring blooms with a guided photography tour of the historic center.",
                "indoor": false,
                "best_time": "Golden Hour",
                "price_range": "Moderate",
                "seasonal_notes": "Spring light is perfect for architectural photography with blooming trees and clear skies.",
                "booking_tips": "Book with a local photographer for insider knowledge of the best angles and timing."
            },
            {
                "name": "Local Spring Markets",
                "type": "Market",
                "description": "Explore local spring markets offering fresh produce, seasonal flowers, and traditional Czech goods at various locations throughout the city.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets are bustling with seasonal produce and vibrant flowers.",
                "booking_tips": "Visit early for the best selection and fewer crowds."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Olomouc Summer Festival",
                "type": "Music Festival",
                "description": "Enjoy classical music performances in historic venues including St. Maurice Church and the Archbishop's Palace during the annual summer festival.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings the city's premier cultural event with world-class performances in historic settings.",
                "booking_tips": "Purchase tickets in advance as performances often sell out quickly."
            },
            {
                "name": "Outdoor Beer Gardens",
                "type": "Food & Drink",
                "description": "Experience traditional Czech beer culture in outdoor beer gardens throughout the city, especially popular in the university district.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings are perfect for enjoying Czech beer in beautiful outdoor settings.",
                "booking_tips": "Try local breweries like Svatováclavský Minipivovar for authentic Czech beer experience."
            },
            {
                "name": "Boat Tours on the Morava River",
                "type": "Boat Tour",
                "description": "Take scenic boat trips along the Morava River with views of the historic city center and surrounding countryside.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers pleasant weather for river cruises with lush greenery along the banks.",
                "booking_tips": "Book tickets in advance, especially on weekends, to ensure availability."
            },
            {
                "name": "Visit to the Holy Trinity Column",
                "type": "Historical Site",
                "description": "Explore the UNESCO World Heritage Holy Trinity Column, the most outstanding example of Central European Baroque art, with guided tours available.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer provides the best lighting to appreciate the column's intricate sculptures and details.",
                "booking_tips": "Visit early morning to avoid crowds and get the best photographs."
            },
            {
                "name": "University Campus Tours",
                "type": "Educational Tour",
                "description": "Explore the historic Palacký University campus, one of the oldest universities in Central Europe, with beautiful architecture and rich academic history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer offers quieter campus atmosphere with fewer students and pleasant weather for walking tours.",
                "booking_tips": "Contact the university in advance to arrange guided tours of historic buildings."
            },
            {
                "name": "Cycling Around Olomouc",
                "type": "Outdoor Activity",
                "description": "Rent a bike and explore Olomouc's historic center and surrounding areas, including the university district and river paths.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer climate is ideal for outdoor cycling with long daylight hours and scenic routes.",
                "booking_tips": "Use local bike rental services and follow designated cycling paths for safety."
            },
            {
                "name": "Rooftop Dining at Hotel Arigone",
                "type": "Dining",
                "description": "Dine at Hotel Arigone's rooftop restaurant offering traditional Czech cuisine with panoramic views of the historic city center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings are perfect for rooftop dining with comfortable temperatures and spectacular sunsets.",
                "booking_tips": "Reserve a table in advance, especially for sunset dining with city views."
            },
            {
                "name": "Explore the Astronomical Clock",
                "type": "Historical Site",
                "description": "Visit the unique Olomouc Astronomical Clock, featuring socialist-realist style design and moving figures that perform at noon daily.",
                "indoor": false,
                "best_time": "Noon",
                "price_range": "Free",
                "seasonal_notes": "Summer provides the best conditions to see the clock's moving figures and detailed artwork.",
                "booking_tips": "Arrive 10 minutes before noon to secure a good viewing spot for the moving figures."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Visit to St. Wenceslas Cathedral",
                "type": "Historical Site",
                "description": "Explore the magnificent St. Wenceslas Cathedral with the tallest church spire in Moravia (100.65m) and beautiful Gothic architecture.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn is a great time to explore indoor attractions as the weather cools down.",
                "booking_tips": "Check service times and consider attending a mass for a unique cultural experience."
            },
            {
                "name": "Autumn Foliage Walks in Bezručovy Sady",
                "type": "Park",
                "description": "Take leisurely strolls through Bezručovy Sady park, enjoying the vibrant fall colors and peaceful atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The park is particularly beautiful in autumn with golden fall colors and crisp air.",
                "booking_tips": "Visit in the afternoon for the best lighting for photography of the autumn foliage."
            },
            {
                "name": "Wine Tasting in Local Pubs",
                "type": "Food & Drink",
                "description": "Discover Moravian wines with tastings at traditional Czech pubs and wine bars throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season in Moravia, making it an ideal time for wine tasting.",
                "booking_tips": "Try local Moravian wines and ask pub owners for recommendations of regional specialties."
            },
            {
                "name": "Visit to St. Maurice Church",
                "type": "Historical Site",
                "description": "Tour the historic St. Maurice Church featuring Europe's largest church organ and beautiful Baroque architecture.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn's cooler days are perfect for indoor activities like church visits.",
                "booking_tips": "Check organ concert schedules for a special musical experience."
            },
            {
                "name": "Olomouc Autumn Festival",
                "type": "Cultural Event",
                "description": "Attend the annual autumn festival featuring classical music performances, art exhibitions, and cultural events throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This annual event celebrates culture and art, perfect for crisp autumn evenings.",
                "booking_tips": "Check the festival program in advance and book tickets for popular performances."
            },
            {
                "name": "Visit to the Archbishop's Museum",
                "type": "Museum",
                "description": "Explore the Archbishop's Museum showcasing religious art, historical artifacts, and the rich cultural heritage of Olomouc.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's shorter days make museums an ideal choice for cultural enrichment.",
                "booking_tips": "Purchase tickets online to avoid queues and consider a guided tour for deeper insights."
            },
            {
                "name": "Traditional Czech Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Czech dishes with a hands-on cooking class, focusing on seasonal ingredients and regional specialties.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides a bounty of ingredients for culinary exploration.",
                "booking_tips": "Book early, especially for popular classes, and check if the class includes a market visit."
            },
            {
                "name": "Explore the Baroque Fountains",
                "type": "Historical Site",
                "description": "Visit Olomouc's famous Baroque fountains including Caesar's Fountain, Neptune Fountain, and Hercules Fountain.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn provides beautiful lighting for photographing the intricate Baroque sculptures.",
                "booking_tips": "Take your time to appreciate the details of each fountain and their historical significance."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets in Upper Square",
                "type": "Market",
                "description": "Experience magical Christmas markets featuring traditional Czech crafts, mulled wine (svařené víno), gingerbread, and festive decorations around the Holy Trinity Column.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter markets are a quintessential part of the holiday season, offering a warm, festive atmosphere.",
                "booking_tips": "Visit in the evening for the best atmosphere and to see the festive lights illuminating the Holy Trinity Column."
            },
            {
                "name": "Ice Skating at Bezručovy Sady",
                "type": "Sport",
                "description": "Enjoy ice skating on the outdoor rink set up in Bezručovy Sady park, a festive winter tradition in Olomouc.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is the perfect time for ice skating, with rinks set up around the city.",
                "booking_tips": "Skate rentals are available on-site, but lines can be long, so arrive early."
            },
            {
                "name": "Attend a Concert at St. Maurice Church",
                "type": "Concert",
                "description": "Experience classical music concerts in the stunning setting of St. Maurice Church, featuring its famous organ and beautiful acoustics.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter evenings are perfect for indoor concerts, providing warmth and cultural enrichment.",
                "booking_tips": "Book tickets in advance, as concerts often sell out quickly."
            },
            {
                "name": "Visit to the Archbishop's Palace",
                "type": "Historical Site",
                "description": "Tour the opulent Archbishop's Palace and its historic interiors, less crowded during the winter months.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers fewer crowds, allowing a more leisurely exploration of the palace.",
                "booking_tips": "Purchase tickets online to avoid queues and consider an audio guide for a self-paced tour."
            },
            {
                "name": "Traditional Czech Christmas Dinner",
                "type": "Dining",
                "description": "Enjoy a traditional Czech Christmas dinner featuring carp, potato salad, and traditional Christmas cookies at local restaurants.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter is the perfect season for enjoying traditional Czech Christmas cuisine.",
                "booking_tips": "Reserve a table well in advance, especially for Christmas Eve dinner."
            },
            {
                "name": "Visit to St. Wenceslas Cathedral",
                "type": "Historical Site",
                "description": "Explore the historic St. Wenceslas Cathedral, a masterpiece of Gothic architecture, and attend Christmas services.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter offers a serene atmosphere for visiting iconic landmarks with fewer tourists.",
                "booking_tips": "Check service times and consider attending a Christmas mass for a unique experience."
            },
            {
                "name": "New Year's Eve Celebrations",
                "type": "Festival",
                "description": "Celebrate New Year's Eve with fireworks, live music, and festive atmosphere in Upper Square and throughout the historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "New Year's Eve is a highlight of the winter season with spectacular fireworks and celebrations.",
                "booking_tips": "Find a good vantage point early in the evening to avoid the crowds and bring warm clothing."
            },
            {
                "name": "Hot Chocolate at Local Cafes",
                "type": "Café",
                "description": "Warm up with traditional Czech hot chocolate and pastries at cozy cafes throughout the historic center.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season for enjoying indulgent hot beverages and warm pastries.",
                "booking_tips": "Try local cafes like Eatery & Bakery for authentic Czech pastries and hot drinks."
            },
            {
                "name": "Winter Photography Tour",
                "type": "Photography",
                "description": "Capture the beauty of Olomouc's Baroque architecture and winter atmosphere with a guided photography tour.",
                "indoor": false,
                "best_time": "Golden Hour",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides unique lighting conditions for architectural photography with snow-covered rooftops.",
                "booking_tips": "Book with a local photographer for insider knowledge of the best winter angles and timing."
            }
        ]
    }
}