{
    "sites": [
        {
            "name": "Holy Trinity Column",
            "type": "Monument",
            "description": "A UNESCO World Heritage site and the most outstanding example of Central European Baroque art. This memorial column, erected in 1716-1754, rises 35 meters high and is decorated with exceptional religious sculptures by Moravian artist Ondřej Zahner. It represents the religious devotion and civic pride of Olomouc's inhabitants.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round; golden hour lighting enhances the sculptural details. The column is particularly stunning when illuminated at night.",
            "booking_tips": "No booking required. Free guided tours are occasionally available. Combine with a visit to the nearby Upper Square.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 49.5938,
            "longitude": 17.2509,
            "compositeRank": {
                "country": 1,
                "europe": 8
            }
        },
        {
            "name": "St. Wenceslas Cathedral",
            "type": "Cathedral",
            "description": "The cathedral's 100.65-meter southern tower is the tallest church spire in Moravia and the second highest in the Czech Republic. This impressive Gothic cathedral, begun in 1107, features a three-nave hall and houses the shrine of St. Jan Sarkander, canonized by Pope John Paul II in 1995.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "The cathedral's Neo-Gothic interior is impressive year-round. Check for organ concerts featuring one of the finest Romantic period instruments in the Czech Republic.",
            "booking_tips": "Tower tours require advance booking. Guided tours provide insight into the cathedral's 900-year history and architectural evolution.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 49.5959,
            "longitude": 17.2506,
            "compositeRank": {
                "country": 2,
                "europe": 25
            }
        },
        {
            "name": "Church of St. Maurice",
            "type": "Church",
            "description": "One of the most significant examples of late Gothic architecture in Moravia, featuring Europe's largest church organ. The church serves as the main city temple and houses remarkable 18th-century organs expanded to a five-manual instrument, ranking among the largest in Europe.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Regular organ concerts showcase the magnificent instrument. The church's acoustic properties are exceptional for musical performances.",
            "booking_tips": "Check concert schedules for organ performances. Tower access offers panoramic city views but requires advance booking.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 49.5929,
            "longitude": 17.2511,
            "compositeRank": {
                "country": 3,
                "europe": 40
            }
        },
        {
            "name": "Olomouc Astronomical Clock",
            "type": "Historical Monument",
            "description": "A unique astronomical clock dating from the 15th century, rebuilt in socialist-realist style after World War II damage. Unlike Prague's famous clock, this one features workers and scientists instead of apostles, making it a fascinating example of 20th-century political art.",
            "indoor": false,
            "best_time": "Any time",
            "price_range": "Free",
            "seasonal_notes": "The clock performs a show daily at noon. Best viewed from the front of the town hall on the Upper Square.",
            "booking_tips": "No booking required. Time your visit for the noon performance. The clock is beautifully illuminated in the evening.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 49.5938,
            "longitude": 17.2506,
            "compositeRank": {
                "country": 4,
                "europe": 50
            }
        },
        {
            "name": "Upper Square (Horní náměstí)",
            "type": "Square",
            "description": "The heart of Olomouc's historic center, dominated by the Holy Trinity Column and surrounded by beautiful Renaissance and Baroque buildings. The square hosts the town hall with its astronomical clock and numerous cafes and restaurants.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Lively atmosphere year-round with outdoor seating in warmer months. Christmas markets during December create a magical atmosphere.",
            "booking_tips": "No booking required. Perfect for people-watching and dining. Combine with visits to the Trinity Column and astronomical clock.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 49.5938,
            "longitude": 17.2506,
            "compositeRank": {
                "country": 5,
                "europe": 60
            }
        },
        {
            "name": "Regional Museum in Olomouc",
            "type": "Museum",
            "description": "The main regional museum showcasing Moravian history, culture, and natural history. Located in a beautiful historic building on Republic Square, it features permanent exhibitions on regional archaeology, ethnography, and local personalities.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Rotating exhibitions provide fresh perspectives on regional history. Less crowded on weekdays.",
            "booking_tips": "Check the exhibition schedule online. Family tickets and student discounts available. Audio guides enhance the experience.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 49.5944,
            "longitude": 17.2514,
            "compositeRank": {
                "country": 6,
                "europe": 75
            }
        },
        {
            "name": "Olomouc Fountains",
            "type": "Fountains",
            "description": "A series of six spectacular Baroque fountains scattered throughout the historic center, featuring mythological themes including Hercules, Neptune, Triton, Mercury, Jupiter, and Caesar. These 18th-century masterpieces complement the Holy Trinity Column's baroque program.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round, with water features active from spring through autumn. Each fountain tells a different mythological story.",
            "booking_tips": "No booking required. Create a fountain walking tour to see all six. Pick up a map from the tourist information center.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 49.5935,
            "longitude": 17.2515,
            "compositeRank": {
                "country": 7,
                "europe": 80
            }
        },
        {
            "name": "Bezruč Park",
            "type": "Park",
            "description": "A beautiful urban park perfect for relaxation and leisurely walks, located near the city center. The park features mature trees, walking paths, and peaceful green spaces ideal for picnics and outdoor activities.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Particularly beautiful in spring with blooming flowers and autumn with colorful foliage. Popular with families and joggers.",
            "booking_tips": "No booking required. Perfect for a break between sightseeing. Playground facilities available for families with children.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 49.5955,
            "longitude": 17.2545,
            "compositeRank": {
                "country": 8,
                "europe": 90
            }
        },
        {
            "name": "Villa Primavesi",
            "type": "Architecture",
            "description": "A stunning example of Art Nouveau architecture designed by Josef Hoffmann for the Primavesi family. This villa represents one of the finest examples of Wiener Werkstätte design in Central Europe, showcasing early 20th-century artistic innovation.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Architecture tours available year-round. The villa's geometric design and artistic details are best appreciated in good lighting.",
            "booking_tips": "Guided tours must be booked in advance. Photography may be restricted in certain areas. Check opening hours as they vary seasonally.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 49.5965,
            "longitude": 17.2485,
            "compositeRank": {
                "country": 9,
                "europe": 95
            }
        },
        {
            "name": "Olomouc Fortress",
            "type": "Historical Site",
            "description": "Remnants of the historic fortress system that once protected Olomouc, including preserved fortifications and defensive walls. The fortress played a crucial role in the city's military history and offers insights into Central European defensive architecture.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Best explored in good weather. Some areas may be more accessible during certain seasons. Historical reenactments occasionally take place.",
            "booking_tips": "No booking required for exterior exploration. Guided tours of fortress tunnels require advance reservation and are only available on certain days.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 49.5925,
            "longitude": 17.2535,
            "compositeRank": {
                "country": 10,
                "europe": 100
            }
        }
    ]
}