{
  "neighborhoods": [
    {
      "name": "Alta",
      "alternate_names": [
        "Upper Town",
        "Cidade Alta",
        "University District"
      ],
      "character": "Historic upper district, home to the UNESCO-listed University of Coimbra. Characterized by narrow medieval streets, impressive academic buildings, and stunning viewpoints overlooking the city and Mondego River.",
      "location": {
        "central": true,
        "description": "The highest part of Coimbra's historic center, crowning the city on its prominent hill, with the university as its focal point.",
        "borders": [
          "Baixa",
          "Jardim Botânico",
          "Celas"
        ],
        "landmarks": [
          "University of Coimbra",
          "Biblioteca Joanina (Joanine Library)",
          "Sé Nova (New Cathedral)",
          "Sé Velha (Old Cathedral)",
          "Torre da Universidade",
          "Museu Nacional Machado de Castro"
        ]
      },
      "history": {
        "overview": "Historically the privileged section of Coimbra, where only the wealthy, nobility, and clergy could live within the protective city walls. Has been the intellectual heart of Portugal since the University relocated here permanently in 1537.",
        "significance": "Represents Coimbra's academic heritage and historical importance as Portugal's center of learning for centuries.",
        "notable_events": [
          "University of Coimbra founding (1290) and permanent relocation (1537)",
          "Construction of the Baroque Biblioteca Joanina in the early 18th century",
          "UNESCO World Heritage designation in 2013"
        ]
      },
      "practical_info": {
        "transit": [
          "Accessible by 'Pantufinhas' (Blue Line) minibuses that connect upper and lower town",
          "Limited vehicle access and difficult parking",
          "Best explored on foot"
        ],
        "safety": "Generally very safe, well-lit main paths, though steep streets require caution at night.",
        "best_time_to_visit": "Early morning for fewer tourists, particularly at the University. Spring and fall offer pleasant walking weather.",
        "walkability": "Walkable but challenging due to steep inclines and cobblestone streets; comfortable shoes essential."
      },
      "appeal": {
        "known_for": [
          "University of Coimbra and academic tradition",
          "Spectacular city views",
          "Historic architecture",
          "Student atmosphere"
        ],
        "atmosphere": [
          "Academic",
          "Historic",
          "Lively during term time",
          "Charming"
        ],
        "best_for": [
          "History enthusiasts",
          "Architecture lovers",
          "Photographers",
          "Culture seekers"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 2,
        "green_spaces": 2,
        "shopping": 2,
        "dining": 3,
        "nightlife": 3,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "University of Coimbra",
            "type": "Historical Site/University",
            "description": "Portugal's oldest university and one of Europe's oldest, featuring impressive buildings around the Paço das Escolas courtyard, including the Royal Palace, São Miguel Chapel, and the iconic University Tower.",
            "appeal": "Tour the UNESCO World Heritage site that has shaped Portuguese intellectual life for centuries."
          },
          {
            "name": "Biblioteca Joanina",
            "type": "Historic Library",
            "description": "Stunning 18th-century Baroque library featuring elaborately decorated rooms with gilded shelves, painted ceilings, and a colony of bats that naturally protect the ancient books.",
            "appeal": "Visit one of the world's most beautiful libraries, a masterpiece of Portuguese Baroque design."
          },
          {
            "name": "Museu Nacional Machado de Castro",
            "type": "Museum/Archaeological Site",
            "description": "Major art museum built above the impressively preserved cryptoporticus of the ancient Roman forum, featuring Portuguese sculpture, painting, and decorative arts.",
            "appeal": "Explore both Portuguese fine arts and the remarkable Roman ruins beneath the museum."
          }
        ],
        "dining": [
          {
            "name": "Academic Cafés & Restaurants",
            "cuisine": "Portuguese & International",
            "price_range": "€€-€€€",
            "known_for": "Student atmosphere, traditional and contemporary cuisine",
            "atmosphere": "Mix of historic taverns and modern establishments catering to academic community and visitors."
          }
        ],
        "activities": [
          {
            "name": "Climb the University Tower",
            "type": "Viewpoint/Photography",
            "description": "Ascend the University Tower for panoramic views of Coimbra and the Mondego River valley.",
            "suitable_for": [
              "Those able to climb stairs",
              "Photography enthusiasts"
            ]
          },
          {
            "name": "Experience Academic Traditions",
            "type": "Cultural Immersion",
            "description": "Witness student life with the distinctive black capes, academic ceremonies, and possibly fado performances if visiting during term time.",
            "suitable_for": [
              "Cultural enthusiasts",
              "Music lovers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to immerse yourself in Coimbra's academic atmosphere",
        "You appreciate historic settings and don't mind steep streets",
        "You want easy access to the main monuments and university"
      ],
      "avoid_if": [
        "You have mobility issues or difficulty with hills",
        "You need convenient parking or car access",
        "You prefer modern accommodations with contemporary amenities"
      ],
      "insider_tips": [
        "Visit the University early in the morning to avoid tour groups, especially for the Biblioteca Joanina which has timed entry and limited capacity.",
        "Find the smaller viewpoints (miradouros) throughout Alta for less crowded but still spectacular views of the city.",
        "During term time, listen for the sounds of Coimbra fado performed by student groups in the evenings."
      ]
    },
    {
      "name": "Baixa",
      "alternate_names": [
        "Lower Town",
        "Downtown",
        "Cidade Baixa"
      ],
      "character": "Coimbra's bustling commercial heart with narrow medieval streets and newer commercial areas. Features pedestrianized shopping streets, traditional shops, numerous cafes and restaurants, and the lively rhythm of everyday local life.",
      "location": {
        "central": true,
        "description": "The lower part of the historic center, stretching from the riverfront up to the base of the university hill.",
        "borders": [
          "Alta",
          "Mondego River",
          "Solum (further east)"
        ],
        "landmarks": [
          "Praça do Comércio",
          "Praça 8 de Maio",
          "Igreja de Santa Cruz",
          "Mercado Municipal D. Pedro V",
          "Rua Ferreira Borges (main shopping street)",
          "Café Santa Cruz"
        ]
      },
      "history": {
        "overview": "Historically the working-class district where merchants, artisans, and common people lived, in contrast to the nobility and clergy in Alta. Developed as the commercial center with an Arab-influenced layout of narrow, winding streets.",
        "significance": "Represents the commercial and social heart of Coimbra throughout its history.",
        "notable_events": [
          "Medieval marketplace development",
          "Construction of Santa Cruz Monastery (12th century)",
          "Commercial growth beginning in the Middle Ages"
        ]
      },
      "practical_info": {
        "transit": [
          "Proximity to train and bus stations",
          "Served by numerous city bus routes",
          "Market Elevator (Elevador do Mercado) connects to higher areas",
          "Pedestrianized areas make walking easy"
        ],
        "safety": "Generally safe, though be mindful of belongings on busy shopping streets and during student events.",
        "best_time_to_visit": "Morning for market visits, daytime for shopping, evenings for dining and people-watching.",
        "walkability": "Extremely walkable with pedestrianized zones, though some streets have considerable incline toward Alta."
      },
      "appeal": {
        "known_for": [
          "Shopping streets and traditional commerce",
          "Historic cafés and restaurants",
          "Santa Cruz Monastery",
          "Local daily life"
        ],
        "atmosphere": [
          "Bustling",
          "Commercial",
          "Authentic",
          "Social"
        ],
        "best_for": [
          "Shoppers",
          "Food enthusiasts",
          "People watchers",
          "Those seeking local atmosphere"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 4,
        "green_spaces": 1,
        "shopping": 5,
        "dining": 5,
        "nightlife": 4,
        "cultural": 4,
        "historic": 4
      },
      "highlights": {
        "attractions": [
          {
            "name": "Igreja de Santa Cruz",
            "type": "Historical Church/Monument",
            "description": "12th-century monastery church containing the tombs of Portugal's first two kings, Afonso Henriques and Sancho I, with impressive Manueline architectural elements.",
            "appeal": "Visit the National Pantheon of Portugal and one of Coimbra's most important religious monuments."
          },
          {
            "name": "Café Santa Cruz",
            "type": "Historic Café",
            "description": "Iconic café housed in a former chapel dating to 1530, featuring vaulted ceilings and stained-glass windows, serving as a cultural institution since 1923.",
            "appeal": "Experience Portugal's café culture in a uniquely atmospheric historic setting."
          },
          {
            "name": "Mercado Municipal D. Pedro V",
            "type": "Traditional Market",
            "description": "Vibrant city market where locals shop for fresh produce, fish, meat, and regional products, maintaining traditional commercial practices.",
            "appeal": "Immerse yourself in local daily life and find authentic Portuguese products and food."
          }
        ],
        "dining": [
          {
            "name": "Traditional Tascas & Restaurants",
            "cuisine": "Portuguese Regional",
            "price_range": "€-€€",
            "known_for": "Authentic local dishes, often in simple environments",
            "atmosphere": "Unpretentious eateries frequented by locals and students, particularly along Rua de Azeiteiras."
          },
          {
            "name": "Historic Pastelarias",
            "cuisine": "Portuguese Pastries & Coffee",
            "price_range": "€",
            "known_for": "Traditional pastries like Pastéis de Santa Clara and regional specialties",
            "atmosphere": "Classic bakery-cafés, some dating back generations, perfect for breakfast or afternoon coffee."
          }
        ],
        "activities": [
          {
            "name": "Shopping Spree",
            "type": "Retail Therapy",
            "description": "Explore the shops along Rua Ferreira Borges and surrounding streets, from traditional Portuguese products to fashion and handicrafts.",
            "suitable_for": [
              "Shoppers",
              "Souvenir hunters"
            ]
          },
          {
            "name": "Market Visit",
            "type": "Cultural Experience",
            "description": "Wander through the Municipal Market to see, smell, and taste local products while watching everyday life unfold.",
            "suitable_for": [
              "Foodies",
              "Photographers",
              "Cultural enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be in the heart of Coimbra's commercial and social life",
        "You enjoy bustling city atmospheres with easy access to shops and restaurants",
        "You appreciate authentic local experiences over tourist-centered activities"
      ],
      "avoid_if": [
        "You're seeking absolute tranquility (it can be noisy, especially during student events)",
        "You require convenient parking (limited options and typically paid)",
        "You prefer modern, spacious accommodations (many buildings are historic and compact)"
      ],
      "insider_tips": [
        "Visit the Mercado Municipal in the morning for the freshest products and most authentic atmosphere.",
        "Many shops close for lunch (typically 1-3 PM); plan shopping accordingly.",
        "Look for the small, family-run restaurants on side streets for authentic regional cuisine at reasonable prices."
      ]
    },
    {
      "name": "Santa Clara",
      "alternate_names": [
        "South Bank",
        "Across the River"
      ],
      "character": "Historic area across the Mondego River from central Coimbra, offering a mix of important historic monuments, green spaces, and residential areas with spectacular views of Coimbra's skyline.",
      "location": {
        "central": false,
        "description": "Located on the southern bank of the Mondego River, connected to central Coimbra by several bridges including the Santa Clara Bridge and the Pedro e Inês pedestrian bridge.",
        "borders": [
          "Mondego River",
          "São Martinho do Bispo",
          "Rural areas to the south"
        ],
        "landmarks": [
          "Mosteiro de Santa Clara-a-Velha (Old Monastery)",
          "Mosteiro de Santa Clara-a-Nova (New Monastery)",
          "Portugal dos Pequenitos",
          "Quinta das Lágrimas",
          "Ponte Pedro e Inês (Pedestrian Bridge)",
          "Parque Verde do Mondego (Green Park)"
        ]
      },
      "history": {
        "overview": "Area historically associated with the Poor Clare nuns and Queen Isabel of Portugal (later canonized as Saint Elizabeth). The original monastery (Santa Clara-a-Velha) was abandoned due to frequent flooding, leading to the construction of Santa Clara-a-Nova on higher ground in the 17th century.",
        "significance": "Important religious center tied to one of Portugal's most beloved royal figures, Queen Saint Isabel.",
        "notable_events": [
          "Construction of Santa Clara-a-Velha Monastery (14th century)",
          "Abandonment due to flooding and construction of Santa Clara-a-Nova (17th century)",
          "Creation of Portugal dos Pequenitos theme park (1940)",
          "Recent archaeological excavation and restoration of the flooded monastery"
        ]
      },
      "practical_info": {
        "transit": [
          "Connected to central Coimbra by bus routes",
          "Pedestrian access via bridges",
          "Easier car access and parking than central Coimbra",
          "Bicycle-friendly areas along the river"
        ],
        "safety": "Generally very safe, though be cautious in isolated areas after dark.",
        "best_time_to_visit": "Daytime for monument visits, late afternoon for riverside walks with views of Coimbra's skyline.",
        "walkability": "Walkable near the river and monuments, but more spread out than central Coimbra with some hills."
      },
      "appeal": {
        "known_for": [
          "Historic monasteries",
          "Portugal dos Pequenitos theme park",
          "Quinta das Lágrimas estate",
          "Riverside parks and views"
        ],
        "atmosphere": [
          "Relaxed",
          "Historical",
          "Family-friendly",
          "Scenic"
        ],
        "best_for": [
          "History enthusiasts",
          "Families with children",
          "Those seeking quieter accommodation",
          "Photography enthusiasts"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 4,
        "green_spaces": 5,
        "shopping": 2,
        "dining": 3,
        "nightlife": 2,
        "cultural": 4,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Mosteiro de Santa Clara-a-Velha",
            "type": "Archaeological Site/Museum",
            "description": "Restored ruins of a 14th-century Gothic monastery that was abandoned due to flooding, now featuring glass walkways that allow visitors to explore the original medieval floor level and a modern museum.",
            "appeal": "Experience the atmospherically preserved ruins that tell the story of the nuns' battle against the rising waters of the Mondego River."
          },
          {
            "name": "Portugal dos Pequenitos",
            "type": "Theme Park/Educational Attraction",
            "description": "Unique miniature park created in 1940 featuring small-scale reproductions of Portuguese monuments, regional houses, and buildings from former Portuguese colonies, sized for children to enter.",
            "appeal": "Perfect family attraction combining education with fun as children and adults can explore Portugal in miniature."
          },
          {
            "name": "Quinta das Lágrimas",
            "type": "Historic Estate/Gardens",
            "description": "Historic estate associated with the tragic love story of Pedro and Inês, featuring gardens, fountains (including the legendary Fonte dos Amores), and now housing a luxury hotel.",
            "appeal": "Wander through gardens steeped in Portugal's most famous love story and enjoy the peaceful atmosphere away from the city center."
          }
        ],
        "dining": [
          {
            "name": "Riverside Restaurants",
            "cuisine": "Portuguese & International",
            "price_range": "€€-€€€",
            "known_for": "Views of Coimbra across the river, outdoor dining in pleasant weather",
            "atmosphere": "Relaxed venues perfect for leisurely meals with scenic views."
          }
        ],
        "activities": [
          {
            "name": "Parque Verde do Mondego",
            "type": "Recreation/Leisure",
            "description": "Expansive green park along the riverbank with walking and cycling paths, children's playground, and recreational areas.",
            "suitable_for": [
              "Families",
              "Outdoor enthusiasts",
              "Cyclists and joggers"
            ]
          },
          {
            "name": "Pedro e Inês Bridge Walk",
            "type": "Scenic Walk/Photography",
            "description": "Stroll across the award-winning pedestrian bridge with its unique asymmetrical design and central platform offering excellent views of both riverbanks.",
            "suitable_for": [
              "Everyone",
              "Photographers",
              "Architecture enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You prefer a quieter area with easy access to the city center",
        "You're traveling with family and want space and family-friendly attractions",
        "You appreciate scenic views and green spaces"
      ],
      "avoid_if": [
        "You want to be right in the historic center without crossing the river",
        "You're seeking vibrant nightlife at your doorstep",
        "You don't enjoy walking or using public transportation to reach the main attractions"
      ],
      "insider_tips": [
        "The Portugal dos Pequenitos is most enjoyable early in the day before tour groups arrive.",
        "Walk across the Pedro e Inês Bridge at sunset for spectacular photos of Coimbra's skyline.",
        "Quinta das Lágrimas gardens can be visited even if you're not staying at the hotel; check opening hours."
      ]
    },
    {
      "name": "Solum",
      "alternate_names": [
        "Eastern Coimbra",
        "Modern Coimbra"
      ],
      "character": "Modern residential and commercial district east of the historic center, known for its wide avenues, shopping centers, sports facilities, and contemporary apartment buildings. Considered one of Coimbra's most desirable residential areas.",
      "location": {
        "central": false,
        "description": "Located east of the historic center in a flatter area of the city, developed primarily in the late 20th century.",
        "borders": [
          "Baixa (to the west)",
          "Celas",
          "Santo António dos Olivais"
        ],
        "landmarks": [
          "Estádio Cidade de Coimbra (Municipal Stadium)",
          "Dolce Vita Shopping Center",
          "Municipal Swimming Pools",
          "Norton de Matos Sports Complex"
        ]
      },
      "history": {
        "overview": "Developed primarily in the latter half of the 20th century as Coimbra expanded eastward, creating a modern counterpoint to the historic center.",
        "significance": "Represents Coimbra's modern evolution and growth beyond its historic core.",
        "notable_events": [
          "Major urban development from the 1970s-1990s",
          "Construction of the municipal stadium (renovated for Euro 2004)",
          "Development of commercial centers and residential complexes"
        ]
      },
      "practical_info": {
        "transit": [
          "Well-connected by city bus routes",
          "Better car access and parking than historic areas",
          "Main avenues connect to highways and other parts of the city",
          "20-30 minute walk to the historic center"
        ],
        "safety": "Very safe residential area with good lighting and wide streets.",
        "best_time_to_visit": "Daytime for shopping and sports facilities, evenings for dining and local socializing.",
        "walkability": "Easily walkable with wide sidewalks and gentler terrain than the historic center."
      },
      "appeal": {
        "known_for": [
          "Modern amenities and shopping",
          "Sports facilities",
          "Residential comfort",
          "Less touristy atmosphere"
        ],
        "atmosphere": [
          "Contemporary",
          "Residential",
          "Comfortable",
          "Commercial"
        ],
        "best_for": [
          "Families",
          "Those seeking modern accommodations",
          "Shopping enthusiasts",
          "Sports fans"
        ]
      },
      "categories": {
        "touristy": 1,
        "residential": 5,
        "green_spaces": 3,
        "shopping": 5,
        "dining": 4,
        "nightlife": 2,
        "cultural": 2,
        "historic": 1
      },
      "highlights": {
        "attractions": [
          {
            "name": "Estádio Cidade de Coimbra",
            "type": "Sports Venue",
            "description": "Modern 30,000-capacity stadium that hosts Académica de Coimbra football matches and occasional major events including concerts by international artists.",
            "appeal": "Experience Portuguese football culture or attend events in Coimbra's largest venue."
          },
          {
            "name": "Shopping Centers",
            "type": "Retail",
            "description": "Modern malls including Dolce Vita and Alma Shopping featuring international and Portuguese brands, cinemas, food courts, and supermarkets.",
            "appeal": "Enjoy contemporary shopping and entertainment options in climate-controlled comfort."
          }
        ],
        "dining": [
          {
            "name": "Modern Restaurants & Cafés",
            "cuisine": "Portuguese & International",
            "price_range": "€€",
            "known_for": "Contemporary dining options ranging from casual to upscale",
            "atmosphere": "Modern establishments catering to local residents, families, and professionals."
          }
        ],
        "activities": [
          {
            "name": "Sports Activities",
            "type": "Recreation",
            "description": "Use public sports facilities including swimming pools, tennis courts, and sports fields, or attend sporting events at the stadium.",
            "suitable_for": [
              "Sports enthusiasts",
              "Families",
              "Active travelers"
            ]
          },
          {
            "name": "Shopping Experience",
            "type": "Retail Therapy",
            "description": "Explore modern shopping centers with international brands, entertainment options, and dining.",
            "suitable_for": [
              "Shoppers",
              "Families",
              "Those seeking air-conditioned comfort"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You prefer modern accommodations with contemporary amenities",
        "You're traveling with family and want convenient facilities",
        "You value easy access to shopping, dining, and transportation"
      ],
      "avoid_if": [
        "You primarily want to experience historic Coimbra",
        "You're seeking traditional Portuguese charm and architecture",
        "You want to be within walking distance of the main tourist attractions"
      ],
      "insider_tips": [
        "The bus system makes it easy to reach the historic center while staying in this more comfortable residential area.",
        "Shopping centers offer extended hours and air conditioning, making them good options on very hot or rainy days.",
        "Check the Académica football schedule for a chance to experience local sports culture."
      ]
    },
    {
      "name": "Celas",
      "alternate_names": [
        "University Hospital Area"
      ],
      "character": "Mixed-use district blending university facilities (particularly medical), residential areas, and historic elements. Known for student life, the Jardim da Sereia park, and being home to the Faculty of Medicine.",
      "location": {
        "central": false,
        "description": "Located northeast of the historic center, between the university area and the more modern eastern districts.",
        "borders": [
          "Alta",
          "Solum",
          "Santo António dos Olivais"
        ],
        "landmarks": [
          "Coimbra University Hospital",
          "Faculty of Medicine",
          "Jardim da Sereia (Mermaid's Garden)",
          "Mosteiro de Celas (remnants)"
        ]
      },
      "history": {
        "overview": "Named after the Monastery of Celas founded in the 13th century, the area developed significantly with the expansion of the university's medical facilities in the 20th century.",
        "significance": "Represents the intersection of Coimbra's academic tradition with modern medical education and healthcare.",
        "notable_events": [
          "Foundation of the Mosteiro de Celas (13th century)",
          "Development of university medical facilities",
          "Creation of the Jardim da Sereia (public park)"
        ]
      },
      "practical_info": {
        "transit": [
          "Well-served by city bus routes",
          "Moderate walking distance to the historic center (15-20 minutes)",
          "Better parking options than the historic center",
          "Hilly in parts"
        ],
        "safety": "Generally safe, though be aware of typical urban concerns especially at night in less populated areas.",
        "best_time_to_visit": "Daytime for the park, evenings for student-oriented social life during term time.",
        "walkability": "Moderately walkable, though some areas have steep inclines."
      },
      "appeal": {
        "known_for": [
          "Student life",
          "Medical facilities",
          "Jardim da Sereia park",
          "Mix of traditional and modern"
        ],
        "atmosphere": [
          "Academic",
          "Youthful",
          "Mixed-use",
          "Dynamic"
        ],
        "best_for": [
          "Students",
          "Medical professionals",
          "Young travelers",
          "Those seeking authentic local life"
        ]
      },
      "categories": {
        "touristy": 2,
        "residential": 4,
        "green_spaces": 4,
        "shopping": 3,
        "dining": 4,
        "nightlife": 4,
        "cultural": 3,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Jardim da Sereia (Mermaid's Garden)",
            "type": "Public Park/Historic Garden",
            "description": "Beautiful public park featuring Baroque fountains, stone staircases, and terraces dating to the 18th century, popular with students and local families.",
            "appeal": "Enjoy a peaceful retreat with historic charm in one of Coimbra's most loved green spaces."
          },
          {
            "name": "University Medical Campus",
            "type": "Academic Institution",
            "description": "Modern facilities housing the Faculty of Medicine and associated healthcare institutions that continue Coimbra's long tradition of medical education.",
            "appeal": "Glimpse Coimbra's contemporary academic life beyond the historic university center."
          }
        ],
        "dining": [
          {
            "name": "Student-Friendly Restaurants",
            "cuisine": "Portuguese & International",
            "price_range": "€-€€",
            "known_for": "Good value meals, casual atmosphere, popular with students and faculty",
            "atmosphere": "Lively, youthful eateries ranging from traditional tascas to contemporary cafés."
          }
        ],
        "activities": [
          {
            "name": "Park Relaxation",
            "type": "Leisure",
            "description": "Spend time in Jardim da Sereia, enjoying the historic features, picnicking, or people-watching.",
            "suitable_for": [
              "Everyone",
              "Families",
              "Nature lovers"
            ]
          },
          {
            "name": "Student Nightlife",
            "type": "Entertainment",
            "description": "Experience Coimbra's student-oriented bars and eateries, particularly lively during university term times.",
            "suitable_for": [
              "Young travelers",
              "Night owls",
              "Budget travelers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to experience authentic student life in Coimbra",
        "You're connected to the medical community or visiting the hospital",
        "You seek a balance between accessibility to historic areas and modern conveniences"
      ],
      "avoid_if": [
        "You seek quiet evenings (parts can be noisy during term time)",
        "You want primarily tourist-oriented accommodations and facilities",
        "You prefer flat terrain for walking"
      ],
      "insider_tips": [
        "Visit Jardim da Sereia early in the morning for the most peaceful experience.",
        "The area has excellent affordable eateries catering to medical students and staff.",
        "Parts of Celas transform dramatically during term time versus university holidays."
      ]
    }
  ],
  "activityTypes": {
    "spring": [
      "Exploring the historic Alta and Baixa districts in pleasant weather",
      "Visiting the Botanical Garden during spring blooms",
      "Boat trips on the Mondego River",
      "Attending cultural events at the university",
      "Day trips to nearby Conimbriga Roman ruins",
      "Experiencing the Queima das Fitas festival (late May)"
    ],
    "summer": [
      "Relaxing in riverside parks like Parque Verde do Mondego",
      "Attending the Coimbra International Jazz Festival (June)",
      "Day trips to the beaches at Figueira da Foz (40km away)",
      "Exploring the Portugal dos Pequenitos park",
      "Evening dining with views from Santa Clara",
      "Hiking in the nearby Serra da Lousã mountains"
    ],
    "autumn": [
      "Witnessing the start of the academic year and Festa das Latas student celebrations",
      "Exploring museums like Machado de Castro National Museum",
      "Wine tasting featuring the nearby Bairrada region's wines",
      "Hiking in the Buçaco Forest with autumn colors",
      "Attending Coimbra fado performances in historic venues",
      "Day trips to medieval villages in central Portugal"
    ],
    "winter": [
      "Exploring the University of Coimbra without summer crowds",
      "Cafe culture at historic establishments like Café Santa Cruz",
      "Shopping in both traditional shops and modern malls",
      "Enjoying hearty Portuguese cuisine like Chanfana (goat stew)",
      "Museum visits protected from occasional rain",
      "Attending classical music performances at Convento São Francisco"
    ]
  }
}