{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Dia de Ano Novo)",
          "notes": "New Year's Day is a public holiday throughout Portugal. Most attractions, shops, and restaurants in Coimbra are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. University areas are particularly subdued as students are away on winter break."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is winter in Coimbra with cooler temperatures and increased rainfall. This is low season for tourism, so you'll find fewer crowds at major attractions like the University of Coimbra and Biblioteca Joanina. While cooler, daytime temperatures often reach 15°C (59°F). It's an excellent time to explore the city's indoor cultural attractions such as the Machado de Castro National Museum. Winter sales begin in shops throughout Coimbra, particularly in the downtown commercial areas."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 5,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 3,
          "notes": "February continues with winter conditions but often features some clear, crisp days. Academic activities resume as university students return from winter break, breathing life back into the historic University quarter. Tourism remains low, making it an excellent time to explore Coimbra's museums and cultural attractions without crowds."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "special": true,
          "event": "Carnival (Carnaval)",
          "notes": "The days leading up to Carnival Tuesday feature various festivities around Coimbra. While not as elaborate as celebrations in other Portuguese cities, Coimbra still enjoys parades, parties, and events primarily organized by student groups. University areas become particularly lively during this period with special themed events and parties."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 6,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and occasional rainfall. This shoulder season is ideal for experiencing authentic university life as academic activities are in full swing. It's an excellent time to explore both the historic University area and venture to places like Conimbriga Roman Ruins with fewer tourists present."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Easter Preparations & Spring Equinox",
          "notes": "Late March may include Easter preparations (if Easter falls in March/early April). The weather becomes increasingly pleasant with signs of spring visible throughout the Botanical Garden and in parks around the city. If Easter falls in March, expect religious processions and special events centered around the Sé Velha (Old Cathedral) and Sé Nova (New Cathedral)."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 8,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 5,
          "special": true,
          "event": "Holy Week & Easter (Semana Santa & Páscoa)",
          "notes": "If Easter falls in April, Coimbra observes Holy Week with solemn processions and religious ceremonies at the city's main churches. The city comes alive with spring colors, and the Botanical Garden is particularly beautiful. April also hosts the International Festival of Fado in Coimbra, showcasing the unique male-performed Coimbra style of this traditional Portuguese music at venues throughout the historic center."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Freedom Day (Dia da Liberdade)",
          "notes": "April 25th is a national holiday commemorating the 1974 Carnation Revolution that ended the dictatorship. Celebrations and events take place throughout Coimbra, with particular emphasis at the University where student activism was historically important. Museums and cultural institutions often feature special exhibitions related to Portuguese democracy and freedom."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Late April brings reliable spring weather to Coimbra. The city's historic areas and riverside promenades become increasingly active with students and locals enjoying outdoor spaces. University activities are in full swing before the end-of-year exam period begins, creating an authentic academic atmosphere. Boat trips on the Mondego River resume regular schedules, offering pleasant views of the city."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 9,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Dia do Trabalhador)",
          "notes": "May Day is a national holiday in Portugal. Many businesses are closed, but most tourist attractions remain open. Traditional labor celebrations and gatherings take place in major squares, particularly around the city center and riverside areas."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "notes": "May brings delightful weather with longer days and temperatures reaching 22°C (72°F). Tourism begins to increase but the city isn't yet at peak season crowds. This is the perfect time to explore both the historic university areas and outdoor attractions like the Botanical Garden at their spring best. Local cafes and restaurants extend their hours, and outdoor dining becomes popular along Coimbra's picturesque streets."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Queima das Fitas (Burning of the Ribbons)",
          "notes": "Late May hosts Coimbra's most famous festival, the Queima das Fitas, marking the end of the academic year. This massive week-long celebration includes the traditional Serenata Monumental (nighttime fado serenade at the Old Cathedral), parades with students in academic dress, concerts at Praça da Canção, sporting events, and the symbolic burning of faculty ribbons. The city transforms with thousands of students and visitors participating in this uniquely Coimbran tradition dating back to the 19th century."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 11,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 5,
          "special": true,
          "event": "Portugal Day Preparations",
          "notes": "Early June brings warm summer weather to Coimbra. The academic year concludes, and the city transitions into summer mode with outdoor cafes and riverside activities becoming increasingly popular. Cultural events and exhibitions increase as the summer tourist season begins."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "Portugal Day & International Jazz Festival",
          "notes": "June 10th is Portugal Day (Dia de Portugal), a national holiday celebrating Portugal's cultural heritage with events throughout the city. Mid-June brings the International Jazz Festival to Coimbra, with performances by renowned musicians at venues throughout the historic center and Mondego riverfront. The summer solstice is marked by cultural events taking advantage of the extended daylight hours."
        },
        {
          "days": [23, 24],
          "score": 4,
          "special": true,
          "event": "São João Festival (Festas de São João)",
          "notes": "The night of June 23-24 celebrates the Feast of St. John, though on a smaller scale than in Porto. Local neighborhoods host traditional celebrations with grilled sardines, music, and folk traditions. Small community gatherings with traditional food and music occur throughout the city."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late June brings full summer conditions with warm temperatures around 26°C (79°F). With most students departed for summer break, the city takes on a more tourist-oriented atmosphere. Cultural events continue with outdoor cinema, concerts, and performances at venues like Convento São Francisco. The Mondego riverfront becomes particularly active with recreational activities."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 14,
      "tourismLevel": 6
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Coimbra Arts Festival & Summer Cultural Program",
          "notes": "July brings high summer with temperatures reaching 29°C (84°F) but moderated by Atlantic influences. Tourism increases significantly as European summer holidays begin. The Coimbra Arts Festival features exhibitions, performances, and cultural events throughout the month. The Praça do Comércio hosts artisanal markets and gastronomic events showcasing regional products. With minimal rainfall (typically just 12mm all month), outdoor activities dominate, including concerts in the Mondego Park and riverside areas. Day trips to nearby beaches like Figueira da Foz become popular among visitors staying in Coimbra."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 16,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Summer Festivals & Assumption Day (Assunção de Nossa Senhora)",
          "notes": "August 15th is a national holiday celebrating the Assumption of Mary, with religious ceremonies at the Sé Nova and other churches. Peak tourist season continues with the warmest temperatures of the year, typically around 29°C (84°F). The city hosts various cultural events, outdoor concerts, and film screenings at venues throughout the historic center. With the student population largely absent, the city caters more to tourists and summer visitors."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Late August maintains high summer conditions with the warmest water temperatures at nearby beaches. Cultural events continue throughout the city, though at a slightly reduced pace as the month progresses. The historic university areas remain popular for tourists, while locals often take their own holidays during this month. Late August sometimes sees early preparations for the return of university students in September."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 16,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "notes": "Early September brings pleasant late summer weather with temperatures averaging 27°C (81°F). Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather but fewer crowds. The University of Coimbra begins preparations for the new academic year, bringing renewed energy to the historic center."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Festa das Latas Preparations",
          "notes": "Late September sees preparations for the Festa das Latas (Festival of Cans), a major student event marking the beginning of the academic year. New students begin arriving in the city, creating an atmosphere of anticipation. The historic university area becomes increasingly active as academic facilities prepare for the new year."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 15,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4],
          "score": 5,
          "special": true,
          "event": "Republic Day (Implantação da República)",
          "notes": "October 5th is a national holiday commemorating the establishment of the Portuguese Republic in 1910. Official ceremonies take place at municipal buildings, while many museums and cultural sites remain open with holiday schedules. Early October sees the continuation of pleasant early autumn weather."
        },
        {
          "days": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Festa das Latas (Latada)",
          "notes": "October hosts the famous Festa das Latas (Festival of Cans), the traditional initiation of new university students. This week-long festival includes the Latada parade where first-year students dressed in costumes trail cans through the streets, culminating in a ritual 'baptism' in the Mondego River. The celebration includes concerts, cultural activities, and sporting events. October is also the wettest month in Coimbra with rainfall averaging 124mm, though temperatures remain pleasant at around 22°C (72°F). The university areas are particularly lively as the academic year gets into full swing."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 12,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "All Saints' Day (Dia de Todos os Santos)",
          "notes": "November 1st is a national holiday when Portuguese families traditionally visit cemeteries to honor deceased relatives. Many businesses may be closed, but tourist attractions typically remain open. Traditional sweets associated with this time begin appearing in local bakeries and cafes."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "November brings autumn weather with cooler temperatures around 17-20°C (63-68°F) and increased rainfall. This is low season for tourism, though university activities continue in full force, providing an authentic experience of Coimbra's academic character. Excellent time for museum visits including the Machado de Castro National Museum and indoor cultural activities. Traditional restaurants with hearty Portuguese dishes offer cozy retreats from occasional wet weather. Late November sees the beginning of Christmas preparations with decorations appearing throughout the city center."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 9,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "special": true,
          "event": "Constitution Day & Immaculate Conception (Dia da Constituição & Imaculada Conceição)",
          "notes": "December 1st (Constitution Day) and December 8th (Immaculate Conception) are public holidays in Portugal. The December 8th holiday traditionally marks the beginning of the Christmas season, when decorations and preparations intensify. The Coimbra Christmas Market opens in the city center, featuring traditional crafts, seasonal foods, and cultural performances."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Coimbra Christmas Celebrations",
          "notes": "Throughout December, Coimbra hosts Christmas markets and festivities in the historic center. The city is beautifully decorated with Christmas lights, particularly around Praça do Comércio and main shopping areas. The University area hosts special Christmas concerts and events at venues like the Sé Nova and Convento São Francisco. Student caroling groups perform traditional songs throughout the historic center, creating a uniquely academic Christmas atmosphere."
        },
        {
          "days": [24, 25],
          "score": 3,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Véspera de Natal & Natal)",
          "notes": "Christmas Eve is the main celebration day for most Portuguese families. Most businesses close by early afternoon, and the Christmas Market concludes. Churches hold special Midnight Mass services, particularly at the Sé Nova and Sé Velha. Restaurants that remain open often offer special Christmas Eve dinners focusing on traditional bacalhau (salt cod) dishes, but advance reservations are essential."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year is relatively quiet in Coimbra, as many students have returned to their hometowns. Major tourist attractions remain open but with reduced hours. Winter sales begin in many shops, offering good shopping opportunities. Indoor cultural activities provide welcome entertainment during the cooler, wetter weather."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "New Year's Eve (Véspera de Ano Novo)",
          "notes": "New Year's Eve celebrations center around the historic downtown and Mondego riverside with midnight countdowns and fireworks. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. The Mondego riverfront provides a spectacular backdrop for fireworks displays, with many people gathering along the water for the celebrations."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 7,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the University of Coimbra and Biblioteca Joanina",
      "Attending the International Festival of Fado (April)",
      "Botanical Garden visits during peak flowering season",
      "Queima das Fitas celebrations (late May)",
      "Walking tours of the historic Alta and Baixa districts",
      "Mondego riverside strolls and picnics",
      "Day trips to Conimbriga Roman Ruins",
      "Portugal dos Pequenitos family attraction",
      "Birdwatching along the Mondego River valley"
    ],
    "summer": [
      "Coimbra International Jazz Festival (June)",
      "Outdoor concerts at Praça da Canção",
      "Evening Fado performances in historic venues",
      "Day trips to Figueira da Foz beaches (1 hour away)",
      "Boat trips on the Mondego River",
      "Coimbra Arts Festival exhibitions and performances",
      "Exploring the refreshing shade of the Botanical Garden",
      "Evening dining in the historic center",
      "Hiking in the nearby Serra da Lousã"
    ],
    "autumn": [
      "Festa das Latas student celebrations (October)",
      "Wine tasting featuring local Bairrada region wines",
      "Museum visits including Machado de Castro National Museum",
      "University of Coimbra events and academic traditions",
      "Photography walks in the historic Alta district",
      "Seasonal gastronomy featuring game and mushroom dishes",
      "Day trips to Buçaco Forest for autumn colors",
      "Rainy day café culture in historic establishments",
      "Cultural performances at Convento São Francisco"
    ],
    "winter": [
      "Coimbra Christmas Market (December-January)",
      "Christmas lights throughout the historic center",
      "New Year's Eve celebration along the Mondego River",
      "Winter shopping in the Baixa district and shopping centers",
      "Machado de Castro Museum and indoor cultural attractions",
      "Traditional winter cuisine in historic restaurants",
      "Café culture centered around traditional pastries",
      "Fado performances in intimate venues",
      "Cathedral tours and religious architecture exploration"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or mild, occasionally wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}