{
    "Spring": {
        "activities": [
            {
                "name": "Queima das Fitas (Burning of the Ribbons)",
                "type": "Cultural Festival/Student Tradition",
                "description": "Coimbra's most famous and iconic festival marking the end of the academic year with a week of celebrations including parades, concerts, traditional fado serenades, and the symbolic burning of faculty ribbons. Dating back to the 19th century, this massive student celebration transforms the entire city.",
                "indoor": false,
                "best_time": "Evening/Night",
                "price_range": "Free (Some events)/Moderate (Concerts)",
                "seasonal_notes": "Typically held in late May (May 24-June 1), this weeklong celebration is Coimbra's biggest annual festival and draws visitors from across Portugal.",
                "booking_tips": "Book accommodation months in advance as the city fills with visitors. Concert tickets at Praça da Canção venue should be purchased early. The Serenata Monumental at the Old Cathedral steps is free but extremely crowded - arrive hours early for a good spot."
            },
            {
                "name": "International Festival of Fado in Coimbra",
                "type": "Cultural Festival/Music",
                "description": "Unique celebration of Coimbra's distinctive male-performed fado tradition, featuring performances by renowned fadistas at historic venues throughout the city. Unlike Lisbon fado, Coimbra fado is connected to academic traditions and often features literary lyrics.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate (Per concert/Pass)",
                "seasonal_notes": "Held in April, this festival showcases Coimbra's unique contribution to Portugal's most famous musical tradition in atmospheric historic venues.",
                "booking_tips": "Purchase tickets for specific performances in advance through the festival website as popular concerts in venues like the University Chapel sell out quickly."
            },
            {
                "name": "Botanical Garden Spring Tour",
                "type": "Nature/Leisure",
                "description": "Explore one of Europe's most significant historical botanical gardens during peak spring bloom. Established in 1772, the 13-hectare garden features exotic collections including a bamboo forest, tropical greenhouse, and centuries-old trees arranged across formal and naturalistic landscapes.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings spectacular blooming displays of azaleas, camellias, and rhododendrons throughout the garden's terraced landscapes.",
                "booking_tips": "No booking required. Free guided tours may be available in English through the University - check at the garden entrance. The tropical greenhouse requires a small additional fee."
            },
            {
                "name": "Holy Week Processions (Semana Santa)",
                "type": "Religious/Cultural Event",
                "description": "Traditional religious processions through Coimbra's historic streets during Easter week, particularly around the Old and New Cathedrals. These solemn yet beautiful ceremonies represent centuries of Portuguese Catholic tradition.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Week before Easter (dates vary), offering a glimpse into Portugal's rich religious heritage in one of its most historic cities.",
                "booking_tips": "No booking required. Be respectful during the processions. The areas around both Cathedrals offer good viewing locations. Arrive early to secure a place at major processions."
            },
            {
                "name": "University of Coimbra UNESCO Heritage Tour",
                "type": "Cultural/Historical",
                "description": "Comprehensive guided tour of Portugal's oldest university (established 1290) and UNESCO World Heritage site, including the stunning Baroque Joanina Library, ornate São Miguel Chapel, historic examination rooms, and the ceremonial Great Hall of Acts.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers perfect temperatures for exploring the hilltop university complex with fewer crowds than summer months.",
                "booking_tips": "Purchase tickets in advance through the University's official tourism circuit. Morning visits are recommended as the Joanina Library has strictly limited visitor numbers per hour. Some areas may be closed during graduation season around Queima das Fitas."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Coimbra International Jazz Festival",
                "type": "Cultural Festival/Music",
                "description": "Weekend of world-class jazz performances featuring international and Portuguese musicians at venues throughout the city, from formal concert halls to outdoor stages along the Mondego riverfront.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate (Some free events)",
                "seasonal_notes": "Held in June, the festival transforms Coimbra into a jazz lover's paradise with performances in both ticketed venues and free public concerts.",
                "booking_tips": "Check the festival program online and purchase tickets for headline acts in advance. Free outdoor performances often take place at the Mondego riverfront area."
            },
            {
                "name": "Mondego River Cruises",
                "type": "Leisure/Sightseeing",
                "description": "Relaxing boat trips along the Mondego River offering unique perspectives of Coimbra's historic skyline dominated by the university buildings, with options ranging from traditional wooden boats to modern cruise vessels.",
                "indoor": false,
                "best_time": "Late Afternoon/Sunset",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions with warm temperatures and extended daylight hours perfect for evening cruises with spectacular sunset views.",
                "booking_tips": "Book through operators at the riverfront quay or online. Sunset cruises are particularly popular and may sell out during peak season. Some cruises include food and drinks or fado performances."
            },
            {
                "name": "Figueira da Foz Beach Day Trip",
                "type": "Beach/Leisure",
                "description": "Day excursion to Portugal's widest beach at Figueira da Foz, just 40km from Coimbra. This expansive Atlantic beach resort offers golden sands, casino entertainment, and excellent seafood restaurants along the promenade.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget (Transportation)",
                "seasonal_notes": "Summer brings perfect beach weather and full seasonal activities at this popular coastal resort.",
                "booking_tips": "Regular train service connects Coimbra to Figueira da Foz in approximately 1 hour. No reservation needed for the beach, but arrive early to secure a good spot on busy weekends. Beach umbrellas and loungers available for rent."
            },
            {
                "name": "Coimbra Arts Festival",
                "type": "Cultural Festival/Multi-disciplinary Arts",
                "description": "Multi-week celebration of arts and culture featuring exhibitions, cinema screenings, theatrical performances, dance shows, and musical events at venues throughout the city, including historic buildings and open-air spaces.",
                "indoor": true,
                "best_time": "Various (Event dependent)",
                "price_range": "Varies (Many free events)",
                "seasonal_notes": "Summer season brings numerous cultural activities to Coimbra, with many performances taking advantage of warm evening temperatures in outdoor venues.",
                "booking_tips": "Check the festival program online for ticketed events that require advance booking. Many exhibitions and some performances are free, creating an accessible cultural program."
            },
            {
                "name": "Serra da Lousã Mountain Excursion",
                "type": "Nature/Cultural",
                "description": "Day trip to the picturesque Serra da Lousã mountain range to explore traditional schist villages, natural swimming pools, hiking trails, and rich biodiversity just 30 minutes from Coimbra.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Budget (Self-guided)/Moderate (Tours)",
                "seasonal_notes": "Summer months offer ideal conditions for mountain exploration with clear trails and refreshing natural pools for swimming.",
                "booking_tips": "Accessible by public transport to Lousã town, then local transport or taxi to the villages. Guided tours from Coimbra provide the most comprehensive experience. Wear appropriate hiking footwear and bring water."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Festa das Latas (Festival of Cans)",
                "type": "Cultural Festival/Student Tradition",
                "description": "Lively student festival marking the beginning of the academic year and the initiation of new students. Features a major parade where first-year students dressed in costumes trail cans through the streets, culminating in a ritualistic 'baptism' in the Mondego River.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Free (Public events)/Moderate (Concerts)",
                "seasonal_notes": "Held in October, this week-long festival includes concerts, sporting events, and cultural activities organized by the Academic Association of Coimbra.",
                "booking_tips": "The street parade is free to watch and creates a vibrant atmosphere throughout the city. Concert tickets should be purchased in advance. University areas become particularly lively during this period."
            },
            {
                "name": "Bairrada Wine Region Tour",
                "type": "Food & Wine/Cultural Experience",
                "description": "Excursion to the nearby Bairrada wine region famous for sparkling wines and the traditional suckling pig dish 'Leitão à Bairrada'. Visit wineries, taste regional specialties, and explore the picturesque countryside.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is harvest season in Portuguese vineyards, offering a chance to see wine production in action and enjoy seasonal food pairings.",
                "booking_tips": "Book organized tours that include transportation, as driving between wineries requires a car. Some tour operators offer combined wine and gastronomy experiences focusing on Bairrada's unique culinary traditions."
            },
            {
                "name": "Machado de Castro National Museum Experience",
                "type": "Cultural/Historical",
                "description": "Explore one of Portugal's most important museums housed in the former Bishop's Palace above the ancient Roman forum of Aeminium (Roman Coimbra). The museum features exceptional sculpture collections and remarkable Roman cryptoporticus dating to the 1st century.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is ideal for indoor cultural activities with fewer tourists than summer months, allowing more time to appreciate the extensive collections.",
                "booking_tips": "No advance booking required. Consider the combined ticket if visiting other city museums. Audio guides enhance the experience and provide context for the Roman cryptoporticus beneath the museum."
            },
            {
                "name": "Buçaco Forest Natural Park Hike",
                "type": "Nature/Historical",
                "description": "Explore the magnificent Buçaco Forest with its 700+ tree species, historic Buçaco Palace Hotel (now a luxury hotel), sacred paths, and important battle site from the Peninsular War, all just 30km from Coimbra.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (Self-guided)/Budget (Transportation)",
                "seasonal_notes": "Autumn brings stunning foliage colors to this ancient forest, creating a magical atmosphere along its historic trails and gardens.",
                "booking_tips": "Accessible by car or organized tour from Coimbra. Free trails are well-marked for self-guided exploration. Consider dining at the Palace Hotel restaurant for a special experience even if not staying there."
            },
            {
                "name": "Traditional Coimbra Fado Performance",
                "type": "Cultural Experience/Music",
                "description": "Experience the unique tradition of Coimbra Fado, performed exclusively by male students in their traditional black capes and accompanied by the distinctive Portuguese guitar, in an authentic venue like Fado ao Centro.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn evenings with their earlier sunset create the perfect atmosphere for the melancholic yet beautiful tradition of Coimbra fado in intimate venues.",
                "booking_tips": "Reserve tickets in advance for established venues like Fado ao Centro or À Capella. Some performances include explanations of the tradition's history and the unique characteristics of Coimbra fado."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Coimbra Christmas Market",
                "type": "Market/Festival",
                "description": "Festive market featuring local crafts, seasonal food and drinks, and holiday decorations, transforming the city center with Christmas lights and creating a warm holiday atmosphere in the historic streets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free entrance (Pay for purchases)",
                "seasonal_notes": "Runs throughout December in the historic center, particularly around Praça do Comércio, creating a festive winter atmosphere.",
                "booking_tips": "No booking required. Evening visits offer the most magical experience with illuminated decorations. Special events and performances may take place on weekends."
            },
            {
                "name": "New Year's Eve Celebration",
                "type": "Celebration/Fireworks",
                "description": "Welcome the New Year along the Mondego River with midnight fireworks, live music performances, and festive crowds gathering for the countdown celebration in the heart of the city.",
                "indoor": false,
                "best_time": "Late Evening (Dec 31st)",
                "price_range": "Free (Public areas)/Expensive (Restaurant packages)",
                "seasonal_notes": "Coimbra's mild winter climate makes outdoor New Year celebrations comfortable compared to many European destinations.",
                "booking_tips": "Riverside restaurants offer special dinner packages but book months in advance. For the best firework views, find a spot along the river or on the Pedro e Inês Bridge."
            },
            {
                "name": "Portugal dos Pequenitos",
                "type": "Family Attraction/Cultural Experience",
                "description": "Unique theme park featuring miniature versions of Portuguese architecture and monuments where adults and children can explore kid-sized replicas of Portugal's most famous buildings, traditional houses, and overseas territories.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget",
                "seasonal_notes": "Winter offers a more peaceful experience at this popular attraction, with fewer crowds than during summer peak season.",
                "booking_tips": "No advance booking required. Allow 2-3 hours to fully explore all sections including the miniature monuments and the museums focusing on traditional costumes, furniture, and maritime history."
            },
            {
                "name": "Traditional Portuguese Gastronomy Experience",
                "type": "Food/Cultural",
                "description": "Savor authentic Coimbra and Central Portugal cuisine with warming winter dishes like chanfana (goat stew), various bacalhau (salt cod) preparations, and sweets from Santa Clara convent recipes in traditional restaurants.",
                "indoor": true,
                "best_time": "Lunch/Dinner",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings hearty seasonal specialties to restaurant menus, perfect for cooler days and festive celebrations.",
                "booking_tips": "Traditional restaurants near the university like Zé Manel dos Ossos or A Cozinha da Maria offer authentic local cuisine. Reservations recommended for dinner, especially on weekends. Try the traditional sweet pastry 'Santa Clara Pastries' which originated from the convent."
            },
            {
                "name": "Rainy Day Café Culture Tour",
                "type": "Cultural/Leisure",
                "description": "Experience Coimbra's historic cafés and pastry shops, some dating back centuries, where students, professors, and poets have gathered for intellectual discussion. Savor traditional pastries while observing local life in these atmospheric establishments.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter afternoons are perfect for exploring Coimbra's café culture, with historic establishments offering warm refuge from occasional rain.",
                "booking_tips": "No booking required. Must-visit cafés include Café Santa Cruz (housed in a former chapel), Café Nicola, and Pastelaria Briosa for traditional Portuguese pastries. University areas feature modern student cafés with a more contemporary atmosphere."
            }
        ]
    }
}