{
  "neighborhoods": [
    {
      "name": "Aristotelous Square & Waterfront (Nea Paralia)",
      "alternate_names": [
        "City Center Waterfront",
        "Paralia"
      ],
      "character": "The grand heart of Thessaloniki, centered around the iconic Aristotelous Square which opens onto the expansive Nea Paralia waterfront promenade. Features impressive architecture, numerous cafes, the White Tower, sculptures like Zongolopoulos' 'Umbrellas', and serves as the city's main gathering space.",
      "location": {
        "central": true,
        "description": "Stretching along the Thermaic Gulf from the port area past the White Tower towards the Concert Hall.",
        "borders": [
          "City Center (Tsimiski)",
          "Ladadika (nearby)",
          "White Tower Area"
        ],
        "landmarks": [
          "Aristotelous Square",
          "White Tower",
          "Statue of Alexander the Great",
          "Umbrellas by Zongolopoulos",
          "Nea Paralia Thematic Parks",
          "Electra Palace Hotel (building)",
          "Olympion Cinema (Film Festival hub)"
        ]
      },
      "history": {
        "overview": "Aristotelous Square was redesigned by Ernest Hébrard after the Great Fire of 1917, intended as the monumental civic center. The Nea Paralia waterfront underwent significant redevelopment in the early 21st century, becoming a vast, modern public space.",
        "significance": "The symbolic and social heart of modern Thessaloniki, hosting major events, celebrations, and daily life.",
        "notable_events": [
          "Redesign post-1917 fire",
          "Hosting major political rallies, concerts, festivals (Film Fest, Christmas)",
          "Nea Paralia redevelopment (completed ~2013)"
        ]
      },
      "practical_info": {
        "transit": [
          "Major bus hub around Aristotelous Square and Tsimiski Street",
          "No metro access (under construction)",
          "Ferries depart from the nearby port",
          "Waterfront is highly walkable and cycle-friendly"
        ],
        "safety": "Generally very safe, well-populated day and night. Standard precautions apply.",
        "best_time_to_visit": "Anytime. Buzzing during cafe hours, beautiful for sunset strolls ('volta'), lively during festivals.",
        "walkability": "Excellent. Flat, expansive promenade perfect for walking, running, cycling."
      },
      "appeal": {
        "known_for": [
          "Aristotelous Square architecture",
          "Waterfront promenade ('Nea Paralia')",
          "White Tower",
          "Sea views",
          "Cafes and people-watching",
          "Major events and festivals"
        ],
        "atmosphere": [
          "Grand",
          "Lively",
          "Open",
          "Social",
          "Scenic"
        ],
        "best_for": [
          "Everyone",
          "First-time visitors",
          "Walkers and cyclists",
          "Photographers",
          "Experiencing city life and events"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 2,
        "green_spaces": 4,
        "shopping": 4,
        "dining": 4,
        "nightlife": 3,
        "cultural": 4,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Aristotelous Square",
            "type": "Public Square",
            "description": "Thessaloniki's main square, designed by Ernest Hébrard, surrounded by monumental buildings and opening towards the sea. Features the Olympion cinema.",
            "appeal": "Experience the city's central hub, admire the architecture, enjoy cafes."
          },
          {
            "name": "White Tower",
            "type": "Historic Landmark / Museum",
            "description": "The iconic symbol of Thessaloniki, a 15th-century Ottoman fortification housing a museum about the city's history.",
            "appeal": "Visit the city's emblem, learn about its past, enjoy views from the top."
          },
          {
            "name": "Nea Paralia Promenade",
            "type": "Urban Park / Waterfront",
            "description": "A long, modern waterfront park stretching several kilometers, featuring thematic gardens, sculptures (incl. 'Umbrellas'), bike paths, cafes, and play areas.",
            "appeal": "Enjoy seaside walks, cycling, relaxation, people-watching, and stunning sunsets."
          }
        ],
        "dining": [
          {
            "name": "Waterfront Cafes/Bars",
            "cuisine": "Coffee, Drinks, Snacks, Light Meals",
            "price_range": "€€-€€€",
            "known_for": "Sea views, relaxed atmosphere, popular meeting spots",
            "atmosphere": "Ideal for coffee, brunch, or evening drinks overlooking the Thermaic Gulf."
          },
          {
            "name": "Restaurants near Aristotelous",
            "cuisine": "Greek, International",
            "price_range": "€€-€€€€",
            "known_for": "Variety of dining options from casual to upscale, often with square views",
            "atmosphere": "Central location attracts both locals and tourists."
          }
        ],
        "activities": [
          {
            "name": "Walk/Cycle the Nea Paralia",
            "type": "Recreation/Exploration",
            "description": "Cover the full length or sections of the waterfront promenade, enjoying the parks, views, and sea air.",
            "suitable_for": [
              "Everyone",
              "Families",
              "Walkers",
              "Cyclists"
            ]
          },
          {
            "name": "Sunset Viewing",
            "type": "Relaxation/Photography",
            "description": "Find a spot along the waterfront, perhaps near the 'Umbrellas' or White Tower, to watch the often spectacular sunset over the gulf.",
            "suitable_for": [
              "Everyone",
              "Photographers",
              "Romantics"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want a prime central location with sea views and easy access to everything",
        "You enjoy lively public spaces and people-watching",
        "You want to be close to major event locations (Aristotelous, Film Fest)"
      ],
      "avoid_if": [
        "You seek a very quiet, residential neighborhood",
        "You are on a very tight budget (prime location hotels can be pricier)",
        "You dislike large crowds during major events"
      ],
      "insider_tips": [
        "The evening 'volta' (stroll) along Nea Paralia is a quintessential Thessaloniki experience.",
        "Rent a bike for an easy way to cover the long distance of the waterfront.",
        "Cafes directly on Aristotelous Square can be more expensive; explore side streets for potentially better value."
      ]
    },
    {
      "name": "Ladadika",
      "alternate_names": [
        "Historic Commercial District"
      ],
      "character": "A beautifully restored historic district near the port, once the central market and wholesale area (selling oil - 'ladi'). Now famous for its colourful neoclassical buildings housing a dense concentration of traditional tavernas, ouzeries, restaurants, and lively bars.",
      "location": {
        "central": true,
        "description": "Located west of Aristotelous Square, between the port and Tsimiski Street.",
        "borders": [
          "Port",
          "Aristotelous Square area",
          "Valaoritou (nearby)"
        ],
        "landmarks": [
          "Colourful restored buildings",
          "Cobblestone streets (largely pedestrianized)"
        ]
      },
      "history": {
        "overview": "Survived the Great Fire of 1917 largely intact due to its location near the port. Was the city's main commercial hub, particularly for oil trade. Fell into decline but was revived and pedestrianized in the late 20th century, becoming a major entertainment district.",
        "significance": "Preserved example of pre-fire Thessaloniki architecture, successfully repurposed for nightlife and dining.",
        "notable_events": [
          "Survived the 1917 Fire",
          "History as a central market (oil trade)",
          "Revitalization and pedestrianization"
        ]
      },
      "practical_info": {
        "transit": [
          "Short walk from Aristotelous Square and central bus routes",
          "Close to the ferry port",
          "Largely pedestrianized, minimal car traffic"
        ],
        "safety": "Generally very safe and bustling, especially in the evenings. Well-lit.",
        "best_time_to_visit": "Evenings and nights for the vibrant dining and bar scene. Daytime is quieter, good for appreciating the architecture.",
        "walkability": "Excellent. Flat cobblestone streets perfect for strolling."
      },
      "appeal": {
        "known_for": [
          "Nightlife (tavernas, ouzeries, bars)",
          "Historic architecture & colourful buildings",
          "Traditional Greek food (especially mezedes)",
          "Lively atmosphere",
          "Pedestrianized streets"
        ],
        "atmosphere": [
          "Historic",
          "Lively",
          "Colourful",
          "Bustling (evenings)",
          "Traditional yet trendy"
        ],
        "best_for": [
          "Foodies",
          "Nightlife enthusiasts",
          "Photographers",
          "Groups seeking social dining",
          "Experiencing traditional Greek entertainment"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 1,
        "green_spaces": 0,
        "shopping": 1,
        "dining": 5,
        "nightlife": 5,
        "cultural": 3,
        "historic": 4
      },
      "highlights": {
        "attractions": [
          {
            "name": "Restored Neoclassical Buildings",
            "type": "Architecture",
            "description": "The main appeal is the ensemble of well-preserved, colourful 19th and early 20th-century buildings that house the area's businesses.",
            "appeal": "Admire the unique architectural character of the district."
          }
        ],
        "dining": [
          {
            "name": "Tavernas & Ouzeries",
            "cuisine": "Traditional Greek, Mezedes",
            "price_range": "€€-€€€",
            "known_for": "Grilled meats, seafood, shared plates (mezedes), ouzo/tsipouro",
            "atmosphere": "Casual to lively settings, often with outdoor seating, perfect for social dining and experiencing local flavors."
          },
          {
            "name": "Restaurants & Bars",
            "cuisine": "Greek, International, Cocktails",
            "price_range": "€€-€€€€",
            "known_for": "Variety of options from traditional to modern, lively bar scene",
            "atmosphere": "Busy and vibrant, especially on weekend evenings."
          }
        ],
        "activities": [
          {
            "name": "Evening Dining & Drinks",
            "type": "Nightlife/Dining",
            "description": "The primary activity is enjoying dinner and/or drinks at the numerous establishments, soaking up the lively atmosphere.",
            "suitable_for": [
              "Everyone (age permitting for bars)",
              "Foodies",
              "Social groups"
            ]
          },
          {
            "name": "Architectural Photography",
            "type": "Photography/Exploration",
            "description": "Capture the colourful buildings and historic streetscapes, especially attractive during the day or at dusk.",
            "suitable_for": [
              "Photographers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be right in the heart of a major dining and nightlife area",
        "You appreciate historic architecture and atmosphere",
        "You plan to spend evenings out frequently"
      ],
      "avoid_if": [
        "You are looking for a quiet place to stay (can be noisy until late)",
        "You need extensive green spaces nearby",
        "You prioritize shopping over dining/nightlife"
      ],
      "insider_tips": [
        "Ladadika gets extremely busy on Friday and Saturday nights; weekdays offer a slightly calmer experience.",
        "While touristy, many places offer good quality traditional food; look for spots busy with locals.",
        "It's easily combined with a visit to the nearby port area or Valaoritou district."
      ]
    },
    {
      "name": "Ano Poli (Upper Town)",
      "alternate_names": [
        "Old Town",
        "Kastra (The Castles)"
      ],
      "character": "The historic upper district of Thessaloniki, largely spared by the 1917 fire. Characterized by steep, winding cobblestone streets, Ottoman-era houses with wooden balconies, Byzantine walls and churches, the Heptapyrgion fortress, and stunning panoramic views over the city and Thermaic Gulf.",
      "location": {
        "central": false,
        "description": "Located on the hills north of the modern city center.",
        "borders": [
          "Modern City Center (below)",
          "Byzantine Walls"
        ],
        "landmarks": [
          "Byzantine Walls",
          "Heptapyrgion (Eptapyrgio) Fortress",
          "Trigonion Tower (Chain Tower)",
          "Church of Osios David (Latomou Monastery)",
          "Vlatadon Monastery",
          "Traditional Ottoman Houses"
        ]
      },
      "history": {
        "overview": "Represents the oldest part of the city, retaining its structure from the Byzantine and Ottoman periods. It was enclosed by the city walls and served as the main residential area, particularly for the Turkish population during Ottoman times. Escaped the Great Fire of 1917.",
        "significance": "A living museum showcasing Thessaloniki's Byzantine and Ottoman past, offering unique atmosphere and views. UNESCO World Heritage site (Paleochristian and Byzantine Monuments).",
        "notable_events": [
          "Core of Byzantine Thessaloniki",
          "Main residential area during Ottoman rule",
          "Survived the 1917 Fire"
        ]
      },
      "practical_info": {
        "transit": [
          "Bus routes (e.g., #23) go up into Ano Poli, but walking is key",
          "Significant uphill walking required from the city center",
          "Very narrow streets, extremely limited driving/parking"
        ],
        "safety": "Generally safe, but some streets can feel deserted. Stick to main paths after dark. Be mindful on uneven surfaces.",
        "best_time_to_visit": "Daytime for exploration and museum/church visits. Late afternoon/sunset for incredible views.",
        "walkability": "Walkable but challenging due to steep hills and uneven cobblestones. Good walking shoes are essential."
      },
      "appeal": {
        "known_for": [
          "Panoramic city and sea views",
          "Historic atmosphere (Byzantine/Ottoman)",
          "Byzantine Walls & Heptapyrgion Fortress",
          "Traditional architecture",
          "Quiet escape from the city center",
          "Traditional tavernas"
        ],
        "atmosphere": [
          "Historic",
          "Atmospheric",
          "Quiet (compared to center)",
          "Picturesque",
          "Authentic"
        ],
        "best_for": [
          "History buffs",
          "Photographers",
          "View seekers",
          "Those seeking authentic atmosphere",
          "Walkers (prepared for hills)"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 4,
        "green_spaces": 2,
        "shopping": 1,
        "dining": 3,
        "nightlife": 1,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Heptapyrgion (Eptapyrgio) Fortress",
            "type": "Historic Fortress",
            "description": "The Byzantine and Ottoman-era fortress complex located at the highest point of Ano Poli, offering commanding views. Parts served as a notorious prison until 1989.",
            "appeal": "Explore the impressive fortifications and enjoy unparalleled panoramic views."
          },
          {
            "name": "Byzantine Walls & Trigonion Tower",
            "type": "Historic Fortifications",
            "description": "Significant sections of the ancient city walls remain, particularly in Ano Poli. The Trigonion Tower offers another key viewpoint.",
            "appeal": "Walk along parts of the historic defenses and imagine the city's past."
          },
          {
            "name": "Church of Osios David (Latomou Monastery)",
            "type": "Byzantine Church (UNESCO)",
            "description": "A small but incredibly important 5th-century church hidden in Ano Poli, famous for its rare early mosaic of the Vision of Ezekiel.",
            "appeal": "Discover a hidden gem of early Byzantine art."
          }
        ],
        "dining": [
          {
            "name": "Traditional Tavernas",
            "cuisine": "Classic Greek",
            "price_range": "€€",
            "known_for": "Home-style cooking, often with views, relaxed atmosphere",
            "atmosphere": "Authentic neighborhood tavernas offering traditional dishes, some with stunning city vistas."
          },
          {
            "name": "Cafes with Views",
            "cuisine": "Coffee, Drinks, Snacks",
            "price_range": "€€",
            "known_for": "Panoramic views over Thessaloniki",
            "atmosphere": "Relaxed spots to enjoy a drink while taking in the breathtaking scenery."
          }
        ],
        "activities": [
          {
            "name": "Wandering the Streets",
            "type": "Exploration/Photography",
            "description": "Get lost in the maze of steep, winding streets, discovering traditional houses, hidden churches, and viewpoints.",
            "suitable_for": [
              "Explorers",
              "Photographers"
            ]
          },
          {
            "name": "Viewpoint Hopping",
            "type": "Sightseeing/Photography",
            "description": "Seek out different spots along the walls (Heptapyrgion, Trigonion Tower, various points) for varying perspectives of the city and sea.",
            "suitable_for": [
              "Everyone (prepared for walking)",
              "Photographers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You prioritize historic atmosphere and stunning views",
        "You enjoy walking and exploring challenging terrain",
        "You seek a quieter, more authentic neighborhood experience"
      ],
      "avoid_if": [
        "You have mobility issues (steep hills, uneven surfaces)",
        "You want easy access to nightlife and central amenities (requires walk/bus/taxi)",
        "You need convenient parking"
      ],
      "insider_tips": [
        "Wear your most comfortable walking shoes.",
        "Allow plenty of time to explore – getting lost is part of the charm.",
        "Sunset views from the Kastra (walls) are unforgettable. Bring a jacket as it can be windy."
      ]
    },
    {
      "name": "City Center (Tsimiski, Mitropoleos, Egnatia)",
      "alternate_names": [
        "Downtown",
        "Commercial Center"
      ],
      "character": "The bustling commercial and administrative heart of modern Thessaloniki. Dominated by major shopping streets like Tsimiski and Mitropoleos (higher-end) and the busy thoroughfare of Egnatia. Features mainstream shops, department stores, banks, offices, cafes, fast food, and key historical sites like the Roman Forum and Galerius Arch.",
      "location": {
        "central": true,
        "description": "The area roughly between the waterfront (south), Egnatia street (north), the port/Ladadika (west), and the University/Exhibition grounds (east).",
        "borders": [
          "Aristotelous Square/Waterfront",
          "Ano Poli (uphill)",
          "Ladadika",
          "University/Rotunda area"
        ],
        "landmarks": [
          "Tsimiski Street",
          "Mitropoleos Street",
          "Egnatia Street",
          "Roman Forum (Ancient Agora)",
          "Church of Panagia Chalkeon",
          "Kapani & Modiano Markets (edge)",
          "Numerous shops and cafes"
        ]
      },
      "history": {
        "overview": "Largely rebuilt after the Great Fire of 1917 based on Hébrard's plan, creating wide avenues like Tsimiski and Egnatia (following the path of the ancient Roman Via Egnatia). Became the modern commercial and administrative hub.",
        "significance": "The engine of Thessaloniki's modern commercial life, built upon ancient foundations.",
        "notable_events": [
          "Path of the ancient Via Egnatia",
          "Reconstruction after 1917 fire",
          "Development as the main shopping district"
        ]
      },
      "practical_info": {
        "transit": [
          "Excellent bus connectivity along Tsimiski and Egnatia",
          "No metro (under construction)",
          "Walkable, but distances can be significant",
          "Busy traffic, especially on Egnatia"
        ],
        "safety": "Generally very safe during the day and evening. Standard city precautions apply.",
        "best_time_to_visit": "Shopping hours for retail therapy. Daytime for exploring markets and Roman Forum. Buzzing cafe scene throughout the day.",
        "walkability": "Very walkable along main streets (Tsimiski largely pedestrianized), but Egnatia is busy with traffic."
      },
      "appeal": {
        "known_for": [
          "Shopping (mainstream & high-end)",
          "Busy atmosphere",
          "Central location",
          "Cafes",
          "Markets (Kapani, Modiano)",
          "Roman Forum"
        ],
        "atmosphere": [
          "Busy",
          "Commercial",
          "Central",
          "Modern",
          "Noisy (traffic on Egnatia)"
        ],
        "best_for": [
          "Shoppers",
          "Business travelers",
          "Those wanting central accommodation with easy bus access",
          "Experiencing the city's daily commercial pulse"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 3,
        "green_spaces": 1,
        "shopping": 5,
        "dining": 4,
        "nightlife": 2,
        "cultural": 3,
        "historic": 4
      },
      "highlights": {
        "attractions": [
          {
            "name": "Tsimiski Street",
            "type": "Shopping Street",
            "description": "Thessaloniki's primary shopping avenue, featuring international brands, department stores (Attica), cafes, and bustling pedestrian traffic.",
            "appeal": "Indulge in retail therapy or simply experience the city's commercial energy."
          },
          {
            "name": "Roman Forum (Ancient Agora)",
            "type": "Archaeological Site",
            "description": "The administrative and social center of Roman Thessaloniki, located just above Aristotelous Square. Includes ruins of the Odeon, stoas, and forum square.",
            "appeal": "Explore significant Roman history integrated within the modern city grid."
          },
          {
            "name": "Kapani & Modiano Markets",
            "type": "Traditional Markets",
            "description": "Historic covered markets (off Egnatia) selling fresh produce, meat, fish, spices, household goods, and more. Modiano also features tavernas.",
            "appeal": "Experience the vibrant atmosphere and sights/smells of traditional Greek markets."
          }
        ],
        "dining": [
          {
            "name": "Cafes & Patisseries",
            "cuisine": "Coffee, Greek pastries, Bougatsa",
            "price_range": "€-€€",
            "known_for": "Coffee breaks, people-watching, trying local sweets",
            "atmosphere": "Numerous options from traditional 'zacharoplasteia' to modern coffee shops."
          },
          {
            "name": "Restaurants & Fast Food",
            "cuisine": "Greek, International, Fast Food",
            "price_range": "€-€€€€",
            "known_for": "Wide variety catering to shoppers and office workers",
            "atmosphere": "Mix of quick lunch spots, casual eateries, and more formal restaurants."
          }
        ],
        "activities": [
          {
            "name": "Shopping",
            "type": "Retail Therapy",
            "description": "Explore Tsimiski for mainstream brands, Mitropoleos for higher-end boutiques, and surrounding streets for various shops.",
            "suitable_for": [
              "Shoppers"
            ]
          },
          {
            "name": "Market Exploration",
            "type": "Cultural Experience",
            "description": "Visit Kapani and Modiano markets (mornings best) for a sensory experience and local flavour.",
            "suitable_for": [
              "Everyone",
              "Foodies",
              "Photographers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "Shopping is a high priority",
        "You want a very central location with good bus connections",
        "You prefer staying in modern hotels or apartments amidst city bustle"
      ],
      "avoid_if": [
        "You seek charm and quiet (better options: Ano Poli, parts of waterfront)",
        "You dislike busy commercial streets and traffic noise",
        "You are primarily interested in nightlife (Ladadika/Valaoritou better)"
      ],
      "insider_tips": [
        "Tsimiski is the main fashion street; Mitropoleos runs parallel and tends slightly more upscale.",
        "The markets are a fantastic place to grab ingredients or a quick, traditional bite.",
        "Egnatia Street can be very noisy and traffic-choked; Tsimiski offers a more pleasant walking experience."
      ]
    }
  ],
  "activityTypes": {
    "spring": [
      "Enjoying the blooming Nea Paralia waterfront park",
      "Exploring Ano Poli's alleys and viewpoints in pleasant weather",
      "Outdoor cafe hopping in Aristotelous Square and Ladadika",
      "Witnessing Easter processions (Holy Week) if applicable",
      "Day trips to Halkidiki as beaches become appealing"
    ],
    "summer": [
      "Strolling the Nea Paralia waterfront in the evenings ('volta')",
      "Attending outdoor concerts (Moni Lazariston, Dasous Theatre)",
      "Enjoying open-air cinemas ('Therina Cinema')",
      "Experiencing the nightlife in Ladadika and Valaoritou districts",
      "Escaping the heat with day trips to Halkidiki beaches"
    ],
    "autumn": [
      "Exploring historical sites (Roman Forum, Rotunda, Ano Poli) in comfortable temperatures",
      "Attending the Thessaloniki International Film Festival (November)",
      "Experiencing the Dimitria Festival and Agios Dimitrios celebrations (October)",
      "Visiting museums (Archaeological, Byzantine Culture, MOMus)",
      "Enjoying cozy tsipouradika with seasonal mezedes"
    ],
    "winter": [
      "Exploring museums with fewer crowds",
      "Enjoying the vibrant indoor cafe culture",
      "Shopping during the winter sales (starting January)",
      "Visiting the Christmas market and decorations in Aristotelous Square",
      "Warming up in traditional tavernas or tsipouradika"
    ]
  }
} 