{
    "Spring": {
        "activities": [
            {
                "name": "Orthodox Easter Celebrations (Megali Evdomada & Pascha)",
                "type": "Cultural/Religious Festival",
                "description": "Experience the most important religious holiday in Greece. Witness solemn Holy Week (Megali Evdomada) processions like the Epitaphios on Good Friday (notably from churches like Agios Dimitrios or Agia Sofia), the spectacular Anastasi midnight service on Holy Saturday with fireworks, followed by feasting on Easter Sunday (Pascha).",
                "indoor": false,
                "best_time": "Holy Week (dates vary, typically April/May)",
                "price_range": "Free (Observing processions/services)",
                "seasonal_notes": "A deeply significant period in the Greek Orthodox calendar, with unique traditions observed throughout Thessaloniki. Dates differ from Western Easter.",
                "booking_tips": "Book accommodation and travel well in advance. Observing traditions in historic churches like those in Ano Poli or the city center is special. Check restaurant opening times and special menus."
            },
            {
                "name": "Explore Ano Poli & Byzantine Walls",
                "type": "Nature/Viewpoint/Historical",
                "description": "Enjoy pleasant spring weather while wandering the historic Ano Poli (Upper Town). Explore its winding cobblestone streets, Ottoman houses, Byzantine churches, and walk along sections of the Byzantine Walls for panoramic city and Thermaic Gulf views.",
                "indoor": false,
                "best_time": "Morning/Late Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings pleasant temperatures ideal for tackling the hilly terrain of Ano Poli before the summer heat. Wildflowers may add color to the surroundings.",
                "booking_tips": "Wear comfortable walking shoes for steep, uneven paths. Accessible by bus (e.g., #23) or a strenuous uphill walk from the center."
            },
            {
                "name": "Waterfront Cafe Culture & 'Volta'",
                "type": "Leisure/Social",
                "description": "Relax at the numerous cafes along the expansive Nea Paralia waterfront or in Aristotelous Square. Enjoy Greek coffee (freddo espresso/cappuccino), bougatsa, or cocktails while soaking up the spring sunshine, sea breeze, and engaging in the quintessential Thessaloniki 'volta' (evening stroll).",
                "indoor": false,
                "best_time": "Daytime/Early Evening",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Spring allows for comfortable enjoyment of Thessaloniki's strong outdoor cafe culture, especially along the scenic waterfront.",
                "booking_tips": "Plenty of options available. Waterfront cafes offer great views but can be pricier. Explore side streets off Aristotelous or areas like Ladadika for variety."
            },
            {
                "name": "Visit Historical Sites",
                "type": "Cultural/Historical",
                "description": "Explore Thessaloniki's rich history by visiting key sites like the Roman Forum (Ancient Agora), the Arch of Galerius and Rotunda, the White Tower, and various Byzantine Churches (like Agios Dimitrios, Agia Sofia) in comfortable spring temperatures.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Budget/Moderate (Some sites free, some paid, consider combo tickets if available)",
                "seasonal_notes": "Ideal weather for exploring both outdoor ruins and indoor museums associated with these sites.",
                "booking_tips": "Check opening hours for specific churches and museums. A combined ticket for major archaeological sites/museums can offer savings."
            },
            {
                "name": "Day Trip to Halkidiki Beaches",
                "type": "Beach/Excursion",
                "description": "As the weather warms, take a day trip to the nearby beaches of Halkidiki. Early spring might still be cool for swimming for some, but the coastal scenery is beautiful, and seaside tavernas start opening.",
                "indoor": false,
                "best_time": "Daytime (Late Spring)",
                "price_range": "Moderate (Transportation + Food)",
                "seasonal_notes": "Water temperature increases through spring. Less crowded than summer. Focus on closer areas like Perea/Agia Triada or first peninsula (Kassandra) for day trips.",
                "booking_tips": "Accessible by public bus (KTEL Halkidikis) or car. Check bus schedules. Car rental offers more flexibility to explore different beaches."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Summer Festivals (Sani, Moni Lazariston, Dasous Theatre)",
                "type": "Cultural Festival/Performing Arts",
                "description": "Attend diverse performances during Thessaloniki's summer festival season. Check schedules for events at venues like Moni Lazariston, the open-air Dasous Theatre (Forest Theatre), or consider excursions to the renowned Sani Festival in nearby Halkidiki.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "Thessaloniki and its surroundings host various music, theatre, and dance events throughout the summer.",
                "booking_tips": "Book tickets in advance online for major festivals and popular performances. Check specific festival websites for programs and booking details."
            },
            {
                "name": "Enjoy Waterfront Bars & Nea Paralia Evenings",
                "type": "Nightlife/Leisure",
                "description": "Spend warm evenings strolling the vast Nea Paralia waterfront (the 'volta'). Enjoy drinks at the numerous bars along the promenade or rooftop bars in the city center, offering views of the Thermaic Gulf and the bustling city.",
                "indoor": false,
                "best_time": "Sunset/Evening",
                "price_range": "Moderate/Expensive",
                "seasonal_notes": "The waterfront is the social heart of Thessaloniki in summer evenings, offering cooler breezes off the sea.",
                "booking_tips": "Waterfront bars are plentiful. Rooftop bars in the center might require reservations for best views, especially on weekends."
            },
            {
                "name": "Open-Air Cinemas ('Therina Cinema')",
                "type": "Leisure/Entertainment",
                "description": "Enjoy the classic Greek summer tradition of watching movies under the stars at Thessaloniki's open-air cinemas, often located in garden settings or rooftops.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Typically runs from late May/June to September. Offers a relaxed way to enjoy a summer night.",
                "booking_tips": "Check local listings (online or city guides) for schedules and locations (e.g., Cine Alex, Cine Natali). Tickets usually bought at the venue."
            },
            {
                "name": "Escape to Halkidiki Beaches",
                "type": "Beach/Leisure/Excursion",
                "description": "Take full advantage of the summer heat with trips to the famous beaches of Halkidiki. Choose from lively beach bars on the first peninsula (Kassandra) or explore quieter coves and stunning turquoise waters on the second peninsula (Sithonia).",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate/Expensive (Transportation, beach facilities, food)",
                "seasonal_notes": "Peak season for Halkidiki. Expect crowds, especially on weekends. Water is perfect for swimming and water sports.",
                "booking_tips": "Consider renting a car for flexibility, especially for exploring Sithonia. Public buses serve main towns but access to specific beaches can be limited. Book accommodation far in advance if staying overnight."
            },
            {
                "name": "August Moon Festival (Selected Date)",
                "type": "Cultural Event",
                "description": "On the night of the August full moon, check for special free admissions or events at archaeological sites and museums in and around Thessaloniki (e.g., Roman Forum, Museum of Byzantine Culture), organized by the Ministry of Culture.",
                "indoor": false,
                "best_time": "Evening (August Full Moon night)",
                "price_range": "Free",
                "seasonal_notes": "A unique chance to experience cultural sites atmospherically illuminated by the full moon.",
                "booking_tips": "Confirm participating sites and specific event details via the Ministry of Culture website closer to the date. Expect crowds at popular locations."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Dimitria Festival & Agios Dimitrios Celebrations",
                "type": "Cultural/Religious Festival",
                "description": "Experience Thessaloniki's major cultural festival, 'Dimitria' (usually spans Sept/Oct), featuring diverse artistic events. Culminates around the feast day of the city's patron saint, St. Demetrius (Agios Dimitrios), on October 26th with religious services and city-wide celebrations.",
                "indoor": true,
                "best_time": "October (esp. week of Oct 26th)",
                "price_range": "Varies (Many events free, some ticketed)",
                "seasonal_notes": "A key period in Thessaloniki's cultural calendar, celebrating its patron saint and artistic life.",
                "booking_tips": "Check the official Dimitria Festival program online for event schedules and tickets. Accommodation can be busy around Oct 26th-28th holidays."
            },
             {
                "name": "'Oxi Day' (No Day) Parade",
                "type": "National Holiday/Parade",
                "description": "Witness the large military and student parade along Thessaloniki's waterfront (Leoforos Megalou Alexandrou) and Tsimiski street, commemorating Greece's refusal of Mussolini's ultimatum in 1940 on October 28th.",
                "indoor": false,
                "best_time": "Morning (October 28th)",
                "price_range": "Free",
                "seasonal_notes": "A major national holiday following Agios Dimitrios Day (Oct 26th), making it a long holiday weekend. Expect closures and crowds.",
                "booking_tips": "Find a viewing spot along the parade route early. Public transport schedules might be altered."
            },
            {
                "name": "Thessaloniki International Film Festival (TIFF)",
                "type": "Cultural Festival/Film",
                "description": "Attend screenings, premieres, and events during one of Southeast Europe's most important film festivals, showcasing international and Greek cinema. Centered around the Olympion cinema on Aristotelous Square and nearby venues.",
                "indoor": true,
                "best_time": "Typically November (Check specific dates)",
                "price_range": "Moderate (Per screening or festival pass)",
                "seasonal_notes": "Transforms the city center into a hub for cinephiles, directors, and actors.",
                "booking_tips": "Check the official TIFF website for the program and ticket sales. Book popular screenings in advance. Also features documentaries (in March usually)."
            },
            {
                "name": "Explore Museums Comfortably",
                "type": "Cultural/Historical",
                "description": "Visit Thessaloniki's excellent museums like the Archaeological Museum, Museum of Byzantine Culture, MOMus venues (Museum of Modern Art, Photography Museum etc.), Atatürk Museum, or Jewish Museum in pleasant autumn weather.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Comfortable temperatures make it ideal for combining indoor museum visits with exploring nearby areas.",
                "booking_tips": "Allocate enough time for major museums. Check for combined tickets or free admission days. Atatürk Museum may require pre-booking."
            },
             {
                "name": "Enjoy Tsipouradika & Tavernas",
                "type": "Food/Social",
                "description": "As the evenings cool, enjoy the cozy atmosphere of Thessaloniki's traditional 'tsipouradika' (serving tsipouro spirit with mezedes) and tavernas, especially in areas like Ladadika, Ano Poli, or around the markets (Kapani, Modiano).",
                "indoor": true,
                "best_time": "Lunch/Evening",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Autumn is perfect for enjoying warm, hearty Greek food and the social culture of sharing mezedes with tsipouro or wine.",
                "booking_tips": "Explore different areas. Reservations might be needed for popular spots on weekends. Ask for seasonal specialties."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas & New Year in Aristotelous Square",
                "type": "Festival/Celebration",
                "description": "Experience the festive season centered around Aristotelous Square, which typically hosts the city's main Christmas tree (or festive boat), market stalls, concerts, and New Year's Eve countdown celebrations with fireworks over the Thermaic Gulf.",
                "indoor": false,
                "best_time": "Evenings (December)",
                "price_range": "Free (Viewing)/Moderate (Market purchases/activities)",
                "seasonal_notes": "Thessaloniki offers a vibrant Christmas atmosphere. Celebrations focus on Aristotelous Square and the waterfront.",
                "booking_tips": "Check the Municipality's schedule for specific events. Book restaurants or venues for Christmas/NYE dinners well in advance."
            },
             {
                "name": "Winter Sales Shopping",
                "type": "Shopping",
                "description": "Take advantage of the winter sales period (typically starting mid-January) for discounted shopping along Tsimiski Street, Mitropoleos, and other commercial areas.",
                "indoor": true,
                "best_time": "Daytime (Mid-Jan to Feb)",
                "price_range": "Varies",
                "seasonal_notes": "A good time for bargain hunting after the holidays.",
                "booking_tips": "Shops can be busy, especially during the initial days of the sales."
            },
            {
                "name": "Cozy Cafe & Patisserie Culture",
                "type": "Food/Leisure",
                "description": "Embrace Thessaloniki's strong cafe culture indoors during winter. Enjoy hot beverages, intricate pastries ('zacharoplasteia'), or the famous 'bougatsa' in warm, lively cafes throughout the city center.",
                "indoor": true,
                "best_time": "Anytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Perfect season to indulge in Thessaloniki's renowned sweets and coffee culture in cozy indoor settings.",
                "booking_tips": "Explore different types of cafes, from historic spots to modern coffee houses. Try both sweet and savory bougatsa."
            },
            {
                "name": "Museum Hopping with Fewer Crowds",
                "type": "Cultural/Historical",
                "description": "Utilize the low tourist season for leisurely visits to Thessaloniki's rich array of museums (Archaeological, Byzantine Culture, MOMus, White Tower Museum, etc.) without the usual queues.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Ideal time for in-depth exploration of museum collections.",
                "booking_tips": "Check winter opening hours. Consider museum passes if visiting multiple MOMus venues or other sites."
            },
            {
                "name": "Apokries (Carnival Season) & Tsiknopempti",
                "type": "Cultural Festival",
                "description": "Experience the Greek carnival season ('Apokries', usually Feb/March) with parties and events leading up to Lent. Particularly enjoy 'Tsiknopempti' ('Smoky Thursday'), when tavernas and streets fill with the smell of grilled meat.",
                "indoor": true,
                "best_time": "Evenings (esp. Tsiknopempti & Carnival weekends)",
                "price_range": "Varies (Free street atmosphere/Paid parties/Dining costs)",
                "seasonal_notes": "A festive period before the solemnity of Lent. Dates vary yearly based on the Orthodox Easter calendar.",
                "booking_tips": "Book tables for Tsiknopempti well in advance if dining out. Look for themed events in bars/clubs during carnival weekends."
            }
        ]
    }
} 