{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Protochronia)",
          "notes": "New Year's Day is a public holiday throughout Greece. Most attractions, shops, and restaurants in Thessaloniki operate with limited hours. Traditional Greek New Year's celebrations include the cutting of the Vasilopita cake with a hidden coin bringing luck to whoever finds it. The city is relatively quiet as residents recover from New Year's Eve celebrations, though the waterfront promenade may see locals taking traditional New Year's Day walks."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 2,
          "notes": "Early January in Thessaloniki features winter weather with average high temperatures around 8°C (47°F) and increased chances of rainfall. This is low season for tourism, so you'll find fewer crowds at major attractions like the White Tower, Archaeological Museum, and Byzantine churches. Winter sales begin in shops throughout the city, particularly in Tsimiski Street and the Modiano Market area. This is a good time to explore indoor cultural sites and enjoy the city's famous gastronomy in cozy tavernas."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
          "score": 3,
          "notes": "Mid-January brings typical winter conditions to Thessaloniki. The city occasionally experiences snowfall, particularly in the upper town (Ano Poli). Indoor cultural attractions such as the Archaeological Museum, Museum of Byzantine Culture, and the Jewish Museum are excellent options during occasional rainy days. Winter specialties appear in local restaurants, including hearty soups like fasolada (bean soup) and trahanas (traditional grain soup), perfect for the season."
        },
        {
          "days": [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Late January sees Thessaloniki at its coldest, but winter days can often be sunny and pleasant enough for exploring the city. Fog is quite common during this period, particularly in the mornings. When the weather permits, take advantage of clear days to visit Ano Poli (Upper Town) for panoramic views of the city and gulf. This is a perfect time to explore Thessaloniki's vibrant café culture, with many cozy establishments serving Greek coffee and traditional pastries."
        }
      ],
      "weatherHighC": 8,
      "weatherLowC": 2,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "February continues with winter conditions but frequently features beautiful, clear days with mild temperatures. The first signs of spring can begin to appear toward the end of the month. Tourism remains low, making it an excellent time to enjoy the city's museums, galleries, and indoor attractions without crowds. February is a good month to explore Thessaloniki's well-developed café culture, with locals spending hours in the city's numerous coffee shops. Winter sales continue in many shops, offering good value for shoppers."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 4,
          "notes": "Early March marks the transition from winter to spring, with gradually warming temperatures and occasional rainfall. This shoulder season is ideal for exploring both archaeological sites and cultural attractions with very manageable crowds. The city begins to show signs of spring with flowers appearing in parks like the Nea Paralia (New Waterfront)."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 5,
          "special": true,
          "event": "Thessaloniki International Documentary Festival",
          "notes": "The Thessaloniki International Documentary Festival typically takes place in early-to-mid March, screening hundreds of documentaries from around the world. The festival draws international filmmakers and cinema enthusiasts to the city. During this period, the city has a lively cultural atmosphere with screenings at venues like Olympion Theater and Warehouse C at the port. Spring weather continues to improve, making outdoor exploration more pleasant."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "notes": "Mid-March brings more reliable spring weather with temperatures continuing to rise. Outdoor cafés and restaurants begin setting up their terraces along the waterfront and in popular areas like Ladadika. This is an excellent time to explore the city's historic districts like Ano Poli (Upper Town) and enjoy the panoramic views without summer crowds or heat."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Greek Independence Day (Ikostí Pémpti Martíou)",
          "notes": "March 25th is a major national holiday celebrating Greek Independence Day. A military and student parade takes place in central Thessaloniki, particularly along the waterfront. Museums and archaeological sites may have modified hours but typically remain open. Many restaurants offer special menus featuring traditional Greek foods, particularly bakaliaros (fried cod) and skordalia (garlic sauce), which are traditionally eaten on this day."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Easter Preparations",
          "notes": "Late March may include Easter preparations (if Orthodox Easter falls in March/early April). The weather becomes increasingly pleasant with spring temperatures averaging around 15°C (59°F). If Easter falls in late March/early April, expect increased activity in churches around Thessaloniki, particularly the Church of Agios Dimitrios and the Metropolitan Cathedral, with special services and preparations for Holy Week."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 6,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Holy Week & Easter (Megali Evdomada & Pascha)",
          "notes": "If Orthodox Easter falls in April, Thessaloniki observes Holy Week with solemn processions and religious ceremonies at the city's churches. Good Friday features evening processions of the Epitaphios (Christ's funeral bier) through neighborhoods across the city. Easter Sunday is celebrated with special services, particularly the midnight Resurrection service on Saturday night with candles and fireworks, followed by traditional feasts. April brings reliable spring weather with wildflowers blooming throughout the city's parks and archaeological sites. This is an excellent time for walking tours of the city and visiting outdoor monuments like the Roman Forum and Arch of Galerius."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 9,
      "tourismLevel": 6
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Ergatiki Protomagia)",
          "notes": "May 1st is International Workers' Day and a public holiday in Greece. Traditional celebrations include collecting flowers and making wreaths to hang on doors. Many Thessalonians also use this holiday for excursions to nearby countryside areas like Mount Hortiatis. There may be organized labor demonstrations in central Thessaloniki, particularly around Aristotelous Square."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "May brings ideal weather with warm, sunny days averaging 24°C (75°F) and minimal rainfall. Tourism increases but hasn't yet reached summer peak levels. This is considered one of the best months to visit Thessaloniki with perfect conditions for exploring archaeological sites like the White Tower, Roman Agora, and Rotunda. The waterfront promenade becomes especially popular for evening strolls, and outdoor dining reaches its prime in neighborhoods like Ladadika and Modiano. During May, Thessaloniki hosts the International Book Fair, bringing publishers and authors from around the world."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 13,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 5,
          "notes": "Early June brings warm summer weather to Thessaloniki with temperatures typically around 28°C (82°F). This is an excellent time to visit the city before the peak heat of July and August. Cultural activities increase with outdoor performances beginning in various venues throughout the city. The beaches of Halkidiki, just a short drive from Thessaloniki, become increasingly popular for swimming and beach activities."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Thessaloniki Pride",
          "notes": "Late June features Thessaloniki Pride, a major LGBTQ+ celebration lasting around 5 days and culminating in a parade and concert. Summer solstice (June 21) brings European Music Day celebrations with free concerts throughout the city's public spaces. Open-air cinemas begin operating throughout the city, showing both international and Greek films. Thessaloniki's Moni Lazariston Festival starts in late June, featuring music performances in the courtyard of the historic Lazaristes Monastery."
        }
      ],
      "weatherHighC": 28,
      "weatherLowC": 17,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6],
          "score": 4,
          "notes": "Early July brings high summer with temperatures reaching 32°C (90°F) and virtually no rainfall. Tourism increases as European summer holidays begin. Morning hours are best for visiting archaeological sites before the midday heat. Many locals begin to leave the city for nearby coastal areas, but Thessaloniki remains vibrant with tourists and summer cultural activities."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Summer Cultural Festivals",
          "notes": "Throughout July, Thessaloniki hosts various cultural events and festivals including the Heptapyrgion Festival at the historic Byzantine fortress and summer concerts at the Moni Lazariston. The waterfront becomes extremely lively in the evenings as people escape the daytime heat. Evening activities dominate, with outdoor cinemas, rooftop dining, and cultural performances starting after sunset. Day trips to nearby beaches at Peraia, Agia Triada, and Halkidiki become popular for cooling off during hot days."
        }
      ],
      "weatherHighC": 32,
      "weatherLowC": 20,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early August brings Thessaloniki's hottest temperatures, often exceeding 32°C (90°F). Many locals leave the city for annual vacations, particularly around the August 15th holiday. Some small, family-owned restaurants and shops may close for vacations, particularly in residential areas. Tourism remains at peak levels despite the heat, with visitors exploring the ancient sites, preferably in early morning or evening hours."
        },
        {
          "days": [15],
          "score": 4,
          "special": true,
          "event": "Dormition of the Virgin Mary (Koimisis tis Theotokou)",
          "notes": "August 15th is a major religious holiday celebrating the Dormition (Assumption) of the Virgin Mary. This is one of the most important feast days in the Greek Orthodox calendar. Special services are held at churches throughout Thessaloniki, particularly at the Metropolitan Cathedral and churches dedicated to the Virgin Mary. Many Thessalonians return to ancestral villages for this holiday, so the city may feel slightly less crowded than expected for mid-August."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "August Full Moon Events",
          "notes": "Around the August full moon, archaeological sites and museums often host special evening events with extended hours and cultural performances. Late August maintains high summer conditions with hot temperatures around 32°C (90°F). Evening activities dominate city life, with open-air cinemas, cultural events, and dining typically starting after 8 PM when temperatures begin to cool. The nearby beaches remain extremely popular for daytime cooling off."
        }
      ],
      "weatherHighC": 32,
      "weatherLowC": 20,
      "tourismLevel": 9
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 5,
          "notes": "Early September brings ideal conditions with warm temperatures around 28°C (82°F) but without the extreme heat of summer. Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather but fewer crowds. Local life returns to normal as Thessalonians come back from summer vacations and schools reopen."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Thessaloniki International Fair (TIF)",
          "notes": "The Thessaloniki International Fair is held annually for 10 days in early-to-mid September. This major commercial exhibition is one of the most important economic and political events in Greece, typically inaugurated by the Prime Minister who often announces government policies for the coming year. The fair attracts over 300,000 visitors and features exhibitions from various sectors, international pavilions, and cultural events throughout the city. The weather remains excellent for exploring the city, with pleasant temperatures and reduced humidity."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Beginning of Dimitria Festival",
          "notes": "Late September marks the beginning of the Dimitria Festival, a three-month cultural celebration named after the city's patron saint, Agios Dimitrios. The festival includes numerous musical, theatrical, and dance performances, street happenings, and exhibitions throughout the city. The sea remains warm enough for swimming at Thessaloniki's nearby beaches, and the weather is ideal for outdoor exploration. This period is widely considered one of the best times to visit Thessaloniki."
        }
      ],
      "weatherHighC": 28,
      "weatherLowC": 16,
      "tourismLevel": 8
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "special": true,
          "event": "Dimitria Festival Continues",
          "notes": "The Dimitria Festival continues throughout October with various cultural events across the city. The month brings pleasant autumn weather with temperatures around 20°C (68°F). Tourism continues to decrease, creating ideal conditions for exploring the city without crowds. This is an excellent month for walking tours of historic neighborhoods and enjoying the city's gastronomy with seasonal autumn specialties appearing in restaurants."
        },
        {
          "days": [26],
          "score": 5,
          "special": true,
          "event": "Agios Dimitrios Day",
          "notes": "October 26th is a public holiday in Thessaloniki celebrating Agios Dimitrios, the city's patron saint. Schools, shops, and public services remain closed. A large student parade is held in honor of the saint. The Church of Agios Dimitrios is spectacularly decorated and welcomes thousands of pilgrims. This day also commemorates the liberation of Thessaloniki from Ottoman rule in 1912, adding historical significance to the religious celebration."
        },
        {
          "days": [27],
          "score": 5,
          "notes": "A transition day between two major holidays, with many locals preparing for the national celebration of Oxi Day. The weather continues to be pleasant with autumn colors becoming more prominent throughout the city's parks and the University campus."
        },
        {
          "days": [28],
          "score": 5,
          "special": true,
          "event": "Oxi Day (Epéteios tou Óhi)",
          "notes": "October 28th is 'Oxi Day' ('No' Day), commemorating Greece's refusal to surrender to Axis powers in 1940. A grand military parade takes place in central Thessaloniki, making this one of the most significant national parades in the country. Most museums and archaeological sites remain open, though some may have modified hours. Schools and businesses are closed for this national holiday, and patriotic celebrations take place throughout the city."
        },
        {
          "days": [29, 30, 31],
          "score": 5,
          "notes": "Late October continues with pleasant autumn weather and the possibility of occasional rainfall. The city's urban parks show beautiful autumn colors. This is an excellent time for exploring the city's numerous museums without summer crowds, including the Archaeological Museum, Byzantine Culture Museum, and the Museum of Photography."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 12,
      "tourismLevel": 6
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "special": true,
          "event": "Thessaloniki International Film Festival",
          "notes": "The Thessaloniki International Film Festival takes place during the first ten days of November. This prestigious event attracts filmmakers and cinema enthusiasts from around the world, screening hundreds of films at venues throughout the city. The festival brings a vibrant cultural atmosphere to Thessaloniki, with screenings, masterclasses, and events centered around the Olympion Theater and port warehouse venues. November weather brings cooler temperatures around 15°C (59°F) and increased chances of rainfall."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Mid-to-late November sees the continuation of the Dimitria Festival, which runs until December. The weather becomes cooler with temperatures around 15°C (59°F) and increased chances of rainfall. This is an excellent time for cultural experiences including theater, music, and the vibrant café culture that characterizes Thessaloniki in cooler months. Indoor attractions like the city's numerous museums become particularly appealing. Late November sees the beginning of Christmas preparations with decorations starting to appear throughout the city center, particularly around Aristotelous Square."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 8,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "special": true,
          "event": "Christmas Celebrations & End of Dimitria Festival",
          "notes": "December marks the conclusion of the three-month Dimitria Festival. Throughout December, Thessaloniki hosts Christmas markets and festivities in central areas, particularly at Aristotelous Square which features a large Christmas tree and holiday decorations. The city center, especially areas like Tsimiski Street and Modiano Market, is beautifully decorated with Christmas lights. Special cultural events, concerts, and performances take place at venues throughout the city. December brings winter weather with temperatures around 9°C (48°F) and occasional rainfall, though clear, sunny winter days are also common."
        },
        {
          "days": [24, 25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Paramoni Christougennon & Christougenna)",
          "notes": "Christmas is celebrated throughout Thessaloniki with special services at churches, particularly at the Metropolitan Cathedral. Many restaurants offer special Christmas menus, though some may close for family celebrations on Christmas Day. Most major archaeological sites and museums remain open during the holiday period but may have reduced hours on Christmas Eve and Day. The Christmas season in Greece traditionally extends through January 6 (Epiphany), so celebrations continue past Christmas Day."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year is festive in Thessaloniki, with holiday decorations, special events, and a generally celebratory atmosphere. Shopping areas remain busy with winter sales beginning at some stores. Major tourist attractions maintain normal winter hours, and the city's cultural life continues with special holiday performances and events."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "New Year's Eve (Paramoni Protochronias)",
          "notes": "New Year's Eve celebrations center around Aristotelous Square with midnight countdowns, music, and fireworks. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. A unique Greek New Year's tradition is the smashing of a pomegranate on the doorstep at midnight for good luck. The city maintains a festive atmosphere with families and friends gathering to welcome the New Year."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 4
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the Byzantine city walls and Upper Town (Ano Poli) with ideal temperatures",
      "Visiting the White Tower and Archaeological Museum",
      "Strolling the renovated New Waterfront (Nea Paralia) during spring blooms",
      "Thessaloniki Food Tours featuring seasonal spring ingredients",
      "Walking tours of historic neighborhoods like Ladadika and Modiano Market",
      "Day trips to ancient Vergina (tomb of Philip II of Macedon)",
      "Greek Easter celebrations and traditions (when applicable)",
      "Outdoor café culture in Navarinou Square and along the waterfront",
      "Photography excursions capturing spring light on monuments"
    ],
    "summer": [
      "Early morning visits to archaeological sites before peak heat",
      "Cultural events at open-air venues like the Roman Agora",
      "Evening rooftop dining with views of the illuminated cityscape",
      "Day trips to nearby beaches at Peraia and Agia Triada",
      "Open-air cinema experiences showing films under the stars",
      "Boat cruises in the Thermaic Gulf with views of Mount Olympus",
      "Summer festival events including Thessaloniki Pride",
      "Evening walking tours when temperatures cool",
      "Day trips to nearby Halkidiki Peninsula beaches"
    ],
    "autumn": [
      "Perfect weather for extended exploration of archaeological sites",
      "Thessaloniki International Film Festival (November)",
      "Museum visits including the Museum of Byzantine Culture",
      "Wine tasting featuring new harvest Greek wines",
      "Hiking on nearby Mount Hortiatis with panoramic city views",
      "Seasonal gastronomy featuring autumn ingredients at local tavernas",
      "Cultural performances during the Dimitria Festival",
      "Photography walks capturing golden autumn light on monuments",
      "Day trips to Vergina and Pella (ancient Macedonian capital) with ideal weather"
    ],
    "winter": [
      "Thessaloniki Christmas Market at Aristotelous Square",
      "New Year's celebrations and traditions",
      "Winter shopping along Tsimiski Street and in Modiano Market",
      "Museum explorations during occasional rainy days",
      "Traditional winter cuisine featuring seasonal specialties",
      "Cozy café culture centered around Greek coffee and bougatsa",
      "Winter views from the Upper Town on clear days",
      "Indoor cultural performances at historic theaters",
      "Greek Orthodox Christmas and Epiphany traditions"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or mild, occasionally wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}