{
    "sites": [
        {
            "name": "White Tower",
            "type": "Historic Monument/Museum",
            "description": "Thessaloniki's iconic landmark, this cylindrical, six-storey tower is the most recognizable symbol of the city. Built in the 15th century during Ottoman rule, it served as a fortress, prison, and place of execution before being whitewashed in 1890. Today, it houses a museum that chronicles the history of Thessaloniki through interactive exhibits. The top floor offers a stunning 360° panoramic view of the city, sea, and on clear days, even Mount Olympus.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. Can get crowded during peak tourist season. The viewing platform may be windy.",
            "booking_tips": "Purchase tickets in advance online. Audio guides are available. Allow 1-2 hours for the museum and views. Located on the waterfront promenade, easily accessible from the city center.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 40.6263,
            "longitude": 22.9485
        },
        {
            "name": "Arch of Galerius (Kamara)",
            "type": "Ancient Monument",
            "description": "A triumphal arch commissioned by Roman Emperor Galerius in 303 AD to celebrate his victory over the Persians. Originally part of an imperial complex connecting his palace with the Rotunda. Of the four main pillars and four secondary ones, only two main and one secondary pillars remain today. The impressive marble reliefs depict battle scenes from Galerius' Persian campaign. Now surrounded by a vibrant student area with cafes and bars.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. The area around the arch becomes especially lively in the evenings when students gather.",
            "booking_tips": "No booking required. Best viewed as part of a walking tour of Thessaloniki's monuments. Can be combined with a visit to the nearby Rotunda. Located on Egnatia Street, a main artery through the city center.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 40.6316,
            "longitude": 22.9447
        },
        {
            "name": "Rotunda",
            "type": "Ancient Monument/Church",
            "description": "A massive circular structure built in the early 4th century AD as part of Emperor Galerius' palace complex. With its 30-meter-high dome (once pierced by an oculus similar to Rome's Pantheon), the building has served various functions throughout its history: Roman temple, Christian church, and mosque during Ottoman rule (with a minaret still standing outside). Inside, visitors can admire beautifully restored 5th-century Byzantine mosaics that adorn the dome and upper walls.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. The interior is cool and provides respite from summer heat.",
            "booking_tips": "Purchase tickets on site. Allow 30-60 minutes. Can be combined with the nearby Arch of Galerius. The acoustics inside are remarkable.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 5
            },
            "latitude": 40.6325,
            "longitude": 22.9453
        },
        {
            "name": "Archaeological Museum of Thessaloniki",
            "type": "Major Archaeological Museum",
            "description": "One of the most important museums in Greece, displaying artifacts from prehistory to late antiquity with special emphasis on Macedonia. The collections showcase the rich archaeological heritage of Northern Greece, including stunning gold Macedonian treasures, sculptures, pottery, jewelry, and daily life objects. Notable exhibits include finds from royal tombs and early Christian artifacts. The museum provides a comprehensive overview of the region's ancient civilizations.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled indoor environment. Open year-round with potential reduced hours in winter. School groups may make it busier on weekday mornings.",
            "booking_tips": "Allow 2-3 hours for a thorough visit. Audio guides available. Located near the International Trade Fair grounds and HELEXPO, a short distance from the city center. Combine with the nearby Byzantine Museum for a full day of cultural exploration.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 40.6272,
            "longitude": 22.9540
        },
        {
            "name": "Museum of Byzantine Culture",
            "type": "Historical Museum",
            "description": "This fascinating museum showcases the rich Byzantine heritage of Thessaloniki through well-designed thematic units. Exhibits include icons, mosaics, wall paintings, scriptures, jewelry, and everyday objects that help visitors understand the art, ideology, and evolution of Byzantine civilization. The museum's architecture is impressive in itself, designed to complement the artifacts and create an immersive experience. Informative panels provide historical context to the collections.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled indoor environment. Open year-round with potential seasonal hour changes.",
            "booking_tips": "Allow 1.5-2 hours. Audio guides available in multiple languages. Located near the Archaeological Museum, making it convenient to visit both in one day. The museum shop offers quality Byzantine-inspired items.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 5
            },
            "latitude": 40.6261,
            "longitude": 22.9559
        },
        {
            "name": "Church of Agios Dimitrios",
            "type": "Byzantine Church",
            "description": "A magnificent 7th-century basilica honoring Saint Dimitrios, the patron saint of Thessaloniki. Built on the site of Roman baths where the saint was martyred in 306 AD. For centuries, pilgrims came to venerate his relics, which are preserved in a sarcophagus in the crypt. The church features impressive mosaics, marble columns with finely carved capitals, and a stunning central chandelier. At 43 meters long, it's the largest sanctuary in Greece and a UNESCO World Heritage site.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. May have limited hours during services or religious holidays. Respectful dress (covered shoulders and knees) required.",
            "booking_tips": "No booking required. Allow 1 hour. The underground crypt showcases the site of the saint's martyrdom. Located in the northern part of the city center, easily reached on foot or by public transport.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 5
            },
            "latitude": 40.6374,
            "longitude": 22.9436
        },
        {
            "name": "Ano Poli (Upper Town)",
            "type": "Historic Neighborhood",
            "description": "The only part of Thessaloniki that survived the great fire of 1917, this charming old quarter preserves the city's Ottoman and Byzantine character. Winding cobblestone streets, traditional timber-framed houses with overhanging upper stories, and Byzantine churches create a picturesque atmosphere. The area is enclosed by the old city walls and includes notable sites like the Trigoniou Tower, the Monastery of Vlatadon, and the Church of Osios David. Offers spectacular panoramic views of the city and gulf.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Best explored in spring or autumn when temperatures are pleasant. Summer afternoons can be hot, but evening brings a refreshing breeze. Winter offers less crowded exploration but potentially rainy conditions.",
            "booking_tips": "Free to wander. Wear comfortable shoes for steep, uneven streets. Allow 2-3 hours to explore thoroughly. Can be reached by walking uphill from the city center or taking a bus. Consider a guided walking tour to learn about the area's rich history.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 40.6415,
            "longitude": 22.9494
        },
        {
            "name": "Aristotelous Square",
            "type": "Central Square/Waterfront",
            "description": "The heart of modern Thessaloniki, this elegant square was designed by French architect Ernest Hébrard after the great fire of 1917. Lined with beautiful buildings housing cafes, hotels, and shops, it extends from the waterfront to Egnatia Street. The square offers views of the Thermaic Gulf and is the city's main gathering place for events, celebrations, and protests. Its distinctive architecture blends Byzantine and Western elements, creating a unique sense of place.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Free",
            "seasonal_notes": "Bustling year-round. Especially lively during holidays and festivals. Summer evenings bring a vibrant atmosphere with street performers and outdoor dining.",
            "booking_tips": "Free to visit. The surrounding cafes offer perfect people-watching opportunities but can be pricey compared to establishments further from the center. The square is a common meeting point and starting place for walking tours.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 3
            },
            "latitude": 40.6329,
            "longitude": 22.9431
        },
        {
            "name": "Roman Forum (Ancient Agora)",
            "type": "Archaeological Site",
            "description": "The political, commercial, and social center of Roman-era Thessaloniki, excavated in 1966. Built in the 2nd-3rd centuries AD at the intersection of the city's main streets. Features include a restored Odeon (theater), a partially preserved colonnaded square (stoa), and the fascinating Cryptoporticus - underground corridors built into the natural slope. An on-site museum displays artifacts discovered during excavations and provides historical context about the forum's role in ancient city life.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. The site is largely uncovered, so best visited in cooler morning hours during summer. The museum offers indoor respite.",
            "booking_tips": "Purchase tickets on site. Allow 1-1.5 hours. Located in the heart of the city near Aristotelous Square. Particularly interesting for those interested in ancient urban planning and Roman architecture.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 40.6345,
            "longitude": 22.9412
        },
        {
            "name": "Thessaloniki Waterfront Promenade",
            "type": "Urban Promenade/Recreation",
            "description": "A beautifully renovated 5-kilometer coastal walkway extending from the port to the Concert Hall. This award-winning public space transformation project features distinct thematic gardens, public art installations, cycling paths, and recreational areas. The promenade offers stunning views of the Thermaic Gulf and Mount Olympus on clear days. Popular with joggers, cyclists, families, and those looking for a leisurely stroll. Lined with cafes and restaurants, particularly vibrant at sunset.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round. Summer evenings bring cooling sea breezes. Winter promenades can be brisk but beautiful on sunny days. Spring and autumn offer ideal temperatures for walking.",
            "booking_tips": "Free to access. Bicycle rentals available along the route. The stretch between the White Tower and Aristotelous Square is most developed with amenities. Sunset walks are particularly rewarding with views of the changing colors over the gulf.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 2
            },
            "latitude": 40.6276,
            "longitude": 22.9457
        },
        {
            "name": "Ladadika District",
            "type": "Historic Neighborhood/Entertainment",
            "description": "Once the city's old market area and oil stores (Ladadika means 'oil shops'), this colorful district near the port has been revitalized into Thessaloniki's premier entertainment hub. Pedestrianized streets wind between restored 19th-century buildings housing tavernas, bars, clubs, and restaurants. The neighborhood maintains its historic character with neoclassical facades and cobblestone streets while offering modern dining and nightlife. A lively district that showcases the city's famous food and music scene.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Area is accessible year-round. Most vibrant in evenings and at night. Restaurants and bars have indoor and outdoor seating depending on season. Summer brings al fresco dining and street music.",
            "booking_tips": "Free to explore. Restaurant reservations recommended for dinner, especially on weekends. The area becomes increasingly lively after 9pm. Located near the port and Aristotelous Square, easily accessible from most central hotels.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3.0,
                "cultural_significance": 3
            },
            "latitude": 40.6334,
            "longitude": 22.9390
        },
        {
            "name": "Jewish Museum of Thessaloniki",
            "type": "Cultural/Historical Museum",
            "description": "A small but powerful museum documenting the rich history of Thessaloniki's once-thriving Sephardic Jewish community, which flourished for 450 years until WWII. Exhibits include religious artifacts, photographs, documents, and personal items that trace the community's history, culture, and traditions. The Holocaust Memorial Room pays tribute to the thousands of Thessaloniki Jews who perished in concentration camps. The museum preserves the legacy of a community that once made up nearly half the city's population.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Budget",
            "seasonal_notes": "Climate-controlled indoor environment. Open year-round with possible limited hours on holidays.",
            "booking_tips": "No advance booking required. Allow 1-1.5 hours. Located on Agiou Mina Street in the city center. Staff can provide additional historical context. A moving experience that highlights an often-overlooked aspect of the city's multicultural past.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 4
            },
            "latitude": 40.6345,
            "longitude": 22.9401
        },
        {
            "name": "Modiano Market",
            "type": "Historic Market/Food Hall",
            "description": "A covered market built in 1922 by architect Eli Modiano, recently renovated to blend historical character with modern amenities. This cross-shaped market features dozens of stalls selling local products, from fresh fish and meat to spices, cheese, olives, and regional specialties. The renovation added new restaurants and bars, making it a culinary destination that showcases Thessaloniki's famous food scene. The market provides a glimpse into local daily life while offering visitors authentic food experiences.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. Most active in mornings when produce and goods are freshest. Food vendors and restaurants have longer hours. Sheltered location makes it a good rainy day option.",
            "booking_tips": "Free to enter. Come hungry to sample local specialties. Busiest on Saturdays. Located in the commercial heart of the city, near Aristotelous Square. Combine with visits to nearby Kapani Market and Bit Bazaar for a comprehensive market experience.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 40.6347,
            "longitude": 22.9414
        },
        {
            "name": "Museum of Photography",
            "type": "Art Museum",
            "description": "Housed in a renovated warehouse at the port, this museum presents historical and contemporary photography exhibitions in Greece's only dedicated photography museum. Founded in 1997, it showcases work from Greek and international photographers through rotating exhibitions. The museum also organizes the Thessaloniki PhotoBiennale, a major international photography festival. Its industrial setting by the water adds to the atmospheric experience of viewing thought-provoking photographic works.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Budget",
            "seasonal_notes": "Climate-controlled indoor environment. Check website for current exhibitions and special events, which change regularly.",
            "booking_tips": "No advance booking required. Allow 1 hour. Located at Warehouse A in the port area, at the beginning of the waterfront promenade. The museum cafe offers views of the harbor. Be aware that exhibition content changes frequently.",
            "ratings": {
                "cost_estimate": 4,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 3
            },
            "latitude": 40.6328,
            "longitude": 22.9341
        },
        {
            "name": "Heptapyrgion (Yedi Kule)",
            "type": "Byzantine Fortress/Prison",
            "description": "A Byzantine and Ottoman fortress complex that crowns the highest point of Thessaloniki's old town walls. Originally built to strengthen the city's defenses, it later served as a notorious prison until 1989. The name means 'Fortress of Seven Towers' in Greek and Turkish, though it actually contains ten towers. Visitors can explore the restored fortifications, prison cells, and courtyards while enjoying panoramic views of the city, the gulf, and the surrounding mountains.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. Early mornings offer the best light for photography and views. Can be hot in summer due to exposed location and uphill walk.",
            "booking_tips": "Purchase tickets on site. Allow 1.5 hours including walking time. Located at the highest point of Ano Poli (Upper Town). Comfortable shoes recommended for the uphill approach. Can be combined with exploration of the old town walls and Byzantine churches in Ano Poli.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 40.6446,
            "longitude": 22.9505
        }
    ],
    "destinations": [
        {
            "city": "Athens",
            "country": "Greece",
            "whyGo": "The Greek capital featuring the Acropolis, Parthenon, National Archaeological Museum, Ancient Agora, and vibrant neighborhoods like Plaka. The historic and cultural heart of Greece with world-class archaeological sites and museums.",
            "directWithinCountryTrain": {
                "stationInThessaloniki": "Thessaloniki Railway Station (New Railway Station)",
                "journeyTime": "Approx. 4-5 hours (InterCity Express)",
                "frequency": "Several trains daily"
            },
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                "journeyTime": "Approx. 5-6 hours",
                "frequency": "Frequent daily services"
            },
            "intraGreeceFlight": {
                "airportInThessaloniki": "Thessaloniki International Airport (SKG)",
                "approxFlightTime": "Approx. 55 minutes",
                "frequency": "Multiple flights daily"
            }
        },
        {
            "city": "Meteora (Kalabaka)",
            "country": "Greece",
            "whyGo": "Marvel at the breathtaking UNESCO World Heritage site featuring monasteries perched dramatically atop towering rock pillars. A unique combination of natural beauty and spiritual history.",
            "directWithinCountryTrain": {
                "stationInThessaloniki": "Thessaloniki Railway Station (New Railway Station)",
                "journeyTime": "Approx. 2-3 hours (to Kalabaka)",
                "frequency": "Several trains daily"
            },
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                "journeyTime": "Approx. 2.5-3 hours (to Kalabaka)",
                "frequency": "Several buses daily"
            },
            "guidedTour": {
                "departsFrom": "Thessaloniki city center",
                "journeyTime": "Full-day tour (approx. 8 hours)",
                "frequency": "Regular tours available through operators"
            }
        },
        {
            "city": "Mount Olympus (Litochoro)",
            "country": "Greece",
            "whyGo": "Visit the legendary home of the Greek gods, Greece's highest mountain. Explore hiking trails, stunning gorges, alpine landscapes, and the charming town of Litochoro at its base.",
            "directWithinCountryTrain": {
                "stationInThessaloniki": "Thessaloniki Railway Station (New Railway Station)",
                "journeyTime": "Approx. 1-1.5 hours (to Litochoro)",
                "frequency": "Several trains daily"
            },
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                "journeyTime": "Approx. 1.5 hours (to Litochoro)",
                "frequency": "Several buses daily"
            },
            "guidedTour": {
                "departsFrom": "Thessaloniki city center",
                "journeyTime": "Full-day tour (approx. 10 hours)",
                "frequency": "Regular tours available, especially in summer"
            }
        },
        {
            "city": "Halkidiki",
            "country": "Greece",
            "whyGo": "Explore the three peninsular 'fingers' of Kassandra, Sithonia and Mount Athos, known for beautiful beaches, clear turquoise waters, pine forests, traditional villages, and the historic monastic community.",
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Halkidiki Bus Terminal",
                "journeyTime": "Approx. 1-2 hours (depending on destination)",
                "frequency": "Frequent buses, especially in summer"
            },
            "guidedTour": {
                "departsFrom": "Thessaloniki city center",
                "journeyTime": "Full-day tours available",
                "frequency": "Daily tours during summer season"
            }
        },
        {
            "city": "Vergina (Aigai)",
            "country": "Greece",
            "whyGo": "Visit the UNESCO World Heritage archaeological site featuring the royal tombs of Macedonian kings, including Philip II (father of Alexander the Great). Explore well-preserved tombs, exceptional gold artifacts, and the excellent museum.",
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                "journeyTime": "Approx. 1 hour",
                "frequency": "Several buses daily"
            },
            "guidedTour": {
                "departsFrom": "Thessaloniki city center",
                "journeyTime": "Half-day tour (5-6 hours)",
                "frequency": "Regular tours available through operators"
            }
        },
        {
            "city": "Philippi",
            "country": "Greece",
            "whyGo": "Explore the UNESCO World Heritage archaeological site with well-preserved Roman and Byzantine ruins. Famous for its connection to Apostle Paul, who established the first Christian church in Europe here.",
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                "journeyTime": "Approx. 2-2.5 hours (to Kavala, then local bus)",
                "frequency": "Several buses daily"
            },
            "guidedTour": {
                "departsFrom": "Thessaloniki city center",
                "journeyTime": "Full-day tour (approx. 10 hours)",
                "frequency": "Regular tours available"
            }
        },
        {
            "city": "Pella",
            "country": "Greece",
            "whyGo": "Visit the birthplace of Alexander the Great and capital of ancient Macedonia. Explore the archaeological site featuring impressive mosaics, ancient city layout, and the museum housing artifacts from the Macedonian kingdom.",
            "directWithinCountryBus": {
                "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                "journeyTime": "Approx. 45 minutes",
                "frequency": "Several buses daily"
            },
            "guidedTour": {
                "departsFrom": "Thessaloniki city center",
                "journeyTime": "Half-day tour (4-5 hours)",
                "frequency": "Regular tours available"
            }
        },
        {
            "city": "Istanbul",
            "country": "Turkey",
            "whyGo": "Discover the city where East meets West, featuring Hagia Sophia, the Blue Mosque, Topkapi Palace, the Grand Bazaar, Spice Market, and a cruise on the Bosphorus.",
            "intraEuropeFlight": {
                "airportInThessaloniki": "Thessaloniki International Airport (SKG)",
                "approxFlightTime": "Approx. 1 hour",
                "frequency": "Several flights weekly"
            },
            "directInternationalBus": {
                "stationInThessaloniki": "Thessaloniki Bus Station",
                "journeyTime": "Approx. 7-8 hours",
                "frequency": "Daily services"
            }
        },
        {
            "city": "Sofia",
            "country": "Bulgaria",
            "whyGo": "Explore Bulgaria's capital featuring the Alexander Nevsky Cathedral, historic churches, communist-era architecture, vibrant markets, and the nearby Vitosha Mountain.",
            "intraEuropeFlight": {
                "airportInThessaloniki": "Thessaloniki International Airport (SKG)",
                "approxFlightTime": "Approx. 45 minutes",
                "frequency": "Several flights weekly"
            },
            "directInternationalBus": {
                "stationInThessaloniki": "Thessaloniki Bus Station",
                "journeyTime": "Approx. 3.5-4 hours",
                "frequency": "Daily services"
            }
        },
        {
            "city": "Skopje",
            "country": "North Macedonia",
            "whyGo": "Visit North Macedonia's capital with its unique blend of Ottoman, Byzantine and modern architecture, the Stone Bridge, Old Bazaar, Kale Fortress, and the controversial 'Skopje 2014' urban renewal project.",
            "directInternationalBus": {
                "stationInThessaloniki": "Thessaloniki Bus Station",
                "journeyTime": "Approx. 3-3.5 hours",
                "frequency": "Daily services"
            }
        },
        {
            "city": "Ohrid",
            "country": "North Macedonia",
            "whyGo": "Discover the UNESCO-listed Lake Ohrid and historic town featuring beautiful churches, fortress ruins, pristine waters, and a charming Old Town with traditional architecture.",
            "directInternationalBus": {
                "stationInThessaloniki": "Thessaloniki Bus Station",
                "journeyTime": "Approx. 4-4.5 hours",
                "frequency": "Several services weekly"
            }
        },
        {
            "city": "Thassos",
            "country": "Greece",
            "whyGo": "Enjoy the northernmost Greek island with beautiful beaches, mountain landscapes, marble quarries, traditional villages, and archaeological sites including an ancient agora and theater.",
            "combinedJourney": {
                "busFromThessaloniki": {
                    "stationInThessaloniki": "KTEL Macedonia Bus Terminal",
                    "journeyToPort": "Approx. 2 hours (to Keramoti)",
                    "frequency": "Several buses daily"
                },
                "ferryFromKeramoti": {
                    "journeyTime": "Approx. 35-40 minutes",
                    "frequency": "Frequent daily crossings"
                }
            }
        }
    ]
}