{
  "overview_paragraph": "Genoa is at its best in spring (April–June) and early fall (September–October), when pleasant temperatures make exploring the historic center ideal, maritime gardens bloom with spring flowers, and the cultural scene buzzes with fresh seasonal exhibitions. July brings warm evenings perfect for dining in piazzas and cultural festivals—though some areas can be crowded; August offers a more relaxed atmosphere with fewer crowds. Winter (November–February) is cozy and atmospheric—ideal for museum visits, Renaissance palace tours, and enjoying the city's famous Ligurian cuisine in warm trattorias—while March begins to warm with spring blossoms and the return of vibrant cultural life to the historic center.",
  "January": [
    "Palazzo Reale without the crowds, steaming Ligurian hot chocolate in historic cafés, and misty walks between cozy local shops in the historic center.",
    "Winter light on the cathedral, snug trattorias in the historic center, and vintage hunts in the covered markets."
  ],
  "February": [
    "Piazza De Ferrari at golden hour, romantic views from Spianata Castelletto, and traditional Ligurian music nights in local venues.",
    "Shared local pastries, candlelit trattorias, and strolls past secret courtyards in the Old Town."
  ],
  "March": [
    "First spring blossoms along the Mediterranean waterfront, terrace tables returning around Piazza De Ferrari, and historic center bookshop wanders.",
    "Morning cornetto, museum afternoons, and blue-hour walks welcoming spring back to Genoa."
  ],
  "April": [
    "Wildflowers in bloom around Piazza San Lorenzo, flaky Ligurian pastries, and walks from the historic center to Porto Antico.",
    "Spring light on the cathedral, gallery-hopping in the historic center, sunset views from Spianata Castelletto."
  ],
  "May": [
    "Picnics in Palazzo Reale gardens, markets brimming with local color, and twilight strolls along the Mediterranean waterfront.",
    "Flowered courtyards, open-air café moments around Piazza De Ferrari, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, piazza aperitivos around the historic center, and the city humming with cultural festival celebrations.",
    "Sun-splashed Renaissance façades, garden picnics, and late sunsets that turn every viewpoint into a postcard."
  ],
  "July": [
    "Summer festival fireworks over Porto Antico, lazy afternoons in the Palazzo Reale gardens, and moonlit walks through the historic center.",
    "Summer markets, piazza terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet historic areas, easy museum days, and Mediterranean evenings with breezes through the Renaissance streets.",
    "Shaded porticoes, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh cultural exhibits, lively piazza terraces, and vineyard-tinted evenings in the historic center.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering irresistible."
  ],
  "October": [
    "Autumn colors along the Mediterranean waterfront, restaurants aglow, and the local food harvest festival in the historic center.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the historic center."
  ],
  "November": [
    "Local wine toasts, cozy trattorias, and Palazzo Reale afternoons while the city slows to a hush.",
    "Foggy Mediterranean mornings, Renaissance antiquities indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Historic center lights, Christmas markets at Piazza De Ferrari, and strolling beneath grand Renaissance façades.",
    "Vin brulé in hand, Cathedral bells, and winter sparkle from piazza to boutique passage."
  ]
}

