{
    "Spring": {
        "activities": [
            {
                "name": "Settimana Santa (Holy Week Processions)",
                "type": "Religious Tradition",
                "description": "Experience deeply traditional and often dramatic religious processions winding through the historic streets of Palermo and nearby towns during the week leading up to Easter.",
                "indoor": false,
                "best_time": "Evening (main processions)",
                "price_range": "Free",
                "seasonal_notes": "A major cultural and religious event in Sicily. Dates vary based on Easter. Processions can be solemn and crowded.",
                "booking_tips": "Check local schedules for specific procession routes and times. Be respectful of the religious nature."
            },
            {
                "name": "Visit to Monreale Cathedral & Cloisters",
                "type": "Cultural/Sightseeing",
                "description": "Take a day trip to nearby Monreale to see the stunning Norman cathedral and cloisters, particularly beautiful in the spring light.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Low (transport/entry)",
                "seasonal_notes": "Pleasant weather for the trip and exploring the town. Gardens are blooming.",
                "booking_tips": "Easily accessible by bus from Palermo. Purchase cathedral/cloister tickets on site or potentially online."
            },
            {
                "name": "Stroll through Villa Giulia & Botanical Gardens",
                "type": "Outdoor Activity/Sightseeing",
                "description": "Enjoy Palermo's historic public garden and adjacent botanical gardens as flowers come into bloom.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free (Villa Giulia) / Low (Botanical Gardens)",
                "seasonal_notes": "Spring brings lush greenery and blooming flowers, making it the ideal time to visit.",
                "booking_tips": "Check opening hours for the Botanical Gardens. Villa Giulia is a public park."
            },
            {
                "name": "Explore Outdoor Markets (Ballarò, Capo)",
                "type": "Cultural/Food & Drink",
                "description": "Wander through Palermo's vibrant outdoor markets, enjoying the seasonal spring produce like artichokes and fava beans.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (to browse) / Low-Moderate (purchases)",
                "seasonal_notes": "Markets are bustling with fresh spring vegetables and a lively atmosphere.",
                "booking_tips": "Go early for the best selection and atmosphere. Be prepared for crowds."
            },
            {
                "name": "May Day (Primo Maggio) Activities",
                "type": "Local Holiday/Event",
                "description": "Experience local traditions for Labor Day (May 1st), which often involves picnics, outings to the countryside, or special events in the city.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free to Moderate",
                "seasonal_notes": "May 1st is a public holiday. Many shops may be closed, but parks and outdoor spaces are popular.",
                "booking_tips": "Check for specific local events announced closer to the date."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Festino di Santa Rosalia",
                "type": "Religious Festival/Cultural Event",
                "description": "Palermo's most important festival celebrating its patron saint, Santa Rosalia. Features a grand procession with a triumphal chariot, fireworks, music, and street food.",
                "indoor": false,
                "best_time": "Evening (July 14th is main night)",
                "price_range": "Free",
                "seasonal_notes": "Peak celebration occurs July 10-15, culminating on the night of the 14th. Very crowded and lively.",
                "booking_tips": "Find a viewing spot early, especially along the procession route (Cassaro/Foro Italico). Be prepared for huge crowds."
            },
            {
                "name": "Mondello Beach Days",
                "type": "Leisure/Outdoor Activity",
                "description": "Spend time at Palermo's famous sandy beach, swimming, sunbathing, and enjoying the seaside atmosphere.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free (public beach) / Moderate (Lido rentals)",
                "seasonal_notes": "Summer is peak season for Mondello. Expect large crowds, especially on weekends. Water is warm.",
                "booking_tips": "Take bus 806 from Politeama. Go early to secure a spot, especially on weekends. Renting chairs/umbrella at a lido offers convenience."
            },
            {
                "name": "World Festival on the Beach (Mondello)",
                "type": "Sports/Music Festival",
                "description": "An international event held in Mondello featuring watersports competitions (windsurf, kitesurf), beach volleyball, music, and food stands.",
                "indoor": false,
                "best_time": "All Day/Evening",
                "price_range": "Free (to watch)",
                "seasonal_notes": "Typically held in late May or June, marking the start of the summer beach season. Lively atmosphere.",
                "booking_tips": "Check official dates annually. Events centered around Piazza Valdesi and the beach."
            },
            {
                "name": "Outdoor Concerts and Cinema",
                "type": "Entertainment/Cultural",
                "description": "Enjoy open-air concerts, film screenings, and theater performances often held in historic courtyards or parks as part of summer arts festivals ('Palermo Estate').",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Various locations host events throughout summer. Check local listings ('Palermo Estate' programs).",
                "booking_tips": "Some events may require advance ticket purchase. Check schedules online or at tourist info points."
            },
            {
                "name": "Sicilian Jazz Festival",
                "type": "Music Festival",
                "description": "Major jazz festival featuring international and Italian artists performing in various venues across Palermo.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free to Expensive (depending on venue/artist)",
                "seasonal_notes": "Usually held over several weeks in July/August. Features big names and local talent.",
                "booking_tips": "Check the official festival schedule and book tickets for headline acts well in advance."
            },
            {
                "name": "Evening Passeggiata & Granita",
                "type": "Cultural/Food & Drink",
                "description": "Join locals for the traditional evening stroll (passeggiata) along main streets like Via Maqueda or the Foro Italico promenade, followed by a refreshing granita.",
                "indoor": false,
                "best_time": "Early Evening",
                "price_range": "Low (for granita)",
                "seasonal_notes": "A quintessential Italian summer evening ritual. Perfect way to cool down and people-watch.",
                "booking_tips": "No booking needed. Find a good gelateria/bar for granita (lemon, almond, coffee are classics)."
            },
            {
                "name": "Boat Trip along the Coast",
                "type": "Outdoor Activity/Leisure",
                "description": "Take a boat tour from Palermo's ports (Cala, Mondello) to explore nearby coves, swim in clear waters, and see the coastline from the sea.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate to High",
                "seasonal_notes": "Ideal summer activity to escape the city heat and enjoy the sea.",
                "booking_tips": "Various tour operators offer trips. Book in advance, especially in July/August. Options range from short trips to full-day excursions."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Le Vie dei Tesori (Treasures' Ways)",
                "type": "Cultural Festival",
                "description": "A major cultural event where hundreds of normally inaccessible historical sites, palaces, churches, and gardens across Palermo open their doors to the public.",
                "indoor": true,
                "best_time": "Weekends (All Day)",
                "price_range": "Low (per site or via pass)",
                "seasonal_notes": "Typically held over several weekends in September/October. Incredible opportunity for cultural discovery.",
                "booking_tips": "Check the official program released annually. Purchase a pass for multiple entries. Some sites require booking specific time slots."
            },
            {
                "name": "Theater and Opera Season Opening",
                "type": "Performance/Cultural",
                "description": "Attend the opening performances of the new season at Palermo's prestigious theaters like Teatro Massimo and Teatro Politeama.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "The main cultural seasons typically kick off in the autumn months.",
                "booking_tips": "Book tickets well in advance for popular opera or theater productions. Check theater websites for schedules."
            },
            {
                "name": "Hiking in Nearby Nature Reserves (Zingaro, Madonie)",
                "type": "Outdoor Activity",
                "description": "Take advantage of the cooler autumn weather for hiking in beautiful nature reserves accessible as day trips from Palermo.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Low (transport/entry)",
                "seasonal_notes": "Autumn offers ideal temperatures for hiking, less crowded trails than summer. Scenery can be beautiful with autumn colors.",
                "booking_tips": "Requires own transport or organized tour. Check reserve opening times and trail conditions."
            },
            {
                "name": "Visit Indoor Museums & Galleries",
                "type": "Cultural/Sightseeing",
                "description": "Explore Palermo's rich museum collections, such as the Salinas Archaeological Museum or the Galleria d'Arte Moderna, during pleasant autumn days.",
                "indoor": true,
                "best_time": "Anytime during opening hours",
                "price_range": "Low to Moderate",
                "seasonal_notes": "Good activity for potentially rainier autumn days. Less crowded than summer.",
                "booking_tips": "Check opening hours. Consider combined museum passes if available."
            },
            {
                "name": "Wine Tasting in Western Sicily",
                "type": "Food & Drink",
                "description": "Explore the wine regions west of Palermo (e.g., around Marsala, Alcamo) during or just after the harvest season.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate to High (transport/tastings)",
                "seasonal_notes": "Autumn is the wine harvest season ('vendemmia'), offering a chance to see vineyards in action or taste new wines.",
                "booking_tips": "Requires own transport or organized wine tour. Book winery visits and tastings in advance."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets & Decorations",
                "type": "Festival/Shopping",
                "description": "Explore festive Christmas markets set up in various squares (e.g., Piazza Castelnuovo/Politeama) and enjoy the holiday lights and decorations along main streets.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Free (to browse) / Low-Moderate (purchases)",
                "seasonal_notes": "Markets typically run from early December through Epiphany (Jan 6). Atmosphere is festive, especially in the evenings.",
                "booking_tips": "No booking needed. Good place to find local crafts and sweets."
            },
            {
                "name": "New Year's Eve Celebrations",
                "type": "Festival/Entertainment",
                "description": "Join public celebrations for New Year's Eve, often featuring a large concert and fireworks display in Piazza Politeama or near Teatro Massimo.",
                "indoor": false,
                "best_time": "Late Evening (Dec 31st)",
                "price_range": "Free (public event)",
                "seasonal_notes": "Large crowds gather for the main public concert and countdown. Restaurants offer special 'cenone' dinners.",
                "booking_tips": "Arrive early for a good spot at the public concert. Book New Year's Eve dinner reservations far in advance."
            },
            {
                "name": "Presepi Viventi (Living Nativities)",
                "type": "Cultural/Religious Tradition",
                "description": "Visit traditional living nativity scenes ('presepi viventi') often staged in historic settings in Palermo or nearby towns during the Christmas season.",
                "indoor": false,
                "best_time": "Evening (check specific times)",
                "price_range": "Free or Low Entry Fee",
                "seasonal_notes": "A charming Sicilian Christmas tradition. Usually runs from mid-December to early January.",
                "booking_tips": "Check local listings for locations and opening times. Some are quite elaborate."
            },
            {
                "name": "Opera and Concert Season",
                "type": "Performance/Cultural",
                "description": "Enjoy the main season for opera, ballet, and classical music concerts at Teatro Massimo and other venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Winter is the peak season for indoor performing arts.",
                "booking_tips": "Book tickets well in advance, especially for popular performances or during holidays."
            },
            {
                "name": "Carnival (Carnevale) Events",
                "type": "Festival",
                "description": "Experience local Carnival celebrations (dates vary, late winter/early spring) which may include parades, costumes, and special sweets.",
                "indoor": false,
                "best_time": "Afternoon/Evening (main events)",
                "price_range": "Free",
                "seasonal_notes": "Celebrations leading up to Ash Wednesday. Intensity varies year to year.",
                "booking_tips": "Check local announcements for specific dates and events related to Carnevale."
            },
            {
                "name": "Visit Museums on Cooler Days",
                "type": "Cultural/Sightseeing",
                "description": "Take advantage of cooler winter weather to explore Palermo's indoor attractions like Palazzo dei Normanni, museums, and churches without the summer heat.",
                "indoor": true,
                "best_time": "Anytime during opening hours",
                "price_range": "Low to Moderate",
                "seasonal_notes": "Comfortable temperatures for extensive indoor sightseeing. Fewer crowds than peak season.",
                "booking_tips": "Check opening hours, which might be reduced slightly in the off-season."
            }
        ]
    }
} 