{
    "February": {
        "reasons_to_visit": [
            {
                "reason": "Peak Winter Sports Season",
                "details": "February offers some of the best snow conditions. Access numerous ski resorts around Innsbruck (like Nordkette, Axamer Lizum, Patscherkofel) via the SKI plus CITY pass for skiing, snowboarding, tobogganing, and winter hiking."
            },
            {
                "reason": "Tyrolean Fasching (Carnival)",
                "details": "Depending on the year's calendar, experience traditional Tyrolean carnival celebrations with parades, costumes, and festive events, especially leading up to Fasching Tuesday."
            },
            {
                "reason": "Fewer City Crowds",
                "details": "Compared to summer or December, the city's historical sights (Golden Roof, Hofburg) are less crowded, allowing for more relaxed exploration."
            },
            {
                "reason": "Stunning Snowy Alpine Scenery",
                "details": "Enjoy breathtaking panoramic views of snow-covered mountains from vantage points like the Nordkette cable car or while participating in winter activities."
            },
            {
                "reason": "Cozy Indoor Activities",
                "details": "Warm up in museums like the Tyrolean State Museum, Ambras Castle, or enjoy traditional Austrian coffee houses after exploring in the cold."
            },
            {
                "reason": "Potential for Off-Peak Pricing",
                "details": "Outside of major school holidays or Fasching peak times, you might find better deals on accommodation compared to prime seasons."
            },
            {
                "reason": "Variety of Winter Activities",
                "details": "Beyond skiing, enjoy snowshoeing, exploring cleared winter hiking trails, ice skating, or visiting indoor attractions like Swarovski Crystal Worlds."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cold Winter Weather",
                "details": "February is reliably cold, often below freezing, with frequent snowfall and overcast days possible. Requires proper winter clothing."
            },
            {
                "reason": "Peak Ski Season Crowds/Prices",
                "details": "While the city might be quieter, ski resorts, ski buses, and associated accommodation can be very busy and expensive, especially during school holidays."
            },
            {
                "reason": "Shorter Daylight Hours",
                "details": "Days are still relatively short, limiting time for outdoor activities in daylight, although many ski areas offer floodlit activities."
            },
            {
                "reason": "Some Mountain Trails Inaccessible",
                "details": "High-altitude summer hiking trails are closed due to snow; winter activities are confined to marked/prepared routes or require specific gear/knowledge."
            }
        ],
        "first_half": {
            "date_range": "February 1–14",
            "weather": {
                "average_temperature": {
                    "high": "4°C",
                    "low": "-4°C"
                },
                "precipitation": "Cold with frequent chances of snow, especially accumulating in the mountains. City snow possible but may melt/refreeze. Overcast days common, but sunny spells occur.",
                "general_tips": "Essential gear: Warm layers (thermals, fleece), waterproof/windproof winter coat, insulated waterproof boots, hat, gloves, scarf. Sunscreen/sunglasses needed for sunny days on snow."
            },
            "tourism_level": {
                "crowds": "Moderate in the city, but high season in ski resorts. Can be very busy if school holidays fall in this period.",
                "pricing": "Off-peak for city stays unless coinciding with holidays/events. Peak season pricing for ski resort accommodation and passes.",
                "overall_atmosphere": "Winter sports focus. City is relatively calm, mountains are active. Cozy indoor atmosphere."
            },
            "events_holidays": [
                {
                    "name": "Fasching (Carnival) Season Begins",
                    "date": "Events may start ramping up (date varies yearly)",
                    "description": "Look out for early carnival events, balls, or traditional Tyrolean Fasching customs in Innsbruck and surrounding villages.",
                    "notes": "Check local event calendars closer to the date as Fasching dates depend on Easter."
                },
                {
                    "name": "Valentine's Day",
                    "date": "February 14",
                    "description": "Restaurants may offer special dinners, but it's not a major public event.",
                    "notes": "Book popular restaurants in advance if planning a special meal."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Skiing/Snowboarding at Axamer Lizum",
                    "where": "Axamer Lizum Ski Resort",
                    "description": "Enjoy the slopes of this large resort near Innsbruck, known for its Olympic history and varied terrain.",
                    "practical_tips": "Accessible by free ski bus (with pass/gear). Check lift status and snow report. Rentals available.",
                    "best_time": "Daytime",
                    "estimated_cost": "€50-€70 (Day ski pass) + Rental",
                    "weather_dependent": true
                },
                {
                    "activity": "Ride the Nordkette Cable Car",
                    "where": "Nordkettenbahnen",
                    "description": "Ascend directly from the city for stunning winter panoramas over Innsbruck and the Inn Valley.",
                    "practical_tips": "Dress very warmly. Check webcams for visibility. Included in SKI plus CITY pass.",
                    "best_time": "Clear mornings/early afternoons",
                    "estimated_cost": "€35-€45 (round trip to Hafelekar)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore the Old Town & Golden Roof",
                    "where": "Altstadt",
                    "description": "Wander through the historic center, admire the Golden Roof possibly dusted with snow, and enjoy the quieter atmosphere compared to peak seasons.",
                    "practical_tips": "Wear warm shoes with good grip. Pop into cafes to warm up.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (exterior viewing)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Swarovski Crystal Worlds",
                    "where": "Wattens",
                    "description": "A great indoor excursion to see the imaginative crystal installations and Chambers of Wonder.",
                    "practical_tips": "Take the shuttle bus from Innsbruck. Allow 2-3 hours. Book tickets online.",
                    "best_time": "Anytime",
                    "estimated_cost": "€20-€25 (entry) + Shuttle",
                    "weather_dependent": false
                },
                {
                    "activity": "Winter Hike on Patscherkofel",
                    "where": "Patscherkofel Mountain",
                    "description": "Take the cable car up and walk on prepared winter hiking trails with views towards the Stubai Valley.",
                    "practical_tips": "Check cable car operating times and trail conditions. Wear sturdy winter boots.",
                    "best_time": "Morning/Early Afternoon",
                    "estimated_cost": "Cable car fare (€25-€35 round trip) + Free trail",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Ambras Castle",
                    "where": "Schloss Ambras",
                    "description": "Explore the collections and Renaissance architecture of this castle on the edge of Innsbruck.",
                    "practical_tips": "Check winter opening hours. Accessible by public transport.",
                    "best_time": "During opening hours",
                    "estimated_cost": "€10-€16",
                    "weather_dependent": false
                },
                {
                    "activity": "Ice Skating",
                    "where": "Various locations (e.g., Olympiaworld, local rinks)",
                    "description": "Enjoy ice skating at indoor or potentially outdoor rinks.",
                    "practical_tips": "Check public skating times and locations. Rentals usually available.",
                    "best_time": "Afternoon/Evening",
                    "estimated_cost": "€5-€15 (entry + rental)",
                    "weather_dependent": false
                },
                {
                    "activity": "Warm up with Tyrolean Food",
                    "where": "Traditional Gasthäuser",
                    "description": "Enjoy hearty local dishes like Tiroler Gröstl, Kasspatzln, or Germknödel in a cozy setting.",
                    "practical_tips": "Look for restaurants serving local cuisine ('Tiroler Küche'). Reservations recommended for popular spots.",
                    "best_time": "Lunch or Dinner",
                    "estimated_cost": "€15-€30 per main course",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "February 15–28/29",
            "weather": {
                "average_temperature": {
                    "high": "6°C",
                    "low": "-3°C"
                },
                "precipitation": "Still cold, potential for snow remains high, but slightly longer days and potentially more sunshine towards the end of the month. Foehn wind can bring sudden thaws.",
                "general_tips": "Continue with full winter gear. Be prepared for variable conditions, from snowstorms to bright sun or mild Foehn winds."
            },
            "tourism_level": {
                "crowds": "Can be very busy if Fasching week/Tuesday falls here, or during peak school holiday periods. Otherwise, moderate in city, busy in resorts.",
                "pricing": "Prices may spike during Fasching or school holidays, otherwise remain typical for ski season.",
                "overall_atmosphere": "Can be very lively and festive during Fasching, otherwise focused on winter sports."
            },
            "events_holidays": [
                {
                    "name": "Fasching Tuesday (Shrove Tuesday)",
                    "date": "Date varies (can be late Feb)",
                    "description": "Climax of the Carnival season. Expect major parades (check locations like Innsbruck city center or nearby villages like Axams), parties, and traditional customs.",
                    "notes": "Confirm dates and event locations. Very crowded. Costumes encouraged! Some shops may close early."
                },
                {
                    "name": "End of Semester School Holidays",
                    "date": "Often falls in February (dates vary by region/year)",
                    "description": "Austrian school holidays can lead to significantly busier ski resorts and potentially higher prices.",
                    "notes": "Check Austrian school holiday calendars if planning around this period."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Tyrolean Fasching Parade",
                    "where": "Innsbruck City Center or nearby villages (e.g., Axams)",
                    "description": "Witness traditional and elaborate carnival parades with unique local characters, music, and costumes (if dates align).",
                    "practical_tips": "Check specific dates and locations for major parades. Arrive very early for good viewing spots. Be prepared for crowds and noise.",
                    "best_time": "Daytime (check schedule)",
                    "estimated_cost": "Free (usually)",
                    "weather_dependent": true
                },
                {
                    "activity": "Skiing/Snowboarding on Stubai Glacier",
                    "where": "Stubai Glacier (day trip)",
                    "description": "Visit Austria's largest glacier ski resort for high-altitude, snow-sure slopes, even late in the season.",
                    "practical_tips": "Longer day trip (approx. 45-60 min drive/bus). Check weather, can be very cold/windy. Ski pass often separate or requires upgrade.",
                    "best_time": "Full day",
                    "estimated_cost": "€60-€80 (Day ski pass) + Transport + Rental",
                    "weather_dependent": true
                },
                {
                    "activity": "Tobogganing (Rodeln)",
                    "where": "Various dedicated runs (e.g., Muttereralm, Elferlift Neustift)",
                    "description": "Enjoy a fun downhill ride on a traditional toboggan. Many runs are floodlit for night tobogganing on certain days.",
                    "practical_tips": "Check run conditions and opening times (especially night). Rent toboggans on site.",
                    "best_time": "Daytime or designated evenings",
                    "estimated_cost": "€10-€20 (rental+lift)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Tyrolean State Museum (Ferdinandeum)",
                    "where": "Museumstraße",
                    "description": "Explore Tyrolean art, history, archaeology, and natural sciences in this major regional museum.",
                    "practical_tips": "Good indoor option. Check opening hours.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "€10-€12",
                    "weather_dependent": false
                },
                {
                    "activity": "Snowshoe Hiking",
                    "where": "Guided tours or marked trails (e.g., Muttereralm, Rangger Köpfl)",
                    "description": "Explore deeper into the snowy landscape off the beaten path with snowshoes.",
                    "practical_tips": "Rentals available in town. Consider a guided tour for safety and route finding. Check avalanche warnings.",
                    "best_time": "Morning/Early Afternoon",
                    "estimated_cost": "€10-€20 (rental) / €40-€60 (guided tour)",
                    "weather_dependent": true
                },
                {
                    "activity": "See the Bergisel Ski Jump",
                    "where": "Bergisel Hill",
                    "description": "Visit the iconic ski jump stadium, potentially see training jumps, and enjoy panoramic views from the tower cafe.",
                    "practical_tips": "Take the lift up. Check opening times.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "€9-€11 (Tower entry)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Hofkirche (Court Church)",
                    "where": "Universitätsstraße",
                    "description": "See the impressive cenotaph of Emperor Maximilian I guarded by the life-sized 'Schwarze Mander' bronze statues.",
                    "practical_tips": "Often combined with the adjacent Tyrolean Folk Art Museum.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "€7-€11 (combined ticket often available)",
                    "weather_dependent": false
                },
                {
                    "activity": "Relax at a Spa",
                    "where": "Aqua Dome (Längenfeld - day trip) or Stubay (Telfes)",
                    "description": "Unwind after winter activities at a thermal spa complex with pools, saunas, and wellness treatments.",
                    "practical_tips": "Requires travel outside Innsbruck (Aqua Dome is further). Check opening hours and prices. Bring swimwear/towel.",
                    "best_time": "Afternoon/Evening",
                    "estimated_cost": "€25-€50+ (entry fee) + Transport",
                    "weather_dependent": false
                }
            ]
        }
    }
} 