{
    "May": {
        "summary": "May transforms Innsbruck into a vibrant spring destination. Snow recedes from lower slopes, hiking trails begin to open, flowers bloom in the city, and outdoor cafes buzz with life. It offers pleasant weather before the summer heat and crowds arrive.",
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather",
                "details": "Enjoy mild temperatures ideal for city exploration, valley walks, and the first lower-altitude hikes."
            },
            {
                "reason": "Alpine Spring Awakening",
                "details": "Witness the transition from winter to summer in the mountains, with melting snow, rushing streams, and emerging green pastures."
            },
            {
                "reason": "Start of Hiking Season",
                "details": "Lower and mid-mountain hiking trails start becoming accessible, offering beautiful walks among spring flowers."
            },
            {
                "reason": "Blooming City & Gardens",
                "details": "See flowers blooming in city parks like the Hofgarten and private gardens. The Alpine Garden on Patscherkofel might start showing colour later in May."
            },
            {
                "reason": "Outdoor Activities Recommence",
                "details": "Conditions become ideal for cycling along the Inn River, visiting outdoor attractions like the Alpine Zoo, and enjoying cafe terraces."
            },
             {
                "reason": "Fewer Crowds than Summer",
                "details": "While busier than early spring, May still offers a less crowded experience than the peak months of July and August."
            },
            {
                "reason": "Longer Daylight Hours",
                "details": "Benefit from long daylight hours for sightseeing and outdoor activities."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Mountain Weather",
                "details": "While pleasant in the valley, mountain weather can still be unpredictable with potential for cold snaps, rain, and even snow at higher elevations."
            },
            {
                "reason": "Limited High-Alpine Access",
                "details": "Many high-altitude hiking trails and some mountain huts will likely still be closed due to snow."
            },
            {
                "reason": "Potential for Rain",
                "details": "May can still experience periods of rain, sometimes heavy showers or thunderstorms, especially in the afternoons."
            },
            {
                "reason": "Increasing Prices & Crowds",
                "details": "As the shoulder season transitions towards summer, accommodation prices rise and popular spots become busier."
            },
            {
                "reason": "Pollen Season",
                "details": "Blooming trees and grasses can mean high pollen counts, affecting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "6°C"
                },
                "precipitation": "Mix of sunny spells and spring showers. Generally mild but still potential for cooler days. Snow line gradually retreating up the mountains.",
                "general_tips": "Pack layers including t-shirts, sweaters, a light waterproof jacket, and comfortable walking shoes. Sunglasses and sunscreen needed for sunny days."
            },
            "tourism_level": {
                "crowds": "Moderate - tourism noticeably picks up, especially around public holidays.",
                "pricing": "Shoulder season prices, but trending higher than April.",
                "overall_atmosphere": "Pleasant spring atmosphere. City feels alive, outdoor cafes are popular."
            },
            "events_holidays": [
                {
                    "name": "May Day (Staatsfeiertag)",
                    "date": "May 1",
                    "description": "Public holiday in Austria. Shops closed, but many restaurants and attractions open. Potential for local events or parades.",
                    "notes": "Public transport runs on a Sunday schedule."
                },
                {
                    "name": "Ascension Day (Christi Himmelfahrt)",
                    "date": "Variable (Thursday, 40 days after Easter)",
                    "description": "Public holiday. Shops closed. Often a popular day for excursions if weather is good.",
                    "notes": "Check specific date for the year."
                },
                {
                    "name": "Potential Start of Small Festivals/Events",
                    "date": "Check local listings",
                    "description": "Smaller local events, markets, or concerts might begin.",
                    "notes": "Consult the Innsbruck Tourism event calendar."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Ride Nordkette Cable Cars (Seegrube)",
                     "where": "Connected via Hungerburgbahn",
                    "description": "Ascend to Seegrube for stunning views. Enjoy the sunshine on the terrace, but expect snow patches and limited/no hiking at this level yet.",
                    "practical_tips": "Hafelekar (top station) may still have significant snow/winter conditions. Check conditions before going higher.",
                    "best_time": "Clear days",
                    "estimated_cost": "€30-€40 (Seegrube return)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore the Old Town (Altstadt)",
                    "where": "Historic City Center",
                    "description": "Wander the charming streets, enjoy outdoor cafes near the Golden Roof, and climb the City Tower for views.",
                    "practical_tips": "Pleasant temperatures for walking. Explore side streets.",
                    "best_time": "Anytime",
                    "estimated_cost": "Free (entry fee for Tower)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Ambras Castle & Gardens",
                    "where": "Schloss Ambras",
                    "description": "Explore the Renaissance castle and see the surrounding park starting to green up. The Spanish Hall is a highlight.",
                    "practical_tips": "Accessible by public transport.",
                    "best_time": "Anytime",
                    "estimated_cost": "€10-€16",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Cycle Along the Inn River",
                    "where": "Inn River Promenade",
                    "description": "Enjoy the pleasant weather with a flat walk or bike ride along the river, enjoying mountain views.",
                    "practical_tips": "Bike rentals available in the city. Paths are well-maintained.",
                    "best_time": "Anytime, especially sunny afternoons",
                    "estimated_cost": "Free (walk) / €15-€25 (bike rental)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Alpine Zoo (Alpenzoo)",
                    "where": "Hungerburg (via Hungerburgbahn)",
                    "description": "See Alpine wildlife in enclosures designed to mimic their natural habitat. Animals are often active in spring.",
                    "practical_tips": "Combine with Hungerburgbahn. Allow 2-3 hours.",
                    "best_time": "Morning/Early Afternoon",
                    "estimated_cost": "€12-€15 (Zoo entry) + Funicular fare",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "8°C"
                },
                "precipitation": "Continued mix of sun and showers, possibly increasing chance of afternoon thunderstorms as temperatures rise. Generally warmer.",
                "general_tips": "Be prepared for warmer days but also potential rain. Layers remain useful. Sun protection is important."
            },
            "tourism_level": {
                "crowds": "Moderate to High - Busy, especially around Whitsun weekend if it falls late May.",
                "pricing": "Approaching summer season prices for accommodation and flights.",
                "overall_atmosphere": "Vibrant, pre-summer buzz. Ideal time for outdoor activities before peak heat."
            },
            "events_holidays": [
                {
                    "name": "Whit Monday (Pfingstmontag)",
                    "date": "Variable (Monday after Pentecost/Whitsun)",
                    "description": "Public holiday. Shops closed. Popular weekend for travel.",
                    "notes": "Check specific date for the year."
                },
                {
                    "name": "Innsbruck Alpine Trailrun Festival (if scheduled)",
                    "date": "Check specific dates (often late May/early June)",
                    "description": "Major trail running event attracting international athletes, with various race distances starting/finishing in the city.",
                    "notes": "Check event website for dates and potential spectator points."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Lower Mountain Hiking",
                    "where": "e.g., Patscherkofel (lower trails), Muttereralm, Rumer Alm area",
                    "description": "Explore trails below the snow line, enjoying wildflowers and views back towards Innsbruck.",
                    "practical_tips": "Check trail conditions locally (Innsbruck Tourism or Almen websites). Wear sturdy footwear, paths can be muddy.",
                    "best_time": "Morning/Early Afternoon",
                    "estimated_cost": "Free (trails) + potential lift costs",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Swarovski Crystal Worlds",
                     "where": "Wattens (short bus/shuttle ride)",
                    "description": "Explore the unique crystal installations and expansive gardens, pleasant in late spring weather.",
                     "practical_tips": "Book tickets online. Combine with other activities in the Hall-Wattens region.",
                     "best_time": "Anytime",
                     "estimated_cost": "€20-€25 (entry) + Transport",
                     "weather_dependent": false
                },
                {
                    "activity": "Ride the Patscherkofel Cable Car",
                    "where": "Igls (accessible by tram/bus)",
                    "description": "Ascend Innsbruck's 'local mountain' for panoramic views and access to the Alpine Garden (check opening) and easier high-level walks like the Zirbenweg start (check conditions).",
                    "practical_tips": "Check operating times. The Zirbenweg trail itself likely still has snow patches in May.",
                    "best_time": "Clear mornings",
                    "estimated_cost": "€25-€35 (round trip)",
                    "weather_dependent": true
                },
                {
                    "activity": "Relax at an Outdoor Cafe/Beer Garden",
                    "where": "Old Town, Maria-Theresien-Straße, along the river, St. Nikolaus district",
                    "description": "Enjoy the longer evenings and pleasant temperatures with drinks or food outdoors.",
                    "practical_tips": "Many options available. Try spots with evening sun.",
                    "best_time": "Afternoon/Early Evening",
                    "estimated_cost": "€10-€20",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Hall in Tirol",
                    "where": "Nearby town (short train/bus ride)",
                    "description": "Visit the well-preserved medieval old town of Hall, known for its mint tower and charming streets.",
                    "practical_tips": "Easy half-day trip from Innsbruck.",
                    "best_time": "Anytime",
                    "estimated_cost": "Transport + small museum fees if visited",
                    "weather_dependent": false
                }
            ]
        }
    }
}