{
  "overview_paragraph": "Ajaccio is at its best in spring (April–June) and early fall (September–October), when café terraces hum along the marina, Mediterranean gardens bloom, and walking weather is ideal. July brings long evenings and vibrant festivals—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days, local patisserie stops, and twinkling holiday lights—while March begins to warm with the odd shower and blooming almond trees.",
  "January": [
    "Maison Bonaparte without the lines, steaming Corsican hot chocolate, and misty waterfront walks between cozy local shops.",
    "Winter light on the Citadel, snug restaurants in the Old Town, and vintage hunts in the covered market."
  ],
  "February": [
    "Old Town at golden hour, romantic views from the Marina, and traditional Corsican music nights in local venues.",
    "Shared local pastries, candlelit waterfront restaurants, and strolls past secret courtyards in the Vieille Ville."
  ],
  "March": [
    "First almond blossoms on the hillsides, terrace tables returning, and Old Town bookshop wanders.",
    "Morning croissants, museum afternoons, and blue-hour waterfront welcoming spring back to Ajaccio."
  ],
  "April": [
    "Wildflowers in bloom, flaky Corsican pastries, and walks from the Marina to the Old Town.",
    "Spring light on the Cathedral, gallery-hopping in Place Foch, sunset cruise to a glittering Gulf of Ajaccio."
  ],
  "May": [
    "Picnics on Plage Saint-François, markets brimming with local color, and twilight strolls along the waterfront.",
    "Flowered promenades, open-air café moments along the marina, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, waterfront aperitifs on the Marina, and the city humming for Fête de la Musique.",
    "Sun-splashed beaches, seaside picnics, and late sunsets that turn every viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over the Gulf, lazy afternoons on the beaches, and moonlit boat cruises.",
    "Summer markets, waterfront terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet beaches, easy museum days, and Paris Plages evenings with breezes off the Mediterranean.",
    "Shaded gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits, lively terraces, and vineyard-tinted evenings in the Old Town.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering irresistible."
  ],
  "October": [
    "Autumn colors in the hills, restaurants aglow, and the local harvest festival in Place Foch.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the waterfront."
  ],
  "November": [
    "Local wine toasts, cozy restaurants, and Fesch Museum afternoons while the city slows to a hush.",
    "Foggy waterfront mornings, Renaissance color indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Marina lights, Christmas markets at Place Foch, and strolling beneath grand Mediterranean façades.",
    "Vin chaud in hand, Cathedral bells, and winter sparkle from waterfront to boutique passage."
  ]
}

