{
  "sites": [
    {
      "name": "Lausanne Cathedral (Cathédrale de Lausanne)",
      "type": "Religious Site",
      "description": "One of the most beautiful Gothic cathedrals in Europe, completed in 1235 and dedicated to the Virgin Mary. Features include magnificent stained glass windows, a 13th-century rose window, and a 16th-century pipe organ. The 224 steps to the top of the belfry offer breathtaking panoramic views of the city, Lake Geneva, and the Alps.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The night watchman still calls out the hours from 10pm to 2am every night, continuing a tradition that has lasted over six centuries.",
      "booking_tips": "No booking required. Located in the heart of the Old Town on a hilltop. The climb to the top of the belfry is worth it for the views but requires good physical condition.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 5
      },
      "latitude": 46.5223,
      "longitude": 6.6355
    },
    {
      "name": "Olympic Museum (Musée Olympique)",
      "type": "Museum",
      "description": "The world's largest information center on the Olympic Games, founded in 1993 by the International Olympic Committee. The museum showcases the history of the Olympics through interactive exhibits, historic artifacts, and multimedia displays including Olympic torches, medals, equipment, and memorabilia from ancient times to the present day.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Moderate",
      "seasonal_notes": "Open Tuesday to Sunday from 9am to 6pm, closed on Mondays except public holidays. Special exhibitions throughout the year.",
      "booking_tips": "No advance booking required for individuals. Located in the Ouchy district near the lakefront. Allow at least 2 hours for the exhibition plus additional time for the Olympic Park and TOM Café with its panoramic lake views.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 4
      },
      "latitude": 46.5083,
      "longitude": 6.6342
    },
    {
      "name": "Plateforme 10",
      "type": "Cultural District",
      "description": "Lausanne's new arts district located near the train station, spanning 25,000 square meters. Houses three major museums: the Cantonal Museum of Fine Arts (MCBA), Photo Elysée (photography museum), and MUDAC (design and contemporary applied arts museum), alongside the Toms Pauli and Félix Vallotton foundations.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Moderate",
      "seasonal_notes": "MCBA is closed on Mondays, while Photo Elysée and MUDAC are closed on Tuesdays. Special exhibitions throughout the year.",
      "booking_tips": "No booking required for general admission. Features restaurants, cafés, bookshops, and public spaces. Special events and exhibitions may require tickets in advance.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 4.0,
        "cultural_significance": 5
      },
      "latitude": 46.5163,
      "longitude": 6.6300
    },
    {
      "name": "Old Town of Lausanne (Vieille Ville)",
      "type": "Historic District",
      "description": "The charming medieval center of Lausanne with cobblestone streets, historic buildings, fountains, and squares. Key features include Place de la Palud with its animated clock, the steep Escaliers du Marché (wooden covered staircase from the 13th century), and numerous cafés, boutiques, and cultural sites.",
      "indoor": false,
      "best_time": "Daytime/Evening",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, especially lively during summer. Christmas markets in December. Farmers' market at Place de la Palud on Wednesdays and Saturdays.",
      "booking_tips": "Best explored on foot. The terrain is quite hilly, so comfortable walking shoes are recommended. Free walking maps available at the tourist office. Consider guided walking tours for historical insights.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 46.5225,
      "longitude": 6.6322
    },
    {
      "name": "Lake Geneva (Lac Léman)",
      "type": "Nature",
      "description": "Western Europe's largest freshwater lake, forming a crescent between Switzerland and France with spectacular views of the Alps. Lausanne's lakefront features promenades, parks, and marinas, with opportunities for swimming, water sports, and boat cruises.",
      "indoor": false,
      "best_time": "Spring through Fall",
      "price_range": "Free to view, boat cruises vary",
      "seasonal_notes": "Summer offers swimming and water activities. CGN boat cruises operate year-round but with reduced schedules in winter. Fall displays beautiful foliage colors and clear mountain views.",
      "booking_tips": "The lakefront promenade is freely accessible. For boat trips on CGN vessels, check schedules as they vary by season. The most scenic cruises pass by the UNESCO-listed Lavaux vineyards between Lausanne and Montreux.",
      "ratings": {
        "cost_estimate": 30,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 46.5102,
      "longitude": 6.6095
    },
    {
      "name": "Ouchy District",
      "type": "Urban District",
      "description": "The lakeside port area of Lausanne, once a fishing village, now a popular promenade with Belle Époque hotels, gardens, and the Olympic Museum. Features include Château d'Ouchy (a renovated 12th-century castle now a luxury hotel), boat docks, and numerous restaurants with lake views.",
      "indoor": false,
      "best_time": "Any time",
      "price_range": "Free",
      "seasonal_notes": "Particularly vibrant during summer when the lakefront fills with outdoor dining and activities. Winter offers serene lake views and Alpine panoramas on clear days.",
      "booking_tips": "Easily accessible via Lausanne's M2 metro line (Ouchy-Olympique station). Starting point for CGN boat cruises on Lake Geneva. Several hotels, restaurants, and ice cream shops in the area.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 46.5075,
      "longitude": 6.6293
    },
    {
      "name": "Collection de l'Art Brut",
      "type": "Museum",
      "description": "A unique museum dedicated to 'outsider art' created by self-taught artists often working outside conventional artistic traditions. Founded on the collection of French artist Jean Dubuffet, it showcases raw, unconventional, and visionary works by creators uninfluenced by mainstream cultural norms.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Budget",
      "seasonal_notes": "Open year-round with changing temporary exhibitions complementing the permanent collection.",
      "booking_tips": "Located in the Beaulieu Castle, a short bus ride from the city center. The museum's content can be intense and unusual, offering a completely different perspective from traditional art museums.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 46.5258,
      "longitude": 6.6236
    },
    {
      "name": "Sauvabelin Tower",
      "type": "Landmark",
      "description": "A wooden observation tower rising from the Sauvabelin Forest, constructed using environmentally sustainable methods. The spiral staircase leads to a platform offering 360-degree panoramic views of Lausanne, Lake Geneva, and the surrounding mountains.",
      "indoor": false,
      "best_time": "Daytime (clear weather)",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round, but views are best on clear days. The surrounding forest is particularly beautiful in autumn with colorful foliage.",
      "booking_tips": "No booking required. Located in the Sauvabelin Forest park, which also features a small lake and farm animal enclosure, making it ideal for families. Accessible by public transport or a pleasant uphill walk from the city.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 46.5338,
      "longitude": 6.6329
    },
    {
      "name": "Lavaux Vineyards",
      "type": "Nature/Cultural Site",
      "description": "UNESCO World Heritage terraced vineyards stretching along Lake Geneva's northern shore between Lausanne and Montreux. Dating back to the 11th century when Benedictine and Cistercian monasteries controlled the area, these steep hillside terraces produce primarily Chasselas white wine.",
      "indoor": false,
      "best_time": "Spring through Fall",
      "price_range": "Free to visit, tastings vary",
      "seasonal_notes": "Beautiful year-round but most vibrant from April to October. Harvest season (September-October) offers special events. The annual Caves Ouvertes (Open Cellars) in spring provides opportunities to visit numerous wineries.",
      "booking_tips": "Accessible by train, with the Lavaux Express tourist train operating in season. Hiking trails connect vineyard villages like Lutry, Cully, and St-Saphorin. Wine tastings available at local cellars and during regional events.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 4.0,
        "cultural_significance": 5
      },
      "latitude": 46.4900,
      "longitude": 6.7500
    },
    {
      "name": "AQUATIS Aquarium-Vivarium",
      "type": "Aquarium/Museum",
      "description": "Europe's largest freshwater aquarium and vivarium, showcasing ecosystems from five continents. Features include immersive exhibits on rivers and lakes worldwide, with thousands of fish, reptiles, and amphibians presented in naturalistic habitats focused on freshwater environments.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Expensive",
      "seasonal_notes": "Open year-round. Indoor activity making it ideal for rainy days.",
      "booking_tips": "Located north of the city center, accessible via the M2 metro (Vennes station). Advance booking recommended during peak tourist season and weekends. Adjacent to a large parking facility for those traveling by car.",
      "ratings": {
        "cost_estimate": 29,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 46.5422,
      "longitude": 6.6412
    },
    {
      "name": "Fondation de l'Hermitage",
      "type": "Museum",
      "description": "An art museum housed in a historic 19th-century mansion surrounded by beautiful gardens and offering views of the city. Presents high-quality temporary exhibitions of paintings, usually focused on 19th and 20th-century art, in an elegant, intimate setting.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with changing exhibitions. Gardens particularly beautiful in spring and summer.",
      "booking_tips": "Located uphill from the city center, accessible by bus or a scenic walk through the park. Check exhibition schedule before visiting as the museum focuses exclusively on temporary shows with no permanent collection on display.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 46.5269,
      "longitude": 6.6386
    },
    {
      "name": "Rolex Learning Center",
      "type": "Architectural Landmark",
      "description": "An innovative architectural masterpiece on the EPFL (Swiss Federal Institute of Technology) campus designed by Japanese architects SANAA. The undulating one-story building houses a library, study spaces, cafés, and exhibition areas beneath a flowing concrete shell pierced by interior courtyards.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round with university schedule. Less crowded during university holidays.",
      "booking_tips": "Accessible by metro M1 (EPFL station). Open to the public with the library accessible to visitors. Worth visiting for the extraordinary architecture alone, which has become a symbol of modern Lausanne.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 46.5284,
      "longitude": 6.5691
    },
    {
      "name": "Musée de l'Elysée (Photo Elysée)",
      "type": "Museum",
      "description": "One of Europe's foremost photography museums, now relocated to the Plateforme 10 arts district. Features a rich collection of over one million photographic images from the 19th century to the present, with changing exhibitions showcasing diverse aspects of photography as an art form.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round except Tuesdays. Changing exhibitions throughout the year.",
      "booking_tips": "Now located at Plateforme 10 near the main train station. Combined tickets available with other museums in the arts district (MCBA and MUDAC).",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 46.5163,
      "longitude": 6.6300
    },
    {
      "name": "Lausanne Historical Museum (Musée Historique de Lausanne)",
      "type": "Museum",
      "description": "Located in the former Bishop's Palace, this museum documents the city's rich history from prehistory to the present day. Exhibits include urban development models, artifacts, paintings, and multimedia presentations that trace how Lausanne evolved from a Roman settlement to a modern city.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Budget",
      "seasonal_notes": "Open year-round with rotating special exhibitions complementing the permanent collection.",
      "booking_tips": "Located in the Old Town near the Cathedral. Provides excellent context for understanding the city before further exploration. Interactive elements make it suitable for families.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 46.5233,
      "longitude": 6.6369
    },
    {
      "name": "Ouchy-Lausanne CGN Cruises",
      "type": "Water Activity",
      "description": "Lake Geneva cruises departing from Lausanne-Ouchy port, offering various routes including scenic journeys along the UNESCO-listed Lavaux vineyards to Montreux and Chillon Castle. Options range from short panoramic excursions to gourmet dinner cruises aboard both modern vessels and historic Belle Époque paddle steamers.",
      "indoor": false,
      "best_time": "Spring through Fall",
      "price_range": "Moderate to Expensive",
      "seasonal_notes": "Services operate year-round but with reduced schedules in winter. Summer offers the fullest schedule with the most options. Historic paddle steamers operate primarily in high season.",
      "booking_tips": "Departures from Lausanne-Ouchy port, accessible via M2 metro. Standard Swiss transportation discounts apply. Dinner and special themed cruises require advance reservations. The Lausanne-Montreux route offers the most spectacular scenery.",
      "ratings": {
        "cost_estimate": 35,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 46.5070,
      "longitude": 6.6288
    },
    {
      "name": "Escaliers du Marché",
      "type": "Historic Site",
      "description": "A picturesque covered wooden stairway built in the 13th century to connect the market at Place de la Palud with the Cathedral above. The stairs run alongside a row of medieval houses and shops, creating one of the most atmospheric routes through Lausanne's Old Town.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Less crowded in early morning. Potentially slippery during winter months.",
      "booking_tips": "No booking required. Several cafés with terraces along the route offer perfect spots to break the climb with refreshments. The stairs provide a direct route between the commercial center and the Cathedral.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 46.5222,
      "longitude": 6.6335
    },
    {
      "name": "Parc de Mon Repos",
      "type": "Park",
      "description": "A historic public park with an elegant 19th-century mansion, manicured gardens, ancient trees, and an aviary. Located between the city center and the lake, it offers tranquil green space with classical landscaping, statues, and a small stream.",
      "indoor": false,
      "best_time": "Spring through Fall",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Most beautiful during spring when flowers bloom and in autumn when leaves change color.",
      "booking_tips": "No booking required. Located halfway between the city center and Ouchy district. Perfect for a picnic or a relaxing break from sightseeing.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 2
      },
      "latitude": 46.5147,
      "longitude": 6.6365
    },
    {
      "name": "Palais de Rumine",
      "type": "Cultural Complex",
      "description": "An impressive Florentine Renaissance-style building housing several museums including natural history, geology, zoology, and archaeology collections. Built in 1906 and named after its benefactor Gabriel de Rumine, the palace also contains a library and university facilities.",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Budget/Varies by museum",
      "seasonal_notes": "Individual museums have varying schedules, but most are open Tuesday through Sunday year-round.",
      "booking_tips": "Located at Place de la Riponne in the city center. Housing multiple museums allows visitors to sample different collections based on interests. The building itself is architecturally significant and worth seeing even from the outside.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 46.5221,
      "longitude": 6.6340
    },
    {
      "name": "Olympic Park",
      "type": "Park",
      "description": "The landscaped gardens surrounding the Olympic Museum, featuring sports-themed sculptures, Olympic symbols, and Mediterranean plantings. The terraced park stretches from the museum down to the Lake Geneva shoreline, with panoramic views across the water to the Alps.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Particularly pleasant in spring and summer when flowers are in bloom. The park is illuminated in the evening.",
      "booking_tips": "No booking required. Accessible even when the museum is closed. Perfect for a stroll before or after visiting the Olympic Museum, or as a lakeside picnic spot with cultural elements.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 46.5084,
      "longitude": 6.6348
    },
    {
      "name": "Château de Chillon",
      "type": "Historic Site/Day Trip",
      "description": "Switzerland's most visited historic monument, a romantic medieval castle on a small island in Lake Geneva near Montreux. Dating from the 12th century, the fortress features original furnishings, medieval murals, subterranean vaults, and impressive state rooms that inspired Lord Byron's 'The Prisoner of Chillon.'",
      "indoor": true,
      "best_time": "Any time",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with extended hours in summer. Special events and medieval demonstrations on the first Sunday of each month.",
      "booking_tips": "Located 30 minutes from Lausanne by train or lake cruise (the boat approach offers spectacular views). Audio guides available in multiple languages. Combined train-castle tickets offer savings.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 5
      },
      "latitude": 46.4144,
      "longitude": 6.9273
    }
  ]
}