{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Jour de l'An)",
          "notes": "New Year's Day is a public holiday throughout Switzerland. Most attractions and shops in Lausanne operate with limited hours. The city is relatively quiet as residents recover from New Year's Eve celebrations. Cold winter temperatures averaging around 1°C (34°F) and short daylight hours characterize this period. Lake Geneva often has a mystical atmosphere with morning mist and snow-capped Alps creating a picturesque winter landscape across the lake."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 2,
          "special": true,
          "event": "Post-Holiday Period & Three Kings Day (January 6)",
          "notes": "The post-holiday period maintains a quiet atmosphere in Lausanne. Three Kings Day (January 6) marks the end of the Christmas season with special pastries (Galette des Rois) featuring a hidden charm inside. Many shops and attractions may have limited hours during this period. Christmas decorations typically remain until this date in this French-speaking region."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "Mid-to-late January is typically cold in Lausanne with temperatures between 0°C and 4°C (32°F to 39°F). Daylight is limited to around 8-9 hours. This is low season for tourism, so major attractions like the Olympic Museum and Collection de l'Art Brut have fewer crowds. The lakefront can be spectacularly beautiful on clear days, with the snow-covered Alps across the lake creating a stunning backdrop. Hotel rates are at their lowest during this period. January is an excellent time for indoor cultural activities, with museums, galleries, and concert venues offering high-quality exhibitions and performances without the crowds of high season."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": 0,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "Early February continues with winter conditions but sometimes features slightly milder days than January. Tourism remains low, making it an excellent time to enjoy indoor attractions like the Olympic Museum, Photo Elysée, and MCBA without crowds. February is perfect for day trips to nearby Alpine ski resorts like Villars, Les Diablerets, or Leysin. This is a great month to experience authentic Swiss fondue or raclette at traditional restaurants in the city center or along the lake."
        },
        {
          "days": [14],
          "score": 3,
          "special": true,
          "event": "Valentine's Day (Saint-Valentin)",
          "notes": "Valentine's Day brings special menus to many of Lausanne's restaurants, particularly those with views of Lake Geneva and the Alps. The lakeside setting makes Lausanne a romantic destination, with opportunities for winter walks along the Ouchy promenade and intimate dining experiences. Chocolate shops throughout the city offer special Valentine's creations, highlighting Switzerland's renowned chocolate-making tradition."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "Late February may bring slightly milder temperatures to Lausanne as winter begins to loosen its grip. If winter carnival (Brandons) events occur in February (dates vary by year based on the Catholic calendar), neighboring towns like Moudon and Payerne host traditional celebrations with parades and music. This is still very much the winter season, with skiing in nearby mountains remaining a popular activity. On clear days, the views of the snow-covered Alps across Lake Geneva are spectacular, especially from elevated vantage points like the Cathedral terrace or Sauvabelin Tower."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
          "score": 3,
          "special": true,
          "event": "Early Spring & Brandons Festivals",
          "notes": "March brings the first signs of spring to Lausanne, with temperatures gradually rising and daylight hours increasing noticeably. Early spring flowers begin to appear in the city's parks and along the lakefront. Local carnival celebrations known as 'Les Brandons' may take place in March (dates vary yearly) in nearby towns like Moudon, Payerne, and Yverdon-les-Bains. These traditional festivals feature colorful parades, masked revelers, and festive music. This is still a relatively quiet tourist season, offering good value for accommodations and easy access to popular attractions."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring Equinox & Easter (if in March)",
          "notes": "Late March sees Lausanne awakening from winter. Easter celebrations may occur in late March (date varies yearly), bringing special church services at the Cathedral, decorated fountains, and chocolate displays in the city's renowned chocolate shops. As spring progresses, cafe terraces along the lakefront in Ouchy begin to open on warmer days, creating a pleasant atmosphere. Lake cruise schedules expand with more frequent departures. The lakeside parks like Denantou and Olympic Park show early spring blooms, making for pleasant walks with mountain views."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 2,
      "tourismLevel": 3
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "special": true,
          "event": "Easter Celebrations (date varies) & Spring Festivals",
          "notes": "Early April often hosts Easter celebrations in Lausanne. The magnificent Cathedral holds special services with music performances, while chocolate shops throughout the city display elaborate Easter creations. The weather becomes noticeably milder, making outdoor activities more pleasant. Cully Jazz Festival takes place in nearby Lavaux wine village, bringing international jazz artists to perform in unique venues including wine cellars and village squares."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Mid-to-late April sees spring truly arriving in Lausanne. The famous Morges Tulip Festival (15 minutes from Lausanne) displays over 120,000 tulips in a spectacular lakeside setting. Parks and gardens throughout Lausanne burst into bloom, particularly the beautiful botanical garden and Parc de l'Hermitage. Boat cruises on Lake Geneva become highly recommended as the Alpine scenery is enhanced by spring colors and often still snow-capped peaks. The terraced Lavaux vineyards begin their growing cycle, with tender green shoots emerging on the ancient slopes. Tourist numbers start to rise, but the city is still relatively uncrowded. Rain showers are common but typically don't last long, and they contribute to the lush spring colors throughout the region."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Fête du Travail)",
          "notes": "May 1st is Labor Day and is observed with some events in Lausanne, particularly in this region with its strong social democratic traditions. The day often features parades, speeches, and gatherings in the city center. This is also a day for spring celebrations as the weather continues to improve, with many locals gathering in parks and along the lakefront promenades."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Ascension Day & Early Tourist Season",
          "notes": "May brings reliably good weather to Lausanne with average temperatures between 11°C and 19°C (52-66°F). The lake and mountain activities become fully operational, with numerous hiking opportunities in the nearby Lavaux vineyards, Jura mountains, and Alps. Ascension Day (40 days after Easter) is a public holiday in Switzerland with special events. This is the beginning of the tourist season, but before the summer peak, making it an excellent time to visit with good weather and manageable crowds. The Lavaux vineyards are particularly beautiful as the vines develop their first full foliage. Lake water temperatures are still too cold for comfortable swimming, but lakeside promenades are perfect for strolling and cycling. The outdoor terraces at lakefront restaurants in Ouchy become popular for dining with spectacular Alpine views across Lake Geneva."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 9,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 5,
          "special": true,
          "event": "Pentecost & Early Summer Activities",
          "notes": "Early June brings the beginning of summer weather to Lausanne. Pentecost (Whit Monday) is a public holiday falling 50 days after Easter. Lake Geneva begins to warm up enough for swimming at locations like Vidy Beach and Bellerive Plage, though the water remains refreshingly cool. Outdoor dining becomes extremely popular along the lake at restaurants in Ouchy and Vidy. The CGN Belle Époque paddle steamers offer increased cruise schedules across Lake Geneva to French and Swiss destinations."
        },
        {
          "days": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Festival de la Cité Preparations",
          "notes": "Mid-to-late June brings long daylight hours (up to 16 hours), pleasant temperatures, and the true beginning of Lausanne's summer season. The summer solstice is marked with various events. Lake Geneva temperatures rise enough to make swimming comfortable, and beaches like Vidy and Bellerive fill with locals and visitors enjoying water activities. This is a perfect time for boat cruises on vintage Belle Époque steamers, hiking in the nearby Lavaux vineyards for panoramic views, and enjoying the lively atmosphere of outdoor cafes and bars throughout the city. Preparations begin for the Festival de la Cité, Lausanne's major free cultural festival in early July. Tourism increases but remains manageable. The lake's crystal-clear waters provide perfect refreshment on warm days."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 12,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 5,
          "special": true,
          "event": "Festival de la Cité & Lausanne Festival",
          "notes": "Early July features the Festival de la Cité, Lausanne's largest free cultural event. The historic Cité district transforms into an open-air performance venue with hundreds of shows including music, dance, theater, circus arts, and installations spread throughout atmospheric spaces in the medieval heart of the city. This multi-disciplinary festival brings the historic center alive with performances in unusual spaces - cathedral steps, cobblestone streets, hidden courtyards, and ancient squares. The festival has a democratic, inclusive atmosphere with diverse programming."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Montreux Jazz Festival & Summer Season",
          "notes": "July is one of the warmest months in Lausanne with temperatures averaging 26°C (79°F) but sometimes reaching 30°C (86°F) or higher. This is peak tourist season with visitors from around the world. The nearby Montreux Jazz Festival (30 minutes from Lausanne) is a major attraction, presenting diverse musical styles in venues along Lake Geneva. Around mid-July, the Paléo Festival in Nyon (30 minutes west of Lausanne) brings one of Europe's major open-air music festivals to the region. Lake swimming is at peak popularity, with the clean Alpine waters offering perfect refreshment on hot days. Vidy Beach becomes a social hub for locals and visitors alike. Boat cruises are running at maximum frequency, and excursions to the Swiss and French Alps are popular. The terraced Lavaux vineyards, a UNESCO World Heritage site, are particularly beautiful with their full summer foliage contrasting with the blue lake."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 15,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Swiss National Day (Fête Nationale Suisse)",
          "notes": "August 1st is Swiss National Day, celebrating the founding of the Swiss Confederation in 1291. Lausanne hosts significant events including fireworks over the lake, boat parades, traditional performances, and official ceremonies. The lakefront at Ouchy serves as a gathering point for celebrations, with the illuminated buildings creating a magical backdrop. Most businesses close for the holiday, but tourist attractions remain open. This is one of the most festive days in the Swiss calendar, with Lausanne offering particularly spectacular celebrations due to its lakeside setting and views."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Lausanne Estivale & Summer Peak",
          "notes": "August continues with ideal summer weather. Lausanne Estivale offers hundreds of free cultural events throughout the city, including concerts, performances, and activities. The Olympic Capital's connection to sports is highlighted with various competitions and demonstrations. Lake activities remain extremely popular, with swimming, boating, and water sports at their peak at beaches like Vidy and Bellerive. The numerous hiking trails in the surrounding regions offer spectacular experiences with the Lavaux vineyards, Jura mountains, and Alpine paths all fully accessible. Accommodations should be booked well in advance during this peak season. Despite high tourism, the relaxed atmosphere and excellent infrastructure ensure Lausanne remains a pleasant destination. This is considered high season for good reason - the combination of perfect weather, cultural events, and full operation of all attractions makes it ideal for experiencing Lausanne at its best."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 15,
      "tourismLevel": 10
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "BDFIL Comic Strip Festival & Early Autumn",
          "notes": "Early September brings the BDFIL Comic Strip Festival, celebrating international comic art through exhibitions, artist meetings, workshops, and performances throughout venues in central Lausanne. The weather remains pleasant with average temperatures around is21°C (70°F). Lake swimming is still enjoyable as the water retains its summer warmth. The crowds begin to thin slightly as European summer holidays end, creating a good balance of atmosphere without overwhelming tourism. The surrounding mountains and vineyards offer excellent hiking with stable weather conditions typically prevailing. This is widely considered one of the best times to visit Lausanne."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Lausanne Underground Film Festival & Autumn Colors",
          "notes": "Late September brings autumn to Lausanne with pleasant temperatures around 18°C (64°F) and beautiful fall colors beginning to appear around the lake and in the surrounding regions. Tourism decreases further, making this an excellent time to visit with good weather and fewer crowds. The cultural season begins with new exhibitions at museums like the MCBA, Photo Elysée, and Collection de l'Art Brut. The Lausanne Underground Film Festival showcases independent cinema. Lake cruises continue with less crowded boats, offering more peaceful experiences. The Lavaux vineyards begin to take on golden autumn hues as harvest preparations commence. This period offers many of the advantages of summer with fewer tourists and more moderate temperatures."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 11,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Lausanne Marathon & Lavaux Harvest",
          "notes": "Early October brings autumn colors to their peak in Lausanne, with the trees around the lake and mountains showing stunning foliage. The Lausanne Marathon takes place in late October, with race routes following the scenic northern shore of Lake Geneva through vineyards and historic villages. The prestigious Lavaux vineyards host grape harvest activities, with many wineries offering special events and the chance to participate in traditional harvesting. This is a good time for museum visits, with the Plateforme 10 arts district featuring coordinated exhibitions across its museums (MCBA, Photo Elysée, and mudac). Tourism continues to decrease, creating good opportunities for value accommodation and uncrowded attractions."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Late October sees autumn fully established in Lausanne. Temperatures cool significantly with averages around 9-15°C (48-59°F). The Sauvabelin Forest above the city offers spectacular autumn colors and walks around the small lake. Traditional autumn foods appear in restaurant menus, with game dishes, mushroom specialties, and the first raclette and fondue of the season becoming popular. Boat cruises operate on reduced autumn schedules but offer beautiful perspectives of fall colors reflecting in the lake. Morning mist over Lake Geneva creates magical photography opportunities, especially when it clears to reveal the snow-dusted Alps beyond. This is an excellent month for visitors seeking natural beauty, cultural experiences, and fewer crowds."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 7,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day (La Toussaint)",
          "notes": "All Saints' Day on November 1st is observed in many parts of French-speaking Switzerland. The Cathedral in Lausanne holds special services, and some people visit cemeteries to honor deceased family members. This marks the transition into the quieter, more introspective late autumn season."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "notes": "November brings increasingly cold conditions to Lausanne, with temperatures around 5-10°C (41-50°F) and daylight hours significantly reduced. This is low season for tourism, though the city maintains a vibrant local atmosphere with cultural events and cozy indoor activities. The Lausanne Underground Film & Music Festival might take place this month, featuring independent productions. The hunting season brings traditional game dishes to restaurant menus, while fondue and raclette become staples as winter approaches. The Swiss Wine Museum in nearby Aigle offers insights into the recently completed harvest. Museum visits become particularly appealing, with new exhibitions at the MCBA, Photo Elysée, and other institutions. Fog is common, sometimes shrouding the lake for days at a time, but when it clears, the views of the first snow on the Alps can be spectacular. Hotel rates are lower, making this a good value time to visit despite the cooler, sometimes gray weather. Toward the end of November, Christmas markets begin to open, creating a magical atmosphere in the historic districts."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "special": true,
          "event": "Lausanne Lumières & Christmas Markets Begin",
          "notes": "Early December brings winter conditions with temperatures around 1-6°C (34-43°F) and very short daylight hours. The Lausanne Lumières festival transforms the city with artistic light installations throughout the center, turning historical buildings, squares, and parks into canvases for creative light displays. Christmas markets open at Place St-François, Flon, and other locations, offering traditional crafts, decorations, and seasonal foods like raclette, Swiss sausages, and vin chaud (mulled wine). Lausanne's topography creates a distinctive Christmas market experience as illuminated streets wind up and down the hillside."
        },
        {
          "days": [6],
          "score": 4,
          "special": true,
          "event": "St. Nicholas Day (Saint-Nicolas)",
          "notes": "December 6th is St. Nicholas Day, when Saint-Nicolas and his helper Père Fouettard visit children. Various events for children take place throughout the city, particularly in the French-speaking tradition, and special treats appear in bakeries. This traditional celebration is particularly charming in Lausanne's historic setting."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "notes": "Mid-December sees Lausanne at its most festive, with decorations, lights, and special events throughout the historic center. Shopping areas are beautifully decorated and buzzing with activity. Cultural events like Christmas concerts take place in Lausanne's Cathedral and churches. Fog, occasional snow, and crisp cold days all create different but equally atmospheric winter experiences. The Olympic Museum and other indoor attractions offer warm refuge on cold days. Special Christmas menus featuring traditional Swiss dishes appear in restaurants throughout the city. Day trips to nearby Alpine resorts become popular as the ski season begins."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Réveillon de Noël & Noël)",
          "notes": "Christmas is celebrated both on Christmas Eve (December 24) and Christmas Day (December 25) in Switzerland. Christmas Eve typically features family gatherings and traditional meals, while Christmas Day is a public holiday with continued celebrations. Many restaurants and attractions close early on Christmas Eve and may remain closed on Christmas Day. The illuminated city center creates a magical atmosphere, especially with snow. Public transportation runs on limited schedules."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees Lausanne quieter but still festive. Winter activities like visits to nearby ski resorts in the Vaud Alps and visits to museums are popular among tourists. Many restaurants and shops reopen after brief Christmas closures. This can be a good time to find post-Christmas shopping deals and enjoy the winter atmosphere with fewer crowds than earlier in December."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Réveillon de Saint-Sylvestre)",
          "notes": "New Year's Eve celebrations take place throughout Lausanne, with restaurants offering special menus (advance reservation essential), while hotels and cultural venues host celebration events. The lakefront at Ouchy becomes a gathering place for viewing informal fireworks displays reflected in Lake Geneva. The historic backdrop of the Cathedral and the Old Town creates a uniquely atmospheric setting for welcoming the New Year. The combination of winter scenery, festive atmosphere, and the magical lakeside setting makes Lausanne a romantic destination for New Year celebrations."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 4
    }
  },
  "activityTypes": {
    "spring": [
      "Cruising on Lake Geneva as nature awakens and the Alps emerge from winter snow",
      "Visiting the spectacular Morges Tulip Festival with over 120,000 blooms",
      "Hiking through the UNESCO-listed Lavaux vineyards as they begin their growth cycle",
      "Attending the Cully Jazz Festival in a picturesque wine village",
      "Exploring the parks and gardens of Lausanne as they burst into bloom",
      "Taking guided walking tours of the historic city before the summer crowds arrive",
      "Enjoying the first outdoor cafés and terraces along the lakefront at Ouchy",
      "Photographing snow-capped Alps across the crystal-clear spring waters of Lake Geneva",
      "Participating in spring cultural festivals throughout the city"
    ],
    "summer": [
      "Swimming in Lake Geneva at Vidy Beach or Bellerive Plage",
      "Experiencing the Festival de la Cité with hundreds of free performances",
      "Visiting the Olympic Museum and its terraced gardens overlooking the lake",
      "Attending the renowned Montreux Jazz Festival just 30 minutes away",
      "Taking a Belle Époque paddle steamer cruise across Lake Geneva",
      "Hiking through the terraced Lavaux vineyards with spectacular lake views",
      "Enjoying outdoor dining on lakefront terraces in Ouchy",
      "Participating in water sports like paddleboarding, sailing, and kayaking",
      "Day-tripping to nearby Alpine destinations via the excellent rail network"
    ],
    "autumn": [
      "Witnessing the grape harvest in the UNESCO-listed Lavaux vineyards",
      "Exploring Lausanne's excellent museums as the cultural season begins",
      "Enjoying the spectacular fall foliage in Sauvabelin Forest",
      "Attending the BDFIL Comic Strip Festival or Lausanne Underground Film Festival",
      "Participating in or watching the Lausanne Marathon along Lake Geneva",
      "Savoring seasonal game dishes and traditional autumn specialties at local restaurants",
      "Shopping at autumn markets for seasonal produce, mushrooms, and regional specialties",
      "Hiking in the surrounding regions with golden autumn colors",
      "Photographing morning mist on the lake with mountains beyond"
    ],
    "winter": [
      "Experiencing the Lausanne Lumières festival with light installations throughout the city",
      "Exploring the Christmas markets at Place St-François and other locations",
      "Taking day trips to nearby ski resorts in the Vaud Alps",
      "Visiting the International Olympic Committee headquarters in the Olympic Capital",
      "Enjoying traditional fondue or raclette in cozy historic restaurants",
      "Attending opera, ballet, or classical performances during the winter cultural season",
      "Photographing the Cathedral and historic districts in winter conditions",
      "Exploring the world-class museums at the new Plateforme 10 arts district",
      "Warming up in historic cafés with hot chocolate and pastries"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, cold or wet weather, very low tourism (some business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, limited activities or accessibility"
  }
}