{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Lá Cinn Bliana)",
          "notes": "New Year's Day is a public holiday throughout Ireland. Most attractions, shops, and restaurants in Cork city are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. The English Market and major museums typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout Cork city, particularly on St. Patrick's Street, Oliver Plunkett Street, and in shopping centers like Merchant's Quay. Christmas decorations gradually come down. The city's cozy traditional pubs offer warm refuge from winter weather."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is the off-season with few tourists and excellent hotel value. Cool winter weather with potential for rain and wind. Limited daylight hours. Winter sales continue throughout January in the main shopping district. The Crawford Art Gallery and Cork City Gaol offer excellent indoor experiences during this quiet season. Cork Opera House features winter programming."
        }
      ],
      "weatherHighC": 8,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "Winter continues with cool weather but slightly longer days. Cork's low tourism season continues, making it ideal for museum visits and indoor cultural activities without crowds. Fitzgerald's Park offers pleasant walks on dry days."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 3,
          "special": true,
          "event": "Mid-Term Break",
          "notes": "Irish school mid-term break typically falls in February. Family-friendly activities are available at Cork's museums and cultural institutions. The Crawford Art Gallery and Cork Public Museum often feature special exhibitions and activities for children."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Late February begins to show early signs of spring in Cork. Planning for St. Patrick's Day events begins around the city. Cultural venues like the Everyman Theatre and Cork Opera House offer winter programming. Traditional music sessions in city pubs provide authentic evening entertainment."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. The city begins to prepare for St. Patrick's Day celebrations. University College Cork's campus becomes particularly attractive as spring blooms appear. The cultural calendar becomes more active with various events across the city."
        },
        {
          "days": [17],
          "score": 5,
          "special": true,
          "event": "St. Patrick's Day (Lá Fhéile Pádraig)",
          "notes": "Cork's St. Patrick's Festival features a large parade through the city center with thousands of participants. The day is a national holiday with businesses closed, but pubs, restaurants, and entertainment venues are bustling. The parade route typically runs from South Mall to Merchant's Quay with various performances, music, and cultural events surrounding the festival."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Tús an Earraigh)",
          "notes": "Spring officially begins, bringing early blooms to Fitzgerald's Park and the grounds of University College Cork. Perfect time for exploring the Victorian Quarter and the historic center as café life begins to move outdoors on warmer days. Easter markets appear if Easter falls in late March."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 4,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Cáisc)",
          "notes": "Easter celebrations typically fall in April, with Good Friday, Easter Sunday, and Easter Monday as public holidays. Special Easter markets and events operate in central Cork in the week before Easter. Spring blooms peak throughout the city's parks, especially at Fitzgerald's Park and the grounds of University College Cork. Outdoor cafés in the city center become increasingly popular."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Cork International Choral Festival",
          "notes": "The Cork International Choral Festival typically takes place in late April, bringing choral groups from around the world to the city. Performances take place in venues across Cork including Cork City Hall, St. Fin Barre's Cathedral, and other churches and performance spaces. The cultural spring season is in full swing with performances at the Cork Opera House and other venues."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 5,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "May Day/Labour Day (Lá Bealtaine)",
          "notes": "May Day is marked with some events in Cork city. Many businesses are closed for the public holiday, but museums and cultural attractions remain open. Traditional celebrations of Bealtaine (the Celtic festival marking the beginning of summer) may take place in cultural venues."
        },
        {
          "days": [2, 3, 4, 5],
          "score": 5,
          "special": true,
          "event": "May Bank Holiday Weekend",
          "notes": "The first Monday in May is a bank holiday in Ireland. This long weekend often features special events and festivals in Cork and the surrounding region. The Ballydehob Jazz Festival takes place in West Cork during this weekend, drawing music enthusiasts to the region."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "May brings perfect spring weather with longer days (approximately 16 hours of daylight). The outdoor café scene in the city center is in full swing. The banks of the River Lee become popular evening spots. Fitzgerald's Park shows spectacular late spring blooms. Tourism begins to increase but the city isn't yet at peak season crowds."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 7,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3],
          "score": 5,
          "special": true,
          "event": "June Bank Holiday Weekend",
          "notes": "The first Monday in June is a bank holiday in Ireland. Cork Harbour Festival typically takes place during this bank holiday weekend, celebrating Cork's maritime heritage with boat tours, water activities, and cultural events. Bantry Walking Festival in West Cork also takes place during this weekend."
        },
        {
          "days": [4, 5, 6, 7, 8, 9, 10, 11, 12],
          "score": 5,
          "notes": "Early summer brings warm weather and extended daylight hours to Cork. Tourism increases but the city remains less crowded than July and August. Perfect time for exploring both the city and daytrips to coastal areas like Kinsale, Cobh, and West Cork."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "Cork Midsummer Festival",
          "notes": "The Cork Midsummer Festival (typically running mid-to-late June) transforms the city with contemporary arts performances, theater, dance, music, and visual arts in both conventional venues and unexpected public spaces. The summer solstice brings the longest days of the year with approximately 17 hours of daylight."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Live at the Marquee",
          "notes": "Cork's premier summer concert series 'Live at the Marquee' typically runs from June through July, bringing major international and Irish musical acts to a specially constructed marquee venue in the Cork Docklands. These popular concerts attract visitors from throughout Ireland and abroad. Summer tourism season begins in earnest as schools finish for the summer holidays."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Live at the Marquee continues",
          "notes": "The Live at the Marquee concert series continues through July. Peak summer with warm temperatures and long daylight hours. Irish school holidays are in full swing, increasing family tourism. Excellent time for visits to Fota Wildlife Park, coastal areas, and outdoor activities. The city's outdoor dining scene is at its most vibrant."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "West Cork Literary Festival",
          "notes": "The West Cork Literary Festival takes place in Bantry (approximately 1.5 hours from Cork city) in mid-July, bringing writers from Ireland and abroad for readings, workshops, and literary events. Peak tourist season with bustling attractions and outdoor activities. Many Cork residents take holidays during this period, giving parts of the city a relaxed atmosphere despite the tourism."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 4,
          "special": true,
          "event": "August Bank Holiday Weekend",
          "notes": "The first Monday in August is a bank holiday in Ireland. This long weekend often features festivals and events in Cork city and throughout the county. Ideal time for exploring Cork's coastline and harbor towns like Kinsale, Cobh, and Youghal."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "High summer with typically warm, pleasant weather. Peak tourism season continues with visitors from Ireland and abroad. Cork Harbour and coastal areas are particularly popular. The English Market is bustling with locally sourced summer produce. Great time to experience Cork's outdoor dining scene and riverside walks. Tourism begins to decrease slightly toward the end of the month as Irish schools prepare to return."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Cork Culture Night & Cork Folk Festival",
          "notes": "September typically brings Culture Night to Cork (a nationwide celebration of arts and culture with free events across the city). The Cork Folk Festival also takes place in late September, featuring traditional Irish music performances in venues throughout the city. Perfect late summer weather for outdoor activities and exploring the city without the peak season crowds. Tourism begins to decrease as Irish schools are back in session, making it an excellent time to visit with good weather but fewer crowds."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 4,
          "notes": "Autumn weather brings cooler temperatures to Cork, but remains pleasant for city exploration. Perfect time for visiting indoor attractions like the English Market, Crawford Art Gallery, and Cork City Gaol. Fitzgerald's Park and the grounds of University College Cork display beautiful autumn colors. Good month for experiencing Cork's cozy pub culture."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Guinness Cork Jazz Festival",
          "notes": "The internationally renowned Guinness Cork Jazz Festival takes place on the October bank holiday weekend (last weekend of October). This major event transforms the city with performances in venues throughout Cork including the Cork Opera House, the Everyman Theatre, and dozens of pubs and clubs. Hotels book up well in advance and the city center is bustling with music fans from around the world."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "Halloween & Dragon of Shandon",
          "notes": "Halloween (Oíche Shamhna) is celebrated with the unique Dragon of Shandon parade through Cork's historic Shandon district. This nighttime street parade features a 36-foot dragon puppet and hundreds of costumed performers celebrating the ancient Celtic festival of Samhain. The parade begins on Church Street and travels down Shandon Street to the Coal Quay, attracting thousands of spectators."
        }
      ],
      "weatherHighC": 13,
      "weatherLowC": 8,
      "tourismLevel": 7
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 3,
          "notes": "Full autumn with cooler, often rainy weather. Excellent time for museum visits and indoor cultural activities. The English Market becomes particularly appealing with seasonal produce. Traditional pubs with open fires offer cozy retreats from the weather. The city begins early preparations for the Christmas season."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Christmas Season Begins",
          "notes": "Cork's Christmas celebrations begin in late November with the lighting of the city's Christmas lights. The Cork Christmas Market (formerly GLOW Cork) opens, featuring festive stalls and attractions at Emmet Place. The iconic ferris wheel is installed on Grand Parade, offering views over the illuminated city. Christmas shopping begins in earnest on St. Patrick's Street, Oliver Plunkett Street, and in the city's shopping centers."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Cork Christmas Market",
          "notes": "Cork's Christmas Market (formerly GLOW Cork) runs from late November until December 23rd. Festive stalls spread across Emmet Place and Grand Parade, featuring traditional crafts, food, and mulled wine. The iconic ferris wheel and carousel operate throughout the season. The city center is beautifully decorated with Christmas lights. The English Market is particularly atmospheric with seasonal specialties. Shopping areas like St. Patrick's Street and Oliver Plunkett Street are bustling with Christmas shoppers."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Oíche Nollag)",
          "notes": "Christmas Eve is an important celebration day for most Irish families. Most businesses close by early afternoon. The Christmas Market ends. Cork's churches hold special services, particularly St. Fin Barre's Cathedral and the North Cathedral. Restaurants that remain open often require advance reservations for special Christmas Eve dinners."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Day & St. Stephen's Day",
          "notes": "December 25 (Christmas Day) and December 26 (St. Stephen's Day) are both public holidays. Most businesses, restaurants, and attractions are closed or operate with limited hours. Carrigaline Wren Boys festival takes place on St. Stephen's Day with a street carnival featuring traditional costumes and music. Traditional horse-racing events also take place on St. Stephen's Day."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is typically quiet but with a festive atmosphere. Major museums and some attractions reopen. Good time for winter sales shopping along St. Patrick's Street and in shopping centers. The Cork Opera House typically offers post-Christmas entertainment including the annual pantomime."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Oíche Chinn Bliana)",
          "notes": "New Year's Eve celebrations center around Cork city center with midnight countdown events. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), and hotels host celebration events. Pubs and clubs throughout the city offer special New Year's parties. The historic city center provides a spectacular backdrop for festivities."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 4,
      "tourismLevel": 6
    }
  },
  "activityTypes": {
    "spring": [
      "Cork St. Patrick's Festival Parade (March)",
      "Cork International Choral Festival (late April)",
      "Fitzgerald's Park Spring Blooms (March through May)",
      "University College Cork Campus Gardens Tour",
      "St. Fin Barre's Cathedral Tours",
      "Blackrock Castle Observatory",
      "Bantry Walking Festival (June Bank Holiday Weekend)",
      "Outdoor café culture begins in the Victorian Quarter"
    ],
    "summer": [
      "Live at the Marquee Concert Series (June-July)",
      "Cork Midsummer Festival (mid-June)",
      "Cork Harbour Festival (June Bank Holiday Weekend)",
      "Fota Wildlife Park summer activities",
      "River Lee kayaking tours",
      "West Cork Literary Festival (July)",
      "Cork Folk Festival (September)",
      "Day trips to coastal towns like Kinsale, Cobh, and Clonakilty"
    ],
    "autumn": [
      "Guinness Cork Jazz Festival (October Bank Holiday Weekend)",
      "Dragon of Shandon Halloween Parade (October 31)",
      "Cork Film Festival (November)",
      "Autumn Colors at Fitzgerald's Park and UCC Gardens",
      "Cork Culture Night (September)",
      "Traditional Music Sessions in Historic Pubs",
      "Cork Folk Festival (September)",
      "English Market Autumn Seasonal Produce"
    ],
    "winter": [
      "Cork Christmas Market (late November to December 23)",
      "Christmas Ferris Wheel on Grand Parade",
      "New Year's Eve Celebration in Cork City Center",
      "Winter Shopping on St. Patrick's Street",
      "The English Market Winter Food Experience",
      "Cork Opera House Winter Season and Pantomime",
      "Cozy pub culture in traditional Cork establishments",
      "Carrigaline Wren Boys Festival (St. Stephen's Day)"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or cool, wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}