{
    "sites": [
      {
        "name": "Cork City Gaol",
        "type": "Historical Prison/Museum",
        "description": "Cork City Gaol stands as one of Ireland's most evocative historical sites, a magnificently preserved Victorian-era prison that offers visitors an immersive journey into 19th-century penal history. Opened in 1824 and operational until 1923, this imposing Gothic-style limestone building now functions as a heritage center that vividly depicts the harsh realities of incarceration during its operational period. The meticulously restored interior includes original cell blocks, punishment areas, and administration spaces with life-like wax figures, while exhibits also include a significant Radio Museum documenting early Irish broadcasting history.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round with extended evening hours during summer for night sky observations. The indoor science center provides consistent experiences regardless of weather. Summer evenings offer spectacular sunset views over Cork Harbor, and winter offers earlier darkness for evening sessions. Special astronomy events are scheduled around celestial phenomena.",
        "booking_tips": "Online tickets are recommended, especially for specialized evening sessions. Located approximately 8 km east of Cork city center in Blackrock, it is accessible by bus or car with on-site parking. Allow at least 2 hours for a comprehensive visit including the exhibitions and castle exploration.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 51.9013,
        "longitude": -8.4006
      },
      {
        "name": "Cork Butter Museum",
        "type": "Specialized Museum/Food Heritage",
        "description": "The Cork Butter Museum documents the surprisingly significant history of Ireland's most important agricultural export through diverse artifacts and archival materials housed in a former market building in Cork's historic Shandon district. Established in 1997, the museum explores butter production from ancient techniques to modern artisanal revival and examines the internationally renowned Cork Butter Exchange.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round with consistent interior exhibitions. Traditional butter-making demonstrations are scheduled more frequently during the summer tourist season, with occasional seasonal events and harvest festivals.",
        "booking_tips": "No advance booking is required for individual visits; group tours should be arranged in advance. Located adjacent to the famous Butter Exchange building, photography is permitted with some restrictions.",
        "ratings": {
          "cost_estimate": 6,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 51.9025,
        "longitude": -8.4768
      },
      {
        "name": "Shandon Bells & Tower at St. Anne's Church",
        "type": "Historic Church/Bell Tower",
        "description": "Shandon Bells and Tower is Cork's most distinctive architectural landmark—a 36.5-meter stone tower topped with a golden fish weathervane. It houses a famous set of eight bells, arranged for change-ringing, and offers a viewing balcony with spectacular 360-degree city and harbor vistas.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round with extended summer hours during peak tourist season. The narrow tower staircase can be cool even in summer; an extra layer is recommended.",
        "booking_tips": "No advance booking is required for individual visits. Larger groups should arrange in advance. Photography is excellent, especially from the upper viewing platform. Allow approximately 1 hour for the complete experience.",
        "ratings": {
          "cost_estimate": 7,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 51.9029,
        "longitude": -8.4761
      },
      {
        "name": "Spike Island",
        "type": "Historic Prison/Island Fortress",
        "description": "Spike Island is one of Europe’s most remarkable coastal fortifications. This 104-acre island in Cork Harbour has served as a monastic settlement, military fortress, and overcrowded prison during the Great Famine. Today, visitors can explore its restored prison buildings, extensive defensive earthworks, and scenic viewpoints.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Open from April through October. Summer provides optimal conditions for outdoor exploration, while winter offers a unique, quieter experience. Special themed events and reenactments are often scheduled during summer weekends.",
        "booking_tips": "Advance ferry booking is essential as sailings can sell out in summer. Tours are available in English with multilingual guides, and photography opportunities are exceptional.",
        "ratings": {
          "cost_estimate": 22,
          "suggested_duration_hours": 4,
          "cultural_significance": 5
        },
        "latitude": 51.8331,
        "longitude": -8.2881
      },
      {
        "name": "The Lough",
        "type": "Urban Nature Reserve/Park",
        "description": "The Lough is a 16-acre limestone lake that serves as Cork's most significant natural landmark. Designated as a wildlife refuge and Ireland's first wildfowl sanctuary, it offers essential urban wildlife habitat and a peaceful setting for nature walks and birdwatching.",
        "indoor": false,
        "best_time": "Evening",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round with different wildlife and planting displays by season. Dawn and dusk are ideal for birdwatching and photography.",
        "booking_tips": "No booking is required as this is a public park. Information boards and flat walking paths ensure easy exploration. Bring binoculars for birdwatching.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 3
        },
        "latitude": 51.8884,
        "longitude": -8.4944
      },
      {
        "name": "University College Cork",
        "type": "Historic University/Architectural Site",
        "description": "University College Cork (UCC) is celebrated for its spectacular riverside campus that blends historic architecture with modern facilities and expansive botanical gardens. Its iconic Quadrangle and diverse museum collections provide insight into the evolution of Irish higher education.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Campus is accessible year-round, with spring showcasing flowering trees and fall displaying vibrant seasonal colors along the river paths.",
        "booking_tips": "No booking is required for general exploration; guided tours are available. Photography is permitted throughout, and visitor maps are available at the center.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 51.8925,
        "longitude": -8.4921
      },
      {
        "name": "Fitzgerald's Park",
        "type": "Urban Park/Museum Complex",
        "description": "Fitzgerald's Park is Cork's premier urban green space featuring landscaped gardens, a café housed in an elegant Pavilion, and the Cork Public Museum within its grounds. The park is celebrated for its blend of Victorian heritage and contemporary landscape design.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Open year-round with seasonal planting displays. Summer weekends feature outdoor concerts and family activities, while winter highlights the park's structural garden elements.",
        "booking_tips": "No booking is required for park access; museum admission is free but separate. Guided garden tours are available periodically.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 51.8967,
        "longitude": -8.4955
      },
      {
        "name": "Jameson Experience Midleton",
        "type": "Distillery Tour/Whiskey Heritage",
        "description": "The Jameson Experience in Midleton offers a comprehensive tour of Ireland's whiskey heritage at the preserved Old Midleton Distillery. Visitors explore authentic 19th-century production facilities and enjoy whiskey tastings and masterclasses that connect historic methods with modern techniques.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Expensive",
        "seasonal_notes": "Open year-round with consistent tour experiences. Summer sees peak visitor numbers with expanded schedules, while winter tours offer a more intimate experience.",
        "booking_tips": "Advance online booking is essential, particularly during summer. Tours are available in multiple languages and include guided tastings and demonstrations.",
        "ratings": {
          "cost_estimate": 25,
          "suggested_duration_hours": 2,
          "cultural_significance": 4
        },
        "latitude": 51.9153,
        "longitude": -8.1658
      },
      {
        "name": "Ballycotton Cliff Walk",
        "type": "Coastal Trail/Natural Attraction",
        "description": "The Ballycotton Cliff Walk is a 7-km coastal trail offering dramatic views of Ballycotton Bay and the Celtic Sea. The path winds along rugged sea cliffs and passes through varied coastal habitats, with interpretive signage detailing both natural and historical features.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round, though conditions vary. Morning visits are ideal before sea breezes develop, and the trail features different wildflower and birdlife displays each season.",
        "booking_tips": "No booking is required. Arrive early to secure parking and allow at least 3 hours for a round-trip hike with stops for photography and wildlife observation.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 3
        },
        "latitude": 51.8307,
        "longitude": -8.0056
      },
      {
        "name": "The Glucksman Gallery",
        "type": "Contemporary Art Gallery/Architectural Landmark",
        "description": "The Glucksman Gallery is an architecturally significant contemporary cultural center on the UCC campus. Its floating design and extensive glazing create a dynamic interplay between art and nature, hosting rotating exhibitions that engage with social and civic issues.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Open year-round with climate-controlled galleries. Afternoon visits provide optimal natural light to appreciate both the architecture and the exhibitions.",
        "booking_tips": "No advance booking is required for general admission; special events or workshops may require registration. Guided tours are available on selected days.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 51.8936,
        "longitude": -8.4911
      },
      {
        "name": "Kinsale",
        "type": "Historic Town/Culinary Destination",
        "description": "Kinsale is a picturesque historic harbor town known for its narrow streets, brightly painted Georgian and Victorian buildings, and an exceptional culinary scene. It offers a mix of maritime history, fortified sites, and gourmet dining experiences.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Accessible year-round with varying atmospheres by season—vibrant in summer and more authentic in winter. Special events include the annual Gourmet Festival in October.",
        "booking_tips": "No booking is required for town exploration; however, restaurant reservations are highly recommended during summer evenings. Guided walking tours are available.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 3,
          "cultural_significance": 5
        },
        "latitude": 51.7054,
        "longitude": -8.5222
      },
      {
        "name": "Cork Opera House",
        "type": "Performance Venue/Cultural Center",
        "description": "Cork Opera House is the city's premier performing arts venue, housed in a modernist building in Emmet Place. It hosts a diverse range of performances from international symphony orchestras to contemporary rock concerts.",
        "indoor": true,
        "best_time": "Evening",
        "price_range": "Expensive",
        "seasonal_notes": "Operates year-round with performances most evenings. Seasonal programming varies, with major festivals in summer and traditional productions in winter.",
        "booking_tips": "Advance ticket booking is essential, particularly on weekends. Arrive early to enjoy pre-show dining options in nearby restaurants.",
        "ratings": {
          "cost_estimate": 35,
          "suggested_duration_hours": 2.5,
          "cultural_significance": 4
        },
        "latitude": 51.8994,
        "longitude": -8.4741
      },
      {
        "name": "Michael Collins House",
        "type": "Biographical Museum/Historic House",
        "description": "Michael Collins House is a biographical museum dedicated to one of Ireland's most significant revolutionary leaders, located in a restored Georgian townhouse in Clonakilty. It chronicles Collins' life from childhood through revolutionary leadership and his early death.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round with extended summer hours during peak tourist season. Rotating temporary exhibitions and special events mark significant anniversaries in Collins' life.",
        "booking_tips": "No advance booking is required for individual visits; group tours should be arranged in advance. Photography is permitted in public areas with some restrictions.",
        "ratings": {
          "cost_estimate": 7,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 51.6228,
        "longitude": -8.9054
      },
      {
        "name": "Old Cork Waterworks Experience",
        "type": "Industrial Heritage/Science Center",
        "description": "The Old Cork Waterworks Experience preserves a magnificent Victorian industrial complex that supplied Cork with water from 1768 to the mid-20th century. Now a heritage attraction, it combines authentic engineering history with interactive science education.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round with consistent indoor exhibitions. Summer brings additional visitors and expanded demonstration schedules, while winter offers a more atmospheric experience.",
        "booking_tips": "No advance booking is required for individual visits; group tours should be arranged in advance. Photography is permitted throughout, and a small café is available on-site.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 3
        },
        "latitude": 51.8973,
        "longitude": -8.5065
      },
      {
        "name": "St. Peter's Cork",
        "type": "Heritage Center/Cultural Venue",
        "description": "St. Peter's Cork is a cultural center housed in a restored 18th-century church in Cork’s historic core. It features exhibitions, performances, and community events that celebrate the city's social and cultural heritage.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Open year-round with rotating exhibitions and seasonal events. Afternoon visits offer optimal natural light through the original Georgian windows.",
        "booking_tips": "No booking is required for general admission; special events may require tickets. Guided tours are available and photography is permitted.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 51.8988,
        "longitude": -8.4770
      },
      {
        "name": "Fota House, Arboretum & Gardens",
        "type": "Historic House/Botanical Gardens",
        "description": "Fota House, Arboretum and Gardens is one of Ireland's finest examples of Regency architecture, surrounded by internationally significant botanical collections on a scenic island in Cork Harbour. The house and gardens offer insights into aristocratic life and horticultural practices.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Open from March through October with reduced winter openings for the gardens. Each season offers distinct botanical displays—from spring flowering to autumn foliage.",
        "booking_tips": "House visits are by guided tour only. Tours are available in English and photography is permitted in most areas. Allow at least 3 hours for a comprehensive visit.",
        "ratings": {
          "cost_estimate": 13,
          "suggested_duration_hours": 3,
          "cultural_significance": 5
        },
        "latitude": 51.8883,
        "longitude": -8.3037
      },
      {
        "name": "Bantry House & Garden",
        "type": "Historic House/Garden Estate",
        "description": "Bantry House and Garden is a magnificent 18th-century mansion overlooking Bantry Bay, featuring exceptional European fine art collections and elaborate Italian-inspired gardens. It remains a living family home with intimate visitor experiences.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Open from April through October with the house and gardens closed during winter. Each season highlights different aspects of the gardens, from spring blooms to autumn mists.",
        "booking_tips": "No advance booking is required for general admission; however, overnight accommodation should be reserved in advance. Self-guided tours are available with informational panels throughout.",
        "ratings": {
          "cost_estimate": 15,
          "suggested_duration_hours": 3,
          "cultural_significance": 5
        },
        "latitude": 51.6791,
        "longitude": -9.4549
      },
      {
        "name": "Cork Public Museum",
        "type": "City Museum/Historical Collection",
        "description": "Cork Public Museum occupies an elegant Georgian building with a modern extension in Fitzgerald's Park, housing diverse collections that trace the city’s evolution from prehistoric settlement to modern European cultural hub.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Open year-round with consistent indoor exhibitions. Temporary exhibitions rotate three times annually, and the museum frequently hosts special events.",
        "booking_tips": "No advance booking is required for individual visits; group tours should be arranged in advance. Photography is permitted with some restrictions for artifact preservation.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 4
        },
        "latitude": 51.8964,
        "longitude": -8.4955
      },
      {
        "name": "Cork City Gaol (Evening Experience)",
        "type": "Historical Prison/Museum",
        "description": "An alternative experience at Cork City Gaol focusing on the eerie ambiance of its shadowy cell blocks. This version features special evening tours with ghost stories, dramatic historical recreations, and immersive exhibitions.",
        "indoor": true,
        "best_time": "Evening",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round with consistent interior conditions regardless of weather. Summer brings peak tourist numbers, while winter visits emphasize the cool, shadowy cell blocks. Special tours and Halloween events are scheduled throughout the year.",
        "booking_tips": "Online tickets are recommended to avoid queues, especially during summer and school holidays. Located in Sunday's Well, approximately 2 km from Cork city center, it is accessible by bus or foot. Guided tours are available.",
        "ratings": {
          "cost_estimate": 12,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 51.9023,
        "longitude": -8.4868
      },
      {
        "name": "The English Market",
        "type": "Food Market/Cultural Heritage",
        "description": "The English Market is Cork's culinary crown jewel—a covered food emporium dating from 1788. Its ornate Victorian interior and diverse array of independent traders offer an authentic taste of Irish food traditions.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Free",
        "seasonal_notes": "Open year-round Monday through Saturday. Morning visits capture the freshest produce and authentic market atmosphere, while weekends are more vibrant with larger crowds.",
        "booking_tips": "No booking is required. Located in the city center, it is easily accessible on foot. Allow at least 1 hour to explore the various vendors and enjoy a meal at one of the market cafés.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1.5,
          "cultural_significance": 5
        },
        "latitude": 51.8986,
        "longitude": -8.4740
      },
      {
        "name": "St. Fin Barre's Cathedral",
        "type": "Cathedral/Religious Site",
        "description": "St. Fin Barre's Cathedral is Cork's most magnificent ecclesiastical building—a French Gothic Revival masterpiece designed by William Burges. It features dramatic spires, intricate stone carvings, and stunning stained glass windows.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round with regular religious services. Morning light streaming through the east windows highlights its interior beauty. Special organ recitals and choral services are held throughout the year.",
        "booking_tips": "A small donation is requested for tourists; worship attendees enter for free. Guided tours are available at scheduled times, and visitors should dress respectfully.",
        "ratings": {
          "cost_estimate": 5,
          "suggested_duration_hours": 1,
          "cultural_significance": 5
        },
        "latitude": 51.8972,
        "longitude": -8.4806
      },
      {
        "name": "Fota Wildlife Park",
        "type": "Zoological Garden/Conservation Center",
        "description": "Fota Wildlife Park is one of Europe’s most progressive zoological facilities, operating on a free-range philosophy across 100 acres on Fota Island. It features barrier-free habitats and hosts significant conservation and educational programs.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round with both outdoor habitats and climate-controlled indoor areas. Summer brings extended hours and additional keeper talks, while winter offers a unique viewing experience.",
        "booking_tips": "Online tickets offer discounts and allow you to skip the queues. The park is accessible by train or car, and a park app provides interactive maps and daily schedules.",
        "ratings": {
          "cost_estimate": 18,
          "suggested_duration_hours": 4,
          "cultural_significance": 4
        },
        "latitude": 51.8854,
        "longitude": -8.3107
      },
      {
        "name": "Crawford Art Gallery",
        "type": "Art Museum/Cultural Center",
        "description": "Crawford Art Gallery is Cork's premier art institution, housing a collection from ancient Greek sculpture to contemporary Irish art within a historic building that reflects nearly 300 years of civic development.",
        "indoor": true,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Open year-round with climate-controlled galleries. Special exhibitions rotate quarterly, and the museum often hosts seasonal events and artist talks.",
        "booking_tips": "No advance booking is required for general admission; special events may need separate tickets. Guided tours are available and photography is permitted without flash.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 51.8998,
        "longitude": -8.4747
      },
      {
        "name": "Blarney Castle & Gardens",
        "type": "Medieval Castle/Historic Gardens",
        "description": "Blarney Castle is one of Ireland's most iconic medieval structures, famous for the Blarney Stone which is said to bestow 'the gift of eloquence' upon those who kiss it. The castle is set amid 60 acres of diverse gardens and parkland.",
        "indoor": false,
        "best_time": "Morning",
        "price_range": "Expensive",
        "seasonal_notes": "Open year-round with dramatically different garden experiences by season. Morning visits are recommended to avoid peak crowds around the Blarney Stone.",
        "booking_tips": "Online tickets are recommended to avoid queues. Ample parking is available, and guided tours can enhance your visit. Wear practical footwear for the castle's narrow stairs and garden paths.",
        "ratings": {
          "cost_estimate": 25,
          "suggested_duration_hours": 3,
          "cultural_significance": 5
        },
        "latitude": 51.9292,
        "longitude": -8.5706
      },
      {
        "name": "Nano Nagle Place",
        "type": "Heritage Center/Urban Garden",
        "description": "Nano Nagle Place is a regenerated historic convent complex in Cork’s center that commemorates Nano Nagle, an 18th-century educator. It features beautifully preserved buildings, contemplative gardens, and community spaces.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Budget",
        "seasonal_notes": "Open year-round with consistent interior exhibitions. The gardens are especially appreciated in summer, while winter events reflect Catholic traditions.",
        "booking_tips": "No advance booking is required for general admission; guided tours are available. Photography is allowed, and the on-site Good Day Deli offers sustainable cuisine.",
        "ratings": {
          "cost_estimate": 8,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 51.8968,
        "longitude": -8.4783
      },
      {
        "name": "Elizabeth Fort",
        "type": "Historic Fortification/Viewing Point",
        "description": "Elizabeth Fort is a 17th-century star-shaped artillery fortification offering significant military heritage and spectacular panoramic views across Cork city. Its restored ramparts and exhibition spaces detail Cork's colonial and military history.",
        "indoor": false,
        "best_time": "Afternoon",
        "price_range": "Free",
        "seasonal_notes": "Open year-round; summer evenings offer extended hours and sunset views. Note that strong winds may occur, so bring appropriate layers.",
        "booking_tips": "No booking is required for general admission. Self-guided exploration is supported by informational panels in multiple languages.",
        "ratings": {
          "cost_estimate": 0,
          "suggested_duration_hours": 1,
          "cultural_significance": 4
        },
        "latitude": 51.8963,
        "longitude": -8.4802
      },
      {
        "name": "Cobh Heritage Centre",
        "type": "Maritime Museum/Emigration Experience",
        "description": "The Cobh Heritage Centre is located in a restored Victorian railway station in the historic port town of Cobh. It offers an emotionally powerful exploration of Irish emigration history through immersive exhibitions and genealogy services.",
        "indoor": true,
        "best_time": "Morning",
        "price_range": "Moderate",
        "seasonal_notes": "Open year-round with consistent indoor exhibitions. Special commemorative events and seasonal exhibitions mark significant maritime anniversaries.",
        "booking_tips": "Tickets are available on-site, though advance booking is recommended during summer peak season. Audio guides and photography (with some restrictions) enhance the experience.",
        "ratings": {
          "cost_estimate": 14,
          "suggested_duration_hours": 2,
          "cultural_significance": 5
        },
        "latitude": 51.8505,
        "longitude": -8.2952
      },
      {
        "name": "Blackrock Castle Observatory",
        "type": "Castle/Science Center",
        "description": "Blackrock Castle Observatory uniquely combines 16th-century defensive architecture with interactive astronomical exhibits. Housed in a historic coastal fortress at the entrance to Cork Harbor, it offers public science programs and stargazing sessions.",
        "indoor": true,
        "best_time": "Evening",
        "price_range": "Moderate"
      }
    ]
  }
  