{
    "Spring": {
        "activities": [
            {
                "name": "Cork St. Patrick's Festival",
                "type": "Festival",
                "description": "Experience Ireland's national celebration with Cork's vibrant parade, street performances, music events, and family activities throughout the city center, showcasing local culture and community spirit.",
                "indoor": false,
                "best_time": "March 17th and surrounding days",
                "price_range": "Free",
                "seasonal_notes": "One of Ireland's most important cultural celebrations, with Cork city hosting its own distinctive festivities with local flair and community involvement.",
                "booking_tips": "No booking required for the parade, but arrive early for good viewing spots. Check the festival program online for any ticketed events happening around the city."
            },
            {
                "name": "Cork City Gaol Heritage Centre",
                "type": "Historic Site",
                "description": "Explore this remarkable 19th-century former prison transformed into a museum, with its imposing Gothic architecture and fascinating exhibitions about Cork's social and political history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers comfortable conditions for exploring both the indoor exhibits and the exterior architecture without summer crowds.",
                "booking_tips": "Purchase tickets online to avoid queues. Audio guides available in multiple languages and provide rich historical context."
            },
            {
                "name": "Blackrock Castle Observatory",
                "type": "Science Center/Historic Site",
                "description": "Visit this unique attraction combining a 16th-century castle with a modern interactive astronomy center, offering hands-on exhibits, a planetarium, and stunning views of Cork Harbour.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring evenings with clearer skies are ideal for the astronomy demonstrations and telescope viewings that are often scheduled.",
                "booking_tips": "Check the website for special evening astronomy events which may require advance booking."
            },
            {
                "name": "Fitzgerald's Park and Cork Public Museum",
                "type": "Park/Museum",
                "description": "Explore Cork's central park as it bursts into spring bloom, with formal gardens, sculptures, a playground, and riverside walks, plus the Cork Public Museum showcasing the city's rich history.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (Park) / Budget (Museum)",
                "seasonal_notes": "Spring brings colorful displays of flowers and new foliage to the park, making it particularly scenic after winter.",
                "booking_tips": "No booking required. The museum is free to visit and provides a good indoor option if spring showers appear."
            },
            {
                "name": "Cork International Choral Festival",
                "type": "Music Festival",
                "description": "Experience one of Europe's premier choral festivals with performances by international and local choirs in venues throughout Cork city, from grand concert halls to intimate churches.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Held annually in spring (late April/early May), this festival brings beautiful vocal music to venues across the city.",
                "booking_tips": "Book tickets for popular gala concerts well in advance through the festival website. Many lunchtime and community performances are free but fill up quickly."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Cork Harbour Festival",
                "type": "Maritime Festival",
                "description": "Celebrate Cork's maritime heritage with this week-long festival featuring boat tours, kayaking experiences, river races, seafood markets, and cultural events around Cork Harbour, the second-largest natural harbor in the world.",
                "indoor": false,
                "best_time": "Varies by event",
                "price_range": "Varies",
                "seasonal_notes": "Held in early summer (typically June), the festival makes the most of long summer days and celebrates Cork's deep connection to the sea.",
                "booking_tips": "Book water activities like kayaking tours and boat trips well in advance as they're extremely popular and have limited capacity."
            },
            {
                "name": "Live at the Marquee",
                "type": "Concert Series",
                "description": "Experience Cork's premier summer concert series featuring international and Irish music stars performing in a specially constructed marquee venue with excellent acoustics and atmosphere.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "This iconic Cork summer tradition runs from June through July, bringing major musical acts to the city.",
                "booking_tips": "Book tickets as soon as they're released as popular acts sell out quickly. Check the website for the summer lineup announcements in spring."
            },
            {
                "name": "Cork Midsummer Festival",
                "type": "Arts Festival",
                "description": "Immerse yourself in contemporary arts with this vibrant festival featuring theater, dance, music, and visual arts in both conventional venues and unexpected public spaces throughout Cork city.",
                "indoor": false,
                "best_time": "Afternoon and Evening",
                "price_range": "Varies",
                "seasonal_notes": "Coinciding with the longest days of the year in June, this festival transforms the city with contemporary arts and performances.",
                "booking_tips": "While some events are free in public spaces, book tickets for theater and performance pieces early as they often sell out."
            },
            {
                "name": "Fota Wildlife Park",
                "type": "Wildlife Park",
                "description": "Explore this world-class wildlife park on Fota Island featuring free-roaming animals in natural habitats, including rare and endangered species, just a short train ride from Cork city.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings active animals, newborn wildlife, and lush vegetation to the park, though it can be busier during school holidays.",
                "booking_tips": "Purchase tickets online in advance to avoid queues, especially during peak summer season. Arrive early to see animals at their most active."
            },
            {
                "name": "Kayaking on the River Lee",
                "type": "Water Activity",
                "description": "Paddle through the heart of Cork city on a guided kayaking tour, offering unique perspectives of historic buildings, bridges, and urban wildlife from the water.",
                "indoor": false,
                "best_time": "Morning or Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides warmer water temperatures and longer daylight hours, with evening tours offering beautiful lighting on the city's architecture.",
                "booking_tips": "Book with operators like 'Atlantic Sea Kayaking' in advance, especially for sunset tours which are particularly popular in summer."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Cork Jazz Festival",
                "type": "Music Festival",
                "description": "Experience one of Europe's premier jazz festivals with hundreds of performances across the city, from international headliners in concert halls to intimate jazz sessions in historic pubs.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Held over the October bank holiday weekend, this iconic festival transforms Cork into a jazz lover's paradise with music filling every corner of the city.",
                "booking_tips": "Book headline acts well in advance. Many pub sessions are free but get busy, so arrive early. Festival passes available for multiple events."
            },
            {
                "name": "Cork Film Festival",
                "type": "Film Festival",
                "description": "Attend Ireland's oldest film festival showcasing international cinema, documentaries, shorts, and Irish films across various venues in Cork city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Typically held in November, this festival brings international cinema to Cork as the weather turns colder, offering perfect indoor entertainment.",
                "booking_tips": "Book popular screenings and events online in advance. Festival passes offer good value if attending multiple screenings."
            },
            {
                "name": "Kinsale Gourmet Festival",
                "type": "Food Festival",
                "description": "Indulge in this celebrated food festival in the picturesque coastal town of Kinsale (30 minutes from Cork city), featuring cooking demonstrations, tasting events, and special menus at Kinsale's renowned restaurants.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Held in October, this festival celebrates the autumn harvest and showcases Kinsale's reputation as the gourmet capital of Ireland.",
                "booking_tips": "Book festival tickets and accommodations months in advance as this popular event fills up quickly. Restaurant reservations essential."
            },
            {
                "name": "Dragon of Shandon Parade",
                "type": "Cultural Festival",
                "description": "Experience Cork's unique community Halloween parade featuring a giant illuminated dragon puppet and hundreds of costumed performers winding through the historic Shandon district.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on Halloween night (October 31st), this atmospheric parade celebrates the Celtic festival of Samhain with spectacular illuminated creations.",
                "booking_tips": "No booking required. Arrive early to get good viewing spots along the parade route, which is published online beforehand."
            },
            {
                "name": "Whale Watching in West Cork",
                "type": "Nature/Wildlife",
                "description": "Take a boat trip from coastal towns in West Cork to spot fin whales, humpbacks, and dolphins that frequent the waters off southern Ireland during the autumn migration season.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is prime whale-watching season off the Cork coast, particularly October and November when these magnificent creatures follow food sources along the coast.",
                "booking_tips": "Book with established operators like 'Whale Watch West Cork' in Baltimore or Union Hall. Trips are weather-dependent, so have flexible plans."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "GLOW Cork Christmas Celebration",
                "type": "Festival",
                "description": "Experience Cork's magical Christmas festival featuring a ferris wheel on Grand Parade, festive markets, illuminations, and a giant Christmas tree, transforming the city center into a winter wonderland.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free (some attractions have fees)",
                "seasonal_notes": "Running from late November through December, GLOW brings festive spirit to the city with spectacular light displays and family activities.",
                "booking_tips": "No booking required for general access, but arrive early on weekends to avoid crowds. Ferris wheel tickets can be purchased on-site."
            },
            {
                "name": "English Market Winter Food Experience",
                "type": "Food/Market",
                "description": "Explore Cork's historic covered market dating from 1788 at its most atmospheric season, with seasonal specialties, Christmas foods, and the warm bustle of this iconic culinary institution.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free to enter (purchases vary)",
                "seasonal_notes": "Winter brings special seasonal foods and festive atmosphere to this historic market, making it especially charming during the cold months.",
                "booking_tips": "No booking required. Visit early on weekday mornings to avoid crowds and see traders setting up. The Farmgate Café upstairs offers excellent views of the market below."
            },
            {
                "name": "Traditional Irish Music Sessions",
                "type": "Music/Cultural",
                "description": "Warm up in Cork's historic pubs with traditional Irish music sessions where local musicians gather to play authentic tunes in an informal, convivial atmosphere.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free (cost of drinks)",
                "seasonal_notes": "Winter is the perfect time to experience the cozy atmosphere of a traditional Irish session, with pubs like Sin É and The Corner House hosting regular music nights.",
                "booking_tips": "No booking required. Arrive early to get seating close to musicians. Check pub websites or social media for session schedules which may vary seasonally."
            },
            {
                "name": "Crawford Art Gallery Winter Exhibitions",
                "type": "Museum/Gallery",
                "description": "Visit Cork's premier art institution housed in a beautiful historic building, featuring both permanent collections of Irish art and special winter exhibitions in a peaceful, contemplative setting.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter brings special exhibitions and the gallery offers a warm, cultural haven during the cold months.",
                "booking_tips": "No booking required. Free guided tours available on selected days - check the website for current schedule."
            },
            {
                "name": "Cork Opera House Winter Season",
                "type": "Performing Arts",
                "description": "Enjoy seasonal performances at Cork's premier performance venue, from Christmas pantomimes and ballet to concerts and theater productions in a beautiful historic setting.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "The winter program typically includes festive shows, classic ballets like The Nutcracker, and New Year concerts.",
                "booking_tips": "Book popular Christmas shows months in advance as they sell out quickly. Check the website in autumn for the winter program announcement."
            }
        ]
    }
}