{
    "neighborhoods": [
        {
            "name": "City Centre",
            "alternate_names": [
                "Town Centre",
                "Victorian Quarter",
                "Georgian Cork"
            ],
            "character": "Historic and lively with a blend of Georgian architecture, medieval streets, and contemporary urban life, featuring colorful shop facades, pedestrianized areas, and cultural institutions radiating from the central island formed by the River Lee's north and south channels.",
            "location": {
                "central": true,
                "description": "Heart of Cork, centered around the island formed by the River Lee's two channels, including the main commercial streets, historic buildings, and core shopping districts.",
                "borders": [
                    "Shandon",
                    "St. Luke's",
                    "Victorian Quarter",
                    "University College Cork"
                ],
                "landmarks": [
                    "The English Market",
                    "St. Patrick's Street",
                    "Crawford Art Gallery",
                    "Grand Parade"
                ]
            },
            "history": {
                "overview": "Established as a monastic settlement in the 6th century, developed as a Viking trading port, flourished during the medieval era as a walled city, expanded significantly during the Georgian and Victorian periods, and evolved into a vibrant commercial and cultural hub while preserving its historic character.",
                "significance": "Represents Cork's evolution from ancient settlement to Viking port to medieval walled city to contemporary Irish cultural center.",
                "notable_events": [
                    "Founding by St. Finbarr in the 6th century",
                    "Viking settlement established in the 9th century",
                    "Medieval walled city development from 12th-17th centuries",
                    "Georgian expansion in the 18th century",
                    "Burning of Cork by British forces in 1920",
                    "Pedestrianization of central streets in the late 20th century"
                ]
            },
            "practical_info": {
                "transit": [
                    "Kent Railway Station within walking distance",
                    "Main bus terminal at Parnell Place",
                    "Extensive city bus network",
                    "Highly walkable central district"
                ],
                "safety": "Generally safe at all hours, with typical urban awareness advised on weekend nights",
                "best_time_to_visit": "Morning for markets, afternoon for shopping, evening for dining and pubs",
                "walkability": "Extremely walkable with pedestrianized streets and compact layout"
            },
            "appeal": {
                "known_for": [
                    "Historic architecture",
                    "English Market food hall",
                    "Traditional Irish pubs"
                ],
                "atmosphere": [
                    "Charming",
                    "Lively",
                    "Authentically Irish"
                ],
                "best_for": [
                    "First-time visitors",
                    "Food enthusiasts",
                    "Shopping and nightlife"
                ]
            },
            "categories": {
                "touristy": 4,
                "residential": 2,
                "green_spaces": 2,
                "shopping": 5,
                "dining": 5,
                "nightlife": 5,
                "cultural": 4,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "The English Market",
                        "type": "Historic Food Market",
                        "description": "Ireland's most famous covered food market dating from 1788, featuring local producers, traditional Cork specialties, and gourmet foods under a grand Victorian interior.",
                        "appeal": "Experience Cork's culinary heart with traditional spiced beef, artisanal cheeses, fresh seafood, and the distinctive atmosphere of a market that has served the city for over 230 years."
                    },
                    {
                        "name": "Crawford Art Gallery",
                        "type": "National Cultural Institution",
                        "description": "Historic gallery housing an important collection of Irish and European art in a beautiful 18th-century building, featuring works from the 18th century to contemporary pieces.",
                        "appeal": "Discover Ireland's artistic heritage in one of the country's leading cultural institutions with significant collections in an atmospheric historic setting."
                    },
                    {
                        "name": "St. Patrick's Street",
                        "type": "Historic Commercial Boulevard",
                        "description": "Cork's elegant curved main shopping street with beautiful architecture, independent retailers, and international brands in a distinctive sweeping layout.",
                        "appeal": "Stroll along 'Pana' (as locals call it) to experience Cork's premier shopping district with its distinctive curved design and mix of historic buildings and modern retail."
                    }
                ],
                "dining": [
                    {
                        "name": "Market Lane",
                        "cuisine": "Modern Irish",
                        "price_range": "€€-€€€",
                        "known_for": "Contemporary Irish cuisine using English Market ingredients",
                        "atmosphere": "Bustling bistro in historic building with wood and brick interior."
                    },
                    {
                        "name": "Farmgate Café",
                        "cuisine": "Traditional Irish",
                        "price_range": "€€",
                        "known_for": "Classic Cork dishes served overlooking the English Market",
                        "atmosphere": "Authentic market dining with balcony views over market stalls."
                    }
                ],
                "activities": [
                    {
                        "name": "Cork Heritage Pub Trail",
                        "type": "Cultural",
                        "description": "Self-guided tour of historic pubs with centuries of stories, traditional music, and authentic Cork atmosphere.",
                        "suitable_for": [
                            "History enthusiasts",
                            "Social travelers",
                            "Traditional music fans"
                        ]
                    },
                    {
                        "name": "Shopping on Oliver Plunkett Street",
                        "type": "Shopping",
                        "description": "Explore Cork's award-winning shopping street with independent retailers, traditional Irish shops, and lively street performers.",
                        "suitable_for": [
                            "Shopping enthusiasts",
                            "Souvenir hunters",
                            "Those seeking local products"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to be at the heart of Cork's historic and commercial center",
                "You prioritize walkability and easy access to dining, shopping, and cultural sites",
                "You enjoy lively urban atmosphere with authentic Irish character"
            ],
            "avoid_if": [
                "You're seeking quiet residential areas",
                "You're sensitive to weekend night noise from pubs and clubs",
                "You prefer modern accommodations with parking"
            ],
            "insider_tips": [
                "Visit the English Market early on weekday mornings to see traders setting up and enjoy breakfast at the Farmgate Café above the market",
                "The Coal Quay area offers some of the most interesting independent shops and cafés just off the main shopping streets",
                "For the best photos of the city center, cross the river to either quay for panoramic views of the central island"
            ]
        },
        {
            "name": "Shandon",
            "alternate_names": [
                "Historic Shandon",
                "North Cathedral District",
                "Cork's Historic Heart"
            ],
            "character": "Authentic and historic working-class neighborhood with a strong sense of local identity, featuring steep narrow streets, colorful terraced houses, and commanding views over the city from its hillside position north of the River Lee.",
            "location": {
                "central": false,
                "description": "North of the River Lee on a steep hill overlooking the city center, centered around the iconic Shandon Bells tower and North Cathedral.",
                "borders": [
                    "City Centre",
                    "St. Luke's",
                    "Blackpool",
                    "Sunday's Well"
                ],
                "landmarks": [
                    "St. Anne's Church (Shandon Bells)",
                    "Firkin Crane",
                    "North Cathedral",
                    "Butter Museum"
                ]
            },
            "history": {
                "overview": "Developed in the 17th and 18th centuries as a hub of Cork's butter trade and merchant activity, became the center of the city's dairy export industry with the establishment of the Butter Exchange in 1770, preserved its distinctive character through centuries of economic change, and continues as an authentic neighborhood with strong connections to Cork's mercantile past.",
                "significance": "Embodies Cork's historic commercial heritage, particularly the butter trade that made Cork one of the world's largest butter exporters in the 18th and 19th centuries.",
                "notable_events": [
                    "Establishment of St. Anne's Church with Shandon Bells in 1722",
                    "Founding of the Cork Butter Market in 1770, becoming the world's largest butter market",
                    "Construction of the North Cathedral in the 19th century",
                    "Urban renewal initiatives in the late 20th century",
                    "Designation as a historic conservation area"
                ]
            },
            "practical_info": {
                "transit": [
                    "City bus routes connecting to center",
                    "15-minute uphill walk from city center",
                    "Limited parking on narrow streets",
                    "Taxi recommended for those with mobility issues due to steep hills"
                ],
                "safety": "Generally safe neighborhood with strong community feel",
                "best_time_to_visit": "Daytime for attractions and views, especially morning for clear city vistas",
                "walkability": "Walkable but hilly with some steep inclines"
            },
            "appeal": {
                "known_for": [
                    "Shandon Bells tower",
                    "Panoramic city views",
                    "Authentic Cork character"
                ],
                "atmosphere": [
                    "Historic",
                    "Genuine",
                    "Working-class Irish"
                ],
                "best_for": [
                    "Cultural tourists",
                    "Photography enthusiasts",
                    "Those seeking authentic local character"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 4,
                "green_spaces": 2,
                "shopping": 1,
                "dining": 2,
                "nightlife": 2,
                "cultural": 4,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "St. Anne's Church (Shandon Bells)",
                        "type": "Historic Bell Tower",
                        "description": "Iconic 18th-century church tower with distinctive two-tone facade and famous bells that visitors can ring themselves with views over the entire city.",
                        "appeal": "Climb the tower to ring the bells that have called to Corkonians for centuries and enjoy spectacular 360-degree views from one of Cork's most recognizable landmarks."
                    },
                    {
                        "name": "Cork Butter Museum",
                        "type": "Specialist Museum",
                        "description": "Unique museum telling the story of Ireland's most important food export and Cork's central role in the international butter trade.",
                        "appeal": "Discover the unexpected significance of butter to Ireland's economy and Cork's history in this small but fascinating museum near where the world's largest butter market once stood."
                    }
                ],
                "dining": [
                    {
                        "name": "Alchemy Coffee and Books",
                        "cuisine": "Café",
                        "price_range": "€",
                        "known_for": "Specialty coffee and light meals in literary setting",
                        "atmosphere": "Cozy, book-lined café with community focus."
                    }
                ],
                "activities": [
                    {
                        "name": "Bell Ringing at Shandon",
                        "type": "Cultural",
                        "description": "Climb the tower of St. Anne's Church and ring the bells yourself, playing simple tunes that sound out across the city.",
                        "suitable_for": [
                            "Families with children",
                            "Music enthusiasts",
                            "Photography lovers"
                        ]
                    },
                    {
                        "name": "Shandon Historic Walk",
                        "type": "Self-guided tour",
                        "description": "Follow narrow lanes and steep streets to discover hidden corners of Cork's most historic neighborhood.",
                        "suitable_for": [
                            "History enthusiasts",
                            "Photographers",
                            "Urban explorers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You seek authentic local character away from tourist centers",
                "You appreciate historic neighborhoods with working-class roots",
                "You enjoy panoramic views and don't mind hilly terrain"
            ],
            "avoid_if": [
                "You have mobility issues or difficulty with steep hills",
                "You prefer central locations with easy access to amenities",
                "You want a wide selection of dining and entertainment options"
            ],
            "insider_tips": [
                "The view from St. Anne's Church tower is best in early morning light when the city is less hazy",
                "Listen for the bells of Shandon playing tunes at noon each day",
                "The narrow lane called 'Church Street' offers the most picturesque views of Shandon's colored houses"
            ]
        },
        {
            "name": "Victorian Quarter",
            "alternate_names": [
                "MacCurtain Street Area",
                "North City",
                "Cultural District"
            ],
            "character": "Revitalized and trendy neighborhood with vibrant Victorian architecture, featuring a thriving food and drink scene, cultural venues, and an emerging creative atmosphere in beautifully restored historic buildings north of the River Lee.",
            "location": {
                "central": true,
                "description": "Just north of the River Lee across from the city center island, centered around MacCurtain Street with its distinctive Victorian commercial buildings.",
                "borders": [
                    "City Centre",
                    "Shandon",
                    "St. Luke's",
                    "Kent Station"
                ],
                "landmarks": [
                    "The Everyman Theatre",
                    "St. Patrick's Bridge",
                    "Cork Opera House",
                    "Mother Jones Flea Market"
                ]
            },
            "history": {
                "overview": "Developed in the late 19th century as a commercial extension of Cork city, experienced economic decline in the mid-20th century, underwent significant revitalization in recent decades, and has transformed into a cultural and culinary hotspot while preserving its Victorian architectural character.",
                "significance": "Represents successful urban regeneration that honors historic architecture while creating a contemporary, vibrant district.",
                "notable_events": [
                    "Victorian commercial development in the late 19th century",
                    "Opening of The Everyman Theatre in 1897",
                    "Economic decline in mid-20th century",
                    "Renovation of key historic buildings in early 2000s",
                    "Culinary and cultural renaissance in the 2010s",
                    "Designation as Cork's Victorian Quarter in recent years"
                ]
            },
            "practical_info": {
                "transit": [
                    "Kent Railway Station within walking distance",
                    "City bus routes along MacCurtain Street",
                    "5-minute walk from city center across St. Patrick's Bridge",
                    "Several parking options available"
                ],
                "safety": "Safe area popular with locals and visitors alike",
                "best_time_to_visit": "Evening for dining and entertainment, daytime for architecture appreciation",
                "walkability": "Very walkable with wide sidewalks along main streets"
            },
            "appeal": {
                "known_for": [
                    "Culinary scene",
                    "Victorian architecture",
                    "Cultural venues"
                ],
                "atmosphere": [
                    "Vibrant",
                    "Creative",
                    "Up-and-coming"
                ],
                "best_for": [
                    "Food and drink enthusiasts",
                    "Theater and music fans",
                    "Architecture admirers"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 3,
                "green_spaces": 1,
                "shopping": 3,
                "dining": 5,
                "nightlife": 4,
                "cultural": 4,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "The Everyman Theatre",
                        "type": "Historic Theatre",
                        "description": "Beautiful Victorian theater dating from 1897 with ornate interior, hosting a diverse program of plays, music, and comedy in a historic setting.",
                        "appeal": "Experience live performances in one of Ireland's most beautiful historic theaters with its original architectural features and intimate atmosphere."
                    },
                    {
                        "name": "St. Patrick's Bridge",
                        "type": "Historic Bridge",
                        "description": "Elegant limestone bridge from 1861 connecting the Victorian Quarter to the city center with classic design and river views.",
                        "appeal": "Cross this iconic Cork landmark that offers both beautiful architecture and excellent views along the River Lee in both directions."
                    }
                ],
                "dining": [
                    {
                        "name": "Greenes Restaurant",
                        "cuisine": "Modern Irish",
                        "price_range": "€€€-€€€€",
                        "known_for": "Innovative local cuisine in atmospheric courtyard setting",
                        "atmosphere": "Romantic restaurant with natural waterfall feature and historic surroundings."
                    },
                    {
                        "name": "The Glass Curtain",
                        "cuisine": "Contemporary Irish",
                        "price_range": "€€€",
                        "known_for": "Innovative cooking in historic former bakery building",
                        "atmosphere": "Sophisticated restaurant in beautifully restored Victorian industrial space."
                    }
                ],
                "activities": [
                    {
                        "name": "MacCurtain Street Food Trail",
                        "type": "Culinary",
                        "description": "Self-guided exploration of the area's acclaimed restaurants, cafés, and bars that have made this Cork's premier food district.",
                        "suitable_for": [
                            "Food enthusiasts",
                            "Culinary tourists",
                            "Social diners"
                        ]
                    },
                    {
                        "name": "Live Performance",
                        "type": "Entertainment",
                        "description": "Attend theater, music, or comedy at the district's various performance venues including The Everyman.",
                        "suitable_for": [
                            "Culture seekers",
                            "Theater fans",
                            "Evening entertainment"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You prioritize dining and nightlife experiences",
                "You appreciate Victorian architecture and cultural attractions",
                "You want to be close to the city center but in a less touristy area"
            ],
            "avoid_if": [
                "You prefer modern environments without historic character",
                "You're seeking quiet residential neighborhoods",
                "You want extensive green spaces nearby"
            ],
            "insider_tips": [
                "The best Victorian architecture can be viewed by looking up above the street-level shops along MacCurtain Street",
                "Several hotels in the area occupy beautifully restored historic buildings, offering accommodation with character",
                "Check the Cork Whiskey Bar at the Metropole Hotel for one of the city's best Irish whiskey selections"
            ]
        },
        {
            "name": "University College Cork",
            "alternate_names": [
                "UCC Area",
                "College Road",
                "Western Road District"
            ],
            "character": "Academic and leafy neighborhood with elegant limestone buildings, featuring historic university campus, scenic riverside walks, and a relaxed atmosphere with student energy in a green, park-like setting.",
            "location": {
                "central": false,
                "description": "Western area centered around the historic University College Cork campus, extending along the south channel of the River Lee with academic buildings and residential areas.",
                "borders": [
                    "City Centre",
                    "Mardyke",
                    "Sunday's Well",
                    "Glasheen"
                ],
                "landmarks": [
                    "University College Cork Quad",
                    "Lewis Glucksman Gallery",
                    "Fitzgerald's Park",
                    "Cork Public Museum"
                ]
            },
            "history": {
                "overview": "Established in 1845 as one of Ireland's first universities, developed around an iconic limestone quadrangle in Victorian Gothic style, expanded significantly throughout the 20th century, and evolved into a leading academic institution while maintaining its historic campus character.",
                "significance": "Represents Ireland's commitment to education and the influence of academic institutions on urban development and culture.",
                "notable_events": [
                    "Founding of Queen's College Cork in 1845 (later UCC)",
                    "Construction of the iconic limestone quadrangle building",
                    "Evolution to University College Cork in Irish independence era",
                    "Campus expansion in mid-to-late 20th century",
                    "Opening of the award-winning Glucksman Gallery in 2004",
                    "Designation of campus grounds as Ireland's first university museum"
                ]
            },
            "practical_info": {
                "transit": [
                    "City bus routes along Western Road and College Road",
                    "20-minute walk from city center",
                    "Limited parking on campus (public parking nearby)",
                    "Bike-friendly area with dedicated lanes"
                ],
                "safety": "Very safe area with 24-hour campus security",
                "best_time_to_visit": "Weekdays during academic term for campus atmosphere, weekends for quieter exploration",
                "walkability": "Excellent walking paths throughout campus and along river"
            },
            "appeal": {
                "known_for": [
                    "Historic university architecture",
                    "Riverside gardens and walks",
                    "Academic atmosphere"
                ],
                "atmosphere": [
                    "Scholarly",
                    "Green",
                    "Peaceful"
                ],
                "best_for": [
                    "Architecture enthusiasts",
                    "Garden lovers",
                    "Visitors seeking tranquil walks"
                ]
            },
            "categories": {
                "touristy": 2,
                "residential": 4,
                "green_spaces": 5,
                "shopping": 2,
                "dining": 3,
                "nightlife": 3,
                "cultural": 4,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "UCC Quad and Stone Corridor",
                        "type": "Historic Architecture",
                        "description": "Iconic Victorian Gothic quadrangle building with renowned Stone Corridor displaying ancient Ogham stones in a magnificent limestone setting.",
                        "appeal": "Walk through Ireland's finest university building with its ancient Celtic stone carvings and breathtaking Gothic architecture."
                    },
                    {
                        "name": "Lewis Glucksman Gallery",
                        "type": "Contemporary Art Gallery",
                        "description": "Award-winning modern gallery building set among mature trees, featuring contemporary art exhibitions in a stunning architectural space.",
                        "appeal": "Experience cutting-edge contemporary art in a building that has won multiple architectural awards, beautifully integrated into the historic campus landscape."
                    },
                    {
                        "name": "UCC Visitor Centre and Honan Chapel",
                        "type": "Cultural/Religious Site",
                        "description": "University visitor center with campus history displays adjacent to the exquisite Arts and Crafts style Honan Chapel with its remarkable Celtic Revival decoration.",
                        "appeal": "Discover the university's history and visit one of Ireland's most beautiful small chapels with its stunning Harry Clarke stained glass windows."
                    }
                ],
                "dining": [
                    {
                        "name": "Café Paradiso",
                        "cuisine": "Vegetarian",
                        "price_range": "€€-€€€",
                        "known_for": "World-renowned vegetarian cuisine by chef Denis Cotter",
                        "atmosphere": "Sophisticated yet relaxed dining in converted townhouse near UCC."
                    },
                    {
                        "name": "Natural Foods Bakery",
                        "cuisine": "Café/Bakery",
                        "price_range": "€-€€",
                        "known_for": "Artisan breads, healthy lunches and organic coffee",
                        "atmosphere": "Bright, welcoming café popular with students and staff."
                    }
                ],
                "activities": [
                    {
                        "name": "UCC Campus Walk",
                        "type": "Scenic/Cultural",
                        "description": "Self-guided tour of the historic campus with its stone buildings, sculptures, and Ireland's only university arboretum.",
                        "suitable_for": [
                            "Architecture enthusiasts",
                            "History buffs",
                            "Garden lovers"
                        ]
                    },
                    {
                        "name": "Fitzgerald's Park and River Lee Walk",
                        "type": "Outdoor/Leisure",
                        "description": "Explore Cork's most beautiful park adjacent to the campus and follow riverside paths along the Lee.",
                        "suitable_for": [
                            "Nature lovers",
                            "Families",
                            "Those seeking relaxation"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You appreciate academic environments and historic architecture",
                "You enjoy green spaces and riverside walks",
                "You prefer quieter areas with cultural attractions"
            ],
            "avoid_if": [
                "You want to be in the heart of Cork's commercial district",
                "You're seeking intensive shopping or nightlife",
                "You prefer ultra-modern surroundings"
            ],
            "insider_tips": [
                "The university grounds are open to visitors; don't miss the Stone Corridor with its ancient Ogham stones inside the main quadrangle",
                "UCC's campus contains over 2,500 different tree and plant species as Ireland's only university arboretum; free tree trail maps are available at the visitor center",
                "During term time, check UCC's public events calendar for free lectures, concerts, and exhibitions"
            ]
        }
    ],
    "activityTypes": {
        "spring": [
            "Cork International Choral Festival events throughout the city",
            "Exploring Fitzgerald's Park as spring blooms appear",
            "Literary walking tours based on Frank O'Connor and Seán Ó Faoláin",
            "Exhibitions at Crawford Art Gallery",
            "Bird watching at Lough Park",
            "Farmers markets at Coal Quay",
            "Cycling the Blackrock Castle Greenway as nature awakens",
            "St. Patrick's Festival events"
        ],
        "summer": [
            "Cork Midsummer Festival",
            "Live at the Marquee concert series",
            "Open-air performances in Fitzgerald's Park",
            "Kayaking on the River Lee",
            "Picnics in the gardens of University College Cork",
            "Evening sessions at traditional music pubs",
            "Cork Harbour Festival maritime activities",
            "Sailing trips from Crosshaven to Cork Harbour"
        ],
        "autumn": [
            "Cork Jazz Festival",
            "Cork Film Festival screenings at various venues",
            "Guinness Cork Oyster Festival",
            "Food festivals celebrating harvest season",
            "Dragon of Shandon Samhain parade",
            "Literature events at Cork City Library",
            "Theater performances at The Everyman",
            "Cork Folk Festival"
        ],
        "winter": [
            "GLOW Cork Christmas Celebration with ferris wheel",
            "Christmas markets on Grand Parade",
            "New Year's Eve celebrations at the Opera House",
            "Winter traditional music sessions in historic pubs",
            "Indoor food experiences at the English Market",
            "Museum exhibitions during the dark season",
            "Winter light installations in the city center",
            "Cozy literary readings at bookshops and cafés"
        ]
    }
}