{
  "sites": [
    {
      "name": "National Archaeological Museum",
      "type": "Museum",
      "description": "The National Archaeological Museum of Naples houses one of the world's most important collections of Greek and Roman antiquities, including artifacts from Pompeii and Herculaneum. The museum's highlights include the Farnese collection of classical sculptures, ancient Roman mosaics from Pompeii, and the Secret Cabinet (Gabinetto Segreto) containing erotic artifacts. The building itself, a 16th-century palace, was converted to a museum in the late 18th century.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded during winter months except around holidays. Summer brings more tourists but provides relief from heat with air-conditioned galleries. Some sections may close on a rotating basis for restoration.",
      "booking_tips": "Online booking recommended to avoid lines. Closed on Tuesdays. Consider the ArteCard for combined entry to multiple Naples attractions. Audio guides available in multiple languages.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 40.8531,
      "longitude": 14.2507
    },
    {
      "name": "Naples Cathedral (Duomo di Napoli)",
      "type": "Church",
      "description": "The Naples Cathedral, dedicated to San Gennaro (Saint Januarius), blends various architectural styles including Gothic, Renaissance, and Baroque elements. Construction began in the 13th century on the site of earlier religious buildings. The highlight is the Chapel of San Gennaro containing the saint's blood relics, which are said to liquefy during special ceremonies. The cathedral also houses important artworks and the ancient Baptistery of San Giovanni in Fonte, dating from the 4th century.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Special religious ceremonies occur in May, September, and December when the blood miracle is observed. Dress modestly (covered shoulders and knees). Visit on weekday mornings to avoid crowds and tour groups.",
      "booking_tips": "No booking required for the main cathedral. The Treasury Museum requires a separate ticket. Check for mass times as the cathedral closes to tourists during services.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 40.8524,
      "longitude": 14.2618
    },
    {
      "name": "Cappella Sansevero",
      "type": "Chapel/Museum",
      "description": "This baroque chapel houses one of Italy's most remarkable sculptures, the Veiled Christ by Giuseppe Sanmartino. The marble masterpiece depicts Christ covered by a transparent veil, rendered with such skill that the veil appears genuinely transparent. Other notable works include anatomical machines - two 18th-century human skeletons with intact, artificially recreated vascular systems. The chapel was commissioned by Raimondo di Sangro, Prince of Sansevero, a noted scientist and alchemist.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with consistent indoor temperature. Small space means it can feel crowded during peak tourist season (May-September). Consider visiting during shoulder seasons for a less crowded experience.",
      "booking_tips": "Advance online booking essential to avoid long lines. Photography not permitted inside. Closed on Tuesdays. The chapel is small and can accommodate limited visitors at once.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 40.8500,
      "longitude": 14.2569
    },
    {
      "name": "Castel dell'Ovo",
      "type": "Castle",
      "description": "The oldest standing fortification in Naples, Castel dell'Ovo (Egg Castle) sits on the small island of Megaride, now connected to the mainland. According to legend, the Roman poet Virgil placed a magical egg in the castle's foundations, and Naples' fate is tied to this egg. The castle offers panoramic views of the Gulf of Naples and Mount Vesuvius. Its terraces, halls, and ramparts provide a glimpse into the city's medieval military architecture.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Beautiful at sunset when golden light illuminates the seafront. The surrounding area of Borgo Marinaro features restaurants with scenic views. Interior exhibitions vary throughout the year. Outdoor areas may close during severe weather.",
      "booking_tips": "No booking required. Check opening hours as they vary seasonally. Some areas may be closed for private events. The walk up to the castle involves slopes and uneven surfaces.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 40.8295,
      "longitude": 14.2478
    },
    {
      "name": "Palazzo Reale",
      "type": "Palace/Museum",
      "description": "Naples' Royal Palace was one of four residences used by the Bourbon Kings during their rule of the Kingdom of the Two Sicilies. The palace overlooks Piazza del Plebiscito and features a magnificent staircase, the royal apartments decorated with furniture and art objects from the Bourbon period, and the Royal Chapel. The Teatrino di Corte (Court Theater) and National Library are also housed within the complex.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "The palace offers a cool retreat during summer heat. Different sections may close on different days. The attached gardens provide pleasant outdoor space with seasonal plantings.",
      "booking_tips": "Online booking available. Guided tours enhance the experience. Included in the Campania ArteCard. Free entry on the first Sunday of each month.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.8361,
      "longitude": 14.2503
    },
    {
      "name": "Pompeii Archaeological Park",
      "type": "Archaeological Site",
      "description": "Though located outside Naples proper, Pompeii is a must-visit day trip from the city. This ancient Roman city was preserved by ash when Mount Vesuvius erupted in 79 CE, creating an unprecedented archaeological snapshot of daily life. Visitors can explore streets, houses, temples, theaters, forums, and shops with remarkably preserved details including frescoes, mosaics, and graffiti. The site continues to yield new discoveries as excavations progress.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Expensive",
      "seasonal_notes": "Very hot and crowded in summer with limited shade. Spring and fall offer better weather for exploration. Winter brings fewer crowds and mild temperatures, though with increased chance of rain. Some houses open on rotation to preserve delicate features.",
      "booking_tips": "Advance online booking essential. Wear comfortable shoes and bring water, sun protection in summer. Consider guided tour or detailed guidebook to understand context. Combined tickets available with Herculaneum. Accessible by Circumvesuviana train.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 5,
        "cultural_significance": 5
      },
      "latitude": 40.7508,
      "longitude": 14.4856
    },
    {
      "name": "Spaccanapoli",
      "type": "District",
      "description": "This straight, narrow street (officially Via Benedetto Croce and Via San Biagio dei Librai) cuts through Naples' historic center, literally 'splitting Naples' in two. The bustling thoroughfare and surrounding alleys showcase the authentic character of the city with shops, churches, street food vendors, and daily life unfolding around visitors. Highlights include artisan workshops specializing in Nativity scenes, numerous historic churches, and small museums hidden among residential buildings.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Lively year-round but especially atmospheric during Christmas season when artisan workshops display elaborate Nativity scenes (presepi). Summer evenings feature local residents socializing outdoors. Many shops close for afternoon riposo (rest) between 1:30-4:30pm, especially in summer.",
      "booking_tips": "No booking required for exploring. Consider guided walking tours to understand historical context. Some churches and small museums along the route require modest entry fees. Watch for pickpockets in crowded areas.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 40.8497,
      "longitude": 14.2566
    },
    {
      "name": "Castel Nuovo (Maschio Angioino)",
      "type": "Castle/Museum",
      "description": "This medieval castle, also known as Maschio Angioino, dominates Naples' harbor area and serves as a symbol of the city. Built in the 13th century as a royal residence, it features five cylindrical towers and an impressive Renaissance triumphal arch at its entrance. Today, the castle houses the Civic Museum displaying sculptures, paintings, and artifacts from the 14th-19th centuries, along with the impressive Baron's Hall with its 15th-century frescoes.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with special exhibitions during summer. The courtyard provides insights into medieval military architecture. Upper levels offer views of the Bay of Naples and city center.",
      "booking_tips": "Online booking available but rarely necessary. Included in Campania ArteCard. Free entry on the first Sunday of each month. Check for temporary exhibitions.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 40.8355,
      "longitude": 14.2526
    },
    {
      "name": "Herculaneum Archaeological Park",
      "type": "Archaeological Site",
      "description": "This ancient Roman resort town was preserved by the same eruption that buried Pompeii, but Herculaneum was covered by pyrocastic flows rather than ash, resulting in different preservation conditions. The site is smaller than Pompeii but features better-preserved organic materials, wooden structures, and second stories of buildings. Vivid frescoes, mosaics, and detailed household items provide extraordinary insight into Roman daily life and luxury in a seaside resort town.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Less crowded than Pompeii year-round. More compact site provides better shade during summer. Spring and fall offer ideal visiting conditions. Winter visitors benefit from smallest crowds but should watch weather forecasts.",
      "booking_tips": "Online booking recommended. Combined tickets available with Pompeii. Accessible via Circumvesuviana train (Ercolano Scavi station). Consider guide or detailed guidebook to understand context. Wear comfortable shoes for uneven surfaces.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 40.8062,
      "longitude": 14.3470
    },
    {
      "name": "San Lorenzo Maggiore Complex",
      "type": "Church/Archaeological Site",
      "description": "This multi-layered complex includes a Gothic church, monastery, and remarkable underground excavations revealing a perfectly preserved section of the ancient Greek-Roman marketplace. Visitors can walk along actual Roman streets and enter shops, food stalls, and civic buildings from 2,000 years ago. The Gothic church above contains important artworks, while the monastery houses a museum of church artifacts and archaeological finds.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "The underground excavations maintain consistent temperature year-round, making this a good option during extreme weather. The complex receives fewer visitors than major Naples attractions despite its historical significance.",
      "booking_tips": "No advance booking required. Church is free but archaeological area and museum require tickets. Guided tours enhance understanding of the complex stratified history. Located in the historic center near Spaccanapoli.",
      "ratings": {
        "cost_estimate": 9,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 40.8511,
      "longitude": 14.2576
    },
    {
      "name": "Catacombe di San Gennaro",
      "type": "Archaeological Site",
      "description": "Naples' largest catacombs feature two levels of underground burial chambers dating from the 2nd-4th centuries CE. The site houses important early Christian frescoes, mosaics, and the first known portrait of San Gennaro, Naples' patron saint. The structure reveals how Christian burial practices evolved over centuries, with different architectural styles and decoration techniques. The catacombs were used until the 10th century and rediscovered in the 16th century.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Consistent cool temperatures year-round make this a refreshing summer visit. Tours operate in all seasons. Located in the Sanità district, an authentic neighborhood experiencing revitalization through cultural tourism.",
      "booking_tips": "Accessible only through guided tours that depart at scheduled times. Advance booking recommended in high season. Tours available in multiple languages. Not suitable for visitors with mobility issues due to numerous stairs.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 40.8615,
      "longitude": 14.2421
    },
    {
      "name": "Via San Gregorio Armeno",
      "type": "Street",
      "description": "Known as 'Christmas Alley,' this narrow street in the historic center is famous for artisan workshops producing handcrafted Nativity scenes (presepi). The tradition dates back to the 18th century, and today visitors can watch artisans creating figurines year-round. Beyond traditional religious figures, workshops also craft satirical figures of celebrities, politicians, and sports stars, updating their collections with current personalities each year.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Spectacular during Christmas season (November-January) when shops are fully stocked and decorated. Increasingly crowded as Christmas approaches. Workshops are open year-round but may have limited hours during summer afternoons.",
      "booking_tips": "No booking required for browsing. Guided tours available focusing on the craftsmanship and traditions. Most shops accept credit cards for larger purchases. Custom figurines can be commissioned but may require shipping arrangements.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 40.8510,
      "longitude": 14.2590
    },
    {
      "name": "Capodimonte Museum and Park",
      "type": "Museum/Park",
      "description": "Housed in a Bourbon royal palace set within Naples' largest public park, this museum contains one of Italy's richest art collections. Highlights include works by Caravaggio, Raphael, Titian, El Greco, Botticelli, and Neapolitan painters from the 13th-19th centuries. The museum also houses decorative arts, including the famous Capodimonte porcelain. The surrounding park offers walking paths, panoramic views, and an 18th-century royal hunting ground atmosphere.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "The museum offers climate-controlled galleries year-round. The park is particularly beautiful in spring with flowering trees, and in autumn with fall colors. Summer heat is mitigated by the hilltop location and mature tree canopy.",
      "booking_tips": "Online booking recommended. Free entry on the first Sunday of each month. Included in Campania ArteCard. Museum shuttle bus available from Naples center, or take city bus C63 from the National Archaeological Museum.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 40.8676,
      "longitude": 14.2506
    },
    {
      "name": "Catacombs of San Gaudioso",
      "type": "Archaeological Site",
      "description": "These 5th-century catacombs beneath the Basilica of Santa Maria della Sanità reveal unique burial practices including skull-only niches where nobles' painted portraits were created on the wall above their skulls. The site contains Byzantine frescoes, early Christian symbols, and evidence of how burial customs evolved over centuries. Less extensive than the Catacombs of San Gennaro, they offer a more intimate experience with distinctive artistic elements.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Consistent cool temperatures year-round make this a good site to visit during summer heat. Tours operate daily except on certain holidays. Located in the vibrant Sanità district, one of Naples' most characterful neighborhoods.",
      "booking_tips": "Accessible only through guided tours that depart at scheduled times. Advance booking recommended. Combined tickets available with San Gennaro Catacombs. Not suitable for visitors with mobility issues due to steep stairs.",
      "ratings": {
        "cost_estimate": 9,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 40.8580,
      "longitude": 14.2437
    },
    {
      "name": "Galleria Borbonica",
      "type": "Underground Site",
      "description": "This underground tunnel complex was initially commissioned by King Ferdinand II of Bourbon as an escape route from the Royal Palace to military barracks. Later it served as a water cistern, a military hospital, and a bomb shelter during WWII. Tours showcase historic vehicles, war relics, and graffiti left by shelter-seekers. The engineering achievement demonstrates Naples' long relationship with its underground spaces, built using the yellow tuff stone that underlies the city.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Consistent temperatures year-round make this a good option during extreme weather. Different tour options available, including adventurous routes through partially flooded sections requiring boots and helmets (provided).",
      "booking_tips": "Advance booking essential as access is by guided tour only. Multiple tour types available from easy to adventurous. Tours in English available at specific times. Wear comfortable shoes and bring a light jacket even in summer.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 40.8380,
      "longitude": 14.2468
    },
    {
      "name": "Lungomare",
      "type": "Promenade",
      "description": "This 2.5 km seaside promenade stretches from Mergellina to Castel dell'Ovo, offering spectacular views of the Bay of Naples, Vesuvius, and Capri. The pedestrianized walkway features parks, fountains, and numerous cafes and restaurants. Particularly atmospheric at sunset and in evenings when locals gather for the traditional passeggiata (evening stroll), the area represents Naples' connection to the sea and Mediterranean lifestyle.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round but especially lively on summer evenings when locals escape the heat. Winter brings fewer crowds but equally stunning views on clear days. Spring and fall offer ideal temperatures for walking the entire length.",
      "booking_tips": "No booking required. Area is accessible 24/7. Street performers and vendors gather in evenings. Restaurants along the route are popular and may require reservations, especially for dinner with sea views.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.8300,
      "longitude": 14.2440
    },
    {
      "name": "Certosa di San Martino",
      "type": "Monastery/Museum",
      "description": "Perched on Vomero Hill, this former Carthusian monastery now houses a museum showcasing Neapolitan history, art, and culture. The complex includes a magnificent baroque church with marble inlays and frescoes, cloisters with panoramic views, and extensive collections of presepi (Nativity scenes), paintings, vehicles, and maritime artifacts. The site offers spectacular views of Naples, its bay, and Mount Vesuvius.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with exceptional Christmas displays of historic presepi. The hilltop location offers cooler temperatures in summer. Multiple levels and sections allow for visits of varying durations.",
      "booking_tips": "Online booking available but rarely necessary. Included in Campania ArteCard. Free entry on the first Sunday of each month. Accessible via funicular to Vomero district. Combined visit with nearby Castel Sant'Elmo recommended.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 40.8417,
      "longitude": 14.2398
    },
    {
      "name": "Castel Sant'Elmo",
      "type": "Castle/Museum",
      "description": "This medieval fortress sits atop Vomero Hill, offering 360-degree panoramic views of Naples, the bay, and surrounding mountains. Built in its current form in the 16th century, the six-pointed star fortress contains a museum of 20th-century Neapolitan art, temporary exhibition spaces, and a historical collection explaining Naples' military history. The expansive terraces provide the most comprehensive viewpoint in the city.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Spectacular at sunset year-round. The exposed hilltop location can be windy even in summer, so bring a light jacket. Views are clearest on days after rain has cleared air pollution.",
      "booking_tips": "No advance booking necessary. Accessible via funicular to Vomero district. Included in Campania ArteCard. Combined visit with nearby Certosa di San Martino recommended. Wear comfortable shoes for walking on ramparts.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 40.8414,
      "longitude": 14.2404
    },
    {
      "name": "Underground Naples (Napoli Sotterranea)",
      "type": "Archaeological Site",
      "description": "This network of tunnels 40 meters below Naples' historic center reveals the city's 2,400-year stratified history. Originally a Greek-Roman aqueduct, the spaces were later used as cisterns, wartime bomb shelters, and garbage dumps. Guided tours include narrow passages, ancient Greek water systems, remains of the Roman theater where Emperor Nero performed, and WWII artifacts. The site demonstrates Naples' continuous habitation and vertical urban development.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Constant 15°C (59°F) temperature year-round makes this a refreshing summer activity and warm winter option. Tours operate daily throughout the year. Some sections involve very narrow passages which may be challenging for claustrophobic visitors.",
      "booking_tips": "Accessible only through guided tours departing regularly from Piazza San Gaetano. Advance booking recommended during high season. Tours available in multiple languages. Wear comfortable shoes and bring a light jacket even in summer.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 40.8508,
      "longitude": 14.2573
    },
    {
      "name": "Mount Vesuvius",
      "type": "Natural Site",
      "description": "This active volcano dramatically shaped the region's history with its catastrophic eruption in 79 CE that destroyed Pompeii and Herculaneum. Visitors can hike to the crater rim along a zigzagging path that offers increasingly spectacular views of the Bay of Naples. The crater itself spans 700 meters across and 200 meters deep, with visible fumaroles emitting steam. The volcano is monitored continuously by the Vesuvius Observatory, the world's oldest volcanological institution.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Clearest views occur in winter and early spring. Summer brings crowds and heat, making morning visits essential. The summit can be significantly cooler and windier than Naples, so bring appropriate layers. May close during severe weather or volcanic activity.",
      "booking_tips": "Entrance ticket required for final ascent to crater. Accessible by EAV bus from Ercolano Scavi station or by car to parking area at 1,000m elevation. Final climb takes approximately 30 minutes on steep, gravel path. Wear sturdy shoes and bring water.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 40.8210,
      "longitude": 14.4270
    },
    {
      "name": "Naples Street Food Experience",
      "type": "Cultural Experience",
      "description": "Naples' street food culture offers insight into local culinary traditions and daily life. Highlights include pizza a portafoglio (folded pizza), frittatina (fried pasta cake), crocchè (potato croquettes), arancini (rice balls), sfogliatelle (shell-shaped pastries), and taralli (savory biscuits). The historic center and Spanish Quarters feature numerous vendors and small shops where these specialties have been prepared following traditional methods for generations.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Inexpensive",
      "seasonal_notes": "Available year-round with seasonal specialties appearing during religious festivals. Some vendors close during August when many locals vacation. Best experienced as lunch or afternoon snack when shops are busiest and turnover ensures freshness.",
      "booking_tips": "Guided food tours available offering historical context and insider access to top vendors. Pay attention to where locals line up for best quality. Most vendors accept cash only. Crowded streets make this challenging with large strollers or wheelchairs.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 40.8475,
      "longitude": 14.2508
    },
    {
      "name": "Pizza Napoletana Experience",
      "type": "Cultural Experience",
      "description": "Naples is the birthplace of pizza, and experiencing authentic Neapolitan pizza in its original environment is a cultural highlight. Traditional pizzerias adhere to strict preparation standards: hand-kneaded dough, wood-fired ovens reaching 485°C, and simple toppings including San Marzano tomatoes and Campania buffalo mozzarella. The result is a soft, elastic pizza with charred crust that must be eaten with knife and fork or folded.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Inexpensive",
      "seasonal_notes": "Year-round experience. Most historic pizzerias close on Sundays. Popular establishments have long lines during peak dinner hours (8-10pm). Some offer cooking classes during off-peak hours.",
      "booking_tips": "Reservations essential for famous establishments like Da Michele, Sorbillo, and Starita. Pizza-making classes available for visitors wanting deeper insight into the tradition. UNESCO recognized Neapolitan pizza-making as Intangible Cultural Heritage in 2017.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 40.8505,
      "longitude": 14.2585
    }
  ]
}