{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Nyttårsdag)",
          "notes": "New Year's Day is a public holiday in Norway. Most attractions and shops in Stavanger operate with limited hours. Unlike Tromsø, Stavanger does not experience polar night, but daylight hours are short (around 6-7 hours). Temperatures average around 2°C (36°F) with frequent rainfall."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "January is the low season for tourism in Stavanger, offering a more authentic experience of local life. The city is relatively quiet with fewer tourists. Weather is typically mild for the Arctic region due to the Gulf Stream influence, with temperatures hovering between 0°C and 4°C (32°F to 39°F). Days are short with sunrise around 9:15 AM and sunset around 4:15 PM. Rainfall is common, often mixed with occasional snow. Indoor activities like visiting museums (including the Norwegian Petroleum Museum and Stavanger Art Museum) become popular choices."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 2,
          "notes": "Early February continues with winter conditions, though snowfall is less common than in other Norwegian cities. Daylight begins to increase noticeably with sunrise around 8:45 AM and sunset around 5:00 PM by month's start."
        },
        {
          "days": [6],
          "score": 3,
          "special": true,
          "event": "Sami National Day (Samefolkets dag)",
          "notes": "February 6th celebrates Sami National Day, commemorating the first Sami congress in 1917. While Stavanger doesn't have as large a Sami population as northern Norway, cultural events and exhibitions may be held in the city's cultural institutions."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 2,
          "notes": "February remains relatively quiet in terms of tourism. Temperatures typically range from 0°C to 5°C (32°F to 41°F). Weather can be unpredictable with rain, occasional snow, and strong winds. Indoor cultural activities are popular, while outdoor enthusiasts might enjoy hiking in the milder conditions compared to other Norwegian destinations. By month's end, daylight increases to almost 10 hours."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 3,
          "notes": "Early March brings the first signs of spring to Stavanger. Daylight increases significantly with sunrise around 7:15 AM and sunset around 6:15 PM by the spring equinox. Temperatures begin to rise, typically ranging from 2°C to 7°C (36°F to 45°F). Rainfall remains common, but snowfall becomes rare. Early flowers and plants begin to show signs of life, adding color to the landscape."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Easter Preparations",
          "notes": "Late March might include Easter celebrations depending on the calendar year. Norwegians often take Easter holidays very seriously, with many locals heading to mountain cabins. This can make Stavanger quieter if Easter falls in March. Easter traditions include decorating with yellow colors and birch twigs with colorful feathers. Tourism begins to pick up slightly as spring arrives and temperatures become more comfortable."
        }
      ],
      "weatherHighC": 7,
      "weatherLowC": 2,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 3,
          "special": true,
          "event": "Easter Holidays (varies yearly)",
          "notes": "Early April often includes Easter holidays. Many local businesses may have limited hours during this time, especially if Easter falls in April. The city is typically quieter as Norwegians often travel to mountain cabins during this period."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Spring truly arrives in Stavanger in April. Temperatures range from 5°C to 11°C (41°F to 52°F). Daylight increases dramatically with 13-15 hours of light by month's end. Spring flowers bloom throughout the city and surrounding areas. Rainfall remains common but tends to be lighter and less frequent than winter months. Tourism begins to increase as hiking trails in nearby areas like Preikestolen (Pulpit Rock) and Kjeragbolten begin to clear of snow, though early April can still have challenging conditions. April marks the beginning of the cruise ship season, with the first ships arriving in Stavanger harbor."
        }
      ],
      "weatherHighC": 11,
      "weatherLowC": 5,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day (Arbeidernes dag)",
          "notes": "May 1st is Labor Day in Norway, marked by parades and gatherings in Stavanger's city center. This public holiday coincides with the warming weather and increasing tourism."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early May brings favorable conditions to Stavanger. Temperatures typically range from 8°C to 15°C (46°F to 59°F). Daylight extends to 16-18 hours, with very long evenings. The landscape becomes increasingly green and lush. Tourism continues to increase as hiking conditions improve significantly, with popular trails like Preikestolen becoming more accessible."
        },
        {
          "days": [17],
          "score": 5,
          "special": true,
          "event": "Constitution Day (Syttende mai)",
          "notes": "May 17th is Norway's National Day, celebrating the signing of the Constitution in 1814. This is a major celebration in Stavanger with parades featuring people in traditional bunads (folk costumes), marching bands, and festivities throughout the city. Children's parades are a central feature, and the atmosphere is festive with ice cream, games, and national pride on display."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "Late May often provides some of the best weather of the year in Stavanger. Days are very long with sunset after 10:30 PM by month's end. Temperatures typically range from 10°C to 17°C (50°F to 63°F). This period marks the true beginning of the tourist season, with hiking, fjord cruises, and outdoor activities in full swing. Cruise ships become a regular sight in the harbor, bringing day visitors to the city."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 8,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "notes": "Early June brings near peak conditions to Stavanger. While the city doesn't experience the midnight sun like Tromsø, daylight hours are extremely long with only a few hours of dusk around midnight. Summer temperatures typically range from 12°C to 20°C (54°F to 68°F). This is an excellent period for outdoor activities with generally stable weather and comfortable temperatures. Tourism increases significantly as the peak summer season begins. Popular activities include hiking to Preikestolen and Kjeragbolten, exploring Lysefjord by boat, and visiting the city's beaches and parks."
        },
        {
          "days": [21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Midsummer (Sankthansaften)",
          "notes": "June 23rd is Midsummer Eve (Sankthansaften) in Norway, celebrated with bonfires along the coastline. Stavanger hosts celebrations along its shoreline, with locals gathering for food, drinks, and festivities. The summer solstice (around June 21) brings the longest day of the year, though unlike northern Norway, the sun does set briefly in Stavanger."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Late June is prime summer season in Stavanger. Weather is typically at its best with long, sunny days and temperatures ranging from 12°C to 20°C (54°F to 68°F), occasionally climbing higher. Tourism is high but not yet at its peak, offering a good balance. Outdoor dining, street life, and cultural activities flourish throughout the city."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "notes": "Early July marks the beginning of peak summer season in Stavanger. This coincides with the traditional Norwegian holiday period when many Norwegians take their summer vacations. Weather is typically warm with temperatures ranging from 13°C to 21°C (55°F to 70°F), occasionally reaching 25°C (77°F) or higher. Rainfall is still possible but generally less frequent. Daylight hours remain very long with sunset around 10:45 PM. This is high season for tourism with all attractions operating at full capacity."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 5,
          "special": true,
          "event": "Gladmat Food Festival",
          "notes": "Mid-to-late July hosts the Gladmat Food Festival, Scandinavia's largest food festival. The event transforms Stavanger's harbor area into a food lover's paradise with stalls, demonstrations, and culinary experiences. This is a major highlight in Stavanger's cultural calendar and attracts visitors from across Norway and internationally."
        },
        {
          "days": [30, 31],
          "score": 5,
          "notes": "Late July continues with peak summer conditions and high tourist numbers. All outdoor activities are available, and the city has a vibrant atmosphere with outdoor dining, cultural events, and active harbor area."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 13,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "special": true,
          "event": "Stavanger International Chamber Music Festival",
          "notes": "Early-to-mid August features the Stavanger International Chamber Music Festival, with classical performances at various venues throughout the city. The summer season continues in full swing with warm weather and long days, though daylight noticeably decreases from July. Temperatures typically range from 13°C to 20°C (55°F to 68°F). Tourism remains at peak levels, with cruise ships regularly visiting the port."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Late August begins to show subtle signs of autumn approaching. Days become noticeably shorter, though still with around 14 hours of daylight by month's end. Weather remains pleasant but can become more variable. Tourism begins to decrease slightly from peak levels, making it a good time to visit popular attractions with slightly fewer crowds. Water temperatures reach their annual peak, making this the best time for swimming at local beaches."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 13,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Kapittel Festival",
          "notes": "September brings the Kapittel Festival, Stavanger's international festival for literature and freedom of speech. The event features authors, discussions, and cultural events across the city. Autumn begins to set in with temperatures typically ranging from 10°C to 16°C (50°F to 61°F). Daylight decreases to around 12 hours by month's end. The landscape begins to show autumn colors, particularly in the surrounding countryside. Tourism levels decrease from summer peaks but remain moderate with generally good conditions for outdoor activities. Hiking trails like Preikestolen are less crowded while still accessible. Cruise ship visits begin to decrease in frequency. Rainfall typically increases compared to summer months, but still with many pleasant days."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "October brings full autumn conditions to Stavanger. The landscape displays vibrant autumn colors throughout the month. Temperatures cool noticeably, typically ranging from 6°C to 12°C (43°F to 54°F). Daylight decreases rapidly to around 9 hours by month's end. Rainfall increases, and weather becomes more unpredictable with occasional storms. Tourism decreases significantly, making it a good time to experience the city with fewer crowds. Hiking conditions become more challenging, especially for higher elevation trails like Kjerag, though Preikestolen remains accessible for experienced hikers with proper equipment. Indoor activities like museum visits become more popular. Some seasonal tourist facilities begin to close or reduce hours. The cruise ship season winds down by late October."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 6,
      "tourismLevel": 4
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 2,
          "notes": "November marks the transition to winter conditions in Stavanger. Unlike Tromsø, Stavanger does not experience polar night, but daylight hours decrease to around 7 hours by month's end. Temperatures typically range from 3°C to 8°C (37°F to 46°F). Rainfall is frequent, sometimes turning to sleet or snow, though significant snowfall is uncommon in the city. Tourism is at its lowest levels, with many outdoor attractions either closed or accessible only to well-equipped visitors. This makes it a good time to experience authentic local life without crowds. Christmas preparations begin to appear in the city by late November, with decorations and holiday markets starting to emerge."
        }
      ],
      "weatherHighC": 8,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "special": true,
          "event": "Christmas Markets",
          "notes": "December brings Christmas spirit to Stavanger with holiday markets, decorations, and events throughout the city. The Julemarked (Christmas Market) in the city center offers traditional crafts, food, and beverages. Temperatures typically range from 1°C to 6°C (34°F to 43°F). Daylight hours are at their shortest with sunrise around 9:15 AM and sunset around 3:45 PM. Rainfall remains common, occasionally mixed with snow, though substantial snow accumulation is rare in the city. Tourism remains low except for the period around Christmas and New Year."
        },
        {
          "days": [24, 25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas (Jul)",
          "notes": "Christmas is a major holiday in Norway, with Christmas Eve (December 24) being the main celebration day when families gather for traditional meals. Many restaurants and attractions have limited hours or close entirely during these days. Popular Christmas foods include ribbe (pork ribs), pinnekjøtt (lamb ribs), and lutefisk (lye-treated codfish)."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees a slight increase in tourism, particularly from domestic visitors. The city remains quiet with many locals on holiday. Weather conditions continue to be mild for the season compared to other Norwegian destinations."
        },
        {
          "days": [31],
          "score": 3,
          "special": true,
          "event": "New Year's Eve (Nyttårsaften)",
          "notes": "New Year's Eve celebrations in Stavanger include fireworks displays at midnight. Restaurants offer special New Year's menus (requiring advance reservation), and the atmosphere is festive throughout the city."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 1,
      "tourismLevel": 4
    }
  },
  "activityTypes": {
    "spring": [
      "Hiking to Preikestolen (Pulpit Rock) as snow melts",
      "Exploring the historic Gamle Stavanger (Old Stavanger) district with white wooden houses",
      "Visiting the Norwegian Petroleum Museum to learn about Norway's oil industry",
      "Taking fjord cruises through Lysefjord as weather improves",
      "Celebrating Constitution Day (May 17) with parades and festivities",
      "Bird watching at nearby nature reserves as migratory birds return",
      "Kayaking in the sheltered waters around Stavanger",
      "Exploring the city's museums and cultural attractions",
      "Enjoying the emerging cafe culture as outdoor seating opens"
    ],
    "summer": [
      "Hiking the iconic Preikestolen (Pulpit Rock) and Kjerag with its famous boulder",
      "Taking boat trips through the dramatic Lysefjord",
      "Swimming at beaches like Solastranden, Vaulen, and Godalen",
      "Attending summer festivals including Gladmat Food Festival",
      "Kayaking and stand-up paddleboarding in the fjords",
      "Cycling on the extensive network of bike paths in and around the city",
      "Island hopping to places like Flor & Fjære garden island",
      "Fishing in the fjords and nearby lakes",
      "Enjoying the lively outdoor dining scene and street life"
    ],
    "autumn": [
      "Hiking through forests and mountains with spectacular autumn colors",
      "Visiting museums including Stavanger Art Museum and Norwegian Canning Museum",
      "Taking fjord cruises with fewer crowds than summer",
      "Exploring culinary experiences as seafood season peaks",
      "Attending the Kapittel literature festival",
      "Mushroom and berry foraging in nearby forests",
      "Photography tours capturing autumn colors and landscapes",
      "Shopping in the compact city center",
      "Taking scenic drives along the coastline"
    ],
    "winter": [
      "Exploring the cozy cafe culture during the darker months",
      "Visiting Christmas markets and enjoying holiday decorations",
      "Skiing at nearby resorts like Sirdal (about 1.5 hours away)",
      "Hiking on lower-elevation trails that remain accessible year-round",
      "Taking winter fjord cruises with dramatic light conditions",
      "Enjoying cultural events at Stavanger Concert Hall and other venues",
      "Experiencing traditional Norwegian Christmas and New Year celebrations",
      "Visiting museums and indoor attractions",
      "Dining at restaurants featuring seasonal Norwegian winter cuisine"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, challenging weather, limited activities",
    "1": "Poor: Unfavorable conditions, extreme weather, very limited activities or accessibility"
  }
}