{
    "Spring": {
        "activities": [
            {
                "name": "Promenade du Peyrou",
                "type": "Outdoor Activity",
                "description": "Explore this magnificent royal square featuring a statue of Louis XIV, the elegant Water Castle (Château d'Eau), and the 18th-century Saint-Clément Aqueduct, all while enjoying panoramic views of the city extending to the Mediterranean on clear spring days.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings perfect mild temperatures and blooming trees to this iconic esplanade, with fewer tourists than summer months and clear visibility toward the sea.",
                "booking_tips": "No booking required. The water tower can occasionally be visited during Heritage Days or special events, but the promenade is always accessible."
            },
            {
                "name": "Jardin des Plantes",
                "type": "Botanical Garden",
                "description": "Visit France's oldest botanical garden (established 1593) when spring brings magnificent blooms to its historic collections of medicinal plants, Mediterranean species, and ancient trees.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring is spectacular here with flowering magnolias, rare medicinal plants, and Mediterranean collections bursting into bloom after winter dormancy.",
                "booking_tips": "No booking required. Guided tours are occasionally available through the University of Montpellier's botany department, especially during spring plant festivals."
            },
            {
                "name": "Les Estivales Preview Events",
                "type": "Cultural Event",
                "description": "Catch the early season preview events of Montpellier's famous summer wine and food festival, with special tastings and cultural performances throughout the historic center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "Late spring (May) sees the first of these popular events that showcase regional wines, local cuisine, and artisanal products before the full summer program begins.",
                "booking_tips": "No booking required. Purchase tasting tickets on-site for wine sampling. Events typically occur in Place de la Comédie or Esplanade Charles de Gaulle."
            },
            {
                "name": "Pic Saint-Loup Hiking",
                "type": "Outdoor Activity",
                "description": "Trek to the summit of this iconic limestone peak just north of Montpellier, offering spectacular panoramic views across the vineyards to the Mediterranean Sea.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers ideal hiking conditions with moderate temperatures, wildflowers in bloom, and green landscapes before the summer heat and dryness arrive.",
                "booking_tips": "No booking required, but organized tours are available through local outdoor companies. Drive 30 minutes from Montpellier to the trailhead at Cazevieille."
            },
            {
                "name": "Marché des Arceaux",
                "type": "Market",
                "description": "Experience one of Montpellier's largest and most picturesque markets, held twice weekly beneath the arches of the historic Saint-Clément Aqueduct, showcasing local spring produce, flowers, and artisanal products.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings abundant local asparagus, strawberries, cherries, and young goat cheeses from the Cévennes mountains to this vibrant market.",
                "booking_tips": "No booking required. Visit Tuesday and Saturday mornings (7am-1:30pm), with Saturday being larger and more atmospheric. Arrive before 10am to avoid crowds."
            },
            {
                "name": "Fête de la Musique",
                "type": "Cultural Festival",
                "description": "Join this nationwide celebration of music that transforms Montpellier's streets, squares, and parks into open-air concert venues featuring every genre from classical to electronic, jazz to world music.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on June 21st (summer solstice), this festival marks the transition from spring to summer with hundreds of free performances throughout the city.",
                "booking_tips": "No booking required. Pick up a program from the tourist office to plan your musical journey through different city quarters. The Ecusson district and Place de la Comédie host the largest performances."
            },
            {
                "name": "Palavas-les-Flots Beach",
                "type": "Outdoor Activity",
                "description": "Enjoy the first beach days of the year at this popular seaside resort just 12km from Montpellier, with wide sandy beaches and a traditional fishing port atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Spring offers pleasant beach weather with fewer crowds than summer, warm enough for sunbathing and paddling by late May, with restaurants and facilities beginning their season.",
                "booking_tips": "Take the direct 606 bus from Montpellier city center (Place de France) or cycle along the dedicated bike path along the Lez River to the coast."
            },
            {
                "name": "Wine Tasting in Pic Saint-Loup",
                "type": "Food & Drink",
                "description": "Visit vineyards in the prestigious Pic Saint-Loup appellation as vines burst into spring growth, tasting the region's distinguished reds and rosés in picturesque settings beneath the mountain.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is beautiful in the vineyards with fresh foliage on the vines, wildflowers between rows, and the opportunity to taste recently bottled vintages from previous harvests.",
                "booking_tips": "Book a guided wine tour from Montpellier or drive yourself to wineries like Château de Cazeneuve or Mas Bruguière, calling ahead to arrange tastings."
            },
            {
                "name": "Antigone Shopping and Architecture Tour",
                "type": "Walking Tour",
                "description": "Explore Montpellier's distinctive neoclassical district designed by architect Ricardo Bofill, featuring dramatic columns, pedestrian plazas, and monumental buildings along a perfectly symmetrical axis.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring sunshine brings out the warm tones in the district's distinctive limestone facades, while comfortable temperatures make it ideal for architectural appreciation.",
                "booking_tips": "Self-guided tours are possible following the main axis from Place du Nombre d'Or to the River Lez. The tourist office offers guided architectural tours in multiple languages."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Les Estivales de Montpellier",
                "type": "Food & Drink Festival",
                "description": "Experience Montpellier's popular summer evening festival where the Esplanade Charles de Gaulle transforms into an open-air wine and food celebration every Friday, showcasing local producers, craftspeople, and musicians.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "This weekly summer event runs from June through early September, bringing locals and visitors together to enjoy Mediterranean evening ambiance with food, wine, and music.",
                "booking_tips": "No booking required. Purchase a wine glass for around €5 that includes three tasting tickets. Additional tastings can be bought separately. Arrive before 8pm to secure seating."
            },
            {
                "name": "Radio France Festival",
                "type": "Music Festival",
                "description": "Attend this prestigious classical music festival featuring world-class orchestras, soloists, and contemporary compositions in venues throughout Montpellier, with many performances in the stunning Le Corum concert hall.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This July festival is one of France's most important classical music events, with air-conditioned venues providing a perfect escape from summer heat.",
                "booking_tips": "Book tickets well in advance through the festival website or at Le Corum box office. Some outdoor concerts in historic courtyards are free but require reservations."
            },
            {
                "name": "Mediterranean Beaches",
                "type": "Outdoor Activity",
                "description": "Escape the city heat with a day trip to the beautiful Mediterranean beaches near Montpellier, including La Grande-Motte, Carnon, Palavas-les-Flots, or the more natural Espiguette Beach.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low",
                "seasonal_notes": "Summer brings warm sea temperatures and full beach services to these coastal towns, all within 30 minutes of Montpellier by public transport.",
                "booking_tips": "Take direct buses from the Place de France transport hub in Montpellier to various beaches. Arrive early (before 10am) to secure good spots, especially in July and August."
            },
            {
                "name": "Festivals d'Avignon Day Trip",
                "type": "Cultural Festival",
                "description": "Visit the nearby city of Avignon during its world-famous theater festival when the entire walled city becomes a stage for hundreds of performances from traditional to experimental.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "This three-week July festival transforms Avignon into the theater capital of Europe, with performances in historic venues, streets, and improvised spaces throughout the city.",
                "booking_tips": "Book main festival shows online in advance, but hundreds of 'Off' festival performances can be booked on the day. Take the direct train from Montpellier to Avignon (1 hour)."
            },
            {
                "name": "Canoeing on the Hérault River",
                "type": "Outdoor Activity",
                "description": "Paddle down the crystal-clear Hérault River through spectacular limestone gorges, stopping to swim at natural pools beneath the medieval village of Saint-Guilhem-le-Désert.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is perfect for this refreshing activity, with warm water temperatures and the cool river providing respite from Mediterranean heat.",
                "booking_tips": "Book canoe rentals in advance with companies in Saint-Guilhem-le-Désert or Gignac. Half-day and full-day trips are available with shuttle service back to your starting point."
            },
            {
                "name": "Nighttime Markets in Historic Center",
                "type": "Market",
                "description": "Explore the charming evening artisan markets that take place throughout summer in Montpellier's historic squares, featuring local craftspeople, artists, and food producers.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "These markets provide a festive atmosphere during warm summer evenings, with different neighborhoods hosting them on rotating nights of the week.",
                "booking_tips": "No booking required. Check with the tourist office for the rotating schedule. The markets at Place de la Canourgue and Place Saint-Roch are particularly atmospheric."
            },
            {
                "name": "Cinéma sous les Étoiles",
                "type": "Cultural Event",
                "description": "Experience outdoor cinema screenings in historic locations throughout Montpellier, from the Peyrou gardens to museum courtyards and neighborhood squares.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "These open-air screenings run throughout July and August, beginning after sunset around 9:30pm with a mix of classic films and new releases.",
                "booking_tips": "Some screenings require advance booking online, while others are free with first-come, first-served seating. Bring a cushion or blanket for comfort."
            },
            {
                "name": "Pézenas Historic Town",
                "type": "Day Trip",
                "description": "Visit this exquisitely preserved medieval and Renaissance town associated with Molière, featuring artisan workshops, historic mansions, and a Saturday market in a theatrical setting.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Summer brings this historic town to life with street performers, evening artisan markets, and courtyard concerts adding to the already rich architectural experience.",
                "booking_tips": "Take the 603 bus from Montpellier (about 1 hour) or drive. For the full experience, visit on Saturday when the market fills the historic center."
            },
            {
                "name": "Sunset Drinks at Rooftop Bars",
                "type": "Nightlife",
                "description": "Enjoy panoramic views of Montpellier while sipping cocktails at one of the city's popular rooftop bars, watching the sun set over the Mediterranean horizon.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings offer spectacular sunset views and pleasant temperatures for outdoor drinking until late into the night.",
                "booking_tips": "Reserve tables in advance at popular spots like the Hôtel Mercure Centre rooftop or Chez Régis at the top of Saint-Roch hospital. Arrive before sunset for the best experience."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Les Internationales de la Guitare",
                "type": "Music Festival",
                "description": "Experience this renowned guitar festival featuring diverse styles from classical to flamenco, jazz to rock, with performances by international artists in venues throughout Montpellier and surrounding towns.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This late September to early October festival brings world-class guitarists to the region when the weather turns cooler but remains pleasant for evening outings.",
                "booking_tips": "Book tickets for main concerts well in advance through the festival website. Some masterclasses and small venue concerts are available for last-minute bookings."
            },
            {
                "name": "Harvest Time in Vineyards",
                "type": "Food & Drink",
                "description": "Visit the vineyards around Montpellier during grape harvest season (vendange) when the countryside buzzes with activity and many domains offer special tastings of young wines.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September and early October bring the excitement of harvest to vineyards throughout the region, with excellent opportunities to understand winemaking processes.",
                "booking_tips": "Book vineyard tours through the Montpellier tourist office or contact wineries directly in appellations like Pic Saint-Loup, Languedoc, or Grés de Montpellier."
            },
            {
                "name": "Mushroom Foraging in Cévennes",
                "type": "Outdoor Activity",
                "description": "Join guided mushroom hunting expeditions in the nearby Cévennes mountains when autumn rains bring forth prized varieties like cèpes, chanterelles, and many other edible fungi.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October and November offer the best mushroom hunting after rainfall, with expert guides ensuring you collect only safe, edible varieties in sustainable ways.",
                "booking_tips": "Book guided foraging trips through specialists like Cévennes Mycologie at least two weeks in advance. Tours typically include identification lessons and cooking tips."
            },
            {
                "name": "CineMed Film Festival",
                "type": "Cultural Festival",
                "description": "Immerse yourself in Mediterranean cinema at this international film festival showcasing works from countries bordering the Mediterranean Sea, with screenings, director talks, and cultural events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "This October/November festival brings together filmmakers from Southern Europe, North Africa, and the Middle East during the comfortable autumn season.",
                "booking_tips": "Purchase festival passes online or individual screening tickets at the Corum and participating cinemas. Some director talks and workshops are free but require registration."
            },
            {
                "name": "Hiking in Hortus Mountains",
                "type": "Outdoor Activity",
                "description": "Explore the spectacular limestone landscapes of the Hortus and Pic Saint-Loup mountains when autumn brings clear visibility, comfortable temperatures, and beautiful golden light.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers ideal hiking conditions with moderate temperatures, seasonal colors in the vegetation, and fewer hikers than spring or summer months.",
                "booking_tips": "No booking required for self-guided hikes. Maps are available at the tourist office or download the Visorando app for detailed trail information. The 'Sentier du Panorama' offers particularly spectacular views."
            },
            {
                "name": "Olive Harvest Experience",
                "type": "Food & Drink",
                "description": "Participate in the traditional olive harvest at farms around Montpellier, learning about cultivation methods and oil production before tasting the region's liquid gold.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "November and early December bring the olive harvest season, when you can witness the production of new oil and participate in picking at some domains.",
                "booking_tips": "Book harvest experiences through the Olive Growing Museum in Clermont l'Hérault or contact producers like Domaine de l'Oulivie directly for tour and tasting appointments."
            },
            {
                "name": "Autumn Food Markets",
                "type": "Food & Drink",
                "description": "Explore Montpellier's vibrant food markets showcasing autumn specialties like wild mushrooms, chestnuts, game, and the first pressing of olive oil.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings an abundance of seasonal delicacies to the covered market at Les Halles Castellane and the open-air markets at Arceaux and Plan Cabanes.",
                "booking_tips": "No booking required. Visit Les Halles Castellane Tuesday through Sunday mornings, Arceaux market on Tuesday and Saturday mornings, and Plan Cabanes on Tuesday through Saturday mornings."
            },
            {
                "name": "Contemporary Art at MOCO",
                "type": "Exhibition",
                "description": "Discover Montpellier's contemporary art center housed in a renovated 18th-century mansion, featuring autumn exhibitions by international artists as part of the post-summer cultural calendar.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Fall exhibitions typically open in September and run through December in this elegant setting that combines historic architecture with cutting-edge art.",
                "booking_tips": "No booking required. The center is closed on Mondays and offers free guided tours on Sunday afternoons. Combined tickets with La Panacée (the center's other venue) are available."
            },
            {
                "name": "Chestnut Festival in Cévennes",
                "type": "Food Festival",
                "description": "Experience the traditional chestnut harvest celebration in picturesque Cévennes mountain villages, with tastings, demonstrations, and cultural events dedicated to this historic staple food.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Low",
                "seasonal_notes": "October brings these festivals to villages like Saint-Martial and Olargues, celebrating the chestnut harvest that has sustained mountain communities for centuries.",
                "booking_tips": "No booking required for festival entry, but accommodation in the small villages fills quickly. Drive from Montpellier (about 1.5 hours) or take a combination of train and bus to reach the Cévennes villages."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Les Hivernales Christmas Market",
                "type": "Market",
                "description": "Wander through Montpellier's charming Christmas market centered around the Esplanade Charles de Gaulle and Place de la Comédie, with wooden chalets selling crafts, regional foods, and mulled wine.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "From late November through December, the market creates a festive atmosphere with lights, decorations, and seasonal treats including local specialties.",
                "booking_tips": "No booking required. Visit weekday evenings to avoid weekend crowds. The illuminations and Ferris wheel in Place de la Comédie add to the festive atmosphere."
            },
            {
                "name": "Truffle Markets",
                "type": "Food & Drink",
                "description": "Experience the mysterious world of the black diamond of cuisine at specialized truffle markets in villages around Montpellier, where hunters sell their precious fungi directly to the public.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "December through February is truffle season in the Languedoc, with special markets in villages like Uzès and Saint-Geniès-des-Mourgues offering this prized winter delicacy.",
                "booking_tips": "No booking required for market entry, but arrive early (before 10am) for the best selection. Some markets offer truffle-hunting demonstrations and cooking workshops that should be booked in advance."
            },
            {
                "name": "Wine Tasting by the Fireplace",
                "type": "Food & Drink",
                "description": "Escape winter chill with cozy wine tastings in historic cellars and tasting rooms around Montpellier, focusing on the robust red wines that perfectly complement the season.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for discovering the region's fuller-bodied reds from appellations like Saint-Chinian, Faugères, and Terrasses du Larzac in warm, comfortable settings.",
                "booking_tips": "Book guided tastings at La Maison des Vins du Languedoc in central Montpellier or arrange visits to nearby wineries that offer fireside tastings during winter months."
            },
            {
                "name": "Opera at Le Corum",
                "type": "Performance",
                "description": "Attend an opera, classical concert, or ballet at Montpellier's impressive Corum concert hall, home to the National Orchestra of Montpellier and a prestigious winter performance season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "The winter season features both classic productions and innovative performances in this acoustically perfect modern venue.",
                "booking_tips": "Purchase tickets through the Opera Orchestre National Montpellier website at least a month in advance. Pre-performance talks (in French) offer insights into the productions."
            },
            {
                "name": "Mont Aigoual Snow Experience",
                "type": "Outdoor Activity",
                "description": "Visit the highest point in the region, often snow-covered in winter, for sledding, cross-country skiing, or simply enjoying the rare snowy landscape just 90 minutes from Mediterranean Montpellier.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low",
                "seasonal_notes": "December through February offers the best chance for snow at this 1,567m peak in the Cévennes National Park.",
                "booking_tips": "Check snow conditions before departing. Drive yourself or take organized day trips from Montpellier. Equipment rental is available at the mountain station."
            },
            {
                "name": "Thermal Spa in Balaruc-les-Bains",
                "type": "Wellness",
                "description": "Indulge in therapeutic thermal waters at this historic spa town on the Thau Lagoon, with treatments harnessing the natural mineral-rich waters known since Roman times.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Winter is ideal for warming thermal treatments, with fewer visitors than the high season and a peaceful atmosphere in this lakeside town.",
                "booking_tips": "Reserve treatments at O'balia Spa or Thermes de Balaruc at least one week in advance. Day packages combining multiple treatments offer the best value."
            },
            {
                "name": "Indoor Food Markets",
                "type": "Food & Drink",
                "description": "Explore Les Halles Castellane, Montpellier's historic covered market, for winter specialties including oysters from nearby Bouzigues, regional cheeses, and seasonal game.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter brings peak season for Mediterranean oysters, truffles, and hearty regional specialties perfect for the cooler weather.",
                "booking_tips": "No booking required. Visit Tuesday through Sunday mornings, with the market closing around 2pm. Some oyster vendors offer on-site tasting with a glass of white wine."
            },
            {
                "name": "Winter Sales Shopping",
                "type": "Shopping",
                "description": "Take advantage of France's regulated winter sales season (soldes) with significant discounts in Montpellier's fashion boutiques, department stores, and the Polygone shopping center.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The winter sales period typically runs from mid-January to mid-February, with the best selection available in the first weeks.",
                "booking_tips": "No booking required. The Polygone mall and boutiques around Place de la Comédie offer the highest concentration of shopping options. Arrive early on the first day of sales for the best selection."
            },
            {
                "name": "FISE Indoor Extreme Sports",
                "type": "Sports Event",
                "description": "Watch world-class skateboarders, BMX riders, and other extreme sports athletes compete in the indoor winter edition of Montpellier's famous FISE World Series event.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "This February event brings the energy of extreme sports indoors during the winter months, with competitions and demonstrations by top athletes.",
                "booking_tips": "Purchase tickets online in advance for the main competition days. Some qualifying rounds and practice sessions are free to spectators."
            }
        ]
    }
}