{
  "neighborhoods": [
    {
      "name": "Écusson",
      "alternate_names": [
        "Historic Center",
        "Old Town",
        "Centre Historique"
      ],
      "character": "The medieval heart of Montpellier with a maze of narrow winding streets, elegant squares, and grand mansions, offering a vibrant blend of historical architecture, upscale shopping, café culture, and student life in a largely pedestrianized environment.",
      "location": {
        "central": true,
        "description": "The historic core of Montpellier, bordered by boulevards that follow the outline of the city's medieval walls (which gave the area its shield-like 'écusson' shape), with Place de la Comédie as its southeastern entrance.",
        "borders": [
          "Gambetta",
          "Les Arceaux",
          "Antigone",
          "Gare"
        ],
        "landmarks": [
          "Place de la Comédie",
          "Promenade du Peyrou",
          "Cathédrale Saint-Pierre",
          "Musée Fabre"
        ]
      },
      "history": {
        "overview": "Founded in the 10th century and developed primarily between the 12th and 16th centuries when Montpellier was a major center of trade and learning. The district's layout preserves the medieval street pattern while featuring grand architecture from the 17th and 18th centuries when wealthy merchants built private mansions.",
        "significance": "Represents Montpellier's golden age as a Mediterranean trade hub and intellectual center, particularly known for its medical school, which remains the oldest active medical faculty in the Western world.",
        "notable_events": [
          "Establishment of the University of Montpellier's medical school in 1220",
          "Construction of the majority of the city's grand hôtels particuliers in the 17th and 18th centuries",
          "Pedestrianization of much of the historic center in the 1980s and 90s"
        ]
      },
      "practical_info": {
        "transit": [
          "Tram lines 1, 2, and 4 serve the edges of the district",
          "Limited vehicle access (primarily residents and deliveries)",
          "Multiple public parking garages surround the perimeter"
        ],
        "safety": "Very safe area with high foot traffic and good lighting throughout. Standard precautions apply in late evening hours.",
        "best_time_to_visit": "Morning for quiet exploration of historic sites, evenings for dining and vibrant atmosphere.",
        "walkability": "Extremely walkable with pedestrianized streets, though narrow cobblestone passages can be challenging with mobility issues."
      },
      "appeal": {
        "known_for": [
          "Medieval street layout",
          "Hidden courtyards of mansions (hôtels particuliers)",
          "Café terraces and dining",
          "Independent boutiques"
        ],
        "atmosphere": [
          "Historic",
          "Vibrant",
          "Cultured"
        ],
        "best_for": [
          "History enthusiasts",
          "Architecture admirers",
          "Café culture lovers",
          "Shoppers"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 3,
        "green_spaces": 2,
        "shopping": 5,
        "dining": 5,
        "nightlife": 4,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Place de la Comédie",
            "type": "Historic square",
            "description": "Montpellier's iconic central plaza, nicknamed 'l'Oeuf' (the Egg) due to its original oval shape, featuring the Three Graces fountain, surrounded by elegant 19th-century buildings and bustling cafés.",
            "appeal": "The vibrant heart of city life and a perfect spot for people-watching from café terraces."
          },
          {
            "name": "Promenade du Peyrou",
            "type": "Royal square and gardens",
            "description": "Majestic 17th-century esplanade featuring a statue of Louis XIV, water tower (Château d'Eau), and spectacular views extending to the Mediterranean on clear days.",
            "appeal": "The most elegant public space in Montpellier with a regal atmosphere and panoramic vistas."
          },
          {
            "name": "Hôtels Particuliers",
            "type": "Historic mansions",
            "description": "Grand private mansions built by wealthy merchants and nobles between the 17th and 19th centuries, featuring hidden courtyards and elaborate staircases accessible through guided tours or during heritage days.",
            "appeal": "Architectural treasures revealing the private luxury behind austere street facades."
          }
        ],
        "dining": [
          {
            "name": "La Diligence",
            "cuisine": "Traditional French",
            "price_range": "€€€",
            "known_for": "Classic regional cuisine in a 17th-century vaulted setting",
            "atmosphere": "Elegant historic ambiance"
          },
          {
            "name": "Le Petit Jardin",
            "cuisine": "Mediterranean",
            "price_range": "€€€",
            "known_for": "Garden dining in a historic courtyard setting",
            "atmosphere": "Romantic and tranquil"
          },
          {
            "name": "Terminal #1",
            "cuisine": "Creative Contemporary",
            "price_range": "€€",
            "known_for": "Innovative small plates and natural wines",
            "atmosphere": "Modern, vibrant wine bar"
          }
        ],
        "activities": [
          {
            "name": "Hidden Courtyards Tour",
            "type": "Guided architectural walk",
            "description": "Explore the normally inaccessible interior courtyards of grand mansions with an expert guide explaining the history and architectural details.",
            "suitable_for": [
              "Architecture enthusiasts",
              "Photography lovers",
              "History buffs"
            ]
          },
          {
            "name": "Market Shopping at Les Halles Castellane",
            "type": "Food and culture experience",
            "description": "Visit the covered market to sample regional specialties, local wines, and fresh seafood from Mediterranean coast.",
            "suitable_for": [
              "Food enthusiasts",
              "Culinary travelers",
              "Those seeking authentic local experiences"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be in the historic heart of the city with attractions at your doorstep",
        "You appreciate historic architecture and atmosphere",
        "You enjoy vibrant street life, café culture, and dining options"
      ],
      "avoid_if": [
        "You're sensitive to noise (parts can be lively until late, especially in summer)",
        "You require easy vehicle access or parking",
        "You prefer modern accommodations with spacious rooms"
      ],
      "insider_tips": [
        "Visit the Faculty of Medicine's historic anatomy theater by booking a guided tour in advance – it's the oldest medical school still in operation in the Western world.",
        "Many hidden courtyards of private mansions are accessible during European Heritage Days (Journées du Patrimoine) in September.",
        "For the best photos of the aqueduct at Les Arceaux, visit in the late afternoon when the golden light illuminates the stone arches."
      ]
    },
    {
      "name": "Antigone",
      "alternate_names": [
        "Neo-Classical District",
        "Bofill Quarter"
      ],
      "character": "A monumental neoclassical district designed in the 1970s and 80s by Catalan architect Ricardo Bofill, featuring grand boulevards, geometric symmetry, and imposing buildings with classical elements that create a dramatic contrast to the medieval center.",
      "location": {
        "central": true,
        "description": "Located directly east of the historic center, extending from Place de la Comédie to the Lez River in a carefully planned linear layout with a central axis.",
        "borders": [
          "Écusson",
          "Comédie",
          "Port Marianne",
          "Lez River"
        ],
        "landmarks": [
          "Place du Nombre d'Or",
          "Hôtel de Région",
          "Olympic Swimming Pool",
          "Esplanade de l'Europe"
        ]
      },
      "history": {
        "overview": "Created in the late 1970s and 1980s on the site of former military barracks as Montpellier's first major urban expansion since the 19th century, designed as a cohesive architectural statement that would extend the city eastward toward the Lez River.",
        "significance": "Represents Montpellier's ambitious urban development under Mayor Georges Frêche and showcases postmodern architectural principles with a Mediterranean classical influence.",
        "notable_events": [
          "Selection of Ricardo Bofill as master architect in 1977",
          "Construction between 1979 and 1990",
          "Establishment of the Hôtel de Région (Regional Government Headquarters) as architectural centerpiece"
        ]
      },
      "practical_info": {
        "transit": [
          "Tram lines 1 and 4 run along the southern edge",
          "Tram line 4 runs through Place du Nombre d'Or",
          "Multiple bus routes",
          "Bicycle-friendly with wide boulevards"
        ],
        "safety": "Very safe area with wide open spaces and good visibility. Well-lit at night with moderate foot traffic.",
        "best_time_to_visit": "Late afternoon when the sunlight enhances the warm tones of the buildings.",
        "walkability": "Extremely walkable with wide boulevards, open squares, and flat terrain throughout."
      },
      "appeal": {
        "known_for": [
          "Neoclassical architecture",
          "Monumental scale",
          "Geometric urban design",
          "Open public spaces"
        ],
        "atmosphere": [
          "Grand",
          "Ordered",
          "Spacious"
        ],
        "best_for": [
          "Architecture enthusiasts",
          "Photography lovers",
          "Urban design students",
          "Those seeking contrast to medieval center"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 4,
        "green_spaces": 3,
        "shopping": 2,
        "dining": 2,
        "nightlife": 1,
        "cultural": 3,
        "historic": 2
      },
      "highlights": {
        "attractions": [
          {
            "name": "Place du Nombre d'Or",
            "type": "Architectural square",
            "description": "Central plaza in the heart of Antigone featuring Bofill's signature neoclassical elements, colonnades, and a geometric layout based on the golden ratio.",
            "appeal": "The defining space of the district showcasing the architect's vision of contemporary classicism."
          },
          {
            "name": "Regional Government Headquarters",
            "type": "Landmark building",
            "description": "Monumental administrative complex serving as the seat of the Occitanie regional government, featuring dramatic classical elements at a grand scale.",
            "appeal": "The architectural centerpiece of Antigone demonstrating the district's political importance."
          },
          {
            "name": "Antigone Linear Axis",
            "type": "Urban design",
            "description": "The central pedestrian boulevard stretching from Place de la Comédie to the Lez River, featuring a carefully designed sequence of public spaces and symmetrical buildings.",
            "appeal": "A masterclass in planned urban design with perfect symmetry and classical proportions."
          }
        ],
        "dining": [
          {
            "name": "Le Castel",
            "cuisine": "Modern French",
            "price_range": "€€",
            "known_for": "Contemporary cuisine with river views",
            "atmosphere": "Contemporary with outdoor terrace"
          },
          {
            "name": "La Tamarillos",
            "cuisine": "Mediterranean fusion",
            "price_range": "€€",
            "known_for": "Creative seasonal dishes in a modern setting",
            "atmosphere": "Sleek and minimalist"
          },
          {
            "name": "Les Bains",
            "cuisine": "Brasserie",
            "price_range": "€€",
            "known_for": "Classic dishes in historic bathhouse building",
            "atmosphere": "Historic with contemporary touches"
          }
        ],
        "activities": [
          {
            "name": "Architectural Walking Tour",
            "type": "Self-guided exploration",
            "description": "Follow the central axis from west to east, observing how the spaces unfold according to Bofill's master plan and classical references.",
            "suitable_for": [
              "Architecture enthusiasts",
              "Photographers",
              "Urban design students"
            ]
          },
          {
            "name": "Olympic Swimming Pool",
            "type": "Sports facility",
            "description": "Visit or swim in the architecturally significant Olympic pool facility designed as part of the original Antigone plan.",
            "suitable_for": [
              "Swimming enthusiasts",
              "Sports architecture fans",
              "Active travelers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You appreciate dramatic postmodern architecture",
        "You prefer spacious, orderly environments",
        "You want a central but quieter alternative to the historic center"
      ],
      "avoid_if": [
        "You're seeking charming historical atmosphere",
        "You prefer bustling street life and café culture",
        "You dislike planned developments with uniform architectural style"
      ],
      "insider_tips": [
        "Visit during the late afternoon golden hour when the warm Mediterranean light brings out the best in the ochre-colored facades.",
        "The central reflecting pool often has its water drained – check local events as it's sometimes used for performances and temporary installations.",
        "For the best panoramic view of Antigone's symmetrical layout, visit the upper floors of the Polygone shopping center at the western entrance."
      ]
    },
    {
      "name": "Port Marianne",
      "alternate_names": [
        "New Montpellier",
        "Eastern District"
      ],
      "character": "Montpellier's showcase of contemporary architecture and urban planning, featuring striking modern buildings by international architects, organized around the landscaped banks of the Lez River with a blend of residential, commercial, and leisure spaces.",
      "location": {
        "central": false,
        "description": "Located in eastern Montpellier beyond Antigone, extending along both banks of the Lez River and developing eastward with numerous sub-neighborhoods still under construction.",
        "borders": [
          "Antigone",
          "Millénaire",
          "Lironde",
          "Lez River"
        ],
        "landmarks": [
          "Hôtel de Ville (City Hall)",
          "Bassin Jacques Cœur",
          "RBC Design Center",
          "Les Jardins de la Lironde"
        ]
      },
      "history": {
        "overview": "Developed primarily since the 1990s as Montpellier's eastward expansion, Port Marianne represents the city's ambition to become a showcase for contemporary architecture and sustainable urban development.",
        "significance": "Embodies Montpellier's transformation from a historic regional center to a forward-looking Mediterranean metropolis emphasizing architectural innovation and quality of life.",
        "notable_events": [
          "Adoption of the Port Marianne masterplan in the 1990s",
          "Construction of Jean Nouvel's iconic City Hall in 2011",
          "Ongoing development of multiple districts, each with distinctive architectural identity"
        ]
      },
      "practical_info": {
        "transit": [
          "Tram lines 1, 3, and 4 serve different areas of the district",
          "Multiple bus routes",
          "Extensive bicycle path network",
          "Good vehicle access with numerous parking facilities"
        ],
        "safety": "Very safe area with good lighting, modern infrastructure, and mixed-use development providing activity throughout the day and evening.",
        "best_time_to_visit": "Afternoons and early evenings when the contemporary architecture catches the light and riverside areas are lively.",
        "walkability": "Generally walkable but somewhat spread out; the tram or bicycles are useful for covering the entire district."
      },
      "appeal": {
        "known_for": [
          "Bold contemporary architecture",
          "Waterfront promenades",
          "Modern public spaces",
          "Sustainable urban design"
        ],
        "atmosphere": [
          "Modern",
          "Spacious",
          "Dynamic"
        ],
        "best_for": [
          "Architecture enthusiasts",
          "Design lovers",
          "Outdoor recreation seekers",
          "Those interested in urban development"
        ]
      },
      "categories": {
        "touristy": 2,
        "residential": 5,
        "green_spaces": 4,
        "shopping": 3,
        "dining": 3,
        "nightlife": 2,
        "cultural": 3,
        "historic": 1
      },
      "highlights": {
        "attractions": [
          {
            "name": "Hôtel de Ville (City Hall)",
            "type": "Architectural landmark",
            "description": "Striking blue cube-shaped building designed by Jean Nouvel, featuring a dramatic cantilever and innovative sustainable design elements including natural ventilation and solar shading.",
            "appeal": "Iconic example of contemporary civic architecture that has become a symbol of modern Montpellier."
          },
          {
            "name": "Bassin Jacques Cœur",
            "type": "Urban waterfront",
            "description": "Attractive residential area centered around an artificial basin connected to the Lez River, with apartments and restaurants lining the waterfront promenades.",
            "appeal": "Mediterranean-inspired waterfront living creating a distinct atmosphere compared to the historic center."
          },
          {
            "name": "Lez River Banks",
            "type": "Urban park and promenades",
            "description": "Landscaped pedestrian and cycling paths along the river, connecting various parts of the district with green spaces and leisure areas.",
            "appeal": "Natural corridor providing recreational space and a scenic spine through the modern developments."
          }
        ],
        "dining": [
          {
            "name": "Le Nuage",
            "cuisine": "Modern French",
            "price_range": "€€€",
            "known_for": "Elegant dining in Philippe Starck's cloud-shaped building",
            "atmosphere": "Design-forward and sophisticated"
          },
          {
            "name": "Terminal #2",
            "cuisine": "Tapas and wine",
            "price_range": "€€",
            "known_for": "Creative small plates and extensive wine selection",
            "atmosphere": "Contemporary and social"
          },
          {
            "name": "Café de la Panacée",
            "cuisine": "Mediterranean fusion",
            "price_range": "€€",
            "known_for": "Seasonal creative cuisine in artistic setting",
            "atmosphere": "Modern and cultural"
          }
        ],
        "activities": [
          {
            "name": "Contemporary Architecture Tour",
            "type": "Self-guided or guided exploration",
            "description": "Discover signature buildings by famous architects including Jean Nouvel, Zaha Hadid, Philippe Starck, and local firms scattered throughout the district.",
            "suitable_for": [
              "Architecture enthusiasts",
              "Design professionals",
              "Photography lovers"
            ]
          },
          {
            "name": "Lez River Activities",
            "type": "Outdoor recreation",
            "description": "Walking, running, cycling, and occasional water sports along the landscaped river corridor that forms the spine of Port Marianne.",
            "suitable_for": [
              "Outdoor enthusiasts",
              "Fitness-minded travelers",
              "Families seeking open spaces"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You appreciate contemporary architecture and modern amenities",
        "You prefer spacious, newly developed areas with good transportation",
        "You enjoy waterfront environments and outdoor activities"
      ],
      "avoid_if": [
        "You're primarily interested in historic atmosphere",
        "You prefer the density and character of traditional urban centers",
        "You dislike areas still under development with ongoing construction"
      ],
      "insider_tips": [
        "The upper floors of the City Hall are open to the public on European Heritage Days (Journées du Patrimoine) in September, offering rare views from its dramatic cantilevered section.",
        "Check the schedule for the summer floating cinema which occasionally shows films on a screen in the Bassin Jacques Cœur with viewers watching from the banks.",
        "The RBC Design Center has a publicly accessible rooftop with excellent views of the district and a small café that's rarely crowded."
      ]
    },
    {
      "name": "Les Arceaux",
      "alternate_names": [
        "Saint-Clément",
        "Aqueduct District"
      ],
      "character": "A charming residential neighborhood just west of the historic center, characterized by the dramatic 18th-century aqueduct that runs through it, tree-lined avenues, a vibrant twice-weekly market, and a laid-back local atmosphere popular with families and academics.",
      "location": {
        "central": true,
        "description": "Located immediately west of the historic center, extending from the Peyrou royal promenade toward Parc Montcalm, named after the impressive aqueduct arches that define the area.",
        "borders": [
          "Écusson",
          "Boutonnet",
          "Figuerolles",
          "Assas"
        ],
        "landmarks": [
          "Arceaux Saint-Clément (aqueduct)",
          "Peyrou Royal Promenade (eastern edge)",
          "Place Max Rouquette",
          "Jardin des Plantes (northeast corner)"
        ]
      },
      "history": {
        "overview": "Developed primarily in the 19th and early 20th centuries around the impressive Saint-Clément Aqueduct, built between 1753-1766 to bring water to the Peyrou water tower and supply the growing city.",
        "significance": "Represents both an engineering achievement of the Enlightenment period and the expansion of Montpellier beyond its medieval walls into elegant residential areas.",
        "notable_events": [
          "Construction of the Saint-Clément Aqueduct in the mid-18th century",
          "Development as a desirable residential area in the 19th century",
          "Establishment of the farmers market beneath the arches, now one of the city's most beloved markets"
        ]
      },
      "practical_info": {
        "transit": [
          "Tram line 3 runs along the southern edge",
          "Multiple bus routes connect to the city center",
          "Bicycle-friendly neighborhood with good infrastructure",
          "10-15 minute walk to Place de la Comédie"
        ],
        "safety": "Very safe residential area with strong community feeling. Well-lit main streets and good pedestrian infrastructure.",
        "best_time_to_visit": "Tuesday and Saturday mornings for the market, late afternoon for photography of the aqueduct.",
        "walkability": "Highly walkable neighborhood with pleasant streets, though with some hills leading west from the center."
      },
      "appeal": {
        "known_for": [
          "Saint-Clément Aqueduct",
          "Vibrant farmers market",
          "Leafy residential streets",
          "Proximity to historic center"
        ],
        "atmosphere": [
          "Relaxed",
          "Local",
          "Family-friendly"
        ],
        "best_for": [
          "Market lovers",
          "Those seeking local atmosphere",
          "Photographers",
          "Families"
        ]
      },
      "categories": {
        "touristy": 2,
        "residential": 5,
        "green_spaces": 4,
        "shopping": 3,
        "dining": 3,
        "nightlife": 2,
        "cultural": 3,
        "historic": 4
      },
      "highlights": {
        "attractions": [
          {
            "name": "Arceaux Saint-Clément",
            "type": "Historic monument",
            "description": "Impressive 18th-century aqueduct featuring two tiers of elegant arches stretching over 800 meters through the neighborhood, originally built to supply water to the city center.",
            "appeal": "Dramatic architectural feature that creates a unique backdrop for daily life and the neighborhood market."
          },
          {
            "name": "Marché des Arceaux",
            "type": "Farmers market",
            "description": "Bustling twice-weekly market (Tuesdays and Saturdays) set beneath the arches of the aqueduct, featuring local producers, organic products, and regional specialties.",
            "appeal": "One of Montpellier's most atmospheric markets, beloved by locals and set in a spectacular historic setting."
          },
          {
            "name": "Jardin des Plantes",
            "type": "Botanical garden",
            "description": "Founded in 1593, France's oldest botanical garden sits at the northeastern edge of the neighborhood, featuring medicinal plants, historic greenhouses, and peaceful walking paths.",
            "appeal": "Historic scientific garden that offers a tranquil green retreat with educational value."
          }
        ],
        "dining": [
          {
            "name": "L'Artichaut",
            "cuisine": "Creative vegetarian",
            "price_range": "€€",
            "known_for": "Innovative plant-based cuisine using market ingredients",
            "atmosphere": "Bright, casual, and welcoming"
          },
          {
            "name": "Café de la Mer",
            "cuisine": "Mediterranean bistro",
            "price_range": "€€",
            "known_for": "Fresh market-inspired dishes with local wines",
            "atmosphere": "Neighborhood favorite with terrace"
          },
          {
            "name": "Le Petit Jardin",
            "cuisine": "Traditional French",
            "price_range": "€€€",
            "known_for": "Garden dining in historic setting near Peyrou",
            "atmosphere": "Romantic and secluded"
          }
        ],
        "activities": [
          {
            "name": "Market Shopping and Picnic",
            "type": "Food and culture experience",
            "description": "Shop for local specialties at the farmers market and enjoy a picnic in the nearby Peyrou gardens with panoramic views over the city.",
            "suitable_for": [
              "Food enthusiasts",
              "Casual travelers",
              "Budget-conscious visitors"
            ]
          },
          {
            "name": "Aqueduct Photography Walk",
            "type": "Self-guided tour",
            "description": "Follow the course of the aqueduct from the Peyrou water tower through Les Arceaux, capturing the changing perspectives and light on the ancient stone arches.",
            "suitable_for": [
              "Photographers",
              "Architecture enthusiasts",
              "History buffs"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want a local residential experience close to the historic center",
        "You enjoy market culture and food shopping",
        "You prefer quieter neighborhoods with character"
      ],
      "avoid_if": [
        "You want to be in the center of nightlife and tourist activities",
        "You prefer ultra-modern accommodations",
        "You have limited mobility (some streets have inclines)"
      ],
      "insider_tips": [
        "Arrive at the Arceaux market before 9am on Saturday for the best selection and to beat the crowds, particularly in summer.",
        "The section of the aqueduct near Rue Pitot offers the most dramatic views and photo opportunities, especially in late afternoon light.",
        "The small Place Saint-Côme at the edge of the district has several good wine bars where locals gather on warm evenings."
      ]
    },
    {
      "name": "Beaux-Arts",
      "alternate_names": [
        "Boutonnet-Beaux-Arts",
        "University District"
      ],
      "character": "A bohemian, artistic neighborhood with a village-like atmosphere, popular with students and creative professionals, offering a mix of traditional architecture, small independent shops, casual dining, and a youthful energy with strong community spirit.",
      "location": {
        "central": true,
        "description": "Located north of the historic center between the university faculties and the Lez River, developed primarily as a residential extension in the late 19th and early 20th centuries.",
        "borders": [
          "Écusson",
          "Boutonnet",
          "Hôpitaux-Facultés",
          "Les Aubes"
        ],
        "landmarks": [
          "Place des Beaux-Arts",
          "Église Saint-François",
          "Parc Clemenceau",
          "Verdanson Stream"
        ]
      },
      "history": {
        "overview": "Originally developed in the late 19th century as Montpellier expanded beyond its medieval core, the neighborhood has evolved from a working-class area to a bohemian district popular with students, artists, and academics from the nearby university.",
        "significance": "Represents the preservation of a village-like community within the urban context, maintaining a distinct identity and local culture despite its central location.",
        "notable_events": [
          "Development as a primarily residential district in the late 19th century",
          "Growth of artistic community in the post-war period",
          "Urban renewal and gentrification since the 1990s while maintaining its bohemian character"
        ]
      },
      "practical_info": {
        "transit": [
          "Tram line 2 serves the eastern edge",
          "Multiple bus routes",
          "Bicycle-friendly with good infrastructure",
          "15-minute walk to Place de la Comédie"
        ],
        "safety": "Very safe neighborhood with strong community presence. Normal precautions apply at night.",
        "best_time_to_visit": "Early evenings when local life is most vibrant, particularly Thursday and Friday.",
        "walkability": "Highly walkable neighborhood with pleasant streets and pedestrian-friendly atmosphere."
      },
      "appeal": {
        "known_for": [
          "Village-like atmosphere",
          "Artistic community",
          "Independent shops and cafés",
          "Local festivals"
        ],
        "atmosphere": [
          "Bohemian",
          "Lively",
          "Creative"
        ],
        "best_for": [
          "Young travelers",
          "Art and music lovers",
          "Those seeking local experiences",
          "Budget-conscious visitors"
        ]
      },
      "categories": {
        "touristy": 1,
        "residential": 5,
        "green_spaces": 3,
        "shopping": 3,
        "dining": 4,
        "nightlife": 3,
        "cultural": 4,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Place des Beaux-Arts",
            "type": "Local square",
            "description": "The heart of the neighborhood featuring a small fountain, surrounded by cafés, restaurants, and shops that create a focal point for community life.",
            "appeal": "Authentic local gathering place with vibrant atmosphere, particularly in evenings."
          },
          {
            "name": "Marché du Mercredi",
            "type": "Local market",
            "description": "Wednesday street market along Avenue Bouisson-Bertrand offering fresh produce, local products, and atmosphere.",
            "appeal": "Authentic neighborhood commerce where locals do their weekly shopping."
          },
          {
            "name": "Street Art Tour",
            "type": "Urban art",
            "description": "The neighborhood features numerous murals and street art installations, some commissioned and others spontaneous, reflecting its creative character.",
            "appeal": "Open-air gallery that changes regularly with new works appearing throughout the area."
          }
        ],
        "dining": [
          {
            "name": "Le Petit London",
            "cuisine": "Tapas and international",
            "price_range": "€€",
            "known_for": "Creative small plates and craft beers in relaxed setting",
            "atmosphere": "Casual and lively with student vibe"
          },
          {
            "name": "La Canourgue",
            "cuisine": "Modern bistro",
            "price_range": "€€",
            "known_for": "Market-fresh seasonal dishes with regional influence",
            "atmosphere": "Neighborhood gem with local following"
          },
          {
            "name": "Broc Café",
            "cuisine": "Coffee and light fare",
            "price_range": "€",
            "known_for": "Specialty coffee, homemade cakes, and light lunches",
            "atmosphere": "Cozy with vintage décor and artistic clientele"
          }
        ],
        "activities": [
          {
            "name": "Evening Bar Hopping",
            "type": "Nightlife exploration",
            "description": "Explore the neighborhood's diverse collection of wine bars, craft beer spots, and casual hangouts popular with local students and creatives.",
            "suitable_for": [
              "Young travelers",
              "Social drinkers",
              "People seeking local atmosphere"
            ]
          },
          {
            "name": "Independent Shopping",
            "type": "Boutique browsing",
            "description": "Discover small independent shops selling everything from vintage clothing to handmade jewelry, local art, and unique gifts.",
            "suitable_for": [
              "Fashion enthusiasts",
              "Souvenir hunters",
              "Supporters of local businesses"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to experience local Montpellier life away from tourist areas",
        "You enjoy bohemian, artistic neighborhoods with character",
        "You're looking for budget-friendly dining and nightlife options"
      ],
      "avoid_if": [
        "You prefer luxury accommodations and upscale environments",
        "You want immediate access to major tourist attractions",
        "You're sensitive to typical urban noise including student revelry"
      ],
      "insider_tips": [
        "Many local shops and restaurants close in August when owners take vacation, but the neighborhood comes alive for the 'Estivales' summer evening markets on Thursdays.",
        "The tiny Bar à Vins de la Canourgue has an excellent selection of local wines by the glass and is a favorite meeting spot for local artists and academics.",
        "Several buildings have interesting interior courtyards that aren't visible from the street - look for open doors during the day to peek inside."
      ]
    },
    {
      "name": "Gambetta",
      "alternate_names": [
        "Figuerolles-Gambetta",
        "Multicultural Quarter"
      ],
      "character": "A diverse, multicultural neighborhood with North African influences, offering authentic markets, international food shops, affordable dining, and a vibrant community atmosphere that provides a genuine contrast to the more tourist-oriented areas of Montpellier.",
      "location": {
        "central": true,
        "description": "Located west of the historic center past Les Arceaux, developed along Cours Gambetta as a working-class area that has become one of the city's most culturally diverse districts.",
        "borders": [
          "Figuerolles",
          "Les Arceaux",
          "Plan Cabanes",
          "Gare"
        ],
        "landmarks": [
          "Place Salengro",
          "Marché du Plan Cabanes",
          "Parc de la Guirlande",
          "Mosquée Averroès"
        ]
      },
      "history": {
        "overview": "Developed primarily in the late 19th and early 20th centuries as a working-class district, the area has evolved into a multicultural neighborhood with significant North African and Mediterranean immigration since the 1960s and 1970s.",
        "significance": "Represents Montpellier's cultural diversity and immigrant heritage, providing authentic cultural experiences beyond the more polished historic center.",
        "notable_events": [
          "Development as working-class housing during industrial expansion",
          "Significant North African immigration from the 1960s onwards",
          "Controversial relocation of the main market from Place Salengro in the early 2000s",
          "Recent gentrification while maintaining multicultural character"
        ]
      },
      "practical_info": {
        "transit": [
          "Tram line 3 runs through the district",
          "Multiple bus routes",
          "Bicycle-friendly with dedicated lanes on main roads",
          "15-20 minute walk to Place de la Comédie"
        ],
        "safety": "Generally safe but exercise normal urban precautions, particularly at night. Some areas have a rougher reputation but are typically fine during daylight hours.",
        "best_time_to_visit": "Mornings for market activity, particularly at Plan Cabanes.",
        "walkability": "Very walkable neighborhood with flat terrain and pedestrian-friendly streets."
      },
      "appeal": {
        "known_for": [
          "Cultural diversity",
          "Authentic markets",
          "International cuisine",
          "Affordable shopping"
        ],
        "atmosphere": [
          "Vibrant",
          "Authentic",
          "Unpretentious"
        ],
        "best_for": [
          "Food enthusiasts",
          "Cultural explorers",
          "Budget travelers",
          "Those seeking authentic local experiences"
        ]
      },
      "categories": {
        "touristy": 1,
        "residential": 5,
        "green_spaces": 2,
        "shopping": 4,
        "dining": 4,
        "nightlife": 2,
        "cultural": 4,
        "historic": 2
      },
      "highlights": {
        "attractions": [
          {
            "name": "Marché du Plan Cabanes",
            "type": "Multicultural market",
            "description": "Vibrant open-air market featuring North African and Mediterranean produce, spices, textiles, and goods that reflect the district's diverse population.",
            "appeal": "Authentic cultural experience with sights, sounds, and flavors rarely found in more tourist-oriented areas."
          },
          {
            "name": "International Food Shops",
            "type": "Specialty retail",
            "description": "Concentrated along Cours Gambetta and surrounding streets, numerous shops selling ingredients, spices, pastries, and products from North Africa, Middle East, and beyond.",
            "appeal": "Culinary exploration opportunities and authentic shopping experience."
          },
          {
            "name": "Parc de la Guirlande",
            "type": "Neighborhood park",
            "description": "Small but vital green space serving as community gathering place, particularly for families, with playground, benches, and occasional events.",
            "appeal": "Glimpse of everyday local life in a multicultural setting."
          }
        ],
        "dining": [
          {
            "name": "Chez Karim",
            "cuisine": "Moroccan",
            "price_range": "€",
            "known_for": "Authentic tagines and couscous in generous portions",
            "atmosphere": "Casual and friendly family-run establishment"
          },
          {
            "name": "Le Sphinx",
            "cuisine": "Lebanese/Middle Eastern",
            "price_range": "€€",
            "known_for": "Mezze platters and grilled meats with fresh bread",
            "atmosphere": "Lively with outdoor seating"
          },
          {
            "name": "La Khaima",
            "cuisine": "Mauritanian",
            "price_range": "€",
            "known_for": "Rare opportunity to try Mauritanian cuisine with communal dining",
            "atmosphere": "Traditional seating with cultural authenticity"
          }
        ],
        "activities": [
          {
            "name": "Culinary Exploration",
            "type": "Food adventure",
            "description": "Spend a morning exploring the specialty food shops, bakeries, and market stalls sampling pastries, olives, spices, and other delicacies from different cultures.",
            "suitable_for": [
              "Food enthusiasts",
              "Culinary travelers",
              "Cultural explorers"
            ]
          },
          {
            "name": "Community Events",
            "type": "Cultural participation",
            "description": "Check local postings for community festivals, music events, and cultural celebrations that frequently take place in the neighborhood's public spaces.",
            "suitable_for": [
              "Travelers seeking authentic experiences",
              "Music and arts enthusiasts",
              "Cultural immersion seekers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want an authentic, non-touristy neighborhood experience",
        "You're interested in multicultural environments and global cuisines",
        "You're a budget-conscious traveler looking for affordable accommodation"
      ],
      "avoid_if": [
        "You prefer polished, upscale environments",
        "You're uncomfortable in working-class, diverse urban settings",
        "You want convenient access to main tourist attractions"
      ],
      "insider_tips": [
        "The best time to visit the Plan Cabanes market is Tuesday morning when it's busy but not overcrowded and selection is best.",
        "Look for the small patisseries selling North African sweets like makroud and baklava – most are family businesses using traditional recipes.",
        "Several buildings showcase interesting street art, particularly along Rue du Faubourg Figuerolles leading into the adjacent Figuerolles district."
      ]
    }
  ]
}