{
    "sites": [
        {
            "name": "Place de la Comédie",
            "type": "Square",
            "description": "This vast oval plaza is the beating heart of Montpellier and one of the largest pedestrian areas in Europe. Dominated by the elegant Three Graces fountain and surrounded by beautiful 19th-century buildings including the Opéra Comédie, it's filled with cafés, street performers, and constant activity. The square connects to the Esplanade Charles de Gaulle and serves as the city's primary meeting point.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Lively throughout the year. Summer evenings feature outdoor dining and performances. Christmas markets and decorations make it magical in December.",
            "booking_tips": "No booking required. Numerous restaurants around the square may require reservations, especially during peak tourist season.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 43.6083,
            "longitude": 3.8790
        },
        {
            "name": "Promenade du Peyrou",
            "type": "Historic Park",
            "description": "This magnificent royal square features a statue of Louis XIV on horseback, the elegant Water Castle (Château d'Eau) and an 18th-century aqueduct. The elevated esplanade offers panoramic views of Montpellier and the surrounding landscape extending to the Mediterranean on clear days. The park is bordered by the monumental Arc de Triomphe (Porte du Peyrou).",
            "indoor": false,
            "best_time": "Sunset",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Water markets on Sundays. The aqueduct is illuminated at night. Sunset views are particularly stunning in summer.",
            "booking_tips": "No booking required. Water tower can be visited during limited hours as part of guided tours.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 43.6122,
            "longitude": 3.8733
        },
        {
            "name": "Musée Fabre",
            "type": "Museum",
            "description": "One of France's richest fine art museums houses an exceptional collection spanning from the Renaissance to contemporary art. Highlights include masterpieces by Delacroix, Courbet, Bazille, and a significant collection of works by Pierre Soulages. The museum, founded in 1825, underwent a major renovation in 2007 and now offers 9,200 square meters of exhibition space.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with seasonal exhibitions. Less crowded on weekday mornings. Air-conditioned refuge during summer heat.",
            "booking_tips": "No advance booking required for general admission. Free entry on the first Sunday of each month. Audio guides available in multiple languages.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 43.6114,
            "longitude": 3.8776
        },
        {
            "name": "Cathédrale Saint-Pierre",
            "type": "Cathedral",
            "description": "This imposing Gothic cathedral dates from 1364 and features a distinctive porch with two massive cylindrical pillars creating a dramatic entrance. The interior houses valuable paintings and an impressive organ. The cathedral miraculously survived the Wars of Religion and stands adjacent to the historic Faculty of Medicine.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful lighting in mornings when sun illuminates the stained glass windows. Special services during Easter and Christmas. More peaceful during weekday visits.",
            "booking_tips": "No booking required. Respect quiet during religious services. Occasionally closed for weddings or ceremonies.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.6136,
            "longitude": 3.8731
        },
        {
            "name": "Jardin des Plantes",
            "type": "Botanical Garden",
            "description": "The oldest botanical garden in France (founded in 1593) served as a model for all others in the country. Originally established for medical students to study medicinal plants, it now houses more than 2,500 plant species, including a historic greenhouse, centuries-old trees, and Mediterranean collections. The garden retains its charming historic layout with formalized beds and winding paths.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Spring brings spectacular blooms. Summer offers shade under ancient trees. The greenhouse provides interest during winter months. Closed during periods of high wind.",
            "booking_tips": "No booking required. Occasional guided tours available through the University of Montpellier.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.6136,
            "longitude": 3.8709
        },
        {
            "name": "Quartier de l'Écusson",
            "type": "Historic District",
            "description": "The historic heart of Montpellier takes its name ('shield') from its medieval shield-like shape. This pedestrianized center is a maze of narrow winding streets, elegant mansions with hidden courtyards, small squares, and independent shops. Many buildings date from the 17th and 18th centuries when Montpellier was a major center of learning and commerce.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Enjoyable year-round. Milder temperatures in spring and fall make exploration more comfortable. Many shops close on Sundays, but restaurants remain open.",
            "booking_tips": "No booking required for self-guided walking. Tourist office offers guided walking tours several times weekly (reservation recommended).",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 43.6097,
            "longitude": 3.8763
        },
        {
            "name": "Faculté de Médecine",
            "type": "Historic University",
            "description": "Founded in 1220, this is the world's oldest medical school still in operation. The historic building includes the spectacular anatomy amphitheater and houses a museum of medical history with anatomical collections, ancient instruments, and herbariums. The school has trained physicians for over 800 years and counts Nostradamus among its famous alumni.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Low",
            "seasonal_notes": "Open for guided tours only. Tours run year-round but may be limited during university examination periods. The courtyard can be viewed without a tour.",
            "booking_tips": "Advance booking required for guided tours, which are offered in French and English on specific days only.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 43.6131,
            "longitude": 3.8741
        },
        {
            "name": "Aqueduc Saint-Clément",
            "type": "Historic Monument",
            "description": "This impressive 18th-century aqueduct was built between 1753 and 1765 to bring water from the Saint-Clément spring to the Promenade du Peyrou. The most spectacular section, Les Arceaux, features two tiers of elegant arches rising 22 meters high and stretching for 800 meters through a modern neighborhood, creating a striking juxtaposition of ancient and contemporary.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round. The stone is particularly golden in late afternoon sunlight. A farmers market is held beneath the arches on Tuesday and Saturday mornings.",
            "booking_tips": "No booking required. Can be viewed from multiple angles by walking along Avenue François Delmas.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 43.6114,
            "longitude": 3.8701
        },
        {
            "name": "Marché du Lez",
            "type": "Urban Market & Creative Space",
            "description": "This vibrant space in a former industrial area combines vintage markets, food halls, designer boutiques, and co-working spaces. The renovated warehouses now host restaurants with outdoor terraces, weekend events, regular night markets, and pop-up shops, making it a creative hub for both locals and visitors seeking an alternative side of Montpellier.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Open year-round with different operations for various venues. Summer brings outdoor concerts and events. The covered food hall operates regardless of weather.",
            "booking_tips": "No booking required for general access. Reservations recommended for restaurants, especially on weekends and event nights.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 3
            },
            "latitude": 43.6011,
            "longitude": 3.9024
        },
        {
            "name": "MOCO Hôtel des Collections",
            "type": "Contemporary Art Museum",
            "description": "Opened in 2019 in a beautifully renovated 18th-century mansion, this contemporary art center doesn't have a permanent collection but instead hosts rotating exhibitions of international private and public collections. The museum forms part of Montpellier's ambitious MOCO ecosystem that includes the Panacée art center and the regional fine arts school.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Low",
            "seasonal_notes": "Open year-round except Mondays. Exhibitions typically change three times yearly. The garden courtyard provides a pleasant setting in good weather.",
            "booking_tips": "No advance booking required. Free guided tours available on weekends (check schedule on site).",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.6084,
            "longitude": 3.8764
        },
        {
            "name": "Odysseum",
            "type": "Entertainment Complex",
            "description": "This large modern complex combines shopping, dining, and entertainment facilities on the eastern edge of the city. Attractions include an aquarium (Planet Ocean), planetarium, ice rink, bowling alley, multiplex cinema, and a miniature golf course alongside numerous shops and restaurants. It's easily accessible by tram from the city center.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Varies",
            "seasonal_notes": "Most attractions operate year-round. More crowded during school holidays and weekends. Air-conditioned refuge during summer heat.",
            "booking_tips": "No booking required for general access. Individual attractions may require tickets or reservations. Planet Ocean aquarium offers discounted tickets when purchased online.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 2
            },
            "latitude": 43.6039,
            "longitude": 3.9152
        },
        {
            "name": "Plage du Grand Travers",
            "type": "Beach",
            "description": "The closest major beach to Montpellier offers miles of fine sand and Mediterranean shoreline just 10km from the city center. The beach is well-maintained with clear waters that have consistently earned Blue Flag status. The expansive shoreline means it's possible to find less crowded spots even in high season. Nearby La Grande-Motte offers additional services and dining options.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Summer (June-September) is peak season with lifeguards on duty. Spring and fall offer pleasant temperatures with fewer crowds. Winter walks can be refreshingly wild and atmospheric.",
            "booking_tips": "No booking required. Accessible by car (paid parking in summer) or by seasonal shuttle bus from Montpellier. Arrive early in summer to secure parking.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 4,
                "cultural_significance": 2
            },
            "latitude": 43.5579,
            "longitude": 4.0550
        },
        {
            "name": "Parc Zoologique de Montpellier",
            "type": "Zoo",
            "description": "One of the largest zoological parks in France covers 80 hectares on a hill north of the city. The landscaped park houses around 140 species in spacious, naturalistic enclosures designed to represent different world ecosystems. The park focuses on conservation efforts and maintains a notable Amazon greenhouse and African plain with giraffes and rhinoceros.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round except certain holidays. Animals are most active in morning and late afternoon. Some sections may close during extreme weather conditions.",
            "booking_tips": "No advance booking required. Free entry on the first Sunday of each month from October to March. Plan for substantial walking.",
            "ratings": {
                "cost_estimate": 18,
                "suggested_duration_hours": 4,
                "cultural_significance": 3
            },
            "latitude": 43.6394,
            "longitude": 3.8770
        },
        {
            "name": "Château de Flaugergues",
            "type": "Historic Mansion",
            "description": "This elegant 'folly' (country mansion) built in the 18th century represents the height of aristocratic architecture surrounded by French and English gardens. The estate includes meticulously preserved period furnishings, a working vineyard producing award-winning wines, and botanical gardens featuring a bamboo plantation and Mediterranean species.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Gardens are particularly beautiful in spring. The château hosts summer jazz concerts in the gardens. Wine tastings available year-round.",
            "booking_tips": "Tours of the château interior require advance booking. Gardens can be visited independently. Combined tickets available for house, gardens, and wine tasting.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 43.6203,
            "longitude": 3.9140
        },
        {
            "name": "Pic Saint-Loup",
            "type": "Natural Landmark",
            "description": "This distinctive limestone peak rises dramatically to 658 meters from the surrounding vineyards and garrigue landscape 20km north of Montpellier. The mountain offers hiking trails with panoramic views extending from the Mediterranean to the Cévennes mountains. The area is also known for producing exceptional wines under the Pic Saint-Loup appellation.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Spring and fall offer ideal hiking conditions. Summer hiking should be early morning only due to extreme heat. Winter ascents possible on clear days but can be windy at the summit.",
            "booking_tips": "No booking required. Access by car from Montpellier takes approximately 40 minutes. Several marked trails of varying difficulty available.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 5,
                "cultural_significance": 3
            },
            "latitude": 43.7867,
            "longitude": 3.8030
        },
        {
            "name": "Esplanade de l'Europe",
            "type": "Urban Park",
            "description": "This expansive pedestrian promenade connects Place de la Comédie with the Corum concert hall and features tree-lined walkways, fountains, and open spaces for relaxation. The upper level offers views over the city while the lower level includes a popular children's playground and spaces often used for cultural events, exhibitions, and seasonal markets.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "The tree canopy provides welcome shade during summer. Winter features festive decorations and occasional special markets. The area hosts parts of summer festivals and outdoor cinema events.",
            "booking_tips": "No booking required. Adjacent to the tourist office for convenient information access.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 43.6095,
            "longitude": 3.8818
        },
        {
            "name": "Le Corum",
            "type": "Conference & Opera Hall",
            "description": "This striking pink marble building designed by Claude Vasconi houses Montpellier's opera house (Opéra Berlioz), a concert hall (Salle Pasteur), and a major conference center. The rooftop terrace is publicly accessible and offers spectacular panoramic views of the city, the Mediterranean Sea, and the surrounding mountains.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Performance schedule varies throughout the year. The rooftop terrace is particularly pleasant at sunset. The building hosts the international Radio France festival each July.",
            "booking_tips": "Performances require advance tickets. The rooftop terrace can be visited freely during opening hours without booking.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.6130,
            "longitude": 3.8816
        },
        {
            "name": "Halles Castellane",
            "type": "Market Hall",
            "description": "This vibrant covered market in the heart of the historic center offers a authentic taste of local gastronomy with vendors selling fresh produce, meats, cheeses, seafood, and prepared foods. The recently renovated hall preserves its traditional market atmosphere while incorporating modern amenities, and is surrounded by cafés that spill onto the adjacent square.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open Tuesday to Sunday mornings, closing around 2pm. Sunday mornings are particularly lively but crowded. Seasonal local produce changes throughout the year.",
            "booking_tips": "No booking required. Come before noon for the best selection and atmosphere. Several vendors offer lunch options for on-site consumption.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.6080,
            "longitude": 3.8776
        },
        {
            "name": "Antigone District",
            "type": "Architectural Quarter",
            "description": "This distinctive neoclassical neighborhood was designed by Catalan architect Ricardo Bofill in the 1970s and 80s as an extension of Montpellier's historic center. The monumental district features grand boulevards, classical-inspired facades, dramatic colonnades, and geometric public spaces arranged on a symmetrical axis leading to the River Lez.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open for exploration year-round. The light-colored stone is particularly beautiful in afternoon sunlight. The large open plazas can be very hot in summer without much shade.",
            "booking_tips": "No booking required for self-guided walking. The tourist office occasionally offers architectural tours that include this district.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.6083,
            "longitude": 3.8900
        },
        {
            "name": "MO.CO.Panacée",
            "type": "Contemporary Art Center",
            "description": "Housed in a former 16th-century medical college, this cutting-edge contemporary art center features rotating exhibitions of experimental works by emerging international artists. The complex includes multiple exhibition spaces, a café with a pleasant courtyard, and regularly hosts workshops, performances, and public discussions as part of Montpellier's contemporary art ecosystem.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open year-round except Mondays. Exhibitions typically change several times per year. The courtyard café is especially pleasant in warm weather.",
            "booking_tips": "No booking required. Free guided tours available on weekends (check schedule). Student curators often provide additional insights about exhibitions.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.6144,
            "longitude": 3.8767
        },
        {
            "name": "Porte du Peyrou",
            "type": "Historic Monument",
            "description": "This triumphal arch was built between 1691 and 1693 to honor Louis XIV and marks the entrance to the royal square Promenade du Peyrou. Designed to resemble the Porte Saint-Denis in Paris, the monument features military trophies, bas-reliefs depicting the king's victories, and medallions representing the annexed territories of Languedoc to the French kingdom.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round. The golden stone is particularly beautiful in morning light. The arch is illuminated at night creating dramatic photo opportunities.",
            "booking_tips": "No booking required. The interior is not accessible, but visitors can walk through the archway that connects the medieval city to the Peyrou promenade.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 43.6125,
            "longitude": 3.8728
        }
    ]
}