{
  "sites": [
    {
      "name": "Skanderbeg Square",
      "type": "Historic Square",
      "description": "The main square of Tirana, named after Albania's national hero Gjergj Kastrioti Skanderbeg. Features the Skanderbeg Monument, the National Historical Museum, and the Et'hem Bey Mosque. This is the heart of the city and a perfect starting point for exploring Tirana.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, but spring and autumn offer pleasant temperatures for walking. Summer can be hot, winter mild.",
      "booking_tips": "No booking required. Best visited early morning to avoid crowds and enjoy the peaceful atmosphere.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Et'hem Bey Mosque",
      "type": "Mosque",
      "description": "A beautiful 18th-century mosque located in Skanderbeg Square, featuring stunning frescoes and Islamic architecture. It's one of the oldest buildings in Tirana and represents the city's Ottoman heritage.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Respectful dress required. Non-Muslims can visit outside prayer times.",
      "booking_tips": "No booking required. Remove shoes before entering. Women should cover their heads.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "National Historical Museum",
      "type": "Museum",
      "description": "Albania's largest museum showcasing the country's rich history from prehistoric times to the modern era. Features archaeological finds, ethnographic displays, and exhibits on Albania's struggle for independence.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Less crowded on weekday mornings. Air-conditioned for comfortable summer visits.",
      "booking_tips": "Purchase tickets at the entrance. Audio guides available in multiple languages. Allow 2-3 hours for a comprehensive visit.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Bunkart 2",
      "type": "Museum",
      "description": "A unique museum housed in a massive underground bunker built during the communist era. Offers insight into Albania's communist past and the paranoia of the Hoxha regime. Features exhibits on surveillance, propaganda, and daily life under communism.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Perfect for rainy days or hot summer afternoons. The bunker maintains a cool temperature year-round.",
      "booking_tips": "Book online in advance during peak season. Guided tours available. Allow 2-3 hours for the full experience.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Bunkart 1",
      "type": "Museum",
      "description": "The original Bunkart museum located in a massive nuclear bunker on the outskirts of Tirana. Much larger than Bunkart 2, it showcases Albania's communist history through multimedia exhibits and preserved bunker rooms.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Located outside the city center, best visited when you have a full day. Shuttle service available from the city center.",
      "booking_tips": "Book online in advance. Consider combining with a visit to Mount Dajti. Allow 3-4 hours for the complete experience.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 4,
        "cultural_significance": 5
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Mount Dajti",
      "type": "Mountain",
      "description": "A mountain overlooking Tirana offering spectacular views of the city and surrounding countryside. Accessible by cable car (Dajti Express) or hiking trails. Features restaurants, hotels, and outdoor activities.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Best visited in spring and autumn for pleasant weather. Summer offers clear views, winter can be cold but beautiful.",
      "booking_tips": "Cable car tickets available at the base station. Hiking trails require proper footwear. Consider staying for sunset views.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 4,
        "cultural_significance": 4
      },
      "latitude": 41.3667,
      "longitude": 19.9167
    },
    {
      "name": "New Bazaar (Pazari i Ri)",
      "type": "Market",
      "description": "A vibrant traditional market where locals shop for fresh produce, meat, and household items. The surrounding area has been revitalized with trendy cafes, restaurants, and bars, making it a popular spot for both shopping and socializing.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Market is busiest in the morning. Evening is best for dining and nightlife. Year-round activity.",
      "booking_tips": "No booking required. Best explored on foot. Try local specialties at the surrounding restaurants.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Blloku District",
      "type": "District",
      "description": "Formerly a restricted area for communist party officials, now the trendiest neighborhood in Tirana. Features fashionable boutiques, hip cafes, restaurants, and vibrant nightlife. The heart of Tirana's modern social scene.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Most lively in the evening and weekends. Summer offers outdoor dining, winter has cozy indoor venues.",
      "booking_tips": "No booking required for most venues. Popular restaurants may require reservations on weekends.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Castle (Kalaja e Tiranës)",
      "type": "Historic Site",
      "description": "The remains of a small castle that once protected the city. While mostly in ruins, it's an important historical site and offers insight into Tirana's medieval past. The surrounding area has been developed with restaurants and cafes.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer pleasant temperatures for exploring the ruins.",
      "booking_tips": "No booking required. Combine with a meal at one of the nearby restaurants. Limited historical information on site.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Grand Park of Tirana (Parku i Madh)",
      "type": "Park",
      "description": "A large urban park featuring walking trails, artificial lakes, playgrounds, and sports facilities. Popular with locals for recreation and relaxation. Offers a peaceful escape from the city center.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Beautiful in all seasons. Spring brings blooming flowers, summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Popular spot for picnics and outdoor activities.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Clock Tower (Kulla e Sahatit)",
      "type": "Historic Tower",
      "description": "A 19th-century clock tower located near Skanderbeg Square. One of Tirana's oldest landmarks, it was built during the Ottoman period and has become a symbol of the city. The tower offers views over the surrounding area.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Visible year-round. Best photographed in morning light. Located in a busy pedestrian area.",
      "booking_tips": "No booking required. Can be viewed from outside. Combine with a visit to nearby attractions.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Art Gallery",
      "type": "Art Gallery",
      "description": "A modern art gallery showcasing contemporary Albanian and international art. Features rotating exhibitions, permanent collections, and cultural events. The building itself is an architectural landmark.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Air-conditioned for comfortable visits in any weather. Check website for current exhibitions.",
      "booking_tips": "Free entry to permanent collection. Special exhibitions may require tickets. Guided tours available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana International Hotel",
      "type": "Historic Building",
      "description": "A landmark hotel with distinctive architecture, known for its unique design and historical significance. While primarily a hotel, the building is worth seeing for its architectural interest and the surrounding area offers good photo opportunities.",
      "indoor": false,
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "No booking required to view from outside. Consider having a drink at the hotel bar to see the interior.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Zoo",
      "type": "Zoo",
      "description": "A small but charming zoo located in the Grand Park. Features various animals and is popular with families and children. The zoo is part of the larger park complex and offers a nice break from city sightseeing.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Best visited in good weather. Animals are most active in the morning. Summer can be hot for both visitors and animals.",
      "booking_tips": "Purchase tickets at the entrance. Combine with a walk in the Grand Park. Allow 1-2 hours for the visit.",
      "ratings": {
        "cost_estimate": 3,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 2
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Opera and Ballet Theatre",
      "type": "Theatre",
      "description": "A prestigious cultural venue hosting opera, ballet, and classical music performances. The building itself is architecturally significant and represents Albania's commitment to high culture. Check the schedule for performances during your visit.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Performance season runs year-round. Book tickets in advance for popular performances.",
      "booking_tips": "Book tickets online or at the box office. Dress appropriately for performances. Guided tours of the building available.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Pyramid",
      "type": "Historic Building",
      "description": "A controversial communist-era building originally built as a museum for Enver Hoxha. The pyramid-shaped structure has been repurposed multiple times and is currently being transformed into a cultural center. Its future remains uncertain but it's an interesting example of communist architecture.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building is currently under renovation, so access may be limited.",
      "booking_tips": "View from outside as the building is under renovation. Check local news for updates on its future use.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Central Market",
      "type": "Market",
      "description": "A traditional covered market where locals shop for daily necessities. Offers authentic local experience and opportunities to see traditional Albanian products and foods. The market is less touristy than the New Bazaar and provides insight into local life.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest in the morning. Year-round activity. Covered market provides shelter from weather.",
      "booking_tips": "No booking required. Respectful photography. Try local foods and interact with vendors.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana City Hall",
      "type": "Government Building",
      "description": "A modern government building with distinctive architecture located in the city center. While not open to the public, the building is worth seeing for its contemporary design and the surrounding plaza is a popular gathering spot.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The plaza is popular year-round for events and gatherings.",
      "booking_tips": "View from outside only. The surrounding area is good for people-watching and photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana University",
      "type": "Educational Institution",
      "description": "Albania's largest and most prestigious university, founded in 1957. The campus features interesting architecture and is a center of student life. The surrounding area has many student-friendly cafes and bookstores.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Campus is most lively during the academic year. Summer is quieter but still worth visiting.",
      "booking_tips": "No booking required. Respect that this is an active educational institution. Campus tours may be available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana National Library",
      "type": "Library",
      "description": "The national library of Albania, housed in a modern building with interesting architecture. While primarily a research facility, the building is worth seeing and the surrounding area is pleasant for walking.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "View from outside unless you have research needs. The surrounding area is good for photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    },
    {
      "name": "Tirana Botanical Garden",
      "type": "Botanical Garden",
      "description": "A peaceful botanical garden featuring native Albanian plants and trees. Offers walking paths, benches for relaxation, and educational displays about local flora. A perfect escape from the city's hustle and bustle.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful in spring when flowers are blooming. Summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 41.3275,
      "longitude": 19.8187
    }
  ]
}