{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Spring Awakening & Outdoor Cafes",
                "details": "Experience Gothenburg coming alive after winter. Daylight increases, and outdoor cafes ('uteserveringar') start opening, especially along Avenyn and in Haga."
            },
            {
                "reason": "Botanical Garden Blooms",
                "details": "Visit the Gothenburg Botanical Garden (Botaniska Trädgården) as spring flowers begin to emerge. The Rock Garden and Rhododendron Valley are early highlights."
            },
            {
                "reason": "Liseberg Amusement Park Opens (Late April)",
                "details": "Catch the season opening of Scandinavia's largest amusement park, Liseberg. Enjoy rides and the park's spring atmosphere, usually starting towards the end of the month."
            },
            {
                "reason": "Shoulder Season Benefits",
                "details": "Explore major attractions like the Universeum science center, Gothenburg Museum of Art, or the charming Haga district with potentially fewer crowds than summer. Accommodation might offer better value (outside Easter)." 
            },
            {
                "reason": "Archipelago Trips Begin",
                "details": "Early season boat trips to the southern archipelago islands (Styrsö, Vrångö) start, offering scenic coastal views as nature awakens. Services might be limited initially."
            },
            {
                "reason": "Walpurgis Night Celebrations (April 30th)",
                "details": "Join the traditional Valborg celebrations welcoming spring with bonfires, singing, and festivities, often held in parks like Slottsskogen or Trädgårdsföreningen."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Highly Variable Coastal Weather",
                "details": "April weather is notoriously unpredictable. Expect a mix of sunny, mild days (up to 10-12°C), but also cold winds, rain, and even sleet, especially being on the coast. Layering is crucial."
            },
            {
                "reason": "Cool & Breezy Temperatures",
                "details": "Average temperatures range from lows around 3°C to highs around 10°C. Coastal winds often make it feel colder. Not yet warm spring weather."
            },
            {
                "reason": "Easter Holiday Impact (if applicable)",
                "details": "If Easter falls in April, expect potential reduced hours or closures for some shops (especially Systembolaget) and services on public holidays (Good Friday, Easter Sunday/Monday)." 
            },
            {
                "reason": "Pollen Season Kicks Off",
                "details": "Spring blooms, particularly birch trees, mean the start of pollen season, potentially affecting allergy sufferers."
            },
            {
                "reason": "Sea Still Very Cold",
                "details": "While archipelago boat trips are scenic, the North Sea is far too cold for swimming."
            },
            {
                "reason": "Some Outdoor Attractions Limited",
                "details": "While many attractions are open, some seasonal tours or fully outdoor activities might have limited schedules or only open later in the month."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "10°C",
                    "low": "3°C"
                },
                "precipitation": "Variable, frequent chance of rain or sleet mixed with clearer spells. Often breezy due to coastal location.",
                "general_tips": "Pack layers: base layers, fleece/sweater, windproof/waterproof jacket, scarf, hat, gloves. Waterproof footwear is essential. Sunglasses useful for sunny spells."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. Generally quiet, increasing slightly if Easter falls during this period.",
                "pricing": "Mid-range, generally lower than peak summer, potential increases around Easter.",
                "overall_atmosphere": "City awakening, quieter streets. Good time for museums and indoor attractions. Outdoor cafes begin appearing but blankets often needed." 
            },
            "events_holidays": [
                {
                    "name": "Easter Weekend (Påsk)",
                    "date": "Varies (can fall in early/mid-April)",
                    "description": "Includes Good Friday (Långfredagen), Easter Eve (Påskafton), Easter Sunday (Påskdagen), and Easter Monday (Annandag Påsk). Primarily a family holiday.",
                    "notes": "Good Friday, Easter Sunday, and Easter Monday are public holidays. Expect closures/reduced hours for many shops, Systembolaget. Check attraction opening times. Public transport runs, possibly on a Sunday schedule."
                },
                {
                    "name": "Outdoor Dining Season Opens",
                    "date": "From April 1st (weather permitting)",
                    "description": "Restaurants and cafes officially allowed to open their outdoor seating areas ('uteserveringar'). Popular along Avenyn, Linnégatan, and in Haga.",
                    "notes": "Whether you can comfortably sit outside depends heavily on the day's weather!"
                },
                {
                    "name": "Yoga Games Göteborg",
                    "date": "Usually early April (check specific dates)",
                    "description": "A large yoga event with classes, workshops, and lectures for enthusiasts.",
                    "notes": "Check event website for details and booking."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the Haga District",
                    "where": "Haga",
                    "description": "Wander the charming cobblestone streets lined with wooden houses, independent shops, and cozy cafes famous for giant cinnamon buns ('Hagabullen').",
                    "practical_tips": "Wear comfortable shoes. Allow time for 'fika'. Less crowded than summer.",
                    "best_time": "Daytime, especially late morning/afternoon.",
                    "estimated_cost": "Low (free to wander, costs for fika/shopping)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Universeum Science Center",
                    "where": "Near Korsvägen/Liseberg",
                    "description": "Explore science and nature through interactive exhibits, including a rainforest, aquarium, and technology zones. Great indoor activity.",
                    "practical_tips": "Book tickets online. Allow several hours. Popular with families.",
                    "best_time": "Anytime during opening hours.",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Discover Gothenburg Museum of Art (Konstmuseet)",
                    "where": "Götaplatsen",
                    "description": "View extensive collections of Nordic art from the 15th century onwards, alongside international works. Located at the top of Avenyn.",
                    "practical_tips": "Check current exhibitions. Combine with a walk up Avenyn.",
                    "best_time": "Anytime during opening hours.",
                    "estimated_cost": "Moderate (entry fee, sometimes free for students/under 25)",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll through Slottsskogen Park",
                    "where": "Linné/Majorna area",
                    "description": "Gothenburg's largest park, offering walking paths, green spaces, playgrounds, and free animal enclosures featuring Nordic wildlife (seals, moose, penguins).",
                    "practical_tips": "Free entry. Wear comfortable shoes. Natural History Museum located within the park.",
                    "best_time": "Daytime, better on dry days.",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "12°C",
                    "low": "4°C"
                },
                "precipitation": "Still variable, perhaps slightly higher chance of milder days, but rain showers and wind remain common.",
                "general_tips": "Continue layering. Waterproofs still recommended. Sunglasses and perhaps sunscreen needed for sunny days."
            },
            "tourism_level": {
                "crowds": "Moderate, slowly increasing. Busier around Walpurgis Night and Liseberg opening.",
                "pricing": "Mid-range, relatively stable.",
                "overall_atmosphere": "More distinct signs of spring. Trees start budding, early flowers in parks. City feels more active, especially if weather is pleasant." 
            },
            "events_holidays": [
                {
                    "name": "Liseberg Amusement Park Opening",
                    "date": "Usually late April (check specific date)",
                    "description": "Scandinavia's largest amusement park opens for the summer season.",
                    "notes": "Check website for exact date, opening hours, and ticket prices. Expect crowds."
                },
                {
                    "name": "Hanami at Botanical Garden",
                    "date": "Typically late April (check specific date)",
                    "description": "Celebration of cherry blossoms (if blooming) at the Gothenburg Botanical Garden, inspired by Japanese tradition, often with picnics and related activities.",
                    "notes": "Bloom timing is weather-dependent. Check Botaniska's website." 
                },
                 {
                    "name": "En Öl & Whiskymässa (Beer & Whisky Fair)",
                    "date": "Usually late April (check specific dates)",
                    "description": "Large fair dedicated to beer and whisky tasting at the Swedish Exhibition & Congress Centre (Svenska Mässan).",
                    "notes": "Requires tickets, popular event."
                },
                {
                    "name": "Walpurgis Night (Valborgsmässoafton / Valborg)",
                    "date": "April 30th (evening)",
                    "description": "Traditional celebration welcoming spring with bonfires, choir singing, and speeches. Major gatherings often in Slottsskogen or Trädgårdsföreningen.",
                    "notes": "Festive public event, dress warmly for the evening outdoors. Student celebrations ('Cortègen' parade) often part of the day."
                },
                {
                    "name": "The Cortège Parade",
                    "date": "April 30th (afternoon/evening)",
                    "description": "Annual satirical parade organized by Chalmers University students, featuring elaborate, often humorous, floats travelling through central Gothenburg.",
                    "notes": "Very popular public spectacle, find a spot along the route early."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the Gothenburg Botanical Garden (Botaniska)",
                    "where": "Änggården",
                    "description": "Wander through one of Europe's top botanical gardens. Explore the Rock Garden, Rhododendron Valley, Japanese Glade, and greenhouses (check if open/accessible due to renovations).",
                    "practical_tips": "Allow several hours. Wear good walking shoes, some paths are hilly. Voluntary entrance fee.",
                    "best_time": "Daytime, especially on a dry day to enjoy the outdoor areas.",
                    "estimated_cost": "Low (voluntary entry fee)",
                    "weather_dependent": true
                },
                {
                    "activity": "Take an Archipelago Boat Trip",
                    "where": "Departs from Saltholmen (take tram 11)",
                    "description": "Take a ferry to the car-free southern archipelago islands like Styrsö, Donsö, or Vrångö. Enjoy coastal scenery, walks, and island life.",
                    "practical_tips": "Use Västtrafik public transport ticket. Check ferry timetables (Styrsöbolaget). Dress very warmly for the boat. Fewer cafes/services open than in summer.",
                    "best_time": "Daytime, preferably on a clearer, less windy day.",
                    "estimated_cost": "Low (public transport cost)",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk along Kungsportsavenyn ('Avenyn')",
                    "where": "Central Gothenburg",
                    "description": "Stroll Gothenburg's main boulevard from Kungsportsplatsen up to Götaplatsen (with the Poseidon statue and Art Museum). Lined with shops, restaurants, and theaters.",
                    "practical_tips": "Can be busy. Good for people-watching from an outdoor cafe if weather permits.",
                    "best_time": "Daytime or early evening.",
                    "estimated_cost": "Free (walking), cost varies for shopping/dining.",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Feskekörka ('Fish Church')",
                    "where": "Near Rosenlund",
                    "description": "Iconic indoor fish and seafood market hall shaped like a church. Browse fresh catches and potentially enjoy lunch at one of the eateries (check if open after renovation).",
                    "practical_tips": "Check current opening status and hours post-renovation. Great place to see local seafood.",
                    "best_time": "Late morning/lunchtime.",
                    "estimated_cost": "Free (to browse), Moderate (for food)",
                    "weather_dependent": false
                }
            ]
        }
    }
}