{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Pre-Peak Summer Weather",
                "details": "June offers lovely weather, generally warm and sunny (avg highs 19-21°C/66-70°F), ideal for exploring before the peak heat and crowds of July/August."
            },
            {
                "reason": "Longest Daylight Hours",
                "details": "Experience the magic of near-endless daylight around the summer solstice (June 21st), maximizing time for sightseeing, archipelago trips, and enjoying evenings outdoors."
            },
            {
                "reason": "Midsummer Celebrations",
                "details": "Witness or participate in Sweden's most iconic holiday, Midsummer (late June). Experience traditional celebrations with maypoles, dancing, singing, and special food, particularly in the archipelago or at Slottsskogen park."
            },
            {
                "reason": "National Day of Sweden",
                "details": "Experience Swedish national pride on June 6th, with celebrations in central Gothenburg, events at Liseberg, and festivities at Slottsskogen park, creating a patriotic atmosphere throughout the city."
            },
            {
                "reason": "Archipelago Season Begins",
                "details": "Ferry services to Gothenburg's southern archipelago ramp up, making it a great time to start exploring the beautiful car-free islands like Brännö, Styrsö, and Vrångö as they become more accessible and lively."
            },
            {
                "reason": "Vibrant Parks & Outdoor Life",
                "details": "Parks like Slottsskogen and Trädgårdsföreningen are lush and green. Enjoy picnics, walks, cycling, and the proliferation of outdoor cafes ('uteserveringar') along Avenyn and Linnégatan."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Midsummer Closures & Impact",
                "details": "Midsummer Eve (Friday) is a major de facto holiday with widespread closures (shops, museums, restaurants, systembolaget). Midsummer Day (Saturday) is also a public holiday. This significantly impacts plans and requires advance preparation."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "June marks the start of high season. Expect growing crowds, especially later in the month and around Midsummer/National Day. Accommodation/flight prices rise significantly."
            },
            {
                "reason": "Booking Ahead Crucial (Especially Midsummer)",
                "details": "Accommodation, popular tours (especially archipelago), ferry tickets, and Liseberg amusement park need to be booked well in advance during peak times."
            },
            {
                "reason": "Variable Weather Still Possible",
                "details": "While often lovely, June can still have cooler days or rain showers. Gothenburg's west coast location means it can be slightly wetter than other parts of Sweden. Pack layers and waterproof gear."
            },
            {
                "reason": "National Day Closures (June 6th)",
                "details": "As a public holiday, expect some closures (banks, offices, some shops), though major tourist sites usually remain open. Public transport may run on a Sunday schedule."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "10°C (50°F)"
                },
                "precipitation": "Moderate chance of rain showers, but increasingly sunny and pleasant. Long daylight hours noticeable. West coast location means slightly more rainfall than eastern Sweden.",
                "general_tips": "Pack layers: t-shirts, long sleeves, sweater/fleece, light/medium jacket (waterproof recommended), comfortable walking shoes. Sunglasses essential."
            },
            "tourism_level": {
                "crowds": "High season starts. Busy, especially around National Day (June 6th), but generally less intense than late June/July.",
                "pricing": "High season prices take effect. Book flights/accommodation early.",
                "overall_atmosphere": "Vibrant early summer feel. City is green and lively. Focus on outdoor activities and National Day celebrations."
            },
            "events_holidays": [
                {
                    "name": "National Day of Sweden (Sveriges nationaldag)",
                    "date": "June 6",
                    "description": "Public holiday celebrating Sweden. Flag raising ceremonies throughout the city, especially at Götaplatsen. Processions, folk music/dance, and family activities often held at Slottsskogen park.",
                    "notes": "Expect crowds at celebration spots. Some closures (banks, offices, some shops). Check transport schedules."
                },
                {
                    "name": "Göteborg Green World (Potential Overlap)",
                    "date": "Summer season",
                    "description": "If running this year, this garden and urban greening initiative creates beautiful displays throughout the city, particularly in Trädgårdsföreningen (The Garden Society).",
                    "notes": "Check for current year's programs and special exhibitions."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Celebrate National Day at Slottsskogen",
                    "where": "Slottsskogen Park, central Gothenburg",
                    "description": "Experience traditional Swedish National Day celebrations with flag ceremonies, folk music, dancing, and family activities in Gothenburg's large central park.",
                    "practical_tips": "Check the official program online. June 6th is a public holiday. The park is free to enter.",
                    "best_time": "June 6th (Daytime)",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Early Season Archipelago Trip",
                    "where": "Departing from Saltholmen terminal",
                    "description": "Take advantage of increasing ferry services. Visit car-free islands like Brännö for traditional dancing, Styrsö for scenic hiking, or Vrångö for nature reserves as the islands awaken for summer.",
                    "practical_tips": "Use regular Västtrafik public transport tickets. Check ferry schedules carefully. Bring layers as it can be windy on the water. Fewer services/amenities open than in July/August.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (public transport fare + expenses)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Stroll through Haga District",
                    "where": "Haga neighborhood",
                    "description": "Wander the historic streets with their wooden houses and charming cafes as summer arrives. Enjoy the atmosphere before peak crowds hit later in the season.",
                    "practical_tips": "Don't miss trying a giant cinnamon bun at Café Husaren or another local bakery. Explore side streets and nearby Linnégatan area.",
                    "best_time": "Late Morning / Afternoon / Evening",
                    "estimated_cost": "Free (shopping/food extra)",
                    "weather_dependent": false
                 },
                {
                    "activity": "Visit the Maritime Museum & Aquarium",
                    "where": "Packhusplatsen, near the harbor",
                    "description": "Explore Gothenburg's maritime history and visit the Nordic aquarium. A good option for any weather as the summer season begins.",
                    "practical_tips": "Located near other waterfront attractions. Affordable entry fee.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Low-Moderate (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "21°C (70°F)",
                    "low": "12°C (54°F)"
                },
                "precipitation": "Generally warm and sunny, perfect summer weather. Longest daylight hours around the solstice (June 21st). Showers still possible due to Gothenburg's west coast climate.",
                "general_tips": "Summer clothes needed, but keep layers (sweater/light jacket) for evenings or cooler days. Rain gear still useful."
            },
            "tourism_level": {
                "crowds": "High season intensifies, especially around Midsummer weekend. Many Swedes leave the city for coastal celebrations.",
                "pricing": "Peak season prices firmly in place. Book everything far in advance, especially for Midsummer weekend.",
                "overall_atmosphere": "Peak summer feeling, long bright evenings, culminating in the major Midsummer celebrations. Very lively, but requires planning around the holiday."
            },
            "events_holidays": [
                {
                    "name": "Midsummer Eve (Midsommarafton)",
                    "date": "Friday between June 19-25",
                    "description": "The main celebration day. De facto public holiday. Many Gothenburgers leave the city for countryside/archipelago parties. Those remaining often celebrate at Slottsskogen park or head to the archipelago islands for traditional maypole raising, folk dancing, singing games, herring, potatoes, and strawberries.",
                    "notes": "MAJOR CLOSURES: Most shops, Systembolaget (liquor stores), many museums/restaurants close early or entirely. Plan food/drink purchases ahead. Public transport on limited schedule. Check specific event schedules."
                },
                {
                    "name": "Midsummer Day (Midsommardagen)",
                    "date": "Saturday between June 20-26",
                    "description": "Official public holiday. Much quieter day after the main celebrations. Some festivities might continue in parks or the archipelago.",
                    "notes": "Many places remain closed, similar to a Sunday. Check specific opening hours."
                },
                {
                    "name": "Summer Solstice",
                    "date": "Around June 21st",
                    "description": "The longest day of the year. Celebrated implicitly through Midsummer, enjoy the incredibly long daylight hours by the harbor or canals.",
                    "notes": "Not a public holiday itself."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Midsummer in the Southern Archipelago",
                    "where": "Islands like Brännö, Styrsö, or Vrångö",
                    "description": "Join the traditional Midsummer celebrations on one of the archipelago islands. Brännö is particularly famous for its dancing at Brännö Brygga, immortalized in a classic Swedish song.",
                    "practical_tips": "Check ferry schedules carefully as they operate on holiday timetables. Bring food and drinks as island services may be limited. Arrive early to avoid ferry queues.",
                    "best_time": "Midsummer Eve (daytime)",
                    "estimated_cost": "Low-Moderate (transport costs + food)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Picnic during the Long Evenings",
                    "where": "Parks like Slottsskogen, Trädgårdsföreningen, or by the canals",
                    "description": "Take advantage of the extended daylight. Pack a picnic and enjoy the late evening sun in a beautiful setting.",
                    "practical_tips": "Supermarkets close early on Midsummer Eve. Buy supplies beforehand. Respect park rules.",
                    "best_time": "Evening (light until very late)",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Boat Trip in the Archipelago",
                    "where": "Gothenburg's Southern Archipelago",
                    "description": "Escape the city bustle. Enjoy the scenery and island life as summer hits its peak.",
                    "practical_tips": "Check Midsummer weekend ferry schedules carefully - may be reduced or altered. Some island restaurants may close for Midsummer.",
                    "best_time": "Daytime (avoiding Midsummer Eve closures)",
                    "estimated_cost": "Low-Moderate (public transport fare)",
                    "weather_dependent": true
                 },
                { 
                    "activity": "Enjoy Liseberg Amusement Park",
                    "where": "Central Gothenburg",
                    "description": "Visit Scandinavia's largest amusement park for rides, gardens, and entertainment in full summer mode.",
                    "practical_tips": "Check opening hours, especially around Midsummer. Buy tickets online to avoid queues. Can be busy with tourists and locals.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "High (entry + rides)",
                    "weather_dependent": true
                }
            ]
        }
    }
}