{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May offers arguably Gothenburg's most pleasant weather: increasingly sunny, mild temperatures (average highs ~15°C/59°F), perfect for exploring outdoors as the city bursts into green."
            },
            {
                "reason": "City in Bloom",
                "details": "Experience Gothenburg adorned with spring flowers. See tulips and blossoms in Trädgårdsföreningen (The Garden Society), one of Europe's best-preserved 19th-century parks with its beautiful Palm House and rose garden preparing for summer."
            },
            {
                "reason": "Outdoor Cafes & Lively Atmosphere",
                "details": "Outdoor seating ('uteserveringar') becomes widespread. Enjoy coffee, drinks, or meals outdoors along Avenyn, Linnégatan, or by the canals, soaking up the returning warmth and vibrant city life."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "While tourism picks up significantly, May generally sees fewer crowds and potentially better prices than the peak months of June, July, and August."
            },
            {
                "reason": "Archipelago Awakens",
                "details": "Ferry services to Gothenburg's southern archipelago increase, making it easier and more pleasant to take day trips to car-free islands like Brännö, Styrsö, and Vrångö as services and amenities reopen."
            },
            {
                "reason": "Liseberg Amusement Park Opens",
                "details": "Gothenburg's beloved Liseberg, Scandinavia's largest amusement park, typically opens for the spring/summer season in late April/early May, offering rides, gardens, and entertainment."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "While often pleasant, May can still bring cooler days, wind, and rain showers. Gothenburg's west coast location can make it particularly susceptible to Atlantic weather systems. Packing layers is essential."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks a definite shift towards high season. Expect more noticeable crowds and rising prices for flights and accommodation compared to early spring."
            },
            {
                "reason": "May Day Holiday (May 1st)",
                "details": "May 1st is a major public holiday. Expect widespread closures (shops, Systembolaget, banks) and potentially large demonstrations/marches affecting city center access and transport."
            },
            {
                "reason": "Ascension Day Holiday (Potential)",
                "details": "Ascension Day (Kristi Himmelsfärdsdag), a public holiday, often falls in May (date varies). This creates a long weekend, increasing domestic travel and potentially impacting availability/prices."
            },
            {
                "reason": "Pollen Season",
                "details": "Spring blooms, especially birch trees, mean high pollen counts, significantly affecting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C (59°F)",
                    "low": "7°C (45°F)"
                },
                "precipitation": "Moderate chance of rain showers due to west coast location, but significantly more sunshine and longer days than April. Can still be cool, especially evenings.",
                "general_tips": "Pack layers: t-shirts, sweaters, a medium-weight jacket (waterproof useful), comfortable walking shoes. Sunglasses and potentially allergy medication."
            },
            "tourism_level": {
                "crowds": "Moderate, noticeably busier than April. Very busy around May 1st and potentially Walpurgis Night hangover (April 30th).",
                "pricing": "Shoulder/High season prices emerging. Book ahead, especially around May 1st.",
                "overall_atmosphere": "Vibrant spring awakening. City is greening up. Lively feel, especially when sunny. Potential disruption/closures on May 1st."
            },
            "events_holidays": [
                {
                    "name": "Walpurgis Night (Valborgsmässoafton) - Evening Before",
                    "date": "April 30 (Evening)",
                    "description": "Eve of May 1st. Celebrated with bonfires, singing, and student festivities. Celebrations often take place in Slottsskogen park with choirs performing.",
                    "notes": "Popular event, especially in parks. May impact city atmosphere leading into May 1st."
                },
                {
                    "name": "May Day / Labor Day (Första maj)",
                    "date": "May 1",
                    "description": "Public holiday. Characterized by political demonstrations and marches by labor unions, primarily in the city center.",
                    "notes": "Widespread closures (shops, Systembolaget, banks). Expect traffic/transport disruptions in central areas due to marches. Check opening status for museums/sites."
                },
                {
                    "name": "Gothenburg Green World (Potential)",
                    "date": "May-September (check current year's program)",
                    "description": "If running this year, this garden and urban greening initiative creates beautiful displays throughout the city, particularly in Trädgårdsföreningen (The Garden Society).",
                    "notes": "Check for current year's programs and special exhibitions."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Trädgårdsföreningen (Garden Society)",
                    "where": "Central Gothenburg, near the canal",
                    "description": "Explore this beautifully preserved 19th-century park with its Palm House, rose gardens, and seasonal flower displays in full spring bloom.",
                    "practical_tips": "The Palm House is free to enter. The park hosts a rose garden with 4,000 roses (early blooms may start in late May).",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Slottsskogen Park",
                    "where": "Central Gothenburg",
                    "description": "Explore this large urban park with its small zoo featuring Nordic animals like moose and seals, beautiful walking paths, and spring atmosphere.",
                    "practical_tips": "Free entry. Good activity for May 1st if looking to avoid downtown crowds. Great for picnics on sunny days.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Fika at an Outdoor Café ('Uteservering')",
                    "where": "Various locations (Haga district, Avenyn, Linnégatan)",
                    "description": "Enjoy the Swedish coffee and cake tradition at one of the many outdoor seating areas opening up.",
                    "practical_tips": "Haga district is famous for its giant cinnamon buns and charming atmosphere. Avenyn is more upscale and bustling.",
                    "best_time": "Mid-morning or Afternoon",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": true
                 },
                {
                    "activity": "Explore the Canals by Boat or Foot",
                    "where": "Central Gothenburg",
                    "description": "Take a Paddan boat tour along Gothenburg's 17th-century canals, or walk along their banks as cafes and outdoor life returns with spring.",
                    "practical_tips": "Paddan boat tours typically start their season in April/May. Walking along Stora Hamnkanalen offers nice views of historic buildings.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking) / Moderate (boat tour)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C (63°F)",
                    "low": "9°C (48°F)"
                },
                "precipitation": "Generally pleasant, sunny, and warmer spring weather. Some rain is still possible due to coastal location. Long daylight hours.",
                "general_tips": "Focus on lighter layers, but keep a jacket/sweater for evenings. Sun protection increasingly important."
            },
            "tourism_level": {
                "crowds": "High season approaching. Busy, especially on weekends and if Ascension Day falls here.",
                "pricing": "High season prices likely in effect for most accommodations/flights.",
                "overall_atmosphere": "Beautiful late spring / early summer feel. Ideal for outdoor activities and exploring the city before peak summer heat/crowds."
            },
            "events_holidays": [
                 {
                    "name": "Ascension Day (Kristi Himmelsfärdsdag)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday. Creates a long weekend ('klämdag' - bridge day on Friday is common).",
                    "notes": "Check date for the year. Expect closures (shops, banks). Increased domestic travel; book accommodation/transport ahead if traveling this weekend."
                 },
                 {
                    "name": "Liseberg Amusement Park Open",
                    "date": "Usually daily by late May",
                    "description": "Enjoy rides, gardens, and entertainment at Scandinavia's largest amusement park in the heart of Gothenburg.",
                    "notes": "Check official website for opening hours and special events. Can be busy on weekends and holidays."
                 },
                 {
                    "name": "Gothenburg Half Marathon (Check Dates)",
                    "date": "Sometimes in mid/late May",
                    "description": "Major running event through central Gothenburg streets.",
                    "notes": "Road closures and crowds along the route if occurring. Check date for the current year."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Southern Archipelago Day Trip",
                    "where": "Islands like Brännö, Styrsö, or Vrångö",
                    "description": "Take a ferry from Saltholmen terminal to explore Gothenburg's car-free southern archipelago islands as they prepare for the summer season.",
                    "practical_tips": "Use regular public transport (Västtrafik) tickets. Check ferry timetables carefully. Ferry trips are relatively short (20-30 minutes to most islands).",
                    "best_time": "Full Day",
                    "estimated_cost": "Low (public transport fare + expenses)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Botanical Garden",
                    "where": "Eastern Gothenburg",
                    "description": "Explore one of Europe's largest botanical gardens (Botaniska Trädgården) with its 16,000 plant species, beautiful spring blooms, and woodland valley.",
                    "practical_tips": "Free entry to the main gardens (small fee for greenhouses). Located a bit outside the center but accessible by public transport.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (garden) / Low (greenhouses)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Cycle Around the City",
                    "where": "Various routes (Canalside paths, Slottsskogen, riverfront)",
                    "description": "Rent a bike or use the city's bike share program to explore Gothenburg's relatively flat and bike-friendly paths in pleasant spring weather.",
                    "practical_tips": "Styr & Ställ is the city bike system if operational during your visit. Numerous rental options available. Be mindful of tram tracks when cycling.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (bike rental)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Enjoy Evening at Riverside Restaurants",
                    "where": "Waterfront spots along Göta älv river (e.g., Lilla Bommen, Lindholmen)",
                    "description": "Take advantage of the long, mild evenings to have drinks or dinner with views over the river and harbor.",
                    "practical_tips": "Consider restaurants at Lindholmen (accessible via ferry shuttle from city center) or near the Opera House for sunset views.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                 }
            ]
        }
    }
}