{
    "city_name": "Le Havre",
    "country": "France",
    "brief_description": "The historic port city of Normandy, Le Havre is a UNESCO World Heritage site where innovative post-war architecture meets maritime heritage. With its magnificent City Hall designed by Auguste Perret, the iconic Église Saint-Joseph, and its role as France's largest port, Le Havre offers visitors a unique blend of French elegance and maritime innovation.",
    "nickname": "The Port of Normandy",
    "region": "Normandy",
    "population": {
      "city": 0.17,
      "metro": 0.3,
      "unit": "million"
    },
    "sections": [
      {
        "title": "Maritime Heritage",
        "content": "Le Havre's unique character is defined by its maritime origins, with the city serving as the historic gateway to the English Channel. The magnificent port facilities and surrounding maritime architecture create a striking urban identity that showcases the city's importance as a center of trade and culture during the Age of Sail and modern era.",
        "icon": "anchor"
      },
      {
        "title": "Post-War Reconstruction",
        "content": "The city's innovative post-war history is preserved in landmarks like the UNESCO World Heritage City Hall and the modernist Église Saint-Joseph. These structures tell the story of Le Havre's rebirth after World War II, with architecture that reflects the city's resilience and Auguste Perret's vision of urban renewal.",
        "icon": "building"
      },
      {
        "title": "Port Innovation",
        "content": "Le Havre is globally recognized as France's largest and most important port, which has shaped the city's modern identity. The city's maritime heritage continues to drive innovation, while Le Havre has evolved into a center for contemporary culture and university life, balancing traditional heritage with modern excellence.",
        "icon": "ship"
      },
      {
        "title": "Norman Culture",
        "content": "Le Havre embodies the warm hospitality and rich traditions of the Norman region. Visitors experience this through traditional Norman cuisine featuring local specialties like seafood and Norman cider, the lively atmosphere of local markets, and the genuine friendliness of residents who are proud to share their city's unique story.",
        "icon": "heart"
      }
    ],
    "why_visit": {
      "intro": "Le Havre offers visitors a unique opportunity to experience a French city that combines maritime charm with innovative post-war architecture and Norman culture, featuring authentic local culture, fascinating history, and a distinctive architectural character that's unlike anywhere else in France.",
      "highlights": [
        {
          "title": "UNESCO World Heritage Architecture",
          "content": "Le Havre's distinctive post-war and modernist architecture creates a unique urban landscape that's become the city's signature feature. The historic buildings, harbor views, and elegant structures transform ordinary streets into striking architectural statements, making every street corner a potential photo opportunity and creating a magical atmosphere throughout the city.",
          "image": "/images/le-havre/modernist-buildings.jpg"
        },
        {
          "title": "Place de l'Hôtel de Ville",
          "content": "The heart of Le Havre, this magnificent square is surrounded by important landmarks including the UNESCO World Heritage City Hall, the modernist Église Saint-Joseph, and beautiful post-war architecture. It's the perfect starting point for exploring the city and experiencing the daily life of Le Havre's residents.",
          "image": "/images/le-havre/place-hotel-ville.jpg"
        },
        {
          "title": "Port de Le Havre",
          "content": "This magnificent port, stretching along the English Channel, now offers spectacular panoramic views and insights into the city's maritime heritage with its stunning industrial architecture and cultural significance. The port's design represents the pinnacle of modern maritime infrastructure.",
          "image": "/images/le-havre/port-le-havre.jpg"
        },
        {
          "title": "Historic Center",
          "content": "Le Havre's historic center offers authentic local experiences where visitors can explore surviving pre-war buildings, discover hidden courtyards, and admire the distinctive Norman architecture. The area is particularly atmospheric in the evening when the historic buildings take on a magical quality against the harbor backdrop.",
          "image": "/images/le-havre/historic-center.jpg"
        },
        {
          "title": "Église Saint-Joseph",
          "content": "In the heart of the city, the iconic modernist church offers spectacular views of Le Havre and the surrounding harbor landscape. Designed by Auguste Perret, it provides a unique perspective on the city's post-war renewal and opportunities for photography in a historic maritime setting.",
          "image": "/images/le-havre/eglise-saint-joseph.jpg"
        },
        {
          "title": "Maritime Heritage",
          "content": "The city's cultural heritage is celebrated through its museums, markets, and traditional crafts, with the MuMa offering insights into the region's Impressionist art history and the famous Norman cider adding a unique dimension to the city's cultural landscape.",
          "image": "/images/le-havre/maritime-heritage.jpg"
        }
      ]
    },
    "practical_info": {
      "language": "French",
      "currency": "Euro (EUR)",
      "timezone": "Central European Time (CET/CEST)",
      "emergency_number": "112",
      "useful_phrases": [
        {"phrase": "Bonjour", "pronunciation": "bon-ZHOOR", "meaning": "Hello"},
        {"phrase": "Merci", "pronunciation": "mer-SEE", "meaning": "Thank you"},
        {"phrase": "S'il vous plaît", "pronunciation": "seel voo PLEH", "meaning": "Please"},
        {"phrase": "Au revoir", "pronunciation": "oh reh-VWAR", "meaning": "Goodbye"}
      ],
      "transport": {
        "airport_options": [
          {"name": "Le Havre-Octeville Airport (LEH)", "distance_to_center": "8 km", "transfer_options": ["Bus", "Taxi", "Private transfer"]}
        ],
        "public_transport": "Le Havre has an efficient tram and bus system that serves the city and surrounding areas. Taxis are readily available and the city center is compact and walkable, making it easy to explore on foot.",
        "passes": "Single tickets and day passes are available for public transport. The city center is easily navigable on foot, with most major attractions within walking distance."
      }
    },
    "seasonal_notes": {
      "spring": {
        "months": "March-May",
        "description": "Spring brings pleasant temperatures and blooming flowers to Le Havre, making it an ideal time to explore the city on foot. The weather is comfortable for outdoor activities, and the surrounding Norman landscape comes to life with seasonal colors.",
        "highlights": ["Comfortable walking weather", "Spring blooms", "Fewer tourists", "Outdoor café culture"],
        "considerations": ["Occasional rain showers", "Variable temperatures"],
        "recommended": true
      },
      "summer": {
        "months": "June-August",
        "description": "Summer in Le Havre is pleasant, with the city's many parks and the nearby Norman countryside providing cool retreats. Evening temperatures are comfortable, making it perfect for enjoying the city's vibrant café culture and outdoor dining scene.",
        "highlights": ["Long daylight hours", "Outdoor dining", "Beach escapes", "Cultural festivals"],
        "considerations": ["Peak tourist season", "Higher prices", "Some attractions busy"],
        "recommended": true
      },
      "autumn": {
        "months": "September-November",
        "description": "Autumn offers mild temperatures and beautiful fall colors, particularly in the surrounding Norman landscape. The weather is ideal for exploring the city and nearby natural attractions, with fewer crowds than the summer months.",
        "highlights": ["Pleasant weather", "Autumn colors", "Fewer tourists", "Cultural events"],
        "considerations": ["Increasing rainfall", "Shorter days"],
        "recommended": true
      },
      "winter": {
        "months": "December-February",
        "description": "Winter in Le Havre can be cold and occasionally rainy. The city takes on a cozy atmosphere, with indoor attractions like museums and the historic center providing warm refuge. The nearby Norman countryside offers winter landscape beauty.",
        "highlights": ["Indoor cultural sites", "Cozy atmosphere", "Lower prices", "Winter landscape beauty"],
        "considerations": ["Cold weather", "Shorter daylight hours", "Some outdoor activities limited"],
        "recommended": false
      }
    },
    "monthly_activities": {
      "january": {
        "title": "Visit the MuMa",
        "description": "Explore Impressionist art in the magnificent museum building",
        "price": "€7",
        "type": "Cultural Heritage"
      },
      "february": {
        "title": "Warm up with Norman Cuisine",
        "description": "Experience local specialties in historic restaurants",
        "price": "€15-€30",
        "type": "Cultural Experience"
      },
      "march": {
        "title": "Walk in the Historic Center",
        "description": "Spring blooms and peaceful historic streets",
        "price": "Free",
        "type": "Outdoor Activity"
      },
      "april": {
        "title": "Explore Place de l'Hôtel de Ville",
        "description": "Central square with UNESCO World Heritage architecture",
        "price": "Free",
        "type": "City Center"
      },
      "may": {
        "title": "Visit Fort de Sainte-Adresse",
        "description": "Historic fort with panoramic city and harbor views",
        "price": "Free",
        "type": "Outdoor Activity"
      },
      "june": {
        "title": "Visit Cathédrale Notre-Dame",
        "description": "Gothic cathedral with distinctive architecture",
        "price": "Free",
        "type": "Religious Site"
      },
      "july": {
        "title": "Evening Stroll in Historic Center",
        "description": "Cool evening temperatures and atmospheric lighting",
        "price": "Free",
        "type": "Walking Tour"
      },
      "august": {
        "title": "Shop at Les Halles Centrales",
        "description": "Traditional market with local foods and crafts",
        "price": "Free",
        "type": "Market"
      },
      "september": {
        "title": "Visit Église Saint-Joseph",
        "description": "Modernist church with beautiful architecture",
        "price": "Free",
        "type": "Religious Site"
      },
      "october": {
        "title": "Explore the Norman Landscape",
        "description": "Walking trails in the surrounding countryside",
        "price": "Free",
        "type": "Outdoor Activity"
      },
      "november": {
        "title": "Museum Hopping",
        "description": "Visit art museums and cultural centers",
        "price": "€7-€15",
        "type": "Cultural Experience"
      },
      "december": {
        "title": "Holiday Market Shopping",
        "description": "Seasonal markets and festive atmosphere",
        "price": "Free",
        "type": "Seasonal"
      }
    },
    "meta": {
      "last_updated": "2025-03-24",
      "version": 1.0
    }
  }