{
  "sites": [
    {
      "name": "Place de l'Hôtel de Ville",
      "type": "Historic Square",
      "description": "The main square of Le Havre, surrounded by the impressive City Hall and modern architecture. This central plaza is the heart of the city and showcases the post-war reconstruction that earned Le Havre UNESCO World Heritage status.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, but spring and autumn offer pleasant temperatures. Summer can be breezy due to coastal location, winter can be cold with occasional rain.",
      "booking_tips": "No booking required. Best visited early morning to avoid crowds and enjoy the peaceful atmosphere.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Hôtel de Ville",
      "type": "Historic Building",
      "description": "The magnificent City Hall of Le Havre, designed by Auguste Perret as part of the post-war reconstruction. This stunning building represents the city's rebirth and showcases innovative concrete architecture that defines modern Le Havre.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The building is perfect for rainy days. The architecture is spectacular in any weather.",
      "booking_tips": "Free entry to the building grounds. Guided tours may be available. Respect that this is an active government building.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Église Saint-Joseph",
      "type": "Church",
      "description": "A stunning modernist church designed by Auguste Perret, featuring a distinctive concrete tower that serves as a lighthouse for ships. The church's innovative architecture and beautiful stained glass windows make it one of Le Havre's most iconic landmarks.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The stained glass creates beautiful light effects. Respectful dress required.",
      "booking_tips": "No booking required. Guided tours available. Don't miss the beautiful interior and the view from the tower.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Musée d'Art Moderne André Malraux (MuMa)",
      "type": "Art Museum",
      "description": "One of France's most important art museums, featuring an exceptional collection of Impressionist paintings and modern art. The museum's highlight is its impressive collection of works by Monet, Sisley, and other artists who painted in Normandy.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "€7",
      "seasonal_notes": "Perfect for rainy days or any weather. Air-conditioned and comfortable year-round.",
      "booking_tips": "Entry fee required. Book online in advance during peak season. Guided tours available. Allow 2-3 hours for the full experience.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Port de Le Havre",
      "type": "Port",
      "description": "One of France's largest and busiest ports, offering fascinating views of massive cargo ships, container terminals, and maritime activity. The port area showcases Le Havre's economic importance and maritime heritage.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer pleasant temperatures. Summer can be breezy, winter can be cold and windy.",
      "booking_tips": "No booking required. Respect port security zones. Best viewed from designated observation points.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Plage du Havre",
      "type": "Beach",
      "description": "A beautiful pebble beach stretching along the English Channel coastline. The beach offers stunning views of the sea, perfect for walking, photography, and enjoying the maritime atmosphere that defines Le Havre.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best in spring and summer. Autumn offers dramatic coastal views. Winter can be cold and windy but beautiful for storm watching.",
      "booking_tips": "No booking required. Wear appropriate footwear for pebble beach. Perfect for coastal photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Les Halles Centrales",
      "type": "Market",
      "description": "A vibrant covered market where locals shop for fresh produce, seafood, cheese, and regional Norman specialties. The market offers authentic local experience with traditional French products and foods from the Normandy region.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest in the morning. Year-round activity. Covered market provides shelter from weather.",
      "booking_tips": "No booking required. Respectful photography. Try local Norman foods and interact with vendors.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Avenue Foch",
      "type": "Historic Street",
      "description": "One of Le Havre's most elegant streets, lined with beautiful buildings from the post-war reconstruction period. The street showcases the innovative architecture of Auguste Perret and is perfect for admiring the city's unique architectural heritage.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful in good weather. Spring and autumn offer pleasant walking conditions. Summer evenings are pleasant.",
      "booking_tips": "No booking required. Wear comfortable walking shoes. Perfect for architectural photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Volcan - Scène Nationale",
      "type": "Cultural Center",
      "description": "A striking cultural center designed by Oscar Niemeyer, featuring two volcano-shaped buildings that host theatre, dance, and contemporary performances. The building itself is architecturally significant and represents Le Havre's commitment to contemporary culture.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Performance season runs year-round. Book tickets in advance for popular performances.",
      "booking_tips": "Book tickets online or at the box office. Dress appropriately for performances. Guided tours of the building available.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Jardin Suspendu",
      "type": "Botanical Garden",
      "description": "A beautiful botanical garden located in the former fortifications of Le Havre, offering stunning views of the city and port. Features walking trails, flower gardens, and a peaceful atmosphere perfect for relaxation and nature appreciation.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Beautiful in all seasons. Spring brings blooming flowers, summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for photography and relaxation.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Fort de Sainte-Adresse",
      "type": "Historic Fort",
      "description": "A historic fortification offering panoramic views of Le Havre, the port, and the English Channel. The fort played an important role in the city's defense and now serves as a peaceful viewpoint and historical site.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer pleasant temperatures and clear views. Summer can be breezy.",
      "booking_tips": "No booking required. Wear comfortable walking shoes. Perfect for panoramic photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Musée de l'Armateur",
      "type": "Museum",
      "description": "A fascinating museum housed in a beautiful 18th-century merchant's house, showcasing Le Havre's maritime history and the life of wealthy shipowners. Features exhibits on maritime trade, shipbuilding, and the city's economic development.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "€5",
      "seasonal_notes": "Open year-round. Air-conditioned for comfortable visits in any weather. Perfect for understanding local maritime culture.",
      "booking_tips": "Entry fee required. Guided tours available. Allow 1.5-2 hours for the full experience.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Cathédrale Notre-Dame",
      "type": "Cathedral",
      "description": "The historic cathedral of Le Havre, one of the few buildings to survive the World War II bombings. This beautiful Gothic cathedral features impressive architecture and serves as a reminder of the city's pre-war heritage.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The stained glass creates beautiful light effects. Respectful dress required.",
      "booking_tips": "No booking required. Guided tours available. Don't miss the beautiful interior and stained glass.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Parc de Rouelles",
      "type": "Park",
      "description": "A scenic park located in the heart of Le Havre offering beautiful gardens, walking trails, and peaceful atmosphere. Features walking trails, viewpoints, and is popular with families and nature lovers. Perfect for photography and relaxation.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer the most pleasant conditions. Summer can be breezy.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Maison de l'Armateur",
      "type": "Historic Building",
      "description": "A beautiful 18th-century merchant's house that showcases the wealth and lifestyle of Le Havre's shipowners during the city's golden age of maritime trade. The building's architecture and interior decoration reflect the prosperity of the era.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "€5",
      "seasonal_notes": "Open year-round. Perfect for rainy days. The building is beautiful in any weather.",
      "booking_tips": "Entry fee required. Guided tours available. Allow 1-1.5 hours for the visit.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Marché aux Poissons",
      "type": "Market",
      "description": "A traditional fish market where locals and visitors can purchase fresh seafood caught in the English Channel. Offers authentic local experience and opportunities to learn about Normandy's maritime culture and cuisine.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest in the morning. Year-round activity. Covered market provides shelter from weather.",
      "booking_tips": "No booking required. Respectful photography. Try local seafood and interact with vendors.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Université Le Havre Normandie",
      "type": "Educational Institution",
      "description": "A modern university campus featuring interesting contemporary architecture and green spaces. The campus is a center of student life and the surrounding area has many student-friendly cafes and cultural venues.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Campus is most lively during the academic year. Summer is quieter but still worth visiting.",
      "booking_tips": "No booking required. Respect that this is an active educational institution. Campus tours may be available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Bibliothèque Oscar Niemeyer",
      "type": "Library",
      "description": "A modern library housed in a beautiful contemporary building designed by Oscar Niemeyer. While primarily a research facility, the building is worth seeing for its innovative architecture and the surrounding area is pleasant for walking.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "View from outside unless you have research needs. The surrounding area is good for photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    },
    {
      "name": "Jardin des Plantes",
      "type": "Botanical Garden",
      "description": "A peaceful botanical garden featuring native Norman plants and trees. Offers walking paths, benches for relaxation, and educational displays about local flora. A perfect escape from the city's hustle and bustle.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful in spring when flowers are blooming. Summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 49.4944,
      "longitude": 0.1079
    }
  ]
}