{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Protochronia)",
          "notes": "New Year's Day is a public holiday. Santorini is very quiet, with most tourist facilities closed. Some local tavernas in villages like Fira or Pyrgos might be open, serving traditional Vasilopita. Expect minimal activity."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 1,
          "event": "Epiphany (Theophania - Jan 6th)",
          "notes": "Winter conditions prevail with average highs around 14°C (57°F) and potential for rain and strong winds. Very few tourists. Epiphany (Jan 6th) involves the Blessing of the Waters ceremony at ports like Fira's Old Port (Gialos) or Ammoudi, weather permitting. This is the off-season; enjoy the dramatic, quiet caldera views."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
          "score": 1,
          "notes": "Mid-January is deep winter. Expect cool temperatures, wind, and rain possibilities. Very few tourist services operate. Ideal for solitude seekers wanting raw, dramatic landscapes. Focus on exploring Fira or Pyrgos, visiting the few open cafes/tavernas, and enjoying the quiet."
        },
        {
          "days": [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 1,
          "notes": "Late January remains quiet and cool. Some sunny days are possible but weather can be unpredictable. Limited flights and ferry schedules. A time for peaceful walks (weather permitting), visiting the Prehistoric Thera Museum (check winter hours), and experiencing local life in villages away from the caldera edge."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 9,
      "tourismLevel": 1
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 2,
          "event": "Apokries (Carnival - if applicable)",
          "notes": "February continues with cool, often windy weather, similar to January. Tourism remains very low. If Apokries (Greek Carnival) falls in February, you might find small local celebrations or parties, especially in Fira or traditional villages, but it's not a major tourist event here. Almond trees may start to blossom late in the month, hinting at spring. Still primarily a time for quiet contemplation and enjoying the stark beauty of the caldera."
        }
      ],
      "weatherHighC": 14,
      "weatherLowC": 9,
      "tourismLevel": 1
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 2,
          "notes": "March sees a slow transition towards spring. Weather remains variable with sunny spells, rain, and wind. Temperatures average 16°C (61°F). More businesses start preparing to open for the season, but tourism is still low. Good time for hiking (Fira-Oia path) on clear days without the heat. Wildflowers begin appearing."
        },
        {
          "days": [25],
          "score": 2,
          "special": true,
          "event": "Greek Independence Day",
          "notes": "March 25th is a national holiday. Expect small local parades, likely in Fira. Some shops and sites may have reduced hours, but it's generally low-key compared to mainland Greece. Weather improving but still unpredictable."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 2,
          "event": "Easter Preparations (if applicable)",
          "notes": "Late March sees slightly warmer weather. If Orthodox Easter is early, preparations begin, especially noticeable in villages like Pyrgos. More hotels and restaurants start opening towards the end of the month, anticipating the start of the tourist season in April."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 10,
      "tourismLevel": 2
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21],
          "score": 4,
          "special": true,
          "event": "Holy Week & Easter (Megali Evdomada & Pascha)",
          "notes": "April marks the start of the tourist season. Weather becomes reliably pleasant, averaging 19°C (66°F). If Orthodox Easter falls in April, Santorini offers unique celebrations, especially the atmospheric Good Friday procession in Pyrgos lit by thousands of lamps. Expect increased prices and visitor numbers around Easter. Wineries, restaurants, and shops are generally open. Ideal for hiking and sightseeing before summer heat."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "notes": "Late April offers beautiful spring weather, perfect for exploring Akrotiri and Ancient Thera. Wildflowers are abundant. The caldera path hike is stunning. Sea temperatures are still cool for swimming (around 16°C/61°F). Tourism picks up steadily, but it's still less crowded than summer."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 3
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day (Ergatiki Protomagia)",
          "notes": "May 1st is a public holiday. Locals often celebrate with picnics or outings; some transport disruption possible but tourist services generally operate. Weather is typically excellent, warm and sunny."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "May is arguably one of the best months to visit Santorini. Weather is consistently warm and sunny (avg high 23°C/73°F) but not yet intensely hot. Perfect for hiking, sightseeing (Akrotiri, Ancient Thera, villages), and boat trips. Sea temperature warms up (around 19°C/66°F), becoming suitable for swimming for many. Tourism is busy but hasn't reached peak summer levels. Everything is open."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 15,
      "tourismLevel": 4
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "notes": "June marks the start of true summer weather. Hot, sunny days (avg high 27°C/81°F) with minimal rain. Ideal for beach activities (Kamari, Perissa/Perivolos) and swimming as the sea warms further (around 22°C/72°F). Caldera boat tours (daytime and sunset) are very popular. Tourism increases significantly; book accommodation and popular tours/restaurants in advance."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Ifestia Festival Preparations (Variable Date)",
          "notes": "Late June continues with hot, sunny weather. All tourist services are in full swing. While the main Ifestia (Volcano) Festival is usually later, preparations or related smaller events might occur. It's peak time for enjoying the beaches, caldera views, sunset cocktails, and outdoor dining. Book everything well in advance."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 19,
      "tourismLevel": 5
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "July is peak summer season. Expect hot, dry weather (avg high 29°C/84°F) and strong Meltemi winds, especially in the afternoons. The island is very crowded, particularly Oia for sunset, Fira, and popular beaches. Sea temperature is ideal for swimming (around 24°C/75°F). Essential to book accommodation, ferries, flights, popular restaurants, and tours far in advance. Prioritize early morning or late evening activities to avoid peak heat and crowds."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 22,
      "tourismLevel": 5
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 5,
          "notes": "August continues peak season conditions: very hot (avg high 29°C/84°F, heatwaves possible), dry, often windy (Meltemi), and extremely crowded. Accommodation prices are at their highest. Sea is warmest (around 25°C/77°F). Focus on beaches, boat trips, and evening activities. Sightseeing best done very early morning."
        },
        {
          "days": [15],
          "score": 5,
          "special": true,
          "event": "Dormition of the Virgin Mary",
          "notes": "August 15th is a major national holiday. While many Greeks travel, Santorini remains packed with international tourists. Some smaller local shops might close, but tourist services operate fully. Expect peak crowds everywhere."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Ifestia Festival (Volcano Festival - Variable Date)",
          "notes": "Late August remains hot, windy, and crowded. The Ifestia Festival, re-enacting the volcanic eruption with fireworks over the caldera, often happens around this time (check specific date annually). This spectacular event draws huge crowds; book viewing spots (restaurants, bars, boats) extremely far in advance. Otherwise, conditions are similar to early August."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 22,
      "tourismLevel": 5
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Grape Harvest / International Music Festival (Variable Dates)",
          "notes": "Early September is often considered ideal. Weather remains hot and sunny (avg high 27°C/81°F) but slightly less intense than August. Crowds begin to thin slightly, though still busy. Sea remains very warm (around 24°C/75°F). Grape harvest is underway at wineries. The International Music Festival sometimes takes place in Fira. Excellent time for all activities."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late September sees pleasant warm weather continuing, though evenings might cool slightly. Crowds noticeably decrease compared to peak summer, making sightseeing more enjoyable. Sea is still warm for swimming. A great time for hiking, wine tasting, and exploring villages. Some chance of occasional rain showers towards the end of the month."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 19,
      "tourismLevel": 4
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Early October offers pleasant autumn weather (avg high 22°C/72°F) with good sunshine hours. Sea remains swimmable for many (around 22°C/72°F). Tourism levels drop significantly, offering a much quieter experience. Ideal for hiking, exploring archaeological sites (Akrotiri, Ancient Thera) comfortably, and wine tasting. Some seasonal businesses might start closing."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27],
          "score": 3,
          "notes": "Mid-October continues with mild weather, though chances of rain and wind increase. Still excellent for sightseeing without crowds. Many restaurants and hotels remain open, especially in Fira and Oia, but some beach resorts become very quiet."
        },
        {
          "days": [28],
          "score": 3,
          "special": true,
          "event": "Oxi Day",
          "notes": "October 28th is a national holiday. Expect small local parades/school celebrations, likely in Fira. Most tourist sites remain open but check hours. Ferry schedules might be slightly reduced."
        },
        {
          "days": [29, 30, 31],
          "score": 3,
          "notes": "Late October marks the end of the main tourist season. Weather becomes more variable. Many seasonal businesses close down. Flights and ferry services are reduced. Enjoy the quiet atmosphere and lower prices, but be prepared for potential closures and less predictable weather."
        }
      ],
      "weatherHighC": 22,
      "weatherLowC": 16,
      "tourismLevel": 3
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 2,
          "notes": "November is firmly in the off-season. Expect cooler temperatures (avg high 18°C/64°F), increased rain, and wind. Most tourist-oriented businesses are closed, especially outside Fira. Very few tourists. Ideal for those seeking solitude and experiencing local life. Focus on Fira, Pyrgos, visiting the Prehistoric Thera Museum (check hours), and enjoying cozy local tavernas that remain open. Flights and ferries are significantly reduced."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 13,
      "tourismLevel": 2
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 2,
          "notes": "December brings winter weather (avg high 15°C/59°F) with higher chances of rain and strong winds. The island is very quiet. Some festive decorations may appear in Fira, but celebrations are low-key compared to mainland cities. Very limited tourist services available."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day",
          "notes": "Christmas is primarily a quiet, family-oriented holiday in Santorini. Most places are closed. A few restaurants in Fira might offer festive meals, but options are very limited. Don't expect major public celebrations or markets."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 1,
          "notes": "The period between Christmas and New Year remains very quiet. Weather can be cold and wet. Very few facilities open. For visitors seeking extreme tranquility and dramatic winter landscapes."
        },
        {
          "days": [31],
          "score": 2,
          "special": true,
          "event": "New Year's Eve",
          "notes": "New Year's Eve is low-key. A few restaurants or bars in Fira might host small events or offer special menus (book ahead if available), but large-scale public celebrations are unlikely. Primarily a time for locals."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 10,
      "tourismLevel": 1
    }
  },
  "activityTypes": {
    "spring": [
      "Hiking the Fira-Oia caldera path with pleasant weather and wildflowers",
      "Exploring villages (Oia, Pyrgos, Megalochori) before peak crowds",
      "Visiting Akrotiri and Ancient Thera archaeological sites comfortably",
      "Wine tasting at Santorini's unique wineries",
      "Photography focusing on landscapes and architecture",
      "Experiencing the unique Orthodox Easter celebrations (esp. Pyrgos)",
      "Enjoying caldera views from cafes and restaurants without the summer rush"
    ],
    "summer": [
      "Caldera catamaran cruises (daytime swimming or sunset views)",
      "Swimming and sunbathing at black/red beaches (Kamari, Perissa, Red Beach)",
      "Watching the sunset from Oia, Fira, Imerovigli or Akrotiri Lighthouse",
      "Dining at waterfront tavernas in Ammoudi Bay",
      "Enjoying the nightlife in Fira",
      "Watersports at Perivolos/Perissa beaches",
      "Visiting the Open Air Cinema in Kamari",
      "Exploring Akrotiri or museums during the hottest part of the day"
    ],
    "autumn": [
      "Wine tasting during/after the harvest, enjoying Assyrtiko and Vinsanto",
      "Hiking the caldera path or other trails in comfortable temperatures",
      "Swimming in the still-warm sea with fewer crowds",
      "Exploring archaeological sites and villages more peacefully",
      "Enjoying potentially clearer and vibrant sunset views",
      "Photography capturing the golden light and calmer atmosphere",
      "Relaxing at cafes and tavernas as the season winds down"
    ],
    "winter": [
      "Exploring Fira and Oia without crowds, enjoying the quiet atmosphere",
      "Visiting the Museum of Prehistoric Thera (check winter hours)",
      "Experiencing local life in traditional villages like Pyrgos or Emporio",
      "Enjoying the dramatic winter caldera views and landscapes",
      "Finding lower accommodation prices (limited availability)",
      "Cozying up in local cafes or tavernas that remain open",
      "Hiking on clear, crisp days (weather permitting)"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, though potentially crowded in peak season",
    "4": "Very Good: Favorable conditions, pleasant weather, good balance of services and manageable crowds",
    "3": "Average: Standard conditions, typical weather for the season, moderate tourism level",
    "2": "Below Average: Limited services available, weather can be unpredictable, very few visitors",
    "1": "Poor: Minimal tourism infrastructure operating, winter conditions, best for solitude seekers only"
  }
}