{
    "sites": [
        {
            "name": "Oia Village Sunset Viewing",
            "type": "District",
            "description": "World-famous village known for its stunning sunsets over the caldera, whitewashed houses, blue-domed churches, and narrow winding paths. Offers breathtaking panoramic views.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Extremely crowded during sunset, especially in peak season (July/August). Best photo spots are claimed early.",
            "booking_tips": "Explore the village on foot. Arrive at least 1-2 hours before sunset to find a good viewing spot (e.g., near the Byzantine Castle ruins). Alternatively, book a restaurant with a view.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3.0,
                "cultural_significance": 5
            },
            "latitude": 36.4620,
            "longitude": 25.3756
        },
        {
            "name": "Fira (Thira) Town Exploration",
            "type": "District",
            "description": "The vibrant capital of Santorini, perched on the caldera edge. Offers stunning views, museums (Museum of Prehistoric Thera, Archaeological Museum), shops, restaurants, and nightlife. Access to the old port via cable car or steps.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free (town), Fees for museums/cable car",
            "seasonal_notes": "Main transportation hub. Can be very busy, especially when cruise ships are in port.",
            "booking_tips": "Allow ample time to wander the alleys. Visit museums early. Consider the Fira to Oia hike for incredible views.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 3.0,
                "cultural_significance": 4
            },
            "latitude": 36.4170,
            "longitude": 25.4314
        },
        {
            "name": "Akrotiri Archaeological Site",
            "type": "Historical Site",
            "description": "A remarkably well-preserved Minoan Bronze Age settlement buried by the Theran volcanic eruption (~1627 BC). Often called the 'Minoan Pompeii,' it features multi-story buildings, frescoes, pottery, and advanced drainage systems under a protective bioclimatic roof.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Covered site provides shade. Open year-round, check seasonal hours.",
            "booking_tips": "Purchase tickets online or at the entrance. Consider hiring a guide for deeper insights. Allow 1.5-2 hours. Combine with Red Beach nearby.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 36.3517,
            "longitude": 25.4040
        },
        {
            "name": "Red Beach (Kokkini Paralia)",
            "type": "Park",
            "description": "A unique and dramatic beach characterized by its towering red volcanic cliffs and reddish-black sand. Popular for its striking scenery and snorkeling.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free (beach), Sunbed rental typical",
            "seasonal_notes": "Access path can be prone to rockfalls (heed warning signs). Can get very crowded. Water is clear.",
            "booking_tips": "Accessible via a short, sometimes rough, path from the parking area or by boat from Akrotiri/Perissa. Limited facilities. Combine with Akrotiri visit.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 36.3477,
            "longitude": 25.3946
        },
        {
            "name": "Kamari Beach",
            "type": "Park",
            "description": "A long stretch of black volcanic sand and pebbles, backed by a lively promenade filled with restaurants, bars, and shops. Offers organized facilities, sunbeds, umbrellas, and watersports.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free (beach), Sunbed/watersport rentals",
            "seasonal_notes": "Family-friendly. Can get busy in summer. Water clarity is good.",
            "booking_tips": "Easily accessible. Plenty of amenities available. Located below Ancient Thera.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 2
            },
            "latitude": 36.3750,
            "longitude": 25.4840
        },
        {
            "name": "Perissa & Perivolos Beaches",
            "type": "Park",
            "description": "A very long black sand beach that merges into Perivolos further south. Perissa is similar to Kamari, while Perivolos often has a more relaxed, loungey beach bar vibe. Known for its deep blue waters.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free (beach), Sunbed/watersport rentals",
            "seasonal_notes": "Popular alternative to Kamari. Watersports and diving centers available.",
            "booking_tips": "Easily accessible by bus or car. Wide range of accommodation and dining options.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 2
            },
            "latitude": 36.3566,
            "longitude": 25.4760
        },
        {
            "name": "Ancient Thera",
            "type": "Historical Site",
            "description": "The ruins of an ancient city located atop the Mesa Vouno mountain ridge, separating Kamari and Perissa. Features remnants from Hellenistic, Roman, and Byzantine periods, including temples, a theatre, agora, and gymnasium. Offers spectacular panoramic views.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Exposed site, very hot and windy in summer. Check opening hours as they can be limited.",
            "booking_tips": "Access via a winding road from Kamari (car/ATV/taxi) or a hiking trail from Perissa. Wear sturdy shoes and bring water. Allow 1.5-2 hours.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 36.3638,
            "longitude": 25.4780
        },
        {
            "name": "Skaros Rock Hike (Imerovigli)",
            "type": "Monument",
            "description": "A prominent headland near Imerovigli village, once the site of Santorini's most important medieval fortress. Offers a scenic hike down from Imerovigli with stunning caldera views and a small chapel (Theoskepasti) on the far side.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Trail involves steps and can be exposed to sun/wind. Best avoided during midday heat.",
            "booking_tips": "Start the hike from the chapel Agios Georgios in Imerovigli. Wear good walking shoes. Allow 1-1.5 hours for the round trip.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 36.4318,
            "longitude": 25.4206
        },
        {
            "name": "Santo Wines Winery",
            "type": "Cultural Complex",
            "description": "One of Santorini's largest and most popular wineries, perched on the caldera cliffs near Pyrgos village. Offers wine tasting flights (especially Assyrtiko), guided tours, a deli shop, and spectacular sunset views.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate (Tasting fees)",
            "seasonal_notes": "Can get very crowded, especially around sunset. Offers indoor and outdoor seating.",
            "booking_tips": "Booking wine tasting slots online is highly recommended, particularly for sunset times. Allow 1.5-2 hours.",
            "ratings": {
                "cost_estimate": 20,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 2
            },
            "latitude": 36.3868,
            "longitude": 25.4283
        },
        {
            "name": "Ammoudi Bay",
            "type": "District",
            "description": "A charming small port nestled below Oia, famous for its traditional seafood tavernas right on the water's edge. Also a spot for swimming off the rocks (past the restaurants) and boat tour departures.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Moderate-Expensive (Restaurants)",
            "seasonal_notes": "Very popular dining spot. Can be reached by ~300 steps down from Oia or by road.",
            "booking_tips": "Reservations recommended for waterfront tables, especially for dinner/sunset. Consider a taxi back up to Oia unless you enjoy climbing steps after dinner.",
            "ratings": {
                "cost_estimate": 40,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 3
            },
            "latitude": 36.4595,
            "longitude": 25.3718
        },
        {
            "name": "Pyrgos Village Exploration",
            "type": "District",
            "description": "One of the best-preserved medieval villages on Santorini, located inland on a hilltop. Features traditional Cycladic architecture, narrow winding alleys, churches, and the ruins of a Venetian castle (Kasteli) at its summit, offering panoramic views of the island.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Less crowded than Oia or Fira. Offers a more authentic village experience.",
            "booking_tips": "Explore on foot. Wear comfortable shoes for the uphill climb to the castle. Several cafes and tavernas offer spots to relax.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 36.3835,
            "longitude": 25.4495
        },
        {
            "name": "Museum of Prehistoric Thera (Fira)",
            "type": "Museum",
            "description": "Located in Fira, this museum houses significant finds from the Akrotiri archaeological site, including stunning frescoes (like the 'Fishermen,' 'Boxing Boys,' and 'Blue Monkeys'), pottery, tools, and the famous golden ibex figurine.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Budget",
            "seasonal_notes": "Air-conditioned. Essential context before or after visiting Akrotiri.",
            "booking_tips": "Allow 1-1.5 hours. Tickets can sometimes be combined with Akrotiri or Ancient Thera.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 4
            },
            "latitude": 36.4150,
            "longitude": 25.4315
        }
    ]
}