{
  "neighborhoods": [
    {
      "name": "Fira (Thira)",
      "alternate_names": [
        "Thira Town",
        "Hora (Chora)",
        "Santorini Capital"
      ],
      "character": "The vibrant capital and main hub of Santorini, perched dramatically on the edge of the caldera cliff (approx. 260m high). A bustling maze of narrow pathways, whitewashed cubic houses, blue-domed churches, shops, restaurants, bars, and hotels offering stunning caldera views. It's the island's commercial, cultural, and transportation center.",
      "location": {
        "central": true,
        "description": "Located on the central-west side of the island, overlooking the caldera.",
        "borders": [
          "Firostefani (north)",
          "Caldera cliff (west)",
          "Road towards airport/Kamari (east)",
          "Road towards Athinios Port/Pyrgos (south)"
        ],
        "landmarks": [
          "Caldera Viewpoints",
          "Orthodox Metropolitan Cathedral (Ypapanti)",
          "Catholic Cathedral (St. John the Baptist)",
          "Museum of Prehistoric Thera",
          "Archaeological Museum of Thera",
          "Megaro Gyzi Museum",
          "Cable Car Terminus (upper)",
          "Donkey Path start/end",
          "Main Bus Station",
          "Main Square (Plateia Theotokopoulou)"
        ]
      },
      "history": {
        "overview": "Became the island's capital in the 19th century, replacing Pyrgos. Developed significantly with trade and later tourism. Suffered major damage in the 1956 earthquake but was rebuilt, retaining much of its character while adapting to modern tourism.",
        "significance": "The administrative, commercial, and social heart of Santorini, offering the most comprehensive range of services and amenities.",
        "notable_events": [
          "Established as capital (19th C)",
          "1956 Amorgos Earthquake (major damage & rebuilding)",
          "Development as a major tourist hub (late 20th C - present)"
        ]
      },
      "practical_info": {
        "transit": [
          "Main bus hub connecting all parts of the island",
          "Main taxi station",
          "Cable car connection to Old Port (Gialos Skala Firon)",
          "Steep path (Donkey Path) connection to Old Port",
          "Limited vehicle access in central caldera-edge paths, main roads accessible",
          "Highly walkable core, but involves many steps"
        ],
        "safety": "Generally very safe. Watch out for uneven steps and crowds. Standard precautions against pickpocketing in busy areas.",
        "best_time_to_visit": "Anytime. Busiest during peak summer (July/Aug) and when cruise ships are in. Spring/Autumn offer pleasant weather and fewer crowds. Evenings are lively.",
        "walkability": "Core area is highly walkable but steep with many stairs. Can be challenging for those with mobility issues."
      },
      "appeal": {
        "known_for": [
          "Stunning caldera views",
          "Bustling atmosphere",
          "Shopping (jewelry, fashion, souvenirs)",
          "Nightlife and bars",
          "Museums",
          "Easy access to transport"
        ],
        "atmosphere": [
          "Vibrant",
          "Busy",
          "Cosmopolitan",
          "Touristy",
          "Dramatic (views)",
          "Commercial"
        ],
        "best_for": [
          "First-time visitors wanting a central base",
          "Shoppers",
          "Nightlife seekers",
          "Cruise ship passengers",
          "Those relying on public transport"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 2,
        "green_spaces": 1,
        "shopping": 5,
        "dining": 5,
        "nightlife": 5,
        "cultural": 4,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Museum of Prehistoric Thera",
            "type": "Museum",
            "description": "Houses important finds from the Akrotiri excavation, including frescoes and pottery.",
            "appeal": "Understand the island's ancient history before or after visiting Akrotiri."
          },
          {
            "name": "Caldera Walk",
            "type": "Sightseeing/Walk",
            "description": "Strolling along the main cliffside path offering continuous, breathtaking views.",
            "appeal": "Experience the iconic Santorini caldera views."
          },
          {
            "name": "Cable Car / Donkey Path to Old Port",
            "type": "Transport/Activity",
            "description": "Descend to the Old Port (where tender boats arrive) via cable car or the traditional donkey path.",
            "appeal": "Unique transport methods with dramatic views (Cable Car recommended over donkeys for welfare reasons)."
          }
        ],
        "dining": [
          {
            "name": "Fira Restaurants",
            "cuisine": "Greek, International, Cafes, Fast Food",
            "price_range": "€-€€€€€",
            "known_for": "Huge variety from budget gyros to luxury caldera-view dining. Many options along the cliff edge.",
            "atmosphere": "Ranges from casual takeaways to highly sophisticated restaurants."
          }
        ],
        "activities": [
          {
            "name": "Sunset Viewing (from bars/restaurants)",
            "type": "Social/Sightseeing",
            "description": "Enjoying drinks or dinner while watching the sunset over the caldera (Note: Sun sets behind Thirassia/Oia from Fira).",
            "suitable_for": [
              "Everyone"
            ]
          },
          {
            "name": "Shopping",
            "type": "Shopping",
            "description": "Browsing the numerous shops along the main paths, especially for jewelry, clothing, and art.",
            "suitable_for": [
              "Shoppers"
            ]
          },
          {
            "name": "Bar Hopping",
            "type": "Nightlife",
            "description": "Exploring the many bars and clubs, from relaxed cocktail spots to lively dance clubs.",
            "suitable_for": [
              "Nightlife enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be in the center of the action and nightlife",
        "Easy access to buses and taxis is important",
        "You want the widest range of shops and restaurants",
        "You enjoy a bustling, energetic atmosphere"
      ],
      "avoid_if": [
        "You seek peace and quiet",
        "You dislike crowds and tourist bustle",
        "You prefer easy driving and parking (very difficult in core Fira)",
        "You want a traditional village feel (better options exist)"
      ],
      "insider_tips": [
        "The main square (Plateia Theotokopoulou) is where locals gather and prices are generally lower than on the caldera edge.",
        "Explore the alleys away from the main caldera path for slightly quieter areas and potentially better value.",
        "For a less obstructed sunset view (compared to Oia), consider bars facing south-west."
      ]
    },
    {
      "name": "Oia",
      "alternate_names": [
        "Ia",
        "Pano Meria"
      ],
      "character": "World-renowned village at the northern tip of Santorini, famous for its breathtaking sunsets over the caldera, iconic blue-domed churches, whitewashed cave houses (yposkafa) tumbling down the cliff, upscale hotels, art galleries, and sophisticated atmosphere. Largely pedestrianized core.",
      "location": {
        "central": false,
        "description": "Located on the northwestern tip of the island, approx. 12km from Fira.",
        "borders": [
          "Aegean Sea (north & west)",
          "Caldera (south)",
          "Road towards Fira (east)"
        ],
        "landmarks": [
          "Byzantine Castle Ruins (Sunset Point)",
          "Iconic Blue Domed Churches (Agios Spyridonas & Anastaseos)",
          "Windmills of Oia",
          "Naval Maritime Museum",
          "Ammoudi Bay (port below)",
          "Armeni Bay (port below)",
          "Main Marble Pedestrian Street"
        ]
      },
      "history": {
        "overview": "A significant maritime trading center in the 19th and early 20th centuries, reflected in its neoclassical 'Captains' Houses'. Severely damaged by the 1956 earthquake, it was rebuilt and gradually transformed into a premier, upscale tourist destination.",
        "significance": "Globally recognized symbol of Greek island beauty, famed for its sunsets and architecture.",
        "notable_events": [
          "Maritime prosperity (19th C)",
          "1956 Amorgos Earthquake (major damage)",
          "Reconstruction and rise as luxury destination (late 20th C - present)"
        ]
      },
      "practical_info": {
        "transit": [
          "Largely pedestrianized center",
          "Bus connection to Fira (terminus near village entrance)",
          "Taxi access mainly at village entrance/bus square",
          "Parking is extremely limited and challenging near the village",
          "Steep steps down to Ammoudi Bay (road access also possible)"
        ],
        "safety": "Very safe. Main concern is navigating dense crowds, especially around sunset. Steep drops from paths require caution.",
        "best_time_to_visit": "Morning for photography with fewer crowds. Late afternoon for the sunset spectacle (expect extreme crowds). Spring/Autumn are ideal.",
        "walkability": "Excellent within the pedestrian core, but involves many steps, narrow paths, and can be slow due to crowds."
      },
      "appeal": {
        "known_for": [
          "World-famous sunsets",
          "Iconic blue-domed churches and windmills",
          "Luxury hotels and cave houses",
          "Art galleries and boutiques",
          "Romantic atmosphere",
          "Ammoudi Bay seafood tavernas"
        ],
        "atmosphere": [
          "Picturesque",
          "Romantic",
          "Upscale",
          "Touristy (especially at sunset)",
          "Crowded (peak times)",
          "Iconic"
        ],
        "best_for": [
          "Couples and honeymooners",
          "Photographers",
          "Luxury travelers",
          "Sunset seekers",
          "Art lovers"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 2,
        "green_spaces": 0,
        "shopping": 4,
        "dining": 4,
        "nightlife": 2,
        "cultural": 3,
        "historic": 4
      },
      "highlights": {
        "attractions": [
          {
            "name": "Oia Sunset Viewing (Byzantine Castle)",
            "type": "Viewpoint/Activity",
            "description": "Gathering at the ruins of the Venetian castle to watch the sun dip into the Aegean Sea.",
            "appeal": "Experience one of the world's most famous sunset views (be prepared for crowds)."
          },
          {
            "name": "Iconic Blue Domes Photo Spot",
            "type": "Viewpoint/Photography",
            "description": "Finding the classic viewpoint for the three blue domes and bell towers.",
            "appeal": "Capture the quintessential Santorini postcard image."
          },
          {
            "name": "Ammoudi Bay",
            "type": "Port/Dining/Swimming",
            "description": "Charming fishing port below Oia with waterfront tavernas and swimming spots off the rocks.",
            "appeal": "Enjoy fresh seafood by the water, scenic views up to Oia."
          }
        ],
        "dining": [
          {
            "name": "Oia Restaurants",
            "cuisine": "Greek, Mediterranean, Fine Dining, Seafood",
            "price_range": "€€€-€€€€€",
            "known_for": "Upscale dining with caldera views, romantic settings, fresh seafood (Ammoudi).",
            "atmosphere": "Predominantly sophisticated and scenic, often requiring reservations."
          }
        ],
        "activities": [
          {
            "name": "Wandering the Marble Path",
            "type": "Exploration/Shopping",
            "description": "Strolling the main pedestrian street, browsing art galleries, boutiques, and jewelry stores.",
            "suitable_for": [
              "Shoppers",
              "Art enthusiasts",
              "Everyone"
            ]
          },
          {
            "name": "Photography",
            "type": "Hobby/Sightseeing",
            "description": "Capturing the stunning architecture, views, and details of the village, especially in the morning light.",
            "suitable_for": [
              "Photographers"
            ]
          },
          {
            "name": "Hiking Trail Fira-Oia (End point)",
            "type": "Hiking/Activity",
            "description": "Completing the scenic caldera hike that starts in Fira and finishes in Oia.",
            "suitable_for": [
              "Hikers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want the ultimate romantic, picturesque Santorini experience",
        "Luxury accommodation with caldera views is a priority",
        "Experiencing the famous sunset directly from your area is key",
        "You enjoy browsing art galleries and high-end boutiques"
      ],
      "avoid_if": [
        "You are on a tight budget (Oia is generally the most expensive area)",
        "You intensely dislike crowds (sunset time is overwhelming)",
        "You need easy parking or vehicle access",
        "You seek lively nightlife (Fira is better)"
      ],
      "insider_tips": [
        "Explore Oia early in the morning (before 9 am) to experience its beauty without the crowds.",
        "Don't just stick to the main path; wander the smaller side alleys (respecting private property).",
        "For sunset, consider finding a spot slightly away from the castle ruins or book a restaurant/bar with a view well in advance.",
        "The path down to Ammoudi Bay offers great photo opportunities looking back up at Oia."
      ]
    },
    {
      "name": "Imerovigli",
      "alternate_names": [
        "Merovigli",
        "Balcony to the Aegean"
      ],
      "character": "Situated at the highest point of the caldera cliffs between Fira and Oia. Known for its tranquility, luxury hotels often featuring private plunge pools/jacuzzis, and stunning panoramic caldera views, including the sunset. Offers a more serene and upscale atmosphere compared to Fira.",
      "location": {
        "central": true,
        "description": "Located on the caldera edge, just north of Firostefani and south of Oia.",
        "borders": [
          "Firostefani (south)",
          "Caldera cliff (west)",
          "Road connecting Fira and Oia (east)",
          "Undeveloped land towards Oia (north)"
        ],
        "landmarks": [
          "Skaros Rock",
          "Chapel of Theoskepasti (on Skaros)",
          "Anastasi Church (blue dome)",
          "Luxury Hotels with Infinity Pools"
        ]
      },
      "history": {
        "overview": "Historically significant as the location of Skaros Rock, which housed a major Venetian fortress that served as the island's capital until the 18th century. The fortress was eventually abandoned due to earthquakes. The modern village developed as a quieter, upscale residential and tourist area.",
        "significance": "Offers arguably the best panoramic views from the highest point of the caldera rim. Location of the historic Skaros fortress.",
        "notable_events": [
          "Skaros fortress as medieval capital",
          "Abandonment of Skaros fortress (18th/19th C)",
          "Development as a luxury accommodation hub (late 20th C - present)"
        ]
      },
      "practical_info": {
        "transit": [
          "Located on the main Fira-Oia bus route",
          "Taxi access available",
          "Parking can be tight but generally easier than Fira/Oia centers",
          "Connected to Fira/Firostefani via the scenic caldera path"
        ],
        "safety": "Very safe and generally quiet.",
        "best_time_to_visit": "Anytime for views. Sunset is spectacular. Quieter than Fira/Oia year-round.",
        "walkability": "Excellent along the caldera path. Involves steps. Hike to Skaros Rock requires sturdy footwear."
      },
      "appeal": {
        "known_for": [
          "Unparalleled panoramic caldera views",
          "Luxury hotels and suites",
          "Tranquility and quiet atmosphere",
          "Skaros Rock hike",
          "Romantic setting"
        ],
        "atmosphere": [
          "Serene",
          "Upscale",
          "Quiet",
          "Romantic",
          "Spectacular (views)"
        ],
        "best_for": [
          "Honeymooners and couples seeking tranquility",
          "Luxury travelers",
          "Visitors prioritizing views and relaxation over nightlife/shopping",
          "Hikers (Skaros Rock, Fira-Oia path)"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 3,
        "green_spaces": 1,
        "shopping": 1,
        "dining": 3,
        "nightlife": 1,
        "cultural": 2,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Skaros Rock",
            "type": "Historic Site/Viewpoint/Hike",
            "description": "Prominent headland, site of a former Venetian fortress, offering a rewarding hike and stunning views.",
            "appeal": "Adventurous hike with historical significance and incredible photo opportunities."
          },
          {
            "name": "Caldera Views",
            "type": "Viewpoint",
            "description": "Enjoying the expansive views from hotels, restaurants, or the public caldera path.",
            "appeal": "Considered by many as the best overall viewpoint on the caldera."
          }
        ],
        "dining": [
          {
            "name": "Imerovigli Restaurants",
            "cuisine": "Greek, Mediterranean, Fine Dining",
            "price_range": "€€€-€€€€€",
            "known_for": "High-quality restaurants, often within hotels, focusing on views and fine dining experiences.",
            "atmosphere": "Generally upscale, romantic, and quieter than Fira/Oia."
          }
        ],
        "activities": [
          {
            "name": "Hiking to Skaros Rock",
            "type": "Hiking/Activity",
            "description": "Follow the path down from Imerovigli, around the rock, and potentially to the Chapel of Theoskepasti.",
            "suitable_for": [
              "Fit visitors",
              "Hikers",
              "Photographers"
            ]
          },
          {
            "name": "Walking the Caldera Path (to Fira/Firostefani or towards Oia)",
            "type": "Walking/Sightseeing",
            "description": "Enjoy the scenic paved pathway along the cliff edge connecting the caldera villages.",
            "suitable_for": [
              "Everyone"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want the best caldera views in a tranquil setting",
        "Luxury accommodation with privacy is desired",
        "You prefer quiet evenings over bustling nightlife",
        "You plan to hike Skaros Rock or the Fira-Oia path"
      ],
      "avoid_if": [
        "You are on a strict budget",
        "You want a wide variety of shops, restaurants, and bars within immediate walking distance (Fira is better)",
        "You rely heavily on easy access to nightlife (Fira is better)"
      ],
      "insider_tips": [
        "The walk from Imerovigli to Firostefani and Fira is relatively easy and incredibly scenic.",
        "Even if not staying here, visit for the views and consider the Skaros Rock hike.",
        "Book restaurants in advance, especially those with prime sunset views, as options are fewer than in Fira/Oia."
      ]
    },
    {
      "name": "Firostefani",
      "alternate_names": [
        "Firostefani Village"
      ],
      "character": "A smaller, quieter village seamlessly connecting Fira (to the south) and Imerovigli (to the north) along the caldera path. Offers stunning caldera views, including the famous Three Bells of Fira church viewpoint, with a good selection of hotels and restaurants but a more relaxed pace than Fira.",
      "location": {
        "central": true,
        "description": "Located on the caldera edge, immediately north of Fira.",
        "borders": [
          "Imerovigli (north)",
          "Caldera cliff (west)",
          "Road connecting Fira and Oia (east)",
          "Fira (south)"
        ],
        "landmarks": [
          "Three Bells of Fira (Catholic Church of the Dormition, blue dome & bell tower viewpoint)",
          "Agios Gerasimos Church"
        ]
      },
      "history": {
        "overview": "Essentially developed as an extension of Fira, offering similar views but traditionally a slightly more residential and quieter area. Its name means 'Crown of Fira'.",
        "significance": "Provides a balance between the bustle of Fira and the tranquility of Imerovigli, home to one of Santorini's most photographed church views.",
        "notable_events": [
          "Gradual development alongside Fira"
        ]
      },
      "practical_info": {
        "transit": [
          "Easy walking distance to Fira center (10-15 mins via caldera path)",
          "Located on the main Fira-Oia bus route",
          "Taxi access available",
          "Parking can be challenging but often slightly easier than central Fira."
        ],
        "safety": "Very safe and generally quiet.",
        "best_time_to_visit": "Anytime. Offers great views without the intense crowds of Fira or Oia's sunset point.",
        "walkability": "Excellent, especially along the scenic caldera path connecting to Fira and Imerovigli."
      },
      "appeal": {
        "known_for": [
          "Three Bells of Fira viewpoint",
          "Stunning caldera views",
          "Quieter atmosphere than Fira",
          "Proximity to Fira's amenities",
          "Good selection of hotels and restaurants"
        ],
        "atmosphere": [
          "Relaxed",
          "Scenic",
          "Convenient",
          "Slightly quieter than Fira"
        ],
        "best_for": [
          "Visitors wanting caldera views and proximity to Fira but less bustle",
          "Photographers (Three Bells viewpoint)",
          "Couples"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 3,
        "green_spaces": 0,
        "shopping": 1,
        "dining": 3,
        "nightlife": 1,
        "cultural": 2,
        "historic": 2
      },
      "highlights": {
        "attractions": [
          {
            "name": "Three Bells of Fira Viewpoint",
            "type": "Viewpoint/Photography",
            "description": "Iconic view of the blue-domed Catholic Church of the Dormition with its three bells overlooking the caldera.",
            "appeal": "Capture one of Santorini's most famous and beautiful images."
          }
        ],
        "dining": [
          {
            "name": "Firostefani Restaurants",
            "cuisine": "Greek, Mediterranean",
            "price_range": "€€-€€€€",
            "known_for": "Good quality restaurants with caldera views, often slightly less crowded or expensive than prime Fira spots.",
            "atmosphere": "Relaxed, scenic dining."
          }
        ],
        "activities": [
          {
            "name": "Walking the Caldera Path",
            "type": "Walking/Sightseeing",
            "description": "Enjoy the easy, scenic walk south to Fira (10-15 mins) or north to Imerovigli (15-20 mins).",
            "suitable_for": [
              "Everyone"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want caldera views and easy access to Fira without staying right in the busiest part",
        "A balance of convenience and relative quiet is desired",
        "You plan to do a lot of walking along the caldera path"
      ],
      "avoid_if": [
        "You seek absolute tranquility (Imerovigli or inland villages might be better)",
        "You want extensive shopping or nightlife options right on your doorstep (Fira is better)"
      ],
      "insider_tips": [
        "Firostefani offers many of the same views as Fira but often with slightly lower accommodation prices.",
        "The Three Bells viewpoint is accessed from a path above the church."
      ]
    },
    {
      "name": "Pyrgos Kallistis",
      "alternate_names": [
        "Pyrgos Village",
        "Pyrgos"
      ],
      "character": "Beautifully preserved traditional inland village built amphitheatrically on a hill crowned by a Venetian castle (Kasteli). Offers panoramic views of the entire island (not just the caldera). Features winding narrow pathways, traditional Cycladic architecture, blue-domed churches, quiet squares, art galleries, cafes, and tavernas. Highest settlement on the island.",
      "location": {
        "central": true,
        "description": "Located inland in the southern-central part of the island, approx. 7km south of Fira.",
        "borders": [
          "Vineyards and surrounding hills"
        ],
        "landmarks": [
          "Pyrgos Kasteli (Venetian Castle Ruins)",
          "Church of Theotokaki (within Kasteli)",
          "Church of Eisodion tis Theotokou (main church at entrance)",
          "Prophet Elias Monastery (Profitis Ilias) on nearby mountain peak",
          "Panoramic viewpoints"
        ]
      },
      "history": {
        "overview": "Served as the island's capital before Fira, particularly during the Venetian era when the Kasteli was built. Retained its traditional character due to its inland location and protection as a historical settlement.",
        "significance": "One of the best-preserved traditional villages and former capital, offering a glimpse into Santorini's past away from the main caldera crowds. Offers the best panoramic views of the whole island.",
        "notable_events": [
          "Former capital of Santorini",
          "Construction of Venetian Kasteli",
          "Designated as a preserved traditional settlement"
        ]
      },
      "practical_info": {
        "transit": [
          "Accessible by bus from Fira",
          "Parking available at the base of the village (can be limited)",
          "Village core is mainly pedestrian, involving steep climbs and steps"
        ],
        "safety": "Very safe and generally quiet.",
        "best_time_to_visit": "Anytime. Particularly charming in the morning or late afternoon. Easter celebrations are notable here.",
        "walkability": "Excellent within the village, but requires navigating steep, winding paths and stairs."
      },
      "appeal": {
        "known_for": [
          "Preserved traditional architecture",
          "Venetian Kasteli ruins",
          "Panoramic island views (360 degrees)",
          "Authentic village atmosphere",
          "Charming alleys and churches",
          "Quieter alternative to caldera villages"
        ],
        "atmosphere": [
          "Traditional",
          "Authentic",
          "Charming",
          "Quiet",
          "Historic",
          "Panoramic"
        ],
        "best_for": [
          "Visitors seeking authentic Greek village life",
          "History buffs",
          "Photographers",
          "Those wanting panoramic island views (not just caldera)",
          "Travelers looking for a quieter base"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 4,
        "green_spaces": 1,
        "shopping": 2,
        "dining": 3,
        "nightlife": 1,
        "cultural": 4,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Pyrgos Kasteli",
            "type": "Historic Site/Viewpoint",
            "description": "Exploring the ruins of the Venetian castle at the village summit.",
            "appeal": "Historical exploration and the best panoramic views across Santorini."
          },
          {
            "name": "Wandering the Village Paths",
            "type": "Exploration/Sightseeing",
            "description": "Getting lost in the maze of narrow, whitewashed alleys leading up to the Kasteli.",
            "appeal": "Discover hidden corners, beautiful architecture, and authentic village charm."
          }
        ],
        "dining": [
          {
            "name": "Pyrgos Tavernas & Cafes",
            "cuisine": "Greek, Santorinian",
            "price_range": "€€-€€€",
            "known_for": "Traditional tavernas, charming cafes with views, some well-regarded restaurants (e.g., Metaxy Mas nearby).",
            "atmosphere": "Relaxed, authentic dining experiences, some with excellent views."
          }
        ],
        "activities": [
          {
            "name": "Climbing to the Kasteli",
            "type": "Sightseeing/Activity",
            "description": "Walking up through the village to reach the castle ruins at the top.",
            "suitable_for": [
              "Everyone (moderate climb)"
            ]
          },
          {
            "name": "Visiting Profitis Ilias Monastery (nearby)",
            "type": "Religious Site/Viewpoint",
            "description": "Driving or hiking to the highest point on the island for spectacular views and a visit to the monastery (limited public access).",
            "suitable_for": [
              "View seekers",
              "Cultural visitors"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You seek an authentic, traditional village experience",
        "Panoramic island views are more important than direct caldera views",
        "You prefer a quieter base away from the main tourist crowds",
        "You enjoy exploring historic architecture"
      ],
      "avoid_if": [
        "Direct caldera views from your room are essential",
        "You want easy access to beaches (beach towns are better)",
        "You dislike steep climbs and stairs",
        "You need lively nightlife or extensive shopping"
      ],
      "insider_tips": [
        "Wear comfortable shoes for exploring the steep paths.",
        "Visit Franco's Cafe near the Kasteli for drinks with amazing panoramic views.",
        "Pyrgos is particularly beautiful during sunset, offering a different perspective than the caldera."
      ]
    },
    {
      "name": "Kamari",
      "alternate_names": [
        "Kamari Beach"
      ],
      "character": "A popular, family-friendly beach resort town on the south-east coast of Santorini. Known for its long black volcanic sand/pebble beach, organized amenities (sunbeds, umbrellas, watersports), and a lively beachfront promenade lined with restaurants, cafes, bars, and shops. Located at the foot of Mesa Vouno mountain (site of Ancient Thera).",
      "location": {
        "central": false,
        "description": "Located on the south-east coast of the island, approx. 8km from Fira.",
        "borders": [
          "Aegean Sea (east)",
          "Mesa Vouno mountain (south)",
          "Santorini Airport area (north)",
          "Inland vineyards (west)"
        ],
        "landmarks": [
          "Kamari Beach (Black Beach)",
          "Beachfront Promenade",
          "Mesa Vouno mountain",
          "Access road to Ancient Thera (from Kamari side)",
          "Open Air Cinema Kamari"
        ]
      },
      "history": {
        "overview": "Developed primarily as a tourist resort from the mid-20th century onwards, capitalizing on its long beach. Previously agricultural land.",
        "significance": "One of Santorini's main beach destinations, offering extensive tourist facilities and a different character to the caldera villages.",
        "notable_events": [
          "Development as a major beach resort (mid-late 20th C)"
        ]
      },
      "practical_info": {
        "transit": [
          "Regular bus service to Fira",
          "Taxi access readily available",
          "Easy road access and relatively ample parking compared to caldera villages",
          "Water taxi connection to Perissa (around Mesa Vouno) in summer"
        ],
        "safety": "Very safe, family-friendly resort town.",
        "best_time_to_visit": "Summer season (May-October) for beach activities. Can be very quiet off-season.",
        "walkability": "Excellent along the flat beachfront promenade and within the town."
      },
      "appeal": {
        "known_for": [
          "Long black sand/pebble beach",
          "Organized beach facilities and watersports",
          "Lively beachfront promenade",
          "Wide range of restaurants, bars, and shops",
          "Family-friendly atmosphere",
          "Proximity to Ancient Thera and airport"
        ],
        "atmosphere": [
          "Resort town",
          "Lively (promenade)",
          "Casual",
          "Family-friendly",
          "Beachy"
        ],
        "best_for": [
          "Beach lovers",
          "Families",
          "Visitors seeking organized resort amenities",
          "Travelers wanting easier parking and flatter terrain",
          "Budget-conscious travelers (often more affordable than caldera)"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 3,
        "green_spaces": 1,
        "shopping": 3,
        "dining": 4,
        "nightlife": 3,
        "cultural": 2,
        "historic": 2
      },
      "highlights": {
        "attractions": [
          {
            "name": "Kamari Beach",
            "type": "Beach",
            "description": "Several kilometers long beach with unique black volcanic sand and pebbles, clear water.",
            "appeal": "Relaxing, swimming, sunbathing with full amenities."
          },
          {
            "name": "Ancient Thera (via Kamari access)",
            "type": "Archaeological Site",
            "description": "Accessing the ruins of the ancient city on Mesa Vouno via the winding road from Kamari.",
            "appeal": "Combining history with stunning views over Kamari and the east coast."
          }
        ],
        "dining": [
          {
            "name": "Kamari Promenade Restaurants & Bars",
            "cuisine": "Greek, International, Seafood, Pizza/Pasta, Cafes",
            "price_range": "€€-€€€€",
            "known_for": "Wide variety of dining options directly on the beach promenade, from casual to more upscale.",
            "atmosphere": "Lively, beachfront dining, casual attire acceptable."
          }
        ],
        "activities": [
          {
            "name": "Beach Relaxation & Watersports",
            "type": "Beach/Activity",
            "description": "Enjoying the sunbeds, swimming, and various watersports available along the beach.",
            "suitable_for": [
              "Everyone",
              "Families",
              "Water sports enthusiasts"
            ]
          },
          {
            "name": "Evening Stroll on the Promenade",
            "type": "Walk/Social",
            "description": "Walking along the pedestrianized beachfront road in the evening, choosing a spot for dinner or drinks.",
            "suitable_for": [
              "Everyone"
            ]
          },
          {
            "name": "Open Air Cinema",
            "type": "Entertainment",
            "description": "Watching a movie under the stars at the charming open-air cinema.",
            "suitable_for": [
              "Everyone"
            ]
          }
        ]
      },
      "stay_here_if": [
        "Being directly on the beach is your top priority",
        "You are traveling with family and want easy amenities",
        "You prefer a classic beach resort atmosphere",
        "You want more affordable accommodation options than the caldera"
      ],
      "avoid_if": [
        "You want caldera views (none here)",
        "You seek tranquility (promenade can be busy/noisy)",
        "You prioritize exploring traditional villages or historical sites (requires travel)"
      ],
      "insider_tips": [
        "The southern end of the beach near Mesa Vouno is often slightly quieter.",
        "Wear water shoes as the black sand/pebbles can get extremely hot.",
        "Consider the water taxi to Perissa for a change of scenery."
      ]
    },
    {
      "name": "Perissa & Perivolos",
      "alternate_names": [
        "Black Beach"
      ],
      "character": "Located adjacent to Kamari but separated by the Mesa Vouno mountain, Perissa and the contiguous Perivolos beach form the longest stretch of black volcanic sand beach on Santorini. Perissa tends to be more budget-friendly and backpacker-oriented with campsites and affordable rooms, while Perivolos (further south) is known for its more upscale, trendy beach clubs and bars with comfortable loungers and music.",
      "location": {
        "central": false,
        "description": "Located on the south-east coast, south of Mesa Vouno mountain.",
        "borders": [
          "Mesa Vouno mountain (north)",
          "Aegean Sea (east)",
          "Road towards Emporio/Akrotiri (west)",
          "Agios Georgios beach area (south, extension of Perivolos)"
        ],
        "landmarks": [
          "Perissa Beach (black sand)",
          "Perivolos Beach (black sand, beach clubs)",
          "Church of Timiou Stavrou (large church in Perissa)",
          "Mesa Vouno mountain",
          "Water Park (seasonal)"
        ]
      },
      "history": {
        "overview": "Similar to Kamari, developed mainly as a tourist area centered around its extensive beach, attracting a mix of visitors including backpackers and those seeking beach club vibes.",
        "significance": "Offers the longest and arguably most popular black sand beach experience on Santorini, with distinct zones catering to different tastes (Perissa vs Perivolos).",
        "notable_events": [
          "Development as beach destination (mid-late 20th C)"
        ]
      },
      "practical_info": {
        "transit": [
          "Regular bus service connecting Perissa/Perivolos to Fira",
          "Taxi access available",
          "Relatively easy road access and parking compared to caldera villages",
          "Water taxi connection to Kamari in summer"
        ],
        "safety": "Very safe beach resort area.",
        "best_time_to_visit": "Summer season (May-October) for beach life and beach clubs. Very quiet off-season.",
        "walkability": "Excellent along the flat beach road connecting Perissa and Perivolos."
      },
      "appeal": {
        "known_for": [
          "Longest black sand beach",
          "Variety of beach bars (budget to trendy)",
          "Watersports",
          "Lively beach club scene (Perivolos)",
          "Budget-friendly accommodation options (Perissa)",
          "Access to hiking trail up Ancient Thera (from Perissa side)"
        ],
        "atmosphere": [
          "Beachy",
          "Casual",
          "Lively (beach clubs)",
          "Relaxed (Perissa daytime)",
          "Youthful (parts of Perissa/Perivolos)"
        ],
        "best_for": [
          "Beach lovers seeking long sandy stretches",
          "Young travelers and backpackers (Perissa)",
          "Fans of beach clubs and daytime parties (Perivolos)",
          "Budget-conscious travelers",
          "Families (Perissa)"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 2,
        "green_spaces": 0,
        "shopping": 2,
        "dining": 4,
        "nightlife": 3,
        "cultural": 1,
        "historic": 1
      },
      "highlights": {
        "attractions": [
          {
            "name": "Perissa/Perivolos Beach",
            "type": "Beach",
            "description": "Expansive black sand beach offering diverse ambiances from relaxed to lively.",
            "appeal": "Ideal for sunbathing, swimming, watersports, and enjoying beach bars."
          },
          {
            "name": "Ancient Thera (via Perissa access)",
            "type": "Archaeological Site/Hike",
            "description": "Accessing the ancient city via the hiking trail starting from Perissa.",
            "appeal": "Challenging hike rewarded with history and panoramic views."
          }
        ],
        "dining": [
          {
            "name": "Perissa/Perivolos Beachfront Restaurants & Bars",
            "cuisine": "Greek, International, Seafood, Pizza, Snacks, Cocktails",
            "price_range": "€-€€€€",
            "known_for": "Huge range from cheap eats and traditional tavernas in Perissa to stylish beach club restaurants in Perivolos.",
            "atmosphere": "Casual beach dining to sophisticated lounge vibes."
          }
        ],
        "activities": [
          {
            "name": "Beach Club Hopping (Perivolos)",
            "type": "Social/Relaxation",
            "description": "Spending the day lounging at one of the trendy beach clubs with music, cocktails, and food service.",
            "suitable_for": [
              "Social travelers",
              "Sunbathers",
              "Music lovers"
            ]
          },
          {
            "name": "Watersports",
            "type": "Activity",
            "description": "Engaging in various watersports offered along the beach (jet ski, banana boat, etc.).",
            "suitable_for": [
              "Active visitors",
              "Families"
            ]
          },
          {
            "name": "Hiking to Ancient Thera",
            "type": "Hiking/Activity",
            "description": "Undertaking the steep hike from Perissa up Mesa Vouno to the archaeological site.",
            "suitable_for": [
              "Fit hikers",
              "History enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be right on a long sandy beach",
        "You enjoy beach clubs and a lively daytime beach scene",
        "You are looking for more budget-friendly accommodation options",
        "You prefer a casual resort atmosphere"
      ],
      "avoid_if": [
        "Caldera views are essential",
        "You seek peace and quiet (Perivolos beach clubs can be loud)",
        "You prioritize cultural sights and traditional villages (requires travel)"
      ],
      "insider_tips": [
        "Perivolos generally attracts a slightly older/more affluent crowd than Perissa.",
        "The further south you go along Perivolos towards Agios Georgios, the quieter it tends to become.",
        "Wear water shoes due to the hot black sand."
      ]
    }
  ],
  "activityTypes": {
    "spring": [
      "Hiking the caldera path (Fira-Oia) in pleasant weather",
      "Exploring villages (Pyrgos, Megalochori, Oia) before peak crowds arrive",
      "Visiting Akrotiri archaeological site",
      "Wine tasting at local wineries as vineyards come to life",
      "Enjoying wildflowers and greener landscapes",
      "Witnessing Orthodox Easter celebrations (especially in Pyrgos)"
    ],
    "summer": [
      "Swimming and sunbathing at black sand beaches (Kamari, Perissa, Perivolos) or Red Beach",
      "Taking a catamaran cruise around the caldera (daytime or sunset)",
      "Enjoying sunset views from Oia, Imerovigli, Fira, or Akrotiri Lighthouse",
      "Experiencing the nightlife in Fira",
      "Dining at waterfront tavernas (Ammoudi Bay, Vlychada)",
      "Watersports at Perissa/Perivolos"
    ],
    "autumn": [
      "Swimming in the still-warm sea with fewer crowds on beaches",
      "Wine tasting during or after the harvest season",
      "Hiking the caldera path with comfortable temperatures",
      "Exploring archaeological sites (Akrotiri, Ancient Thera)",
      "Enjoying stunning sunsets with clearer skies"
    ],
    "winter": [
      "Exploring Fira and Oia without the crowds (some shops/restaurants closed)",
      "Visiting museums (Prehistoric Thera, Archaeological)",
      "Enjoying the local, quiet atmosphere in cafes and tavernas that remain open",
      "Taking scenic drives around the island",
      "Getting lower accommodation prices",
      "Hiking (weather permitting)"
    ]
  }
} 