{
    "Spring": {
        "activities": [
            {
                "name": "Hiking the Caldera Path (Fira to Oia)",
                "type": "Nature/Hiking/Sightseeing",
                "description": "Walk the stunning cliffside path connecting Fira and Oia (approx. 10km). Spring offers pleasant temperatures, fewer crowds than summer, and potentially blooming wildflowers, making it ideal for this iconic hike.",
                "indoor": false,
                "best_time": "Morning (to avoid midday sun)",
                "price_range": "Free",
                "seasonal_notes": "Perfect hiking weather before the summer heat sets in. The landscape can be greener than other times.",
                "booking_tips": "Wear sturdy shoes, bring water and sunscreen. Start early from Fira. The path is mostly clear but has some uneven sections."
            },
            {
                "name": "Orthodox Easter Celebrations in Pyrgos",
                "type": "Cultural/Religious Festival",
                "description": "Experience a unique and atmospheric Easter, especially the Epitaphios procession on Good Friday in the traditional village of Pyrgos. The village is lit up with thousands of small fires in cans along the pathways and rooftops, creating a spectacular sight.",
                "indoor": false,
                "best_time": "Good Friday Evening (Pyrgos Procession)",
                "price_range": "Free (Observing)",
                "seasonal_notes": "Dates vary (typically April/May). Pyrgos offers one of the most famous Easter celebrations in the Cyclades. Expect crowds.",
                "booking_tips": "Book accommodation and transport well in advance if visiting during Easter week. Arrive in Pyrgos early on Good Friday evening to find a good vantage point."
            },
            {
                "name": "Explore Akrotiri & Ancient Thera",
                "type": "Historical/Archaeological",
                "description": "Visit the incredibly preserved prehistoric city of Akrotiri and the ancient hilltop city of Thera (on Mesa Vouno) in comfortable spring temperatures before the summer rush.",
                "indoor": true,
                "best_time": "Morning/Afternoon",
                "price_range": "Moderate (Entry fees apply)",
                "seasonal_notes": "Ideal weather for exploring these significant archaeological sites without intense heat.",
                "booking_tips": "Wear comfortable shoes, especially for Ancient Thera (requires uphill walk/drive). Combine Akrotiri visit with nearby Red Beach."
            },
            {
                "name": "Visit Villages Before Peak Season",
                "type": "Sightseeing/Exploration",
                "description": "Wander through the charming alleys of Oia, Pyrgos, Megalochori, or Emporio before the peak summer crowds arrive. Enjoy the architecture, views, and a more relaxed atmosphere.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Spring offers a chance to experience the beauty of Santorini's villages more peacefully.",
                "booking_tips": "Rent a car or use local buses to explore different villages beyond the main caldera hubs."
            },
            {
                "name": "Wine Tasting Season Begins",
                "type": "Food/Drink/Excursion",
                "description": "Visit Santorini's unique wineries as they fully open for the season. Learn about the island's volcanic terroir and basket-trained vines, and taste the famous Assyrtiko white wine.",
                "indoor": true,
                "best_time": "Daytime (Winery opening hours)",
                "price_range": "Moderate (Tasting fees, transport)",
                "seasonal_notes": "Vineyards start showing green growth. Pleasant weather for sitting on winery terraces.",
                "booking_tips": "Book tastings in advance, especially for popular wineries like Santo Wines (for the view) or Estate Argyros/Domaine Sigalas (for wine focus). Consider a wine tour."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Caldera Catamaran Cruise (Day or Sunset)",
                "type": "Boating/Sightseeing/Leisure",
                "description": "Sail into the caldera on a catamaran. Tours typically include swimming/snorkeling stops (e.g., near Hot Springs, Red/White Beaches), onboard BBQ/meal, and drinks. Sunset cruises offer spectacular views of Oia and the sun dipping into the sea.",
                "indoor": false,
                "best_time": "Daytime or Late Afternoon/Sunset",
                "price_range": "Expensive",
                "seasonal_notes": "Peak season for boat tours, offering warm waters for swimming. Sunset slots are extremely popular.",
                "booking_tips": "Book well in advance, especially for sunset cruises. Choose between daytime (more swimming) or sunset (views). Shared or private options available."
            },
            {
                "name": "Beach Time (Kamari, Perissa, Perivolos, Red Beach)",
                "type": "Beach/Leisure",
                "description": "Relax, swim, and sunbathe at Santorini's unique volcanic beaches. Choose the organized black sand beaches of Kamari or Perissa/Perivolos (with lively beach bars), or the dramatic scenery of the Red Beach (requires short walk).",
                "indoor": false,
                "best_time": "Daytime (Protect from intense sun)",
                "price_range": "Free/Budget (Transport + sunbed/umbrella rental)",
                "seasonal_notes": "Warmest sea temperatures. Black sand gets extremely hot - wear sandals/water shoes. Beaches are busiest.",
                "booking_tips": "Use local buses or rent an ATV/car. Red Beach access can be tricky/closed due to landslide risk - check locally. Perivolos has popular beach clubs."
            },
             {
                "name": "Sunset Viewing Spectacle",
                "type": "Sightseeing/Social",
                "description": "Witness the world-famous Santorini sunset. Popular spots include the castle ruins in Oia (extremely crowded), bars/restaurants in Fira/Firostefani/Imerovigli, Santo Wines winery, Akrotiri Lighthouse, or from a sunset cruise.",
                "indoor": false,
                "best_time": "Sunset",
                "price_range": "Free (Public spots) to Expensive (Bars/Cruises)",
                "seasonal_notes": "The quintessential Santorini summer experience. Expect large crowds at prime locations, especially Oia.",
                "booking_tips": "If choosing Oia castle, arrive hours early. For bars/restaurants/cruises, book well in advance and confirm view quality. Consider less crowded spots like Akrotiri Lighthouse or villages like Pyrgos for different perspectives."
            },
            {
                "name": "Explore Ammoudi Bay",
                "type": "Dining/Swimming/Sightseeing",
                "description": "Descend the steps (or drive down) from Oia to the charming port of Ammoudi Bay. Enjoy lunch or dinner at the waterfront seafood tavernas, or walk past the restaurants to find swimming spots off the rocks with views of the cliffs.",
                "indoor": false,
                "best_time": "Lunch/Sunset Dinner/Afternoon Swim",
                "price_range": "Moderate/Expensive (Dining)",
                "seasonal_notes": "Vibrant atmosphere in summer. Seafood is fresh but can be pricey.",
                "booking_tips": "Book tavernas in advance for sunset. Be prepared for the climb back up the steps to Oia (or take a taxi)."
            },
            {
                "name": "Open Air Cinema Kamari",
                "type": "Entertainment",
                "description": "Enjoy a movie under the stars in a beautiful garden setting at Cine Kamari. Films are typically in English with Greek subtitles.",
                "indoor": false,
                "best_time": "Evening (Check screening times)",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "A relaxing and charming evening activity, popular during summer months.",
                "booking_tips": "Arrive a bit early to get good seats and enjoy a drink from the bar. Check their website for the film schedule."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Wine Tasting & Harvest Season",
                "type": "Food/Drink/Excursion",
                "description": "Visit wineries during or just after the grape harvest (August/September). Learn about the Assyrtiko grape and Santorini's unique viticulture. Taste the latest vintages and potentially the sweet Vinsanto.",
                "indoor": true,
                "best_time": "Daytime (September/October)",
                "price_range": "Moderate",
                "seasonal_notes": "Harvest is a key event. Weather is usually still warm and sunny, perfect for winery visits.",
                "booking_tips": "Book winery tours/tastings ahead. Consider visiting different types of wineries (large cooperative like Santo vs. smaller estates like Gavalas or Hatzidakis)."
            },
             {
                "name": "Hiking in Cooler Temperatures",
                "type": "Nature/Hiking/Sightseeing",
                "description": "Hike the Fira-Oia caldera path or explore trails in less crowded areas (e.g., around Pyrgos or Emporio) as the intense summer heat subsides.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Pleasant temperatures make autumn ideal for longer walks. Caldera path is less congested than in summer.",
                "booking_tips": "Wear appropriate footwear. Bring water, although temperatures are milder. Enjoy the clearer air and views."
            },
            {
                "name": "Swimming in Still-Warm Seas",
                "type": "Beach/Leisure",
                "description": "Enjoy the beaches (Kamari, Perissa, etc.) with fewer crowds. The sea often remains warm enough for comfortable swimming well into October.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free/Budget",
                "seasonal_notes": "A more relaxed beach experience compared to summer. Some beach facilities may start closing down later in autumn.",
                "booking_tips": "Check weather forecasts. Enjoy the extra space on the beaches."
            },
            {
                "name": "Explore Sites & Villages with Fewer Crowds",
                "type": "Historical/Sightseeing",
                "description": "Visit Akrotiri, Ancient Thera, and wander through Oia, Fira, or Pyrgos with significantly fewer tourists than in peak summer, allowing for a more intimate experience.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate (Entry fees)/Free (Villages)",
                "seasonal_notes": "Shoulder season offers a good balance of open amenities and reduced crowds.",
                "booking_tips": "Check opening hours for archaeological sites, as they may switch to winter schedules later in autumn."
            },
             {
                "name": "Enjoy Clearer Sunset Views",
                "type": "Sightseeing/Photography",
                "description": "Autumn often brings clearer skies after the summer haze, offering potentially more vibrant and sharp sunset views over the caldera.",
                "indoor": false,
                "best_time": "Sunset",
                "price_range": "Free/Varies",
                "seasonal_notes": "Less atmospheric haze compared to peak summer. Fewer crowds at popular sunset spots like Oia.",
                "booking_tips": "Find your preferred viewpoint (Oia, Imerovigli, Akrotiri Lighthouse) and enjoy the view with more breathing room."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Explore Fira & Oia's Quiet Charm",
                "type": "Sightseeing/Exploration",
                "description": "Experience the iconic villages of Fira and Oia without the summer crowds. Wander the quiet alleys, enjoy the dramatic caldera views in solitude, and appreciate the architecture peacefully.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Many tourist shops, restaurants, and some hotels will be closed. The island feels very different, calm and local.",
                "booking_tips": "Check which restaurants/cafes remain open (usually fewer, catering to locals). Enjoy the tranquility."
            },
             {
                "name": "Museum Visits",
                "type": "Cultural/Historical",
                "description": "Visit the Museum of Prehistoric Thera in Fira and potentially other smaller museums or galleries that may remain open, enjoying them without queues.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "A good indoor activity for cooler or potentially rainy days.",
                "booking_tips": "Confirm winter opening hours in advance as they are often reduced."
            },
            {
                "name": "Enjoy Local Life in Pyrgos or Emporio",
                "type": "Cultural/Exploration",
                "description": "Visit traditional inland villages like Pyrgos or Emporio, where local life continues year-round. Enjoy coffee at a local 'kafeneio' or a meal at a taverna that stays open for residents.",
                "indoor": true,
                "best_time": "Daytime/Early Evening",
                "price_range": "Budget/Moderate",
                "seasonal_notes": "Offers a more authentic glimpse into Santorinian life outside the main tourist season.",
                "booking_tips": "Engage with locals respectfully. Fewer dining options will be available compared to summer."
            },
            {
                "name": "Experience Santorini's Tranquility",
                "type": "Leisure/Relaxation",
                "description": "Embrace the peace and quiet of the low season. Enjoy dramatic winter skies over the caldera, find lower accommodation prices, and experience a more personal side of the island.",
                "indoor": false,
                "best_time": "Anytime",
                "price_range": "Budget (Lower prices generally)",
                "seasonal_notes": "Weather can be mixed (sunny days, rain, wind). Pack layers. Ferry services are reduced.",
                "booking_tips": "Ideal for travelers seeking solitude and a break from tourist crowds. Book accommodation with heating."
            },
            {
                "name": "Hiking (Weather Permitting)",
                "type": "Nature/Hiking",
                "description": "On clear winter days, hiking trails like the Fira-Oia path or paths around Pyrgos can be invigorating, offering solitude and starkly beautiful landscapes.",
                "indoor": false,
                "best_time": "Daytime (on clear days)",
                "price_range": "Free",
                "seasonal_notes": "Check weather forecasts carefully. Trails can be muddy or slippery after rain. Daylight hours are shorter.",
                "booking_tips": "Dress warmly in layers and wear waterproof hiking shoes. Inform someone of your route."
            }
        ]
    }
} 