{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Cannes Film Festival",
                "details": "May hosts the world-famous Cannes Film Festival, transforming the city into the global center of cinema with celebrities, premieres, and events throughout the city."
            },
            {
                "reason": "Perfect Weather",
                "details": "May offers ideal Mediterranean conditions with warm, sunny days and pleasant evenings, before the intense heat and crowds of high summer arrive."
            },
            {
                "reason": "Beach Season Begins",
                "details": "May marks the beginning of beach season in Cannes, with beach clubs setting up and sea temperatures becoming comfortable for swimming."
            },
            {
                "reason": "European Museum Night",
                "details": "Mid-May brings the annual Night of Museums, when Cannes' cultural institutions open their doors late with special events and free admission."
            },
            {
                "reason": "Spring Blooms",
                "details": "The city's gardens, particularly in the hills above Cannes, showcase stunning Mediterranean flowers and plants in full bloom during May."
            },
            {
                "reason": "Celebrity Spotting",
                "details": "During the Film Festival, visitors have unparalleled opportunities to spot film stars and celebrities at hotels, restaurants, and along La Croisette."
            },
            {
                "reason": "Outdoor Culture",
                "details": "Cannes' café culture moves fully outdoors, with restaurant terraces and beachfront spaces filled with locals and visitors enjoying the spring sunshine."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Film Festival Crowds and Prices",
                "details": "During the Film Festival (usually mid-May), hotel rates soar to their annual peak, restaurants are fully booked, and the city center is extremely crowded."
            },
            {
                "reason": "Public Holidays",
                "details": "May has several French public holidays (May 1, 8, and sometimes Ascension), when some businesses close and domestic tourism increases for long weekends."
            },
            {
                "reason": "Limited Access to Venues",
                "details": "During the Film Festival, many areas around the Palais des Festivals require accreditation, and some beaches and venues are reserved for private events."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "14°C"
                },
                "precipitation": "May is typically dry in Cannes with only occasional brief showers. Sunshine dominates with clear blue skies perfect for outdoor activities.",
                "general_tips": "Pack layers for cooler evenings, swimwear for beach days, and elegant attire if attending any Festival-related events. Sun protection is essential."
            },
            "tourism_level": {
                "crowds": "Tourism builds rapidly in early May as the Film Festival approaches, with a dramatic increase in visitors during the Festival itself.",
                "pricing": "Accommodation prices rise steadily, peaking during the Film Festival when rates can be triple or quadruple normal prices.",
                "overall_atmosphere": "The city transforms from relatively calm to extremely vibrant and glamorous as Festival preparations take over the city center."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (May 1)",
                    "date": "May 1",
                    "description": "National holiday when most businesses, shops, and some attractions are closed. Traditional day for lily-of-the-valley sales and workers' demonstrations.",
                    "notes": "Public transportation runs on a holiday schedule. Many restaurants and tourist sites remain open, but confirm in advance."
                },
                {
                    "name": "Victory in Europe Day (May 8)",
                    "date": "May 8",
                    "description": "Public holiday commemorating the end of WWII in Europe with ceremonies at war memorials throughout the city.",
                    "notes": "Government offices and many businesses close, but most tourism-oriented establishments remain open."
                },
                {
                    "name": "Cannes Film Festival Opening",
                    "date": "Mid-May (varies by year)",
                    "description": "The glamorous opening ceremony and first red carpet events of the Cannes Film Festival, drawing international celebrities and media attention.",
                    "notes": "While the actual ceremonies require accreditation, the red carpet arrivals can be viewed from designated public areas, though these fill up hours in advance."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Pre-Festival La Croisette Stroll",
                    "where": "Boulevard de la Croisette",
                    "description": "Walk Cannes' famous promenade before the Festival begins, watching the transformation as pavilions are built and red carpets are prepared.",
                    "practical_tips": "Early morning is best to observe the preparations without crowds. Take photos of the giant film posters being installed on hotel facades.",
                    "best_time": "Morning",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Marché Forville Visit",
                    "where": "Near Le Suquet (Old Town)",
                    "description": "Explore Cannes' main covered market featuring spring Provençal produce, flowers, and Mediterranean specialties before the Film Festival crowds arrive.",
                    "practical_tips": "Open Tuesday through Sunday mornings until around 1pm. Closed Mondays. Visit early (before 9am) for the best experience.",
                    "best_time": "Early morning",
                    "estimated_cost": "Low (unless purchasing items)",
                    "weather_dependent": false
                },
                {
                    "activity": "Le Suquet Exploration",
                    "where": "Cannes' Old Town",
                    "description": "Wander the charming narrow streets of Cannes' historic quarter before the Film Festival, when this authentic area is relatively peaceful.",
                    "practical_tips": "Climb to the top for panoramic views of the bay and Festival preparations. The Musée de la Castre offers cultural context for the region.",
                    "best_time": "Morning or late afternoon",
                    "estimated_cost": "Low (museum has entrance fee)",
                    "weather_dependent": true
                },
                {
                    "activity": "Early Beach Day",
                    "where": "Public or private beaches along La Croisette",
                    "description": "Enjoy the beginning of beach season when the Mediterranean is warming up but beaches aren't yet crowded with summer tourists.",
                    "practical_tips": "Public beaches are free but private beach clubs offer comfort with sun beds and service for a fee. May water temperatures (around 18°C) are refreshing but comfortable for short swims.",
                    "best_time": "Mid-morning to afternoon",
                    "estimated_cost": "Free (public beaches) or Moderate to High (beach clubs)",
                    "weather_dependent": true
                },
                {
                    "activity": "Boat Trip to Îles de Lérins",
                    "where": "Cannes Harbor to nearby islands",
                    "description": "Take a short boat trip to explore the tranquil Lérins Islands, a perfect contrast to the building excitement in Cannes before the Festival.",
                    "practical_tips": "Ferries depart regularly from the Quai Laubeuf. Visit Île Sainte-Marguerite for beaches and Fort Royal or Île Saint-Honorat for the historic monastery.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Pre-Festival Fine Dining",
                    "where": "Restaurants throughout Cannes",
                    "description": "Experience Cannes' excellent restaurants before they become fully booked during the Festival period.",
                    "practical_tips": "Make reservations at least a week in advance, even before the Festival. Try La Palme d'Or for Michelin-starred cuisine or Le Bistrot Gourmand for more casual elegance.",
                    "best_time": "Evening",
                    "estimated_cost": "High to Very High",
                    "weather_dependent": false
                },
                {
                    "activity": "Film Festival Red Carpet Viewing",
                    "where": "Outside Palais des Festivals",
                    "description": "Watch celebrities ascend the famous red-carpeted steps of the Palais des Festivals during the evening premieres of the Film Festival.",
                    "practical_tips": "Public viewing areas fill up hours in advance. Bring water, sun protection, and patience. Evening premieres (after 6pm) attract the biggest stars and crowds.",
                    "best_time": "Late afternoon to evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Antibes",
                    "where": "Nearby coastal town",
                    "description": "Escape the Film Festival buildup with a visit to nearby Antibes, with its Picasso Museum, exceptional market, and charming old town.",
                    "practical_tips": "Take the train from Cannes (15 minutes) to avoid parking issues. Visit the Marché Provençal in the morning and the Picasso Museum afterward.",
                    "best_time": "Full day",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "15°C"
                },
                "precipitation": "Weather becomes increasingly stable and sunny, with virtually no rain expected in late May.",
                "general_tips": "Sun protection is essential as UV levels increase. Light clothing is suitable for days, with a light layer for evenings."
            },
            "tourism_level": {
                "crowds": "Extremely busy during the Film Festival, returning to more moderate levels afterward but still higher than early spring.",
                "pricing": "Premium pricing during the Festival, with a slight decrease afterward but still approaching high season rates.",
                "overall_atmosphere": "Electric and glamorous during the Festival, becoming more relaxed but still vibrant as the month concludes."
            },
            "events_holidays": [
                {
                    "name": "Cannes Film Festival",
                    "date": "Mid to late May (typically two weeks, varies by year)",
                    "description": "The world's most prestigious film festival featuring premieres, competitions, and events throughout Cannes.",
                    "notes": "While many events require accreditation, there are public screenings (Cinema de la Plage - free beach screenings) and opportunities to experience the atmosphere."
                },
                {
                    "name": "European Museum Night",
                    "date": "Mid-May (usually third Saturday)",
                    "description": "Annual event when museums and cultural institutions stay open late with special events, performances, and free admission.",
                    "notes": "May coincide with the Film Festival. The Musée de la Castre and La Malmaison art center typically participate."
                },
                {
                    "name": "Ascension Day",
                    "date": "Variable (May or early June)",
                    "description": "Public holiday that often creates a long weekend when many French people travel, potentially increasing domestic tourism.",
                    "notes": "If it falls during the Film Festival period, the city will be extraordinarily busy."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Cinema de la Plage",
                    "where": "Macé Beach on La Croisette",
                    "description": "Attend a free public screening of classic films on the beach, part of the official Cannes Film Festival program open to everyone.",
                    "practical_tips": "Arrive at least an hour early to secure a seat. Check the Festival website for the screening schedule. Bring something warm to wear as evenings can be cool.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Post-Festival Recovery Spa Day",
                    "where": "Luxury hotels and spas in Cannes",
                    "description": "Indulge in spa treatments at one of Cannes' luxury hotels after the Festival when prices drop slightly and availability improves.",
                    "practical_tips": "The spas at Hotel Martinez or Carlton offer excellent treatments. Book a few days in advance, as post-Festival is a popular time for relaxation.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "High",
                    "weather_dependent": false
                },
                {
                    "activity": "Museum Night Experience",
                    "where": "Various museums in Cannes",
                    "description": "Take part in the European Museum Night, exploring Cannes' museums after hours with special events and illuminations.",
                    "practical_tips": "If it coincides with the Film Festival, expect it to be less prominent than in other cities. Check the city's cultural calendar for participating venues.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Helicopter Tour",
                    "where": "Departing from Cannes Airport",
                    "description": "See the stunning French Riviera coastline from above, with a unique perspective on Cannes during or just after the Festival period.",
                    "practical_tips": "Book well in advance, especially during the Festival. Tours typically last 15-30 minutes and provide spectacular views of the coastline and festival setup.",
                    "best_time": "Morning for clearest visibility",
                    "estimated_cost": "Very high",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Saint-Paul-de-Vence",
                    "where": "Medieval hilltop village",
                    "description": "Escape the Festival atmosphere with a visit to this historic artist's village with galleries, scenic views, and excellent restaurants.",
                    "practical_tips": "Take a taxi or arranged tour as public transport is limited. Visit the Fondation Maeght for an exceptional modern art collection.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate to high",
                    "weather_dependent": true
                },
                {
                    "activity": "Shopping on Rue d'Antibes",
                    "where": "Cannes' main shopping street",
                    "description": "Explore the boutiques and shops on Cannes' premier shopping street as the Festival winds down and the summer collections arrive.",
                    "practical_tips": "More accessible after the Festival concludes. For luxury brands, continue to La Croisette, but Rue d'Antibes offers more accessible shopping options.",
                    "best_time": "Morning to afternoon",
                    "estimated_cost": "Variable",
                    "weather_dependent": false
                },
                {
                    "activity": "Wine Tasting Tour",
                    "where": "Nearby Provence wine country",
                    "description": "Take a half-day tour to vineyards in the nearby countryside specializing in the famous rosé wines of Provence, perfect for spring.",
                    "practical_tips": "Book with a tour company that provides transportation from Cannes. The vineyards around Nice and in the Var department produce excellent rosés.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate to high",
                    "weather_dependent": true
                },
                {
                    "activity": "Sunset Dinner at La Croisette",
                    "where": "Beachfront restaurants",
                    "description": "Enjoy a memorable dinner at one of Cannes' beachfront restaurants as life returns to normal after the Festival.",
                    "practical_tips": "Reserve several days in advance, even after the Festival. Request a table with sea views for the best experience.",
                    "best_time": "Evening (sunset around 8:30-9pm in May)",
                    "estimated_cost": "High",
                    "weather_dependent": true
                }
            ]
        }
    }
}