{
  "overview_paragraph": "Cannes is at its best in spring (April–June) and early fall (September–October), when café terraces hum along La Croisette, Mediterranean gardens bloom, and walking weather is ideal. July brings long evenings and vibrant festivals—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days, local patisserie stops, and twinkling holiday lights—while March begins to warm with the odd shower and blooming almond trees along La Croisette.",
  "January": [
    "Musée de la Castre without the lines, steaming Provençal hot chocolate, and misty waterfront walks between cozy local shops along La Croisette.",
    "Winter light on the Tour du Suquet, snug restaurants in Le Suquet, and vintage hunts in the covered market."
  ],
  "February": [
    "Le Suquet at golden hour, romantic views from the Port de Cannes, and traditional Provençal music nights in local venues.",
    "Shared local pastries, candlelit waterfront restaurants, and strolls past secret courtyards in the Old Town."
  ],
  "March": [
    "First almond blossoms on the hillsides, terrace tables returning along La Croisette, and Old Town bookshop wanders.",
    "Morning croissants, museum afternoons, and blue-hour waterfront welcoming spring back to Cannes."
  ],
  "April": [
    "Wildflowers in bloom along La Croisette, flaky Provençal pastries, and walks from the Port de Cannes to Le Suquet.",
    "Spring light on the Church of Notre-Dame d'Espérance, gallery-hopping in Place du Marché Forville, sunset cruise to a glittering bay of Cannes."
  ],
  "May": [
    "Picnics on Plage de la Croisette, markets brimming with local color, and twilight strolls along the waterfront.",
    "Flowered promenades, open-air café moments along La Croisette, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, waterfront aperitifs on the Port de Cannes, and the city humming for Fête de la Musique.",
    "Sun-splashed beaches, seaside picnics, and late sunsets that turn every viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over the bay, lazy afternoons on the beaches, and moonlit boat cruises.",
    "Summer markets, waterfront terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet beaches, easy museum days, and Paris Plages evenings with breezes off the Mediterranean.",
    "Shaded gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits, lively terraces, and vineyard-tinted evenings in Le Suquet.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering irresistible."
  ],
  "October": [
    "Autumn colors in the hills, restaurants aglow, and the local harvest festival in Place du Marché Forville.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the waterfront."
  ],
  "November": [
    "Local wine toasts, cozy restaurants, and Musée de la Castre afternoons while the city slows to a hush.",
    "Foggy waterfront mornings, Mediterranean antiquities indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Port de Cannes lights, Christmas markets at Place du Marché Forville, and strolling beneath grand Mediterranean façades.",
    "Vin chaud in hand, Church bells, and winter sparkle from waterfront to boutique passage."
  ]
}

