{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day",
          "notes": "New Year's Day (Jan 1) is a public holiday. Most businesses, shops, and restaurants are closed or operate with limited hours. Frankfurt is quiet as residents recover from New Year's Eve celebrations."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "special": true,
          "event": "Three Kings Day (Epiphany)",
          "notes": "Epiphany (Jan 6) marks the official end of the Christmas season. While not a public holiday in Hesse (the state where Frankfurt is located), many Christmas decorations remain up until this date, and some special church services are held."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Off-season with few tourists and excellent hotel value. Cold winter weather with temperatures often hovering just above freezing. Limited daylight hours (around 8-9 hours). Winter sales begin mid-January in all shops. Many museums offer special winter exhibitions. Indoor activities are popular at this time."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": -1,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
          "score": 3,
          "special": false,
          "notes": "Winter continues with cold weather but slightly longer days than January. Frankfurt's low tourism season continues, making it a good time for museum visits and indoor cultural activities without crowds. Many cafés and restaurants offer cozy winter menus and atmosphere."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": -1,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. Trees begin to bud and early spring flowers appear in Frankfurt's parks and gardens. City life begins to move outdoors as café terraces start to open when weather permits."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins",
          "notes": "Spring officially begins, bringing longer days and warmer temperatures. Palmengarten and other city parks start showing colorful blooms. Outdoor activities become more popular. Tourism gradually increases but still before peak season."
        }
      ],
      "weatherHighC": 11,
      "weatherLowC": 2,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "notes": "Spring is in full swing with blossoming trees and flowers throughout the city. The weather can be variable with rain showers alternating with sunny days. Easter markets may be present in early April depending on when Easter falls."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Spring Dippemess Fair",
          "notes": "Frankfurt's traditional Spring Dippemess Fair typically runs from mid-April to early May at the Festplatz am Ratsweg. This folk festival features rides, games, food stalls, and traditional crafts. Cherry blossoms bloom along the boulevard next to Alte Oper, creating spectacular photo opportunities."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 5,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day",
          "notes": "Labor Day (May 1) is a public holiday in Germany with public demonstrations, rallies, and events throughout Frankfurt. Many businesses are closed. The annual Eschborn to Frankfurt cycle race takes place on this day with the finish at Opernplatz."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 5,
          "special": true,
          "event": "Green Sauce Festival",
          "notes": "The Green Sauce Festival (Grüne Soße Festival) usually takes place in mid-May on Roßmarkt. This culinary event celebrates Frankfurt's famous herb sauce with tastings and competitions. Weather is typically pleasant with warm days and cool evenings."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Fressgass Fest",
          "notes": "The Fressgass Fest in late May transforms Frankfurt's upscale shopping and dining street into an open-air food festival lasting around 10 days. Perfect spring weather with comfortable temperatures makes this an ideal time to visit before summer crowds arrive."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 9,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 5,
          "special": true,
          "event": "Wäldchestag (Forest Day Festival)",
          "notes": "Frankfurt's traditional Forest Festival takes place after Pentecost, typically in early June. This unique local holiday features fairground attractions, food, and festivities in Frankfurt's city forest (Stadtwald). It's considered Frankfurt's unofficial local holiday."
        },
        {
          "days": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Early summer brings warm days and pleasant evenings. Tourism increases as the outdoor season is in full swing. Outdoor dining and evening activities become particularly pleasant. River banks of the Main become popular spots for relaxation and socializing."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 13,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": false,
          "notes": "The hottest month of the year with temperatures occasionally exceeding 30°C. Peak summer season with high tourism levels and occasional summer thunderstorms. Urban beaches appear along the Main River. Long daylight hours (up to 16 hours) make for extended evening activities. Outdoor festivals and events throughout the city."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 14,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 4,
          "special": true,
          "event": "Mainfest",
          "notes": "Mainfest typically takes place in early August, transforming the banks of the Main River into a huge waterside festival with food, drinks, music, and traditional attractions. Summer heat continues with warm days and comfortable evenings."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Museum Embankment Festival",
          "notes": "The Museum Embankment Festival (Museumsuferfest) takes place on the last weekend of August. As one of the largest cultural festivals in Europe, it attracts millions of visitors with museum exhibitions, music performances, food stalls, and activities along both banks of the Main River. The festival concludes with a spectacular fireworks display on Sunday night."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 14,
      "tourismLevel": 9
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6],
          "score": 5,
          "special": true,
          "event": "Rheingauer Wine Market",
          "notes": "The Rheingauer Wine Market usually takes place in early September along the Fressgass. Various vintners from the nearby Rheingau wine region offer tastings of their wines in a festive atmosphere."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
          "score": 5,
          "notes": "Excellent time to visit as summer crowds begin to diminish while weather remains warm during the day but more comfortable, especially in the evenings. Local life returns to normal rhythm after summer holidays."
        },
        {
          "days": [29, 30],
          "score": 4,
          "special": true,
          "event": "Autumn Dippemess",
          "notes": "The Autumn Dippemess begins in late September and runs into early October. This traditional fair at Festplatz am Ratsweg offers rides, games, and regional food in a typical German fairground atmosphere."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2],
          "score": 4,
          "special": true,
          "event": "Autumn Dippemess continues",
          "notes": "The autumn edition of Frankfurt's traditional fair continues into early October with fairground rides, food stalls, and entertainment."
        },
        {
          "days": [3],
          "score": 4,
          "special": true,
          "event": "German Unity Day",
          "notes": "German Unity Day (Tag der Deutschen Einheit) is a nationwide public holiday commemorating German reunification in 1990. Government offices and most businesses are closed. Public celebrations and events take place throughout Frankfurt."
        },
        {
          "days": [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "notes": "Pleasant autumn weather with gradually cooling temperatures. Trees begin to display fall colors in Frankfurt's parks and along the Main River. Ideal conditions for urban exploration and day trips to nearby regions like the Taunus mountains."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Frankfurt Book Fair",
          "notes": "The Frankfurt Book Fair (Frankfurter Buchmesse), the world's largest trade fair for books, typically takes place in mid-to-late October. While primarily an industry event, the weekend days are open to the public with readings, signings, and literary events throughout the city."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 7,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": false,
          "notes": "All Saints' Day is not a public holiday in Hesse. Weather turns noticeably cooler with occasional rain and first frosts possible. Daylight hours decrease significantly."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 3,
          "notes": "Full autumn with cooler temperatures and shorter days. Tourism levels decrease significantly. Good time for museum visits and indoor cultural activities. Many restaurants offer seasonal autumn specialties featuring game, mushrooms, and pumpkin dishes."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Christmas Market preparation",
          "notes": "Late November sees the city preparing for the Christmas season. Christmas decorations appear throughout the city center, and the famous Frankfurt Christmas Market typically opens during the last week of November."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "Frankfurt Christmas Market",
          "notes": "The Frankfurt Christmas Market (Frankfurter Weihnachtsmarkt), one of the oldest and largest in Germany, runs from late November until December 22. The market stretches from Römerberg through the city center to Hauptwache and Mainkai. Illuminated buildings, traditional wooden stalls, regional crafts, and seasonal foods create a festive atmosphere throughout the city."
        },
        {
          "days": [23, 24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve",
          "notes": "Christmas Eve (Heiligabend) is the main celebration day for most German families. Many businesses close early on December 24. The Christmas Market is typically closed by this date."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Days",
          "notes": "December 25 and 26 are both public holidays in Germany. Most businesses, restaurants, and attractions are closed or operate with limited hours. A quiet time in the city as most residents celebrate with family."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees the city in a quiet mode. Many locals are on holiday, but most major attractions reopen. Good time for winter sales shopping and museum visits."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve",
          "notes": "New Year's Eve (Silvester) celebrations take place throughout Frankfurt, particularly around Römerberg and along the Main River. Many restaurants offer special dinner menus, and hotels host celebration events. Public fireworks displays light up the skyline at midnight."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Spring Dippemess Fair at Festplatz am Ratsweg",
      "Cherry Blossom Viewing at Alte Oper",
      "Palmengarten Botanical Garden Spring Blooms",
      "Main River Cruises with Spring Landscapes",
      "Green Sauce Festival at Roßmarkt",
      "Wäldchestag Forest Festival in Stadtwald",
      "Berger Straße Farmers Markets and Café Visits",
      "Cycling in Taunus Mountains and City Forest"
    ],
    "summer": [
      "Mainfest Celebrations along the Main River",
      "Museum Embankment Festival Weekend",
      "Urban Beaches along the Main Riverbanks",
      "Outdoor Dining at Fressgass and Sachsenhausen",
      "Main Tower Observation Deck Evening Views",
      "Open-Air Concerts and Cultural Events",
      "Apple Wine Tavern Visits in Sachsenhausen",
      "Exploring the Frankfurt City Forest Nature Trails"
    ],
    "autumn": [
      "Frankfurt Book Fair Events and Readings",
      "Autumn Dippemess Fair at Festplatz",
      "Rheingauer Wine Market Tastings",
      "Fall Foliage in Stadtwald and Grüneburgpark",
      "Apple Wine Festival at Roßmarkt",
      "Museum Visits along Museumsufer",
      "Kleinmarkthalle Seasonal Food Shopping",
      "Day Trips to Taunus Mountains for Autumn Colors"
    ],
    "winter": [
      "Frankfurt Christmas Market at Römerberg",
      "Ice Skating at Eissporthalle",
      "Winter Museum Exhibitions and Gallery Visits",
      "New Year's Eve Celebrations on the Main",
      "Winter Shopping at Zeil and Goethestraße",
      "Indoor Food Markets and Culinary Experiences",
      "Traditional Cafés and Tea Houses",
      "Classical Concerts at Alte Oper and St. Paul's Church"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to high tourism (or cold winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}