{
    "December": {
        "reasons_to_visit": [
            {
                "reason": "Christmas Markets Magic",
                "details": "Olomouc's Christmas markets in Upper Square feature traditional Czech crafts, mulled wine (svařené víno), and the stunning backdrop of the UNESCO World Heritage Holy Trinity Column."
            },
            {
                "reason": "UNESCO World Heritage Setting",
                "details": "Christmas markets are held in the historic Upper Square with the magnificent Holy Trinity Column as the centerpiece, creating a unique festive atmosphere."
            },
            {
                "reason": "Traditional Czech Christmas",
                "details": "Experience authentic Czech Christmas traditions including traditional Christmas dinner with carp, potato salad, and Christmas cookies."
            },
            {
                "reason": "Cozy Indoor Culture",
                "details": "Perfect time for traditional Czech experiences in warm, atmospheric venues like historic churches and cozy cafes."
            },
            {
                "reason": "New Year's Preparation",
                "details": "December builds to spectacular New Year's Eve (Silvestr) celebrations with fireworks and Czech traditions."
            }
        ],
        "reasons_to_avoid": [
            {
                "reason": "Cold Weather",
                "details": "December temperatures often drop below freezing (0-5°C), requiring heavy winter clothing for outdoor activities."
            },
            {
                "reason": "Christmas Crowds",
                "details": "December attracts significant numbers of tourists for Christmas market visits, especially around Upper Square."
            },
            {
                "reason": "Limited Daylight",
                "details": "Shortest days of the year with only 8 hours of daylight, limiting outdoor sightseeing opportunities."
            },
            {
                "reason": "Higher Holiday Prices",
                "details": "Christmas and New Year's periods see increased prices for accommodations and dining, especially in the historic center."
            }
        ],
        "weather": {
            "temperature_range": "0°C to 5°C (32°F to 41°F)",
            "rainfall": "Moderate",
            "snow": "Common",
            "daylight_hours": "8 hours"
        },
        "activities": [
            "Christmas market visits in Upper Square",
            "Traditional Czech Christmas dinner",
            "Church concerts at St. Maurice Church",
            "Winter photography of Baroque architecture",
            "New Year's Eve (Silvestr) celebrations",
            "UNESCO site exploration",
            "Cozy café culture",
            "Historic church visits"
        ]
    }
}