{
    "January": {
        "reasons_to_visit": [
            {
                "reason": "New Year Celebrations",
                "details": "Olomouc offers spectacular New Year's Eve (Silvestr) celebrations with fireworks over the historic center and traditional Czech festivities."
            },
            {
                "reason": "Winter Wonderland",
                "details": "Snow-covered Holy Trinity Column and Baroque architecture create a fairy-tale atmosphere perfect for photography and romantic walks in the UNESCO World Heritage setting."
            },
            {
                "reason": "Indoor Cultural Attractions",
                "details": "Perfect time to explore Olomouc's museums, historic churches, and university buildings without summer crowds."
            },
            {
                "reason": "Cozy Czech Pubs",
                "details": "Traditional Czech pubs and beer halls provide warm refuge with hearty local cuisine, excellent Czech beer, and authentic atmosphere."
            },
            {
                "reason": "Lower Prices",
                "details": "Off-season rates for accommodations and fewer tourists mean a more authentic local experience, especially in the university district."
            }
        ],
        "reasons_to_avoid": [
            {
                "reason": "Cold Weather",
                "details": "January temperatures often drop below freezing (-4 to 2°C), requiring warm winter clothing for outdoor sightseeing on cobblestone streets."
            },
            {
                "reason": "Limited Daylight",
                "details": "Short winter days with only 8-9 hours of daylight can affect outdoor activity timing and photography opportunities."
            },
            {
                "reason": "Post-Holiday Closures",
                "details": "Some attractions and restaurants may have limited hours after New Year's celebrations, especially on January 1st."
            }
        ],
        "weather": {
            "temperature_range": "-4°C to 2°C (25°F to 36°F)",
            "rainfall": "Low",
            "snow": "Common",
            "daylight_hours": "8-9 hours"
        },
        "activities": [
            "UNESCO site exploration (Holy Trinity Column)",
            "Traditional Czech pub experiences",
            "Winter photography of Baroque architecture",
            "Church concerts at St. Maurice Church",
            "Cozy café culture in historic center",
            "University campus tours",
            "Museum and gallery visits",
            "Historic church tours"
        ]
    }
}