{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Peak Weather",
                "details": "June offers the best weather conditions (15-24°C) with warm temperatures and minimal rainfall, perfect for exploring the historic center."
            },
            {
                "reason": "Longest Days",
                "details": "Longest days of the year provide maximum daylight for sightseeing and photography of the UNESCO World Heritage Holy Trinity Column and Baroque architecture."
            },
            {
                "reason": "Festival of Songs",
                "details": "International choir festival with classical music performances in historic venues like St. Maurice Church and the Archbishop's Palace."
            },
            {
                "reason": "Perfect for Romance",
                "details": "Warm evenings and beautiful sunset lighting make June ideal for couples exploring the romantic Baroque architecture and historic squares."
            },
            {
                "reason": "Rosarium Peak Bloom",
                "details": "The second largest rose garden in Czech Republic (4,500 rose bushes) reaches spectacular peak bloom, creating unforgettable photo opportunities."
            }
        ],
        "reasons_to_avoid": [
            {
                "reason": "Peak Crowds",
                "details": "June is one of the busiest months with long lines at popular attractions, especially around the Holy Trinity Column and Upper Square."
            },
            {
                "reason": "Highest Prices",
                "details": "Peak season pricing for accommodations, dining, and activities, with higher rates than shoulder seasons."
            },
            {
                "reason": "Advance Booking Required",
                "details": "Popular restaurants and attractions require reservations well in advance, especially during the Festival of Songs period."
            },
            {
                "reason": "Festival Crowds",
                "details": "The Festival of Songs attracts international visitors, creating additional crowds in the historic center and cultural venues."
            }
        ],
        "weather": {
            "temperature_range": "15°C to 24°C (59°F to 75°F)",
            "rainfall": "Low-Moderate",
            "snow": "None",
            "daylight_hours": "16-17 hours"
        },
        "activities": [
            "Festival of Songs concerts",
            "Rosarium visits and photography",
            "UNESCO site exploration",
            "Beer garden culture",
            "Romantic evening walks in historic center",
            "Baroque architecture photography",
            "University campus tours",
            "Outdoor dining on terraces"
        ]
    }
}