{
  "overview_paragraph": "Rennes is at its best in spring (April–June) and early fall (September–October), when café terraces buzz around Place de la Mairie and the medieval quarter, the Parliament of Brittany glows with seasonal light, and touring weather is ideal. July brings long evenings and vibrant festivals—including the famous Les Transmusicales music festival—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days at the Musée des Beaux-Arts, local Breton restaurant stops, and twinkling holiday lights around the ancient half-timbered houses—while March begins to warm with the odd Breton shower and blooming trees around the historic squares.",
  "January": [
    "Parliament of Brittany without the crowds, steaming Breton cider, and misty walks between cozy local shops around the medieval quarter.",
    "Winter light on the half-timbered façades, snug Breton restaurants in the historic quarter, and vintage hunts in Les Lices market."
  ],
  "February": [
    "Historic quarter at golden hour, romantic views from the cathedral towers, and traditional Breton music nights in local venues.",
    "Shared local Breton specialties, candlelit restaurants, and strolls past secret squares in the Old Town."
  ],
  "March": [
    "First wildflowers in the Thabor gardens, terrace tables returning around Place de la Mairie, and royal heritage bookshop wanders.",
    "Morning crêpes, museum afternoons at the Musée des Beaux-Arts, and blue-hour walks welcoming spring back to Rennes."
  ],
  "April": [
    "Spring blooms throughout the Thabor gardens, flaky Breton pastries, and walks from Place de la Mairie to the medieval quarter.",
    "Spring light on the Parliament building, gallery-hopping in the Musée des Beaux-Arts, sunset views over the ancient half-timbered rooftops."
  ],
  "May": [
    "Picnics in the Thabor gardens, markets brimming with Breton color, and twilight strolls around Place de la Mairie.",
    "Flowered promenades around the cathedral square, open-air café moments along the main square, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, Breton cider aperitifs, and the city humming for the Festival des Tombées de la Nuit.",
    "Sun-splashed walking trails around the medieval quarter, garden picnics, and late sunsets that turn every half-timbered viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over the Parliament, lazy afternoons exploring the Les Transmusicales festival, and moonlit medieval architecture walks.",
    "Summer markets, outdoor terraces, and museum cool-downs between sun-bright wanderings around the ancient sites."
  ],
  "August": [
    "Quiet Thabor garden trails, easy museum days at the Musée des Beaux-Arts, and peaceful evenings with Breton breezes through the historic squares.",
    "Shaded Thabor gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits at the Musée des Beaux-Arts, lively terraces, and Breton cider-tinted evenings in Place de la Mairie.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering through the medieval quarter irresistible."
  ],
  "October": [
    "Autumn colors throughout the Breton countryside, restaurants aglow, and the local harvest festival in the historic squares.",
    "Cinnamon-spiced stalls, museum hideaways at the Musée des Beaux-Arts, and sunset tones warming the half-timbered architecture views."
  ],
  "November": [
    "Local Breton cider toasts, cozy Breton restaurants, and Musée des Beaux-Arts afternoons while the city slows to a hush.",
    "Foggy Breton mornings, Breton cuisine indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Parliament lights, Christmas markets, and strolling beneath grand half-timbered façades.",
    "Vin chaud in hand, cathedral bells at Saint-Pierre, and winter sparkle from city center to the medieval quarter."
  ]
}

