{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Vappu (May Day) Celebrations",
                "details": "Experience Finland's unique and massive Vappu celebration (April 30th eve & May 1st). Witness the student cap-placing ceremony, enjoy picnics in Kaivopuisto, and soak up the carnival atmosphere."
            },
            {
                "reason": "Beautiful Spring Awakening & Blooms",
                "details": "May brings true spring to Helsinki (average highs ~15°C/59°F). Parks turn green, flowers bloom (especially tulips in parks, cherry blossoms in Roihuvuori), and daylight hours rapidly lengthen."
            },
            {
                "reason": "Outdoor Terraces ('Terassit') Open",
                "details": "Enjoy the return of outdoor seating at cafes and restaurants across the city. Sip coffee on Esplanadi or enjoy drinks by the sea as terrace season kicks off."
            },
            {
                "reason": "Archipelago Starts Opening Up",
                "details": "Ferry services to Suomenlinna are frequent, and services to recreational islands like Pihlajasaari often begin, allowing for early summer island exploration."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds (Mostly)",
                "details": "Outside the very busy Vappu period, May offers pleasant weather with fewer tourists and potentially better prices than peak summer, ideal for museums and sightseeing."
            },
            {
                "reason": "Ideal for Walking & Cycling",
                "details": "With improving weather and longer days, May is great for exploring Helsinki's parks, coastline, and different neighborhoods on foot or by city bike."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Vappu Crowds, Closures & Prices",
                "details": "Vappu (April 30th eve & May 1st) brings enormous crowds, especially downtown and in Kaivopuisto. Accommodation prices soar, and many shops/services close on May 1st."
            },
            {
                "reason": "Highly Variable Spring Weather",
                "details": "May weather is unpredictable. While often pleasant, expect potential cold snaps, rain, and wind. Pack layers, including waterproofs."
            },
            {
                "reason": "May 1st (Vappu) Holiday Closures",
                "details": "May 1st is a major public holiday with widespread closures (shops, Alko, banks, many museums). Public transport runs on a Sunday schedule."
            },
            {
                "reason": "Ascension Day Holiday (Potential)",
                "details": "Ascension Day (Helatorstai) often falls in May (date varies). This public holiday creates a long weekend, increasing local travel and causing shop closures."
            },
            {
                "reason": "Pollen Season Begins",
                "details": "Birch pollen season often peaks in May, significantly affecting allergy sufferers."
            },
            {
                "reason": "Sea Still Cold",
                "details": "While islands become accessible, the Baltic Sea remains very cold for swimming."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "14°C (57°F)",
                    "low": "4°C (39°F)"
                },
                "precipitation": "Variable spring weather. Mix of sun, cloud, and showers likely. Nights can still be cold. Daylight hours increase rapidly.",
                "general_tips": "Layers are key: T-shirts, sweaters/fleece, waterproof/windproof jacket. Comfortable walking shoes. Sunglasses. Allergy medication if needed. Be prepared for Vappu festivities/closures."
            },
            "tourism_level": {
                "crowds": "Extremely high around April 30th/May 1st (Vappu). Moderate otherwise, increasing week by week. Shoulder season feel outside Vappu.",
                "pricing": "Peak prices for Vappu weekend (book months ahead). Shoulder/High season prices otherwise, increasing from April.",
                "overall_atmosphere": "Dominated by Vappu celebrations early on. Afterwards, a city bursting into spring green, lively terraces, and growing optimism for summer."
            },
            "events_holidays": [
                {
                    "name": "Vappu Eve (Vappuaatto)",
                    "date": "April 30th Evening",
                    "description": "Main event is the Havis Amanda statue capping ceremony near Market Square, attracting huge crowds. Student celebrations throughout the city.",
                    "notes": "City center extremely crowded. Plan movement accordingly. Festive, noisy atmosphere."
                },
                {
                    "name": "Vappu / May Day (Vappupäivä)",
                    "date": "May 1",
                    "description": "Public holiday. Traditional picnic day, especially massive gathering in Kaivopuisto park. Political marches also occur.",
                    "notes": "Widespread closures (shops, Alko, banks). Public transport on Sunday schedule. Kaivopuisto is packed."
                },
                {
                    "name": "Mother's Day (Äitienpäivä)",
                    "date": "Second Sunday in May",
                    "description": "Family-oriented day. Many restaurants offer special brunches/menus.",
                    "notes": "Book restaurants well in advance if planning a special meal."
                },
                 {
                    "name": "Ascension Day (Helatorstai) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often early/mid May)",
                    "description": "Public holiday.",
                    "notes": "Verify date. Widespread shop closures."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Vappu Celebrations",
                    "where": "Market Square area (April 30th eve), Kaivopuisto Park (May 1st)",
                    "description": "Witness the unique Finnish May Day traditions: student cap ceremony, massive picnic gatherings, balloons, streamers, festive food & drink (like 'sima' and 'tippaleipä').",
                    "practical_tips": "Be prepared for huge crowds and potential transport detours. Embrace the party atmosphere. May 1st picnic is weather-dependent but happens regardless!",
                    "best_time": "April 30th evening & May 1st daytime",
                    "estimated_cost": "Free (observing), Low-Moderate (picnic supplies/street food)",
                    "weather_dependent": true
                },
                {
                    "activity": "See Cherry Blossoms in Roihuvuori",
                    "where": "Roihuvuori district (Japanese Garden area)",
                    "description": "Visit the Roihuvuori Cherry Tree Park ('Kirsikkapuisto') during its brief but beautiful blooming period (timing varies, usually early/mid May).",
                    "practical_tips": "Check local reports/social media for peak bloom status ('Hanami'). Accessible by metro/bus. Can get crowded during peak bloom weekends.",
                    "best_time": "Peak bloom days (usually early May)",
                    "estimated_cost": "Free (park), Low (transport)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Explore Suomenlinna Sea Fortress",
                    "where": "Island accessible by HSL ferry",
                    "description": "Visit the UNESCO site as spring arrives. Explore the grounds, museums, and enjoy the sea air as more services open up.",
                    "practical_tips": "Ferry runs frequently. Wear comfortable shoes. Pack layers.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (ferry fare) to Moderate (museums)",
                    "weather_dependent": true
                 },
                {
                    "activity": "Enjoy Coffee on an Esplanadi Terrace",
                    "where": "Esplanadi Park, City Center",
                    "description": "Sit at an outdoor cafe along the Esplanadi boulevard, enjoy the spring sunshine (hopefully!), and watch the city come back to life.",
                    "practical_tips": "Iconic Helsinki experience. Can be pricey but great atmosphere.",
                    "best_time": "Sunny afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "16°C (61°F)",
                    "low": "6°C (43°F)"
                },
                "precipitation": "Often brings more stable and pleasant spring weather, but still variable. Good chance of sunny days. Daylight hours are very long.",
                "general_tips": "Layers still recommended, but focus shifts more towards lighter spring wear. Waterproof jacket always wise. Sunscreen needed."
            },
            "tourism_level": {
                "crowds": "High season building. Noticeably busier than early May (post-Vappu), but quieter than July/August.",
                "pricing": "High season prices generally apply. Book popular attractions/tours in advance.",
                "overall_atmosphere": "Beautiful late spring. City is green and vibrant. Long evenings encourage outdoor activities. Great time for exploring before peak summer."
            },
            "events_holidays": [
                 {
                    "name": "Helsinki City Running Day (Potential - Check Dates)",
                    "date": "Usually a Saturday in mid/late May",
                    "description": "Major running event featuring marathon, half-marathon, and shorter distances. Affects traffic and brings many participants to the city.",
                    "notes": "Check exact date. Expect road closures and crowds near route/finish line (Olympic Stadium area)."
                 },
                 {
                    "name": "Ascension Day (Helatorstai) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often mid/late May)",
                    "description": "Public holiday.",
                    "notes": "Verify date. Widespread shop closures."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Seurasaari Open-Air Museum",
                    "where": "Seurasaari Island",
                    "description": "Explore historic wooden buildings relocated from around Finland in a beautiful island setting. Opens fully for the summer season usually in May.",
                    "practical_tips": "Accessible by bus then footbridge. Allow several hours. Cafe on site. Check opening times for buildings.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Pihlajasaari Island",
                    "where": "Island south of Helsinki, ferry from Merisatama/Ruoholahti",
                    "description": "Take a ferry to this popular recreational island known for its beaches, rocks, nature trails, and old villas. Great for picnics.",
                    "practical_tips": "Check ferry schedule (usually starts mid/late May). Bring own food/drinks or use island cafe/restaurant (check opening). Swimwear if brave!",
                    "best_time": "Sunny day, allow half a day",
                    "estimated_cost": "Moderate (ferry fare)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Cycle Along Helsinki's Coastline",
                    "where": "Various routes (e.g., towards Lauttasaari or East Helsinki)",
                    "description": "Rent a city bike or personal bike and explore the scenic coastal paths, enjoying the fresh air and long daylight hours.",
                    "practical_tips": "City bike system (HSL) is easy to use. Many dedicated bike paths. Plan route beforehand.",
                    "best_time": "Daytime or Early Evening",
                    "estimated_cost": "Low (city bike rental) to Moderate (private rental)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Day Trip to Nuuksio National Park",
                    "where": "Espoo (accessible by bus)",
                    "description": "Hike trails through forests and around lakes in this beautiful national park near Helsinki as paths become drier.",
                    "practical_tips": "Take bus to Haltia Nature Centre or trailheads. Wear good walking shoes. Bring water/snacks. Check bus schedules.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport fare)",
                    "weather_dependent": true
                 }
            ]
        }
    }
}