{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May often brings pleasant, mild spring weather (avg highs ~19°C/66°F) and significantly longer daylight hours, ideal for comfortable sightseeing and outdoor activities."
            },
            {
                "reason": "City in Full Bloom",
                "details": "Experience Zurich adorned with vibrant spring flowers. Parks like Belvoirpark, Rieterpark, and the Botanical Garden showcase rhododendrons, irises, roses, and lush greenery."
            },
            {
                "reason": "Outdoor Cafes & Lakeside Life",
                "details": "Outdoor seating at cafes and restaurants ('Gartenwirtschaft') becomes widespread. Enjoy drinks or meals by the lake or in sunny squares as the city embraces warmer days."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "Enjoy Zurich with fewer tourists than in the peak summer months (July/August), offering a more relaxed experience at popular sites."
            },
            {
                "reason": "Ideal Hiking & Cycling Conditions",
                "details": "Temperatures are generally perfect for hiking on Uetliberg mountain or cycling along the lake and rivers before the summer heat sets in."
            },
            {
                "reason": "Lake Navigation in Full Swing",
                "details": "Lake Zurich boat companies operate their full spring/summer schedules, offering frequent and scenic trips to various destinations along the lake."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather ('Eisheiligen')",
                "details": "May can still be unpredictable. The 'Ice Saints' ('Eisheiligen') period mid-month can bring sudden cold snaps. Rain showers and cooler days are still possible."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks a noticeable increase in tourism. Expect more people at attractions and rising prices for flights and accommodation compared to early spring."
            },
            {
                "reason": "Public Holidays Impact",
                "details": "May 1st (Labour Day), Ascension Day (Kristi Himmelfahrt - variable), and potentially Whit Monday (Pfingstmontag - variable) are public holidays with widespread shop closures."
            },
            {
                "reason": "Pollen Season Peaks",
                "details": "Grass pollen counts are typically high in May, which can significantly affect allergy sufferers."
            },
            {
                "reason": "Lake Water Still Cool",
                "details": "While inviting, Lake Zurich's water temperature is usually still quite cold for swimming in May."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "8°C (46°F)"
                },
                "precipitation": "Mix of sunny spring days and potential rain showers. The 'Ice Saints' ('Eisheiligen', roughly May 11-15) can bring a noticeable cold snap.",
                "general_tips": "Pack layers: t-shirts, sweaters, a light to medium-weight jacket (waterproof recommended), comfortable walking shoes. Sunscreen and sunglasses needed for sunny days. Allergy medication if needed."
            },
            "tourism_level": {
                "crowds": "Moderate and increasing. Busy around May 1st holiday. Shoulder season feel.",
                "pricing": "Shoulder/High season prices. Book ahead, especially if traveling around May 1st or Ascension Day (if early).",
                "overall_atmosphere": "Vibrant spring awakening. Parks are lush, flowers blooming. Outdoor life returns noticeably. May 1st sees closures and demonstrations."
            },
            "events_holidays": [
                {
                    "name": "Labour Day (Tag der Arbeit)",
                    "date": "May 1",
                    "description": "Public holiday. Characterized by demonstrations and marches, mainly in the city center. Widespread closures of shops, banks, etc.",
                    "notes": "Expect transport disruptions in central areas. Most museums/attractions usually open, but check hours."
                },
                 {
                    "name": "FOOD ZURICH (Potential Overlap/Start)",
                    "date": "Often late May / early June (check specific dates)",
                    "description": "City-wide food festival potentially starting mid-late May. Check program for special menus, workshops, street food, markets.",
                    "notes": "Requires checking the official program for exact dates and booking if necessary."
                 },
                 {
                    "name": "Ascension Day (Auffahrt/Kristi Himmelfahrt)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday creating a long weekend. Shops closed.",
                    "notes": "Check date for the year. Increased domestic travel. Attractions generally open."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Parks in Bloom",
                    "where": "Belvoirpark, Rieterpark, Botanical Garden (University)",
                    "description": "Witness Zurich's parks at their most beautiful with rhododendrons, irises, and other spring flowers in full display.",
                    "practical_tips": "Ideal for walks and picnics. Check opening times for Botanical Garden greenhouses.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (parks) - Low (Bot. Garden potential fees)",
                    "weather_dependent": true
                },
                {
                    "activity": "Hike or Train up Uetliberg",
                    "where": "Zurich's local mountain",
                    "description": "Enjoy pleasant temperatures for hiking the trails or take the S10 train for stunning panoramic views over the city, lake, and Alps.",
                    "practical_tips": "Wear comfortable shoes. Bring layers as it can be cooler/windier at the top. Check weather forecast for visibility.",
                    "best_time": "Daytime, clearer days",
                    "estimated_cost": "Low (train ticket or free if hiking)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Enjoy Outdoor Cafes ('Gartenwirtschaft')",
                    "where": "Various locations: Old Town squares, lakeside, neighborhood cafes",
                    "description": "Soak up the spring sunshine with coffee, cake, or a light meal at one of the many outdoor seating areas.",
                    "practical_tips": "Many places offer blankets if it's slightly cool. Great for people-watching.",
                    "best_time": "Lunchtime or Afternoon on a sunny day",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                 },
                {
                    "activity": "Visit the Kunsthaus Zürich",
                    "where": "Heimplatz",
                    "description": "Explore Zurich's major art museum, housing significant collections from the Middle Ages to contemporary works, including Impressionists and Swiss artists.",
                    "practical_tips": "Good option for a cooler or rainy day. Allow several hours. Check opening hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "20°C (68°F)",
                    "low": "10°C (50°F)"
                },
                "precipitation": "Generally more stable and warmer than early May, with plenty of sunshine, but afternoon showers or thunderstorms remain possible.",
                "general_tips": "Focus on lighter clothing but keep layers (sweater/light jacket) for evenings or cooler days. Sun protection is essential."
            },
            "tourism_level": {
                "crowds": "High season approaching rapidly. Noticeably busy, especially on weekends and around holidays like Ascension or Whit Monday (if late).",
                "pricing": "High season prices generally apply. Book well in advance.",
                "overall_atmosphere": "Beautiful late spring/early summer feel. Ideal weather for most outdoor activities. City is vibrant and green."
            },
            "events_holidays": [
                 {
                    "name": "Cycle Week Zurich (Potential Timing)",
                    "date": "Usually mid/late May (check exact dates)",
                    "description": "Festival celebrating cycling culture with exhibitions, workshops, races, and events, often around Europaallee or Landiwiese.",
                    "notes": "Check official Cycle Week program for locations and schedule."
                 },
                 {
                    "name": "Whit Monday (Pfingstmontag) (Potential Timing)",
                    "date": "Varies (50 days after Easter - often late May/early June)",
                    "description": "Public holiday. Widespread shop closures.",
                    "notes": "Check date for the year. Attractions usually open, but confirm hours."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Lake Zurich Boat Trip",
                    "where": "Departing from Bürkliplatz",
                    "description": "Take a scenic cruise on the lake, enjoying the pleasant weather and views. Choose from short round trips or longer journeys (e.g., to Rapperswil).",
                    "practical_tips": "Check ZSG timetable. Weekends can be busy. Bring sunscreen/hat.",
                    "best_time": "Daytime or early evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Cycle Along Lake Zurich or the Limmat River",
                    "where": "Designated paths along the lake or river",
                    "description": "Rent a bike and enjoy the scenic, mostly flat paths along the water in comfortable spring temperatures.",
                    "practical_tips": "Bike rental shops available, or use city bike schemes if running. Follow marked cycle paths.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (bike rental)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Lindt Home of Chocolate",
                    "where": "Kilchberg (short train/boat ride)",
                    "description": "Explore the world of Swiss chocolate at the interactive museum, featuring a giant chocolate fountain and tasting opportunities.",
                    "practical_tips": "Book tickets online in advance, including time slot. Easily accessible by S-Bahn or boat.",
                    "best_time": "Anytime during opening hours",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Explore the Old Town & Lindenhof Views",
                    "where": "Altstadt, Lindenhof hill",
                    "description": "Wander through the historic streets and climb Lindenhof hill for panoramic views over the Limmat river and Old Town rooftops in the pleasant May light.",
                    "practical_tips": "Lindenhof is a relaxing spot with benches. Wear comfortable shoes.",
                    "best_time": "Daytime or early evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 }
            ]
        }
    }
}