{
    "July": {
        "reasons_to_visit": [
            {
                "reason": "Galway International Arts Festival (GIAF)",
                "details": "July is dominated by GIAF, one of Europe's leading arts festivals. The city transforms with theatre, music, visual arts, comedy, and street spectacle from Irish and international artists."
            },
            {
                "reason": "Peak Summer Weather & Long Daylight",
                "details": "July generally offers Galway's best weather (average highs 19-20°C) with very long daylight hours (sunset after 9:30 PM), ideal for exploring the city, Connemara, and the islands."
            },
            {
                "reason": "Galway Film Fleadh",
                "details": "Often held in early/mid-July, this internationally renowned film festival showcases Irish and international cinema, attracting filmmakers and movie buffs."
            },
            {
                "reason": "Vibrant City Atmosphere & Street Life",
                "details": "The city buzzes with energy, amplified by GIAF. Street performers, bustling pubs spilling outdoors, and a palpable festive spirit fill the Latin Quarter and beyond."
            },
            {
                "reason": "Ideal for Aran Islands & Connemara",
                "details": "Prime time for ferry trips to the Aran Islands (Inis Mor, Inis Meain, Inis Oirr) and exploring the stunning landscapes of Connemara National Park under (hopefully) favourable weather."
            },
            {
                "reason": "Galway Races Build-Up (Late July)",
                "details": "Towards the end of July, the excitement builds for the famous Galway Races Summer Festival (often starting last Monday of July), adding another layer of buzz (and crowds)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Extreme Crowds & Peak Prices",
                "details": "July, especially during GIAF and leading into the Races, is Galway's busiest time. Expect maximum crowds everywhere and the highest prices for accommodation. Booking *months* in advance is non-negotiable."
            },
            {
                "reason": "Accommodation Scarcity",
                "details": "Finding accommodation, particularly during GIAF, can be extremely difficult and expensive if not booked very far ahead."
            },
            {
                "reason": "Atlantic Showers Still Likely",
                "details": "Despite being summer, rain showers blown in from the Atlantic are always possible. Pack layers and waterproofs – don't assume constant sunshine."
            },
            {
                "reason": "Everything Needs Booking",
                "details": "Beyond accommodation, popular restaurants, tours (Aran Islands, Connemara), and GIAF events require advance booking to avoid disappointment."
            }
        ],
        "first_half": {
            "date_range": "July 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "12°C"
                },
                "precipitation": "Mix of sunny spells and potential showers (average monthly rainfall ~70-80mm). Long daylight hours are a major plus.",
                "general_tips": "Pack light summer clothes but include layers (fleece/sweater) and a reliable waterproof jacket. Sunscreen/sunglasses essential. Comfortable walking shoes vital."
            },
            "tourism_level": {
                "crowds": "Extremely High, especially if GIAF or Film Fleadh are running. City centre, Salthill, popular pubs, and day trip destinations are packed.",
                "pricing": "Peak season prices for everything. Accommodation requires booking many months prior.",
                "overall_atmosphere": "Electric and vibrant, especially during festival periods. Buzzing with arts, culture, and summer holidaymakers. Great energy but can feel intense."
            },
            "events_holidays": [
                {
                    "name": "Galway International Arts Festival (GIAF) Starts/Ongoing",
                    "date": "Usually mid-July (check exact dates)",
                    "description": "Major international arts festival filling the city with theatre, music, visual arts, street performances, talks, and comedy in various venues and outdoors.",
                    "notes": "Check GIAF website for program and book tickets for popular shows *well* in advance. Many free street events too."
                },
                {
                    "name": "Galway Film Fleadh",
                    "date": "Usually early/mid-July (check dates)",
                    "description": "Ireland's leading film festival featuring premieres, screenings of Irish and international films, workshops, and industry events.",
                    "notes": "Check Film Fleadh website for schedule and tickets. Attracts film lovers and professionals."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend a GIAF Event",
                    "where": "Various venues (Festival Big Top, Town Hall Theatre, street corners)",
                    "description": "Immerse yourself in the festival. Catch a world-class theatre production, a major concert in the Big Top, browse art exhibitions, or enjoy free street spectacles.",
                    "practical_tips": "Study the program online. Book ticketed events ASAP. Plan travel between venues. Enjoy the unexpected street performances.",
                    "best_time": "Throughout GIAF (check schedule)",
                    "estimated_cost": "Varies (Free street events to High for major concerts/theatre)",
                    "weather_dependent": "Varies (indoor/outdoor venues)"
                },
                {
                    "activity": "Day Trip to Inis Mor (Aran Islands)",
                    "where": "Ferry from Rossaveal (bus connection from city)",
                    "description": "Explore the largest Aran Island. Rent a bike or take a tour to see the prehistoric Dun Aonghasa fort perched on cliffs, the unique limestone landscape, and experience island culture.",
                    "practical_tips": "Book ferry and connecting bus tickets *well* in advance. Allow a full day. Bring layers, sunscreen, cash. Bike rental popular.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate/High (ferry + bike/tour)",
                    "weather_dependent": true
                },
                {
                    "activity": "Soak up the Atmosphere in the Latin Quarter",
                    "where": "Galway City Centre",
                    "description": "Wander the bustling medieval streets, listen to buskers, browse unique shops, and enjoy a drink or meal at a pub or restaurant with outdoor seating.",
                    "practical_tips": "Extremely busy, especially evenings and during festivals. Enjoy the energy.",
                    "best_time": "Anytime (esp. Afternoon/Evening)",
                    "estimated_cost": "Free (wandering) + Costs for food/drink/shopping",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk the Salthill Promenade",
                    "where": "Salthill (Walk/Bus from city)",
                    "description": "Enjoy a walk along the famous Prom overlooking Galway Bay. Brave a dip at Blackrock Diving Tower or just enjoy the sea air and views.",
                    "practical_tips": "Can get crowded on sunny days. Cafes and amusements nearby. Remember to 'kick the wall'.",
                    "best_time": "Sunny Afternoon / Long Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "July 16–31",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "13°C"
                },
                "precipitation": "Similar conditions: warm potential, sunshine mixed with possible showers. Evenings remain very long.",
                "general_tips": "Summer gear plus rain protection. Stay hydrated. Book everything."
            },
            "tourism_level": {
                "crowds": "Peak Intensity. GIAF often runs into this period, and the build-up to/start of Galway Races (late July) makes it exceptionally busy.",
                "pricing": "Highest of the year. Last-minute options virtually non-existent for accommodation.",
                "overall_atmosphere": "Maximum summer buzz, festival fever transitioning into racing excitement. Extremely lively, potentially overwhelming for those seeking quiet."
            },
            "events_holidays": [
                {
                    "name": "Galway International Arts Festival (GIAF) Continues/Concludes",
                    "date": "Usually mid-late July (check dates)",
                    "description": "Continuation of the major arts festival events across the city.",
                    "notes": "Check program for final events. Booking remains essential."
                },
                {
                    "name": "Galway Races Summer Festival (Starts)",
                    "date": "Usually starts last Monday of July (check dates)",
                    "description": "Ireland's biggest horse racing festival begins at Ballybrit racecourse. Expect huge crowds, traffic, and a city-wide party atmosphere.",
                    "notes": "Accommodation booked solid months/year ahead. Transport to racecourse needed. City pubs extremely busy."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip through Connemara National Park",
                    "where": "West of Galway (Car/Bus Tour)",
                    "description": "Explore the stunning landscapes of mountains, lakes, and bogs. Visit Kylemore Abbey, hike Diamond Hill (weather permitting), or stop in charming villages like Clifden.",
                    "practical_tips": "Book bus tours well in advance or rent a car. Allow a full day. Pack layers as mountain weather changes fast. Bring snacks/water.",
                    "best_time": "Full Day",
                    "estimated_cost": "Budget (fuel/bus) / Moderate (tour + entries)",
                    "weather_dependent": true
                },
                {
                    "activity": "Experience the Galway Races Buzz (Even without attending)",
                    "where": "Galway City Centre pubs & streets",
                    "description": "If Races Week begins, the city itself is electric. Enjoy the atmosphere in pubs, see the racegoers dressed up, and soak in the unique excitement.",
                    "practical_tips": "Be prepared for extreme crowds in pubs and restaurants. Book dining reservations far ahead.",
                    "best_time": "Late July (if Races start)",
                    "estimated_cost": "Varies (Free to observe - High for dining/drinks)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit the Spanish Arch & Galway City Museum",
                    "where": "Spanish Arch area",
                    "description": "See the historic arch remnant and visit the adjacent museum covering Galway's history and heritage. Good brief indoor/outdoor combination.",
                    "practical_tips": "Museum is free. Can be crowded but offers respite from sun/rain. Check museum opening times.",
                    "best_time": "Anytime",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Enjoy Street Performers & Buskers",
                    "where": "Shop Street, Quay Street, Latin Quarter",
                    "description": "July brings out numerous talented street performers and musicians. Stop and enjoy the free entertainment that animates the city centre.",
                    "practical_tips": "Have some small change handy if you enjoy a performance and wish to show appreciation. Crowds gather quickly.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "Free (optional tips)",
                    "weather_dependent": true
                }
            ]
        }
    }
}
