{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Longest Days & Pleasant Weather",
                "details": "June boasts the longest daylight hours (sunset after 9:30 PM) and often brings mild, pleasant weather (average highs 17-19°C), ideal for exploring Galway, Connemara, and the Aran Islands."
            },
            {
                "reason": "Start of Summer Buzz in the City",
                "details": "Galway truly comes alive in June. The Latin Quarter bustles, pubs and cafes spill onto the streets, and there's a vibrant energy as the main tourist season kicks off."
            },
            {
                "reason": "Ideal for Exploring Connemara & Aran Islands",
                "details": "With better weather and long days, June is perfect for day trips to the stunning landscapes of Connemara National Park or taking a ferry to the Aran Islands (Inis Mor, etc.)."
            },
            {
                "reason": "Outdoor Activities & Salthill Prom",
                "details": "Enjoy walks along the famous Salthill Promenade, kayaking or paddleboarding in Galway Bay, cycling routes, or simply relaxing outdoors when the sun shines."
            },
            {
                "reason": "Shoulder Season Advantages (Early June)",
                "details": "Early June, especially before schools finish, can offer slightly fewer crowds and potentially better availability than July/August, while still having great weather potential."
            },
            {
                "reason": "Potential Local Festivals & Events",
                "details": "Check local listings for smaller community festivals, regattas (e.g., in Kinvara), music events, or markets that often take place in June before the major July festivals."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Beginning of Peak Tourist Season & Crowds",
                "details": "Visitor numbers rise significantly in June, especially around the Bank Holiday weekend. Expect busier streets, attractions, and popular pubs."
            },
            {
                "reason": "Increasing Accommodation Prices & Booking Essential",
                "details": "Prices for hotels and B&Bs climb towards peak rates. Availability tightens, particularly for the Bank Holiday weekend. Book well in advance."
            },
            {
                "reason": "Unpredictable Atlantic Weather",
                "details": "While often pleasant, June in Galway can still deliver rain showers and windy days blowing in from the Atlantic. Packing layers and waterproofs remains essential."
            },
            {
                "reason": "Bank Holiday Congestion",
                "details": "The June Bank Holiday weekend (first weekend) sees very busy roads, packed pubs and restaurants, and high demand for tours and attractions."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "18°C",
                    "low": "10°C"
                },
                "precipitation": "Moderate chance of showers, but often brighter and drier spells compared to spring (average ~60-70mm for month). Very long daylight hours.",
                "general_tips": "Pack layers: t-shirts, fleece/light sweater, reliable waterproof jacket. Comfortable walking shoes vital. Sunscreen/sunglasses for sunny days. Umbrella useful."
            },
            "tourism_level": {
                "crowds": "Moderate to High, peaking during the June Bank Holiday weekend. City centre, Salthill, and popular tours get busy.",
                "pricing": "Shoulder to Peak season prices. Bank Holiday weekend commands premium rates. Book accommodation far ahead, especially for this weekend.",
                "overall_atmosphere": "Lively and optimistic start to summer. Buzz around the Bank Holiday. Outdoor spaces like Eyre Square and Salthill Prom become popular hubs."
            },
            "events_holidays": [
                {
                    "name": "June Bank Holiday",
                    "date": "First Monday in June",
                    "description": "Public holiday, marks the unofficial start of summer. Expect significant crowds in Galway and surrounding tourist spots (Connemara, Cliffs of Moher).",
                    "notes": "Plan travel and book tours/restaurants well in advance for this weekend."
                },
                {
                    "name": "Local Community Festivals/Events",
                    "date": "Check local listings (Galway Advertiser, Galway Tourism)",
                    "description": "Smaller events, markets, or music sessions may occur, especially around the Bank Holiday.",
                    "notes": "Look out for posters or check local media."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to Inis Mor (Aran Islands)",
                    "where": "Ferry from Rossaveal (bus connection)",
                    "description": "Explore the largest Aran Island under long daylight hours. Rent a bike, visit Dun Aonghasa fort, enjoy the unique landscape.",
                    "practical_tips": "Book ferry and connecting bus *well* in advance, especially for Bank Holiday weekend. Bring layers, sunscreen, water, cash.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate/High (ferry + bike/tour)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore the Latin Quarter & West End",
                    "where": "Galway City Centre",
                    "description": "Wander through the vibrant medieval streets, browse the unique shops (bookshops, crafts, Claddagh rings), soak up the atmosphere.",
                    "practical_tips": "Enjoy the street performers often present in June. Stop for a coffee or pint at an outdoor table.",
                    "best_time": "Anytime (esp. afternoon/evening)",
                    "estimated_cost": "Free (wandering) + food/drink/shopping",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Cycle the Salthill Promenade",
                    "where": "Salthill",
                    "description": "Enjoy the famous 2km walk along Galway Bay with views towards the Burren. Kick the wall at the end!",
                    "practical_tips": "Can rent bikes nearby. Cafes, pubs, and amusements along the way. Can be busy on sunny days.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "Free (walking) / Budget (bike rental)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Cruise on Lough Corrib",
                    "where": "Departs Woodquay (City Centre) or Oughterard",
                    "description": "Take a scenic boat trip on Ireland's largest lake. Options include visiting Inchagoill Island with its monastic ruins.",
                    "practical_tips": "Check Corrib Princess or other operators for schedules. Book in advance, especially weekends. Offers different perspective near the city.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "11°C"
                },
                "precipitation": "Similar weather pattern, mix of sun and potential showers. Evenings stay bright very late.",
                "general_tips": "Continue with layers and waterproofs. Make the most of the exceptionally long evenings for walks or pub gardens."
            },
            "tourism_level": {
                "crowds": "High. Tourist season is well underway. Expect significant crowds at popular sites (Cliffs of Moher day trips, Connemara tours).",
                "pricing": "Peak summer prices become standard. Book accommodation and popular tours ASAP.",
                "overall_atmosphere": "Busy summer atmosphere. City is lively, especially evenings. Build-up towards the July festival season begins."
            },
            "events_holidays": [
                 {
                    "name": "Bloomsday (Minor Local Events)",
                    "date": "June 16",
                    "description": "Check local bookshops or literary groups for potential small readings or events celebrating James Joyce's Ulysses.",
                    "notes": "Observance is minor compared to Dublin."
                },
                 {
                    "name": "Potential Start of Early GIAF/Film Fleadh Buzz",
                    "date": "Late June",
                    "description": "Check dates - announcements and early preparations for the major July festivals might begin, adding to the city's buzz.",
                    "notes": "Main events are in July, but anticipation builds."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Day Trip to Connemara National Park",
                    "where": "Letterfrack (Requires Car/Bus Tour)",
                    "description": "Explore the rugged beauty. Hike Diamond Hill for amazing views (weather permitting), visit the visitor centre, drive the scenic loops.",
                    "practical_tips": "Book bus tours in advance or rent a car. Allow a full day. Pack layers, rain gear, sturdy shoes. Weather changes quickly.",
                    "best_time": "Full Day",
                    "estimated_cost": "Budget (fuel/bus) / Moderate (tour + entries like Kylemore Abbey)",
                    "weather_dependent": true
                },
                {
                    "activity": "Enjoy Live Traditional Music",
                    "where": "Pubs in Latin Quarter / West End (e.g., Tigh Coili, The Crane Bar)",
                    "description": "Experience authentic live Irish music sessions, which become more frequent and run longer in summer months.",
                    "practical_tips": "Check pub schedules. Arrive reasonably early (9pm ish) for a seat, especially on weekends. Buy a drink.",
                    "best_time": "Evening (usually from 9:30pm)",
                    "estimated_cost": "Budget (cost of drinks)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Galway Cathedral",
                    "where": "Nun's Island",
                    "description": "Explore the vast interior of Galway's impressive modern cathedral, located scenically by the River Corrib.",
                    "practical_tips": "Check opening times around services. Offers an interesting contrast to older European cathedrals.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free/Donation",
                    "weather_dependent": false
                },
                {
                    "activity": "Sunset Pint Overlooking the Bay",
                    "where": "Pubs in Salthill with sea views (e.g., O'Connor's Famous Pub - check view seats)",
                    "description": "Take advantage of the late sunset (after 9:30 PM) by enjoying a drink with views over Galway Bay as the light fades.",
                    "practical_tips": "Check sunset times. May need to arrive early to get a window seat or spot with a good view. Wrap up if sitting outside.",
                    "best_time": "Evening (around sunset)",
                    "estimated_cost": "Budget/Moderate (cost of drinks)",
                    "weather_dependent": true
                }
            ]
        }
    }
}