{
  "overview_paragraph": "Lyon is at its best in spring (April–June) and early fall (September–October), when café terraces hum around Place Bellecour and Place des Terreaux, the Parc de la Tête d'Or blooms with seasonal flowers, and touring weather is ideal. July brings long evenings and vibrant festivals—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days at Musée des Beaux-Arts, local patisserie stops, and twinkling holiday lights—while March begins to warm with the odd shower and blooming trees around the historic Renaissance squares.",
  "January": [
    "Musée des Beaux-Arts without the lines, steaming French hot chocolate, and misty walks between cozy local shops around Vieux Lyon.",
    "Winter light on Place Bellecour, snug restaurants in the Presqu'île district, and vintage hunts in Les Halles de Lyon Paul Bocuse."
  ],
  "February": [
    "Renaissance quarter at golden hour, romantic views from the Fourvière Basilica tower, and traditional Lyonnais music nights in local venues.",
    "Shared local pastries, candlelit restaurants, and strolls past secret traboules in the Old Town."
  ],
  "March": [
    "First wildflowers in the Parc de la Tête d'Or, terrace tables returning around Place Bellecour, and Lyonnais bookshop wanders.",
    "Morning croissants, museum afternoons, and blue-hour walks welcoming spring back to Lyon."
  ],
  "April": [
    "Spring blooms in the Parc de la Tête d'Or, flaky French pastries, and walks from Place Bellecour to Vieux Lyon.",
    "Spring light on Fourvière Basilica, gallery-hopping in Musée des Beaux-Arts, sunset views over the historic rooftops."
  ],
  "May": [
    "Picnics in the Parc de la Tête d'Or, markets brimming with local color, and twilight strolls around Place Bellecour.",
    "Flowered promenades, open-air café moments along Place des Terreaux, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, Lyonnais aperitifs, and the city humming for Fête de la Musique.",
    "Sun-splashed walking trails, garden picnics, and late sunsets that turn every Fourvière viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over Place Bellecour, lazy afternoons exploring the Rhône-Alpes region, and moonlit Renaissance architecture walks.",
    "Summer markets, outdoor terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet Parc de la Tête d'Or trails, easy museum days, and peaceful evenings with breezes through the historic squares.",
    "Shaded gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits at Musée des Beaux-Arts, lively terraces, and wine-tinted evenings in Place Bellecour.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering through Vieux Lyon irresistible."
  ],
  "October": [
    "Autumn colors in the Parc de la Tête d'Or, restaurants aglow, and the local harvest festival in the historic squares.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the Renaissance architecture views."
  ],
  "November": [
    "Local wine toasts, cozy restaurants, and Musée des Beaux-Arts afternoons while the city slows to a hush.",
    "Foggy Rhône-Alpes mornings, French gastronomy indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Place Bellecour lights, Christmas markets, and strolling beneath grand Renaissance façades.",
    "Vin chaud in hand, basilica bells, and winter sparkle from city center to the Parc de la Tête d'Or."
  ]
}

