{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Ideal Rhine Spring Climate",
                "details": "May offers perfect weather conditions in Cologne with warm, sunny days averaging 17-21°C, minimal rainfall, and pleasant evenings ideal for exploring the Old Town, strolling along the Rhine promenades, and enjoying the city's famous outdoor beer gardens and café culture without summer's crowds or winter's chill."
            },
            {
                "reason": "Botanical Gardens in Full Bloom",
                "details": "The Flora botanical garden reaches peak beauty in May, with historic rose collections, tulips, and rhododendrons creating magnificent displays of color and fragrance. Cologne's extensive parks like Rheinpark and Stadtgarten similarly burst with spring blooms, offering vibrant green spaces within the urban landscape."
            },
            {
                "reason": "Rhine Promenade Culture",
                "details": "May brings ideal conditions for enjoying Cologne's revitalized Rhine River promenades when they come fully alive with outdoor cafés, beer gardens, cultural activities, and locals enjoying the riverside. The views of the Cathedral and Old Town across the water are particularly spectacular in the clear spring light."
            },
            {
                "reason": "Beer Garden Season Peak",
                "details": "May marks the height of Cologne's beer garden season when the city's famous outdoor drinking establishments fully open, offering the perfect setting to enjoy the local Kölsch beer served in traditional small glasses by traditional waiters (Köbes) in atmospheric settings throughout the city."
            },
            {
                "reason": "Pre-Summer Festival Period",
                "details": "May provides a perfect balance between pleasant weather and moderate tourist numbers before the summer festival season begins, allowing for more relaxed experiences at the Cathedral, Old Town, and museums without excessive crowds or the need for extensive advance bookings."
            },
            {
                "reason": "Eifel National Park and Countryside",
                "details": "May offers the ideal opportunity to explore the nearby Eifel National Park with spring hiking trails through beech forests in full leaf, as well as the charming towns along the Rhine with their vineyards in fresh green growth and picturesque historic centers just 30-60 minutes from the city."
            },
            {
                "reason": "Cologne Culinary Awakening",
                "details": "May brings perfect weather for enjoying Cologne's distinctive cuisine on outdoor terraces, from traditional brewery houses in the Old Town to sophisticated riverside restaurants offering Cathedral views, with seasonal specialties featuring fresh spring ingredients from the fertile Rhine Valley."
            },
            {
                "reason": "Day Trip Perfection",
                "details": "May provides ideal conditions for excursions to nearby destinations like Bonn, the former capital, the UNESCO World Heritage Brühl Palaces, the romantic Rhine towns of Königswinter and Linz, and the picturesque Ahr Valley wine region, all at their most beautiful with spring flowers and comfortable temperatures."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Convention Center Activity",
                "details": "As a major European exhibition center, Cologne hosts several significant trade fairs and conventions in May at the Koelnmesse exhibition grounds, which can impact hotel availability and rates, particularly in the Deutz area and city center, requiring earlier booking than other months."
            },
            {
                "reason": "Holiday Weekend Crowds",
                "details": "May contains several German public holidays (Labor Day, Ascension Day, Pentecost) which create long weekends that bring increased domestic tourism to Cologne, particularly around the Cathedral and Old Town, with corresponding rises in accommodation prices and need for restaurant reservations."
            },
            {
                "reason": "Rhine Water Levels",
                "details": "Spring water levels on the Rhine can occasionally affect river cruise schedules or riverside promenade access during May, particularly after heavy rainfall periods in the river's Alpine source regions, though serious flooding is relatively rare in this season."
            },
            {
                "reason": "Variable Spring Weather",
                "details": "While generally reliable, Cologne's Rhineland climate can bring occasional unpredictable weather changes in May, with afternoon thunderstorms possible and temperature differences between sunny and cloudy days requiring adaptable clothing and flexible planning."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "7°C"
                },
                "precipitation": "Moderate rainfall with generally pleasant conditions and occasional brief showers, particularly in afternoons. Increasing sunshine with spring warmth, though temperatures can still vary from day to day.",
                "general_tips": "Light clothing suitable for warm days with layers for cooler evenings. Temperature drops noticeably after sunset requires an extra layer for riverside dining or evening activities. Rain protection recommended for occasional showers. Comfortable walking shoes essential for Cologne's cobblestone streets and riverside promenades."
            },
            "tourism_level": {
                "crowds": "Moderate tourism levels with busier periods around weekends and holidays; major attractions like the Cathedral and Old Town seeing increasing visitor numbers but still manageable, especially on weekdays.",
                "pricing": "Mid-range pricing for accommodations with good availability except during trade fairs at Koelnmesse; advance booking recommended during business events and holiday weekends.",
                "overall_atmosphere": "Pleasantly vibrant with locals and visitors enjoying outdoor lifestyle along the Rhine, in Old Town squares, and at terrace cafés, creating a lively but not overwhelming ambiance typical of Cologne's relaxed character."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Tag der Arbeit)",
                    "date": "May 1",
                    "description": "Public holiday celebrated with demonstrations, cultural events, and many locals enjoying the day off in parks, particularly along the Rhine River and in beer gardens throughout the city.",
                    "notes": "Many businesses and some attractions closed; restaurants typically open but may have special hours; popular day for locals to gather in Rheinpark and Stadtgarten for picnics; public transportation runs on holiday schedule; political demonstrations may occur in central areas."
                },
                {
                    "name": "Cologne Wine Week",
                    "date": "Early May (varies annually)",
                    "description": "Celebration of regional and international wines with tastings, food pairings, and cultural events held in various venues throughout the city, particularly in the Old Town and Belgian Quarter.",
                    "notes": "Focuses on wines from nearby regions like Ahr Valley and Moselle; special wine menus at participating restaurants; wine market typically held at Heumarkt; ticketed tastings require advance booking; provides interesting contrast to Cologne's beer-centric reputation; knowledgeable sommeliers available to guide choices."
                },
                {
                    "name": "Early Summer Festivals",
                    "date": "Various dates in May",
                    "description": "Neighborhood street festivals taking place throughout Cologne's diverse districts, featuring local food, music, and culture with authentic experiences away from main tourist areas.",
                    "notes": "Ehrenfeld, Nippes, and Südstadt neighborhoods known for lively local festivals; dates vary annually and by district; excellent opportunities to experience authentic Cologne culture; food and craft stalls with local specialties; live music typically features local artists; family-friendly atmosphere during daytime with more adult-oriented evening activities."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Cathedral Without Crowds",
                    "where": "Domkloster 4, Old Town",
                    "description": "Experience Cologne's magnificent UNESCO-listed Gothic Cathedral with fewer visitors than summer months, allowing for more contemplative appreciation of its stunning architecture, medieval stained glass windows, and artistic treasures.",
                    "practical_tips": "Morning visits before 10AM offer best interior light and smallest crowds; tower climb (533 steps) most comfortable in the mild May temperatures; treasury requires separate ticket; guided tours available in multiple languages; dress layers as cathedral interior remains cool; south transept exterior particularly beautiful in morning light.",
                    "best_time": "Early morning (8-10AM)",
                    "estimated_cost": "Free for cathedral entry; €6 for tower climb; €6 for treasury",
                    "weather_dependent": false
                },
                {
                    "activity": "Rhine Promenade Stroll",
                    "where": "Both banks of the Rhine River",
                    "description": "Enjoy Cologne's revitalized riverfront promenades in perfect May conditions with the first full month of outdoor café culture, street performers, and locals embracing the riversides with spectacular views of the city skyline and Cathedral.",
                    "practical_tips": "Left bank (Old Town side) most atmospheric in afternoon and evening; right bank (Deutz side) offers classic Cathedral and skyline views perfect for photography; Hohenzollern Bridge covered with love locks connects both sides; several beer gardens and cafés along route; riverside paths stretch for several kilometers in both directions; bicycle rentals available for longer exploration.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "Free for walking; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Museum Ludwig",
                    "where": "Heinrich-Böll-Platz, next to Cathedral",
                    "description": "Visit one of Europe's most important modern art museums featuring outstanding collections of Pop Art, Expressionism, and Picasso works, along with special spring exhibitions in a striking building next to the Cathedral.",
                    "practical_tips": "Thursday evening offers extended hours until 10PM; special exhibitions typically launched in spring season; less crowded weekday mornings; excellent café with Cathedral views; audio guides available in multiple languages; architecture itself noteworthy; perfect indoor option if caught in a spring shower.",
                    "best_time": "Weekday morning or Thursday evening",
                    "estimated_cost": "€13 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Flora Botanical Garden",
                    "where": "Amsterdamer Str. 34",
                    "description": "Experience Cologne's beautiful botanical garden when spring displays reach their peak, with historic glasshouses, magnificent flower beds, themed gardens, and special May exhibitions showcasing seasonal blooms.",
                    "practical_tips": "Free admission makes this exceptional value; historic Palm House especially worth visiting; rose garden approaching peak bloom; small café on premises; easily accessible via tram; special guided themed tours available certain days; botanical photography particularly rewarding during this season; less crowded on weekday mornings.",
                    "best_time": "Morning or late afternoon for best light",
                    "estimated_cost": "Free admission",
                    "weather_dependent": true
                },
                {
                    "activity": "Old Town Brewery Experience",
                    "where": "Altstadt (Old Town)",
                    "description": "Discover Cologne's traditional beer culture when brewery houses (Brauhäuser) fully open their outdoor seating areas, offering authentic experiences of the local Kölsch beer served in the traditional way alongside hearty Rhineland cuisine.",
                    "practical_tips": "Früh, Peters, Gaffel, and Sion are most traditional establishments in Old Town; outdoor seating fills quickly on warm evenings—arrive early or make reservations; servers (Köbes) continue bringing fresh Kölsch until you place coaster on glass; try local specialties like Himmel un Ääd or Halver Hahn; Friday and Saturday evenings particularly lively with mix of locals and visitors.",
                    "best_time": "Early evening (5-7PM)",
                    "estimated_cost": "€20-30 for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "Rheinpark Spring Bloom",
                    "where": "Deutz, right bank of Rhine",
                    "description": "Explore Cologne's beautiful riverside park when spring blooms are at their height, featuring panoramic views of the Cathedral and Old Town, themed gardens, water features, and spacious lawns perfect for relaxation.",
                    "practical_tips": "Easily accessed via Hohenzollern Bridge from Old Town or Deutz station; mini-train runs through park in season; cable car to Zoo operates weather permitting; beer garden near dance fountain; relatively quiet on weekday mornings; becomes busier afternoons and weekends; excellent sunset viewing location of Cathedral silhouette across river.",
                    "best_time": "Late afternoon",
                    "estimated_cost": "Free; €10-15 for beer garden refreshments",
                    "weather_dependent": true
                },
                {
                    "activity": "Chocolate Museum",
                    "where": "Am Schokoladenmuseum 1a",
                    "description": "Visit this popular museum on a Rhine peninsula featuring exhibits on chocolate production, history and culture, with tropical greenhouse growing cacao trees, live demonstrations, and extensive tasting opportunities with a riverside café terrace.",
                    "practical_tips": "Book tickets online to avoid queues which begin forming in May; chocolate fountain with wafer dipping included in entry; excellent café with outdoor river terrace typically opens in May; self-guided tour takes approximately 2 hours; good family activity; exhibitions in German and English; riverside location offers pleasant walks before/after visit.",
                    "best_time": "Weekday morning",
                    "estimated_cost": "€14 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Belgian Quarter Exploration",
                    "where": "Between Rudolfplatz and Aachener Straße",
                    "description": "Discover Cologne's hippest neighborhood with its independent boutiques, design shops, third-wave coffee shops, and vibrant local culture when outdoor café and bar terraces fully reopen for the season.",
                    "practical_tips": "Most shops open from 11AM; excellent area for fashion, design, and vintage shopping; streets named after Belgian cities; Brüsseler Platz becomes social hub in evenings with outdoor seating; numerous brunch options on weekends; vibrant street life on evenings and weekends; less touristic than Old Town; best explored on foot.",
                    "best_time": "Afternoon and early evening",
                    "estimated_cost": "Free for exploration; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "KölnTriangle Observation Deck",
                    "where": "Ottoplatz 1, Deutz",
                    "description": "Ascend the panorama platform on the right bank of the Rhine for spectacular views of Cologne Cathedral, the Old Town, the river, and surrounding city from 103 meters height—particularly clear on bright May days.",
                    "practical_tips": "Less crowded than Cathedral tower and wheelchair accessible; glass-enclosed platform suitable in any weather; across river from Old Town (short walk across Hohenzollern Bridge); perfect for photography of Cathedral and cityscape; sunset timing increasingly favorable as days lengthen in May; nearby Kennedy-Ufer promenade worth combining for riverside walk.",
                    "best_time": "Late afternoon or sunset",
                    "estimated_cost": "€5 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Cologne Cable Car",
                    "where": "Riehler Straße 180",
                    "description": "Experience a scenic aerial crossing of the Rhine River on Germany's only cross-river cable car, offering unique perspectives of the city, Cathedral, and river from 30 meters height during a short but memorable ride.",
                    "practical_tips": "Regular operation begins in May (weather permitting); connects Rhine Park with Zoo/Flora area; each cabin holds 4 persons; journey takes approximately 5 minutes; excellent photo opportunities of river and skyline; can be combined with Rhine Park and Thermal Baths visit; zoo entrance separate ticket; operates approximately 10AM-6PM depending on weather.",
                    "best_time": "Midday for best lighting",
                    "estimated_cost": "€7 one-way, €9.50 return",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "10°C"
                },
                "precipitation": "Moderate rainfall with generally pleasant conditions and occasional brief thunderstorms, particularly in afternoons. Consistent sunshine with warmer temperatures approaching early summer levels.",
                "general_tips": "Summer clothing appropriate during day with light layers for evening, especially along the Rhine where breezes can be cooler. Increased importance of sun protection, particularly during midday hours. Rain protection still recommended for occasional showers. Outdoor dining pleasant throughout the evening."
            },
            "tourism_level": {
                "crowds": "Moderate to high, increasing as the month progresses and European tourism season begins. Cathedral and Old Town seeing higher visitor numbers, particularly on weekends and around Ascension Day and Pentecost holidays.",
                "pricing": "Higher than early May, with accommodations implementing early summer season rates, particularly during trade fairs, festivals, and holiday weekends.",
                "overall_atmosphere": "Vibrant pre-summer ambiance with outdoor dining in full swing, evening activities extending later as temperatures remain pleasant after sunset, and increasing presence of international visitors alongside locals enjoying the social outdoor culture Cologne is famous for."
            },
            "events_holidays": [
                {
                    "name": "Ascension Day (Christi Himmelfahrt)",
                    "date": "Late May (varies annually)",
                    "description": "Public holiday with special religious observances, traditionally also celebrated as Father's Day with outdoor group activities particularly in parks and along the Rhine promenades.",
                    "notes": "Public holiday with government offices and many businesses closed; traditionally men go on group outings with wagons of beer in parks or along the Rhine; many locals take Friday off creating long weekend; outdoor restaurants particularly busy; advance reservations recommended for popular venues; Cathedral holds special services."
                },
                {
                    "name": "Pentecost/Whitsun (Pfingsten)",
                    "date": "Late May/early June (varies annually)",
                    "description": "Important religious holiday weekend with special church services, cultural events, and many locals enjoying the extended weekend outdoors in parks and along the Rhine River.",
                    "notes": "Both Sunday and Monday are public holidays; many businesses closed Monday; traditional time for cultural outings; notable increase in domestic tourism; accommodation prices rise for holiday weekend; Cathedral holds significant services; public transportation runs holiday schedule."
                },
                {
                    "name": "International a cappella Festival",
                    "date": "Late May (varies annually)",
                    "description": "Celebration of vocal music featuring international a cappella groups performing in various venues throughout Cologne, from concert halls to outdoor spaces and historic churches.",
                    "notes": "Combines professional and amateur performances; venues include Cologne Philharmonic, churches, and public squares; some performances free while others ticketed; diverse musical styles from classical to contemporary; schedule available online and at tourist offices; reservation recommended for featured concerts; combines well with Cologne's strong choral tradition."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Evening Rhine River Cruise",
                    "where": "Departing from Altstadt piers",
                    "description": "Enjoy Cologne's impressive skyline and bridges during a warm May evening on a river cruise, with longer daylight hours and pleasant temperatures creating perfect conditions for seeing the city from its defining waterway.",
                    "practical_tips": "Multiple cruise operators offer 1-2 hour trips; evening departures increasingly popular as days lengthen; upper deck best in good weather; dinner cruises available but simple sightseeing cruises offer more flexibility for photography; pre-booking advised for weekend evenings; sunset cruises particularly atmospheric as Cathedral illumination begins.",
                    "best_time": "Departure 7-8PM for ideal light",
                    "estimated_cost": "€14-16 for standard cruise; dinner cruises €40+",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Ahr Valley",
                    "where": "Ahr Valley wine region (1-1.5 hours from Cologne)",
                    "description": "Experience one of Germany's most picturesque wine regions when spring brings lush green vineyards on dramatic slate slopes, reopened wine taverns, and perfect hiking weather in this romantic red wine producing valley.",
                    "practical_tips": "Direct regional trains from Cologne Hauptbahnhof to towns like Bad Neuenahr-Ahrweiler; famous for exceptional Pinot Noir (Spätburgunder); hiking trails connect wine villages offering both countryside and wine tasting; Bad Neuenahr offers historic spa town atmosphere; Ahrweiler features preserved medieval town walls; less visited by international tourists than Rhine Valley.",
                    "best_time": "Full day starting early",
                    "estimated_cost": "€40-60 including transportation and wine tasting",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Brühl Palaces",
                    "where": "Brühl (20 minutes from Cologne)",
                    "description": "Visit the UNESCO World Heritage Augustusburg and Falkenlust Palaces in perfect late spring conditions, featuring spectacular Rococo architecture, formal gardens at peak bloom, and opulent interiors in a perfect example of 18th-century princely courts near Cologne.",
                    "practical_tips": "Direct trains from Cologne Hauptbahnhof every 20 minutes; combined ticket for both palaces recommended; guided tours required for palace interiors; gardens particularly beautiful in May with formal parterres and fountain displays; café on premises with outdoor seating; comfortable walking shoes recommended for garden exploration; less crowded weekdays.",
                    "best_time": "Morning to allow time for both palaces",
                    "estimated_cost": "€25-30 including transportation and palace tickets",
                    "weather_dependent": true
                },
                {
                    "activity": "Cologne's Romanesque Churches",
                    "where": "Old Town and surrounding districts",
                    "description": "Explore Cologne's magnificent collection of twelve Romanesque churches, showcasing the city's religious heritage before the Gothic Cathedral, with special choir concerts and cultural events often held during May evenings.",
                    "practical_tips": "Twelve Romanesque churches within city center; Great St. Martin, St. Maria im Kapitol, and St. Gereon particularly impressive; 'Romanesque Church Pass' available for churches charging admission; variable opening hours—check schedules; special musical performances often scheduled in May evenings; excellent for architecture enthusiasts; less visited than Cathedral but historically significant.",
                    "best_time": "Morning for interior light; evening for concerts",
                    "estimated_cost": "Free or small donation at most churches; concerts €10-20",
                    "weather_dependent": false
                },
                {
                    "activity": "Stadtgarten Beer Garden",
                    "where": "Venloer Straße, near Belgian Quarter",
                    "description": "Experience one of Cologne's most beloved beer gardens in this beautiful city park when May brings perfect weather for outdoor socializing, live jazz performances, and relaxation under chestnut trees in a typically Cologne atmosphere.",
                    "practical_tips": "Popular with locals of all ages; live jazz performances on certain evenings (check schedule); serves both Kölsch beer and wider selection than traditional brewhouses; food menu features local and international options; fills quickly on warm evenings and weekends; adjacent music venue hosts regular concerts; combines well with Belgian Quarter exploration.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "€15-25 for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "Cologne Zoo and Flora",
                    "where": "Riehler Straße 173",
                    "description": "Visit Cologne's excellent zoo adjacent to the Flora botanical garden when mild May temperatures make animal viewing pleasant, with special emphasis on the elephant park, rainforest house, and newly active outdoor exhibits.",
                    "practical_tips": "Combined with nearby Flora botanical garden makes full day experience; historic zoo with modern conservation focus; mid-week visits less crowded; hippo house with underwater viewing particularly popular; connects to Rhine cable car for unique arrival or departure; several dining options on premises; family-friendly but equally interesting for adults.",
                    "best_time": "Weekday, arriving early",
                    "estimated_cost": "€21 adult admission",
                    "weather_dependent": true
                },
                {
                    "activity": "Cologne Philharmonic Concert",
                    "where": "Bischofsgartenstraße 1",
                    "description": "Attend a performance at Cologne's world-class concert hall featuring excellent acoustics and a diverse late spring program ranging from classical masterworks to contemporary compositions in an elegant modern building near the Cathedral.",
                    "practical_tips": "Spring program features diverse musical styles; booking in advance recommended; dress code relatively relaxed by European standards; concessions available before performance and during intermission; acoustically superb venue; air-conditioned interior if evening turns cool; evening performances typically start at 8PM; easily combined with pre-concert dining in Old Town.",
                    "best_time": "Evening performances",
                    "estimated_cost": "€25-70 depending on performance and seating",
                    "weather_dependent": false
                },
                {
                    "activity": "Claudius Therme Spa",
                    "where": "Sachsenbergstrasse 1",
                    "description": "Relax at Cologne's premier thermal bath complex featuring indoor and outdoor pools, saunas, steam baths, and relaxation areas with views toward the Cathedral skyline across the Rhine River.",
                    "practical_tips": "Located in Rheinpark on right bank; outdoor pools particularly pleasant in May's warmer temperatures; various sauna temperature options; weekdays less crowded than weekends; bring flip-flops and bathrobe or rent on site; textile-free sauna area (German tradition); relaxation pools with Cathedral views particularly impressive; good late afternoon activity if weather turns cooler.",
                    "best_time": "Weekday afternoon",
                    "estimated_cost": "€23-33 for 2-4 hour visit",
                    "weather_dependent": false
                },
                {
                    "activity": "NS Documentation Center",
                    "where": "Appellhofplatz 23-25",
                    "description": "Visit this powerful museum housed in the former Gestapo headquarters documenting Cologne under National Socialism, with exhibits on persecution, resistance, and everyday life during the Third Reich period.",
                    "practical_tips": "Moving and informative exhibits primarily in German with English information available; preserved prison cells in basement particularly impactful; thought-provoking alternative to more touristic experiences; provides understanding of city's difficult history; significantly less crowded than major tourist attractions; good indoor option during occasional rainy periods.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "€5 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Rheinauhafen District Exploration",
                    "where": "Southern edge of Old Town",
                    "description": "Discover Cologne's redeveloped harbor area featuring striking modern architecture including the three iconic Kranhäuser (crane house) buildings, waterfront promenades, design museums, and emerging restaurant scene with Rhine views.",
                    "practical_tips": "Recently developed area with architectural interest; home to German Sports Museum and Chocolate Museum; modern contrast to historic center; waterfront walking path connects to Old Town; several rooftop bars and restaurants with panoramic views open terraces in May; design and photography museums feature regular exhibitions; evening light particularly flattering for architectural photography.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "Free for exploration; €30-40 for rooftop dining",
                    "weather_dependent": true
                }
            ]
        }
    }
}