{
    "Spring": {
        "activities": [
            {
                "name": "Maastricht Art Fair (TEFAF)",
                "type": "Art Exhibition",
                "description": "Experience one of the world's leading art and antiques fairs, showcasing exceptional pieces from top international dealers and galleries.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Expensive",
                "seasonal_notes": "Held annually in March, this prestigious art fair attracts collectors, museum curators, and art enthusiasts from around the world.",
                "booking_tips": "Purchase tickets well in advance; guided tours are available and recommended for first-time visitors."
            },
            {
                "name": "White Asparagus Season",
                "type": "Culinary",
                "description": "Celebrate the iconic Limburg white asparagus season with special menus and events throughout Maastricht.",
                "indoor": true,
                "best_time": "Lunch/Dinner",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "From mid-April to June, local restaurants feature special asparagus menus highlighting this regional delicacy.",
                "booking_tips": "Reserve tables at popular restaurants well in advance; consider visiting asparagus farms outside the city for tours and tastings."
            },
            {
                "name": "Spring Preuvenemint",
                "type": "Food Festival",
                "description": "Sample gourmet food and drinks from local restaurants at this spring version of Maastricht's famous culinary festival.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in late May, this spring edition features seasonal specialties and outdoor dining in the Vrijthof.",
                "booking_tips": "No reservations required; purchase tokens on-site for food and drinks; arrive early for the best selection."
            },
            {
                "name": "Three-Country Point Hike",
                "type": "Outdoor Recreation",
                "description": "Explore the unique point where the Netherlands, Belgium, and Germany meet with guided spring hikes through blooming landscapes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Spring brings wildflowers and mild temperatures, ideal for exploring this unique geographical point and surrounding forests.",
                "booking_tips": "Join organized hiking groups or take public transport to Vaals and follow the well-marked trails; guided tours available for booking online."
            },
            {
                "name": "King's Day (Koningsdag)",
                "type": "Festival",
                "description": "Join the nationwide celebration with street parties, orange outfits, and free markets throughout Maastricht.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free entry",
                "seasonal_notes": "Celebrated on April 27th (or April 26th if the 27th falls on a Sunday), featuring city-wide festivities.",
                "booking_tips": "No reservation needed; main celebrations center around Vrijthof and Markt squares; wear orange to participate in the national tradition."
            },
            {
                "name": "St. Servatius Pilgrimage",
                "type": "Cultural/Religious",
                "description": "Experience the historic pilgrimage honoring Saint Servatius, Maastricht's patron saint.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "May 13th is the feast day of St. Servatius, with special ceremonies at the Basilica of Saint Servatius and religious processions.",
                "booking_tips": "No booking required for public ceremonies; arrive early for the procession; dress respectfully when visiting the basilica."
            },
            {
                "name": "Sint Pietersberg Cave Tours",
                "type": "Cultural",
                "description": "Explore the historic marl caves beneath Sint Pietersberg hill with special spring tours highlighting their history and geology.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings comfortable temperatures for underground exploration; special themed tours available during this season.",
                "booking_tips": "Advance booking essential; tours fill up quickly in spring; bring warm clothing as the caves maintain a constant cool temperature."
            },
            {
                "name": "Jekerkwartier Spring Art Walk",
                "type": "Art",
                "description": "Discover Maastricht's historic Jekerkwartier district through a self-guided art tour of galleries, studios, and outdoor installations.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Spring brings special exhibitions and outdoor art installations throughout this picturesque district.",
                "booking_tips": "Maps available at the tourist office; some galleries and studios require appointments; weekend afternoons offer the most open venues."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "André Rieu Summer Concerts",
                "type": "Music",
                "description": "Experience the world-famous violinist André Rieu performing with his Johann Strauss Orchestra in his hometown on the magnificent Vrijthof Square.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held annually in July, these magical open-air concerts transform the Vrijthof into a classical music venue with a festive atmosphere.",
                "booking_tips": "Book tickets months in advance; concerts always sell out; hotel packages including concert tickets are available."
            },
            {
                "name": "Maas River Cruises",
                "type": "Recreation",
                "description": "Enjoy guided boat tours along the Maas River, offering unique views of Maastricht from the water.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers perfect weather for river cruises; special sunset and dinner cruises available during peak season.",
                "booking_tips": "Book popular sunset cruises in advance; regular daytime cruises can usually be booked same-day; departure point at the Sint Servaasbrug."
            },
            {
                "name": "Preuvenemint",
                "type": "Food Festival",
                "description": "Indulge in Maastricht's largest culinary festival, featuring food and drink from dozens of local restaurants and producers.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held annually in late August, transforming the Vrijthof into a gourmet paradise for four days of culinary delights.",
                "booking_tips": "No reservations needed; purchase tokens on-site for food and drinks; arrive early for dinner service to avoid longest queues."
            },
            {
                "name": "Vrijthof Summer Terraces",
                "type": "Food & Drink",
                "description": "Experience the vibrant café culture of Maastricht with extended summer terraces around the historic Vrijthof Square.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings expanded outdoor seating and special summer menus to the cafés surrounding the square.",
                "booking_tips": "Reservations recommended for dinner, especially on weekends; prime spots fill quickly on sunny days; perfect for people-watching."
            },
            {
                "name": "City Park Open Air Cinema",
                "type": "Entertainment",
                "description": "Watch films under the stars in Maastricht's city parks with temporary open-air cinema screenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings bring outdoor film screenings to various parks around the city, often with themed nights and local food vendors.",
                "booking_tips": "Check local listings for schedule; tickets available online or at the venue; bring blankets or rent chairs on-site."
            },
            {
                "name": "Maastricht Underground Candlelight Tours",
                "type": "Cultural",
                "description": "Explore the North Caves or Zonneberg Caves by candlelight, experiencing the cool underground network that runs beneath the city.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "The caves maintain a constant cool temperature, making them a perfect retreat during hot summer days.",
                "booking_tips": "Advance booking essential; special candlelight tours are very popular in summer; not recommended for those with claustrophobia."
            },
            {
                "name": "Bonnefanten Museum Summer Exhibitions",
                "type": "Art",
                "description": "Visit special summer exhibitions at Maastricht's premier art museum, housed in a distinctive building designed by Aldo Rossi.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings major international exhibitions and extended opening hours to this world-class museum.",
                "booking_tips": "Purchase tickets online to avoid queues; guided tours available in multiple languages; café offers riverside terrace dining."
            },
            {
                "name": "Limburg Wine Festival",
                "type": "Food & Drink",
                "description": "Sample wines from the nearby Limburg vineyards at this celebration of local viticulture.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Held in June, showcasing the surprising wine production of the Netherlands' southernmost region.",
                "booking_tips": "Purchase tasting tickets in advance; shuttle services available from city center to vineyard locations; designated driver services recommended."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "The Walking Dinner",
                "type": "Food Event",
                "description": "Participate in this unique culinary event where guests move between different restaurants for each course of their meal.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held in October, featuring seasonal autumn ingredients and warm, cozy restaurant settings.",
                "booking_tips": "Book well in advance; limited tickets available; dietary restrictions can be accommodated with advance notice."
            },
            {
                "name": "Maastricht Autumn Music Festival",
                "type": "Music",
                "description": "Enjoy classical and contemporary music performances in historic venues throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Autumn brings a series of concerts in atmospheric venues including churches, the theater, and historic buildings.",
                "booking_tips": "Purchase tickets for individual concerts or festival passes; popular performances sell out quickly."
            },
            {
                "name": "Jekerkwartier Book Market",
                "type": "Market",
                "description": "Browse rare and second-hand books at this charming market in Maastricht's historic Jekerkwartier district.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free entry",
                "seasonal_notes": "Autumn brings this special book market to the picturesque streets of one of Maastricht's oldest neighborhoods.",
                "booking_tips": "No booking required; arrive early for rare books; nearby cafés perfect for reviewing purchases."
            },
            {
                "name": "Sint Pietersberg Autumn Walks",
                "type": "Outdoor Recreation",
                "description": "Explore the hillsides and forests around Maastricht when they're dressed in autumn colors.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "October and November bring spectacular fall foliage to the forests and hills surrounding the city.",
                "booking_tips": "Maps available at tourist office; guided nature walks available on weekends; comfortable walking shoes recommended."
            },
            {
                "name": "Maastricht Underground Week",
                "type": "Cultural",
                "description": "Discover the extensive network of caves and tunnels beneath the city with special guided tours and events.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings special historical and archaeological tours of the underground passageways and caves.",
                "booking_tips": "Book specialized tours in advance; regular tours may sell out during this special week; appropriate footwear required."
            },
            {
                "name": "Game Season Culinary Events",
                "type": "Food & Drink",
                "description": "Sample special game menus at restaurants throughout the city, featuring local and regional hunting traditions.",
                "indoor": true,
                "best_time": "Dinner",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "October through December is traditional game season, with special menus featuring venison, wild boar, and pheasant.",
                "booking_tips": "Reserve tables at popular restaurants well in advance; wine pairing recommendations available."
            },
            {
                "name": "Maastricht Museum Night",
                "type": "Cultural",
                "description": "Visit multiple museums and cultural institutions during this special evening when they open their doors after hours.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in October, offering a unique opportunity to experience the city's museums in a different light with special programs.",
                "booking_tips": "Purchase passes in advance; includes access to all participating venues and special transportation between sites."
            },
            {
                "name": "Cheese and Wine Festival",
                "type": "Food & Drink",
                "description": "Sample artisanal cheeses and wines from the region at this popular autumn food festival.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings this celebration of regional dairy and wine production to indoor venues around the city.",
                "booking_tips": "Purchase tasting tickets in advance; masterclasses require separate booking; perfect for learning about local food traditions."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Magical Maastricht",
                "type": "Christmas Market",
                "description": "Experience Maastricht's enchanting Christmas celebration with markets, ice skating, light displays, and seasonal events.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free entry",
                "seasonal_notes": "From late November through December, the Vrijthof transforms into a winter wonderland with a large Christmas market and ice rink.",
                "booking_tips": "No booking required for market access; ice skating tickets available on-site; weekends are busiest."
            },
            {
                "name": "Underground Christmas Market",
                "type": "Market",
                "description": "Shop for unique gifts and festive items in the atmospheric setting of the Velvet Cave beneath Valkenburg castle, just outside Maastricht.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "The caves are transformed into a magical Christmas village from mid-November through December.",
                "booking_tips": "Purchase tickets online to avoid long queues; shuttle buses run from Maastricht; weekdays are less crowded."
            },
            {
                "name": "New Year's Eve at Vrijthof",
                "type": "Celebration",
                "description": "Ring in the New Year at Maastricht's main square with music, fireworks, and festivities.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "December 31st brings a large public celebration to welcome the New Year.",
                "booking_tips": "No booking required for public celebration; restaurants and clubs hold special events that require advance reservations."
            },
            {
                "name": "Winter Wine Tasting",
                "type": "Food & Drink",
                "description": "Enjoy guided tastings of regional and international wines in cozy settings around the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings special tasting events focusing on warming reds and dessert wines perfect for the season.",
                "booking_tips": "Reserve spots for tastings in advance; many wine shops and restaurants offer special winter programs."
            },
            {
                "name": "Bonnefanten Museum Winter Exhibitions",
                "type": "Art",
                "description": "Explore special winter exhibitions at Maastricht's foremost art museum.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings major international exhibitions and quieter visiting conditions.",
                "booking_tips": "Purchase tickets online; guided tours available; café offers a warm retreat with river views."
            },
            {
                "name": "Carolus Thermal Baths",
                "type": "Wellness",
                "description": "Relax in the warm thermal pools and spa facilities of this wellness center just across the border in Aachen, Germany.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect time to enjoy the healing thermal waters and sauna facilities.",
                "booking_tips": "Easy day trip from Maastricht; no advance booking required but arrive early on weekends; bring your own towel or rent one."
            },
            {
                "name": "Winter in the Underground Caves",
                "type": "Cultural",
                "description": "Tour the extensive network of caves beneath Maastricht, which maintain a constant temperature year-round.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "The caves provide a respite from winter weather with their constant temperature; special winter-themed tours available.",
                "booking_tips": "Advance booking recommended; tours continue regardless of weather; dress warmly as the caves are cool year-round."
            },
            {
                "name": "Maastricht Carnival",
                "type": "Festival",
                "description": "Experience the vibrant pre-Lenten celebration with parades, costumes, music, and festivities throughout the city.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Held in February or early March (dates vary based on Easter), this major cultural event includes several days of celebrations.",
                "booking_tips": "No booking required for public events; restaurants and hotels fill up quickly; book accommodations months in advance if visiting during Carnival."
            }
        ]
    }
} 