{
  "sites": [
    {
      "name": "Basilica of Saint Servatius",
      "type": "Church",
      "description": "The Basilica of Saint Servatius is one of the oldest churches in the Netherlands, dating back to the 6th century. This Romanesque church houses the remains of Saint Servatius, the first bishop of the Netherlands. The church features stunning architecture, including the impressive Westwork, medieval sculptures, and the Treasury which contains one of the most important collections of religious artifacts in the Netherlands.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round except during special services. Treasury has seasonal exhibitions. Special services during religious holidays. Extended hours during summer tourist season. Guided tours available in multiple languages.",
      "booking_tips": "Online tickets recommended for Treasury visits. Guided tours available by appointment. Located in Vrijthof square. Audio guides available in multiple languages. Café and restaurants nearby.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 50.8486,
      "longitude": 5.6889
    },
    {
      "name": "Vrijthof Square",
      "type": "Public Square",
      "description": "The Vrijthof is Maastricht's most famous square, surrounded by historic buildings, restaurants, and cafés. This vibrant square hosts numerous events throughout the year, including the famous André Rieu concerts. The square is bordered by the Basilica of Saint Servatius, Saint John's Church, and historic buildings that now house restaurants and hotels.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Summer brings outdoor dining and events. Christmas market in December. André Rieu concerts in summer. Regular cultural events and festivals.",
      "booking_tips": "No booking required for general access. Restaurant reservations recommended for peak times. Located in city center. Multiple parking options nearby. Public transport hub.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 50.8483,
      "longitude": 5.6892
    },
    {
      "name": "Maastricht Underground",
      "type": "Historical Site",
      "description": "Maastricht Underground consists of an extensive network of tunnels and caves beneath the city, including the famous Casemates. These underground passages were used for defense and as a quarry for building materials. The guided tours take visitors through centuries of history, from medieval quarries to World War II shelters.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round except Mondays. Temperature remains constant underground. Special candlelight tours available. Closed on major holidays. Extended hours during summer.",
      "booking_tips": "Advance booking required for guided tours. Warm clothing recommended. Located near Fort Sint Pieter. Tours available in multiple languages. Flashlights provided.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 50.8380,
      "longitude": 5.6756
    },
    {
      "name": "Fort Sint Pieter",
      "type": "Fortress",
      "description": "Fort Sint Pieter is an 18th-century fortress built to protect Maastricht. Located on the Sint-Pietersberg hill, it offers panoramic views of the city and surrounding countryside. The fort played a crucial role in Maastricht's military history and is now open for guided tours.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open March through October. Special events during heritage days. Guided tours available on weekends. Closed during winter months. Extended hours during summer.",
      "booking_tips": "Advance booking required for guided tours. Located on Sint-Pietersberg. Combine visit with Maastricht Underground. Café on premises. Parking available nearby.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 50.8391,
      "longitude": 5.6775
    },
    {
      "name": "Bonnefanten Museum",
      "type": "Museum",
      "description": "The Bonnefanten Museum is Maastricht's leading museum of fine art. The striking building, designed by Aldo Rossi, houses collections of old masters, contemporary art, and archaeological artifacts. The museum is particularly known for its collection of medieval sculpture and Italian Renaissance paintings.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round except Mondays. Special exhibitions rotate throughout the year. Extended hours on Thursday evenings. Closed on major holidays. Family activities during school holidays.",
      "booking_tips": "Online tickets recommended for special exhibitions. Museum card accepted. Located on the Maas river. Café on premises. Guided tours available.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 50.8466,
      "longitude": 5.7034
    },
    {
      "name": "Helpoort",
      "type": "Historical Site",
      "description": "The Helpoort (Hell's Gate) is the oldest surviving city gate in the Netherlands, dating from 1229. This medieval gate is part of Maastricht's historic city walls and offers visitors a glimpse into the city's medieval past. The gate now houses a small museum about the city's fortifications.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round except Mondays. Special exhibitions during heritage days. Guided tours available on weekends. Closed during winter months. Extended hours during summer.",
      "booking_tips": "No booking required for general visits. Located near city center. Combine with city wall walk. Information available in multiple languages. Café nearby.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 50.8453,
      "longitude": 5.6910
    },
    {
      "name": "Sint Servaasbrug",
      "type": "Bridge",
      "description": "The Sint Servaasbrug is the oldest bridge in the Netherlands, dating from the 13th century. This historic stone bridge spans the Maas river and connects the city's two banks. The bridge is a symbol of Maastricht and offers beautiful views of the river and city.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Beautiful views at sunset. Special lighting during festivals. Regular maintenance may affect access. Popular during summer evenings.",
      "booking_tips": "No booking required. Located in city center. Pedestrian and bicycle access only. Multiple viewpoints along the river. Restaurants and cafés nearby.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 5
      },
      "latitude": 50.8480,
      "longitude": 5.6978
    },
    {
      "name": "Dinghuis",
      "type": "Historical Building",
      "description": "The Dinghuis is a historic building in the heart of Maastricht, dating from the 15th century. Originally used as a courthouse, it now serves as the city's tourist information center. The building features Gothic architecture and is a fine example of medieval civic architecture.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round except Sundays. Tourist information available daily. Special exhibitions during heritage days. Extended hours during summer. Closed on major holidays.",
      "booking_tips": "No booking required. Located in city center. Tourist information available in multiple languages. Maps and guides available. Café nearby.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 50.8498,
      "longitude": 5.6933
    },
    {
      "name": "Onze-Lieve-Vrouwebasiliek",
      "type": "Church",
      "description": "The Basilica of Our Lady is a Romanesque church dating from the 11th century. The church is particularly known for its miraculous statue of the Virgin Mary, known as the Star of the Sea. The church features beautiful architecture, including the distinctive west towers and the Gothic choir.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round except during services. Special services during religious holidays. Treasury open for guided tours. Extended hours during summer. Regular organ concerts.",
      "booking_tips": "No booking required for general visits. Guided tours available by appointment. Located in city center. Audio guides available. Café nearby.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 50.8503,
      "longitude": 5.6916
    },
    {
      "name": "Sint-Pietersberg",
      "type": "Natural Area",
      "description": "Sint-Pietersberg is a hill and nature reserve south of Maastricht. The area features walking trails, historic fortifications, and the famous marl caves. The hill offers panoramic views of the city and surrounding countryside, making it a popular destination for outdoor activities.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Spring brings wildflowers. Summer offers best views. Autumn features colorful foliage. Winter brings opportunities for winter sports. Regular guided walks.",
      "booking_tips": "No booking required for general access. Guided tours available for caves. Located south of city center. Multiple parking options. Café and restaurant on site.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 50.8343,
      "longitude": 5.6797
    },
    {
      "name": "Maastricht Christmas Market",
      "type": "Seasonal Event",
      "description": "The Maastricht Christmas Market is one of the most festive events in the city, transforming the Vrijthof square into a winter wonderland. The market features traditional wooden stalls selling crafts, gifts, and seasonal treats, along with an ice rink and festive entertainment.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Held annually in December. Daily from late November to early January. Special events on weekends. Extended hours during peak times. Ice rink open weather permitting.",
      "booking_tips": "No booking required for general access. Ice skating tickets available on site. Located in Vrijthof square. Multiple food and drink options. Public transport extended during event.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 50.8484,
      "longitude": 5.6893
    },
    {
      "name": "Céramique District",
      "type": "Architectural District",
      "description": "The Céramique district is a modern architectural showcase featuring buildings by world-renowned architects. The area, once home to the Céramique factory, has been transformed into a residential and cultural district with striking contemporary architecture, including the Bonnefanten Museum and the Centre Céramique.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Architecture tours available. Special events during heritage days. Regular cultural programming. Extended hours during summer.",
      "booking_tips": "No booking required for general exploration. Guided architecture tours available. Located on west bank of Maas. Multiple parking options. Restaurants and cafés in area.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 50.8454,
      "longitude": 5.7025
    },
    {
      "name": "Centre Céramique",
      "type": "Cultural Center",
      "description": "Centre Céramique is a modern cultural center that combines a library, exhibition spaces, and cultural programming. The building, designed by Jo Coenen, features striking architecture and hosts various cultural events, exhibitions, and educational programs throughout the year.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round except Sundays. Regular exhibitions and events. Special programming during heritage days. Extended hours during summer. Closed on major holidays.",
      "booking_tips": "No booking required for general access. Special events may require tickets. Located in Céramique district. Café on premises. Public transport hub nearby.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 50.8452,
      "longitude": 5.7011
    },
    {
      "name": "Maastricht University",
      "type": "Educational Institution",
      "description": "Maastricht University, founded in 1976, is known for its innovative Problem-Based Learning approach. The university's historic buildings in the city center, particularly the former Dominican monastery, create an interesting contrast with its modern teaching methods. The campus is open to visitors interested in its architecture and history.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Guided tours available during term time. Special events during open days. Closed during major holidays. Extended hours during summer school.",
      "booking_tips": "No booking required for general access. Guided tours available by appointment. Located in city center. Information available in multiple languages. Café on campus.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 50.8473,
      "longitude": 5.6867
    },
    {
      "name": "Maastricht Market",
      "type": "Market",
      "description": "The Maastricht Market is the largest market in the city, held every Friday and Saturday in the Markt square. The market offers a wide variety of goods, from fresh produce and local specialties to clothing and household items. The historic square and surrounding buildings create a charming backdrop for this traditional market.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Held year-round on Friday and Saturday. Special seasonal markets during holidays. Extended hours during summer. Christmas market in December. Regular food festivals.",
      "booking_tips": "No booking required. Located in Markt square. Early arrival recommended for best selection. Multiple parking options nearby. Cafés and restaurants in surrounding area.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 50.8515,
      "longitude": 5.6919
    },
    {
      "name": "Maastricht City Hall",
      "type": "Historical Building",
      "description": "The Maastricht City Hall is a Baroque building dating from the 17th century, designed by Pieter Post. The building features a distinctive clock tower and elegant architecture. While it still serves as the city's administrative center, parts of the building are open to visitors interested in its history and architecture.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round except weekends. Guided tours available on weekdays. Special events during heritage days. Closed on major holidays. Extended hours during special events.",
      "booking_tips": "No booking required for general visits. Guided tours available by appointment. Located in Markt square. Information available in multiple languages. Café nearby.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 50.8518,
      "longitude": 5.6915
    }
  ]
}