{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Norway's Constitution Day (May 17th)",
                "details": "Experience Norway's biggest national celebration! Witness the massive children's parade waving to the Royal Family at the palace, streets filled with people in traditional 'bunad' costumes, marching bands, flags everywhere, and a unique, joyous atmosphere throughout Oslo."
            },
            {
                "reason": "Beautiful Spring Weather & Long Days",
                "details": "May offers pleasant spring weather: increasingly sunny, mild temperatures (average highs ~16°C/61°F), perfect for exploring outdoors as the city bursts into green and flowers bloom."
            },
            {
                "reason": "City in Bloom & Lush Parks",
                "details": "Experience Oslo adorned with spring flowers. See tulips and blossoms in the Royal Palace Park, Vigeland Park, the Botanical Garden (Botanisk hage), and along streets like Karl Johans gate."
            },
            {
                "reason": "Outdoor Cafes & Lively Atmosphere",
                "details": "Outdoor seating ('uteserveringer') becomes widespread. Enjoy coffee, drinks, or meals outdoors at Aker Brygge, Grünerløkka, or along Karl Johans gate, soaking up the returning warmth and vibrant city life."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds (Mostly)",
                "details": "While May 17th week is extremely busy, the rest of May generally sees fewer crowds and potentially better prices than the peak months of July and August."
            },
            {
                "reason": "Oslofjord Islands Accessible",
                "details": "Ferry services to the nearby Oslofjord islands (Hovedøya, Lindøya, Gressholmen) increase, making it pleasant to take day trips for hiking, picnics, and enjoying the coastline as summer approaches."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "May 17th Crowds & Prices",
                "details": "Constitution Day (Syttende Mai) brings massive crowds to the city center. Accommodation and flights around this date are expensive and must be booked extremely far in advance. Many shops are closed."
            },
            {
                "reason": "Variable Spring Weather",
                "details": "While often pleasant, May can still bring cooler days, wind, and rain showers. Packing layers is essential for Oslo's changeable spring weather."
            },
            {
                "reason": "May Day Holiday (May 1st)",
                "details": "May 1st is a public holiday. Expect widespread closures (shops, Vinmonopolet, banks) and potentially large demonstrations/marches affecting city center access and transport."
            },
            {
                "reason": "Ascension Day Holiday (Potential)",
                "details": "Ascension Day (Kristi Himmelfartsdag), a public holiday, often falls in May (date varies). This creates a long weekend, increasing domestic travel and potentially impacting availability/prices. Many shops closed."
            },
            {
                "reason": "Pollen Season",
                "details": "Spring blooms, especially birch trees, mean high pollen counts, significantly affecting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C (61°F)",
                    "low": "6°C (43°F)"
                },
                "precipitation": "Moderate chance of rain showers, but significantly more sunshine and longer days than April. Can still be cool, especially evenings and nights.",
                "general_tips": "Pack layers: t-shirts, sweaters, a medium-weight jacket (waterproof useful), comfortable walking shoes. Sunglasses and potentially allergy medication needed."
            },
            "tourism_level": {
                "crowds": "Moderate, noticeably busier than April. Very busy around May 1st. Anticipation builds towards May 17th.",
                "pricing": "Shoulder/High season prices emerging. Book ahead, especially around May 1st and for the May 17th period.",
                "overall_atmosphere": "Vibrant spring awakening. City is greening up. Lively feel, especially when sunny. Major disruption/closures on May 1st."
            },
            "events_holidays": [
                {
                    "name": "May Day / Labor Day (Første mai)",
                    "date": "May 1",
                    "description": "Public holiday. Characterized by political demonstrations and marches by labor unions, primarily in the city center (Youngstorget area).",
                    "notes": "Widespread closures (shops, Vinmonopolet, banks). Expect traffic/transport disruptions in central areas due to marches. Check opening status for museums/sites."
                },
                {
                    "name": "Ascension Day (Kristi Himmelfartsdag) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often early/mid May)",
                    "description": "Public holiday. Creates a long weekend. Many Norwegians travel.",
                    "notes": "Check date for the year. Expect closures (shops, banks). Book accommodation/transport ahead if traveling this weekend."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit the Botanical Garden (Botanisk hage)",
                    "where": "Tøyen",
                    "description": "Explore Oslo's beautiful botanical garden as spring flowers and trees come into bloom. See diverse plant collections, themed gardens, and greenhouses.",
                    "practical_tips": "Free entry to the outdoor gardens (fee for greenhouses). Accessible by T-bane or bus. A peaceful escape.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (garden) / Low (greenhouses)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Vigeland Sculpture Park",
                    "where": "Frogner Park",
                    "description": "Wander through the world's largest sculpture park by a single artist, Gustav Vigeland, now surrounded by lush green lawns and spring blooms.",
                    "practical_tips": "Free entry. Very popular on sunny days. Combine with a visit to the Oslo City Museum within the park.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Coffee Break at an Outdoor Café ('Uteservering')",
                    "where": "Various locations (Grünerløkka, Aker Brygge, Karl Johans gate)",
                    "description": "Enjoy the Norwegian coffee culture or a light meal at one of the many outdoor seating areas opening up across the city.",
                    "practical_tips": "Grünerløkka offers trendy cafes, Aker Brygge has fjord views (often pricier). Enjoy the people-watching.",
                    "best_time": "Mid-morning or Afternoon",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": true
                 },
                {
                    "activity": "Walk Along the Akerselva River",
                    "where": "Path runs through Oslo from Maridalsvannet to Vaterland",
                    "description": "Follow the path along the river as it flows through different neighborhoods, passing waterfalls, old industrial buildings, parks, and cafes. Nature meets city history.",
                    "practical_tips": "Can walk sections or the whole length (approx. 8km). Path is mostly flat. Popular route for locals.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "18°C (64°F)",
                    "low": "8°C (46°F)"
                },
                "precipitation": "Generally pleasant, sunny, and warmer spring weather. Often the nicest period weather-wise. Some rain still possible. Long daylight hours.",
                "general_tips": "Focus on lighter layers, but keep a jacket/sweater for evenings. Sun protection needed. Pack something smart/festive if attending May 17th celebrations!"
            },
            "tourism_level": {
                "crowds": "EXTREMELY high around May 17th. Otherwise, high season approaching, busy especially on weekends.",
                "pricing": "Peak prices around May 17th. High season prices likely otherwise.",
                "overall_atmosphere": "Dominated by the unique buzz and celebrations of Syttende Mai. Otherwise, beautiful late spring / early summer feel. Ideal for outdoor activities."
            },
            "events_holidays": [
                 {
                    "name": "Norway's Constitution Day (Syttende Mai)",
                    "date": "May 17",
                    "description": "Massive national celebration. Main event is the children's parade marching up Karl Johans gate past the Royal Palace. People dressed in traditional 'bunad', flags, marching bands, street food (hot dogs, ice cream).",
                    "notes": "Public holiday. Most shops closed. City center packed. Transport runs but may be rerouted. Book accommodation MONTHS in advance. Essential Oslo experience."
                 },
                 {
                    "name": "Ascension Day (Kristi Himmelfartsdag) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often mid/late May)",
                    "description": "Public holiday. Creates a long weekend.",
                    "notes": "Check date for the year. Expect closures (shops, banks). Increased domestic travel."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Syttende Mai (May 17th)",
                    "where": "Karl Johans gate, Royal Palace area, City Center",
                    "description": "Witness the children's parade (Barnetoget) in the morning, marvel at the national costumes (bunader), soak up the festive atmosphere, wave flags, and join the city-wide celebration.",
                    "practical_tips": "Find a spot along Karl Johans gate early for the parade. Be prepared for huge crowds. Wear comfortable shoes. Try traditional celebration food like hot dogs ('pølse') and ice cream ('is').",
                    "best_time": "All day on May 17th",
                    "estimated_cost": "Free (watching), Low (street food)",
                    "weather_dependent": true
                },
                {
                    "activity": "Oslofjord Island Hopping",
                    "where": "Departing from Aker Brygge (Rådhusbrygge 4)",
                    "description": "Take a public ferry to islands like Hovedøya (ruins, beaches), Lindøya (cabins), or Gressholmen (nature). Perfect escape on a sunny day.",
                    "practical_tips": "Use regular Ruter tickets/passes. Check ferry schedules (B1-B4 lines). More frequent services than earlier spring. Bring picnic/swimwear.",
                    "best_time": "Full Day",
                    "estimated_cost": "Low (public transport fare + expenses)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Bygdøy Museums",
                    "where": "Bygdøy Peninsula (Bus 30 or Ferry B9)",
                    "description": "Explore museums like the Fram, Kon-Tiki, Maritime Museum, or the Norwegian Museum of Cultural History (Folkemuseum) in pleasant weather.",
                    "practical_tips": "The ferry from Aker Brygge (usually starts late April/May) is a scenic way to arrive. The Folkemuseum's open-air exhibits are great in May.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate to High (museum entries + transport)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Hike in Marka Forest",
                    "where": "Access via T-bane (e.g., Sognsvann, Frognerseteren)",
                    "description": "Enjoy hiking on trails that are likely snow-free, exploring the forests surrounding Oslo. See locals out enjoying the spring weather.",
                    "practical_tips": "Wear good walking/hiking shoes. Trails can still be muddy. Bring water/snacks. Check ut.no for trail suggestions.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport fare)",
                    "weather_dependent": true
                 }
            ]
        }
    }
}