{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Industrial Heritage Tours",
                "details": "Perfect weather for exploring Dolní Vítkovice and other industrial heritage sites with guided tours and photography opportunities."
            },
            {
                "reason": "Spring Industrial Photography",
                "details": "Ideal conditions for capturing the dramatic industrial architecture with spring blooms and golden hour lighting."
            },
            {
                "reason": "Easter Celebrations",
                "details": "Traditional Czech Easter markets and celebrations throughout the city showcase Moravian culture and traditions."
            },
            {
                "reason": "Outdoor Dining Returns",
                "details": "Restaurant terraces and beer gardens reopen, perfect for enjoying Ostravar beer and local specialties."
            },
            {
                "reason": "Manageable Crowds",
                "details": "Pre-peak season means shorter lines at industrial heritage sites while maintaining excellent weather."
            },
            {
                "reason": "Zoo Spring Activity",
                "details": "Ostrava Zoo animals are most active during spring, with blooming gardens and comfortable temperatures."
            },
            {
                "reason": "City Parks Bloom",
                "details": "Komenského Gardens and other city parks come alive with spring flowers and pleasant walking conditions."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Spring Showers",
                "details": "April can bring frequent rain showers requiring flexible outdoor planning and rain gear for industrial site visits."
            },
            {
                "reason": "Price Increases",
                "details": "Accommodation and dining prices begin rising as tourist season approaches, especially around Easter."
            },
            {
                "reason": "Limited Indoor Options",
                "details": "While industrial heritage sites offer some indoor areas, many attractions are weather-dependent."
            }
        ],
        "first_half": {
            "date_range": "2025-04-01/2025-04-15",
            "weather": {
                "average_temperature": {
                    "high_celsius": 14,
                    "low_celsius": 5
                },
                "humidity_percent": 70,
                "wind_speed_kmh": 9,
                "precipitation": "April can be quite rainy, with an average of 9 rainy days. Light showers are frequent but usually brief.",
                "general_tips": "Pack a lightweight raincoat or umbrella and wear layers to adjust to fluctuating temperatures.",
                "sunrise": "06:30",
                "sunset": "19:30"
            },
            "tourism_level": {
                "crowds": "Tourists are moderate, with a slight increase around Easter. Locals begin enjoying outdoor spaces more.",
                "pricing": "Prices for accommodations can be slightly higher during Easter, but generally, there are still good deals available.",
                "overall_atmosphere": "The city feels lively and welcoming, with locals and tourists enjoying the early signs of spring.",
                "wait_time_minutes": {
                    "dolni_vitkovice": 15,
                    "ostrava_zoo": 10,
                    "city_hall_tower": 5
                },
                "public_transport_crowding": "Moderate, higher during Easter weekend"
            },
            "events_holidays": [
                {
                    "name": "Easter Weekend",
                    "date": "2025-04-20/2025-04-21",
                    "description": "Traditional Czech Easter celebrations with markets, decorated eggs, and special church services.",
                    "notes": "Book accommodations and restaurants in advance as the city is bustling with activities.",
                    "category": "Holiday",
                    "accessibility": "Most events are family-friendly and accessible."
                },
                {
                    "name": "Industrial Heritage Photography Workshop",
                    "date": "2025-04-12",
                    "description": "Professional photography workshop focusing on industrial heritage sites with spring blooms.",
                    "notes": "Limited spots available, book in advance for this unique photography opportunity.",
                    "category": "Cultural",
                    "accessibility": "Requires walking and photography equipment."
                }
            ],
            "local_foods_in_season": ["Fresh local produce", "Spring vegetables", "Moravian wines", "Traditional Easter treats"]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "16°C",
                    "low": "8°C"
                },
                "precipitation": "Rain is still possible, but there are more sunny days compared to the beginning of the month.",
                "general_tips": "Continue to dress in layers and keep a compact umbrella handy for sudden showers."
            },
            "tourism_level": {
                "crowds": "Tourist numbers increase slightly as spring progresses, but it's still less crowded than summer.",
                "pricing": "Prices are moderate, with some fluctuations due to late spring events and holidays.",
                "overall_atmosphere": "The atmosphere is vibrant and lively, with outdoor markets and industrial heritage tours adding to the charm."
            },
            "events_holidays": [
                {
                    "name": "Spring Industrial Heritage Festival",
                    "date": "Late April",
                    "description": "Special guided tours and events at Dolní Vítkovice and other industrial heritage sites.",
                    "notes": "Perfect time to explore the UNESCO World Heritage industrial site with expert guides."
                },
                {
                    "name": "Moravian Wine Tasting",
                    "date": "Throughout April",
                    "description": "Wine tastings featuring local Moravian wines at restaurants and wine bars throughout the city.",
                    "notes": "Reserve tables at popular wine bars and ask for local Moravian wine recommendations."
                }
            ]
        },
        "weather": {
            "temperature_range": "5°C to 16°C (41°F to 61°F)",
            "rainfall": "Moderate",
            "snow": "Rare",
            "daylight_hours": "13-14 hours"
        },
        "activities": [
            "Industrial heritage tours",
            "Spring photography workshops",
            "Easter market shopping",
            "Outdoor dining and beer gardens",
            "Zoo visits",
            "City park walks",
            "Moravian wine tasting"
        ]
    }
}