{
    "December": {
        "reasons_to_visit": [
            {
                "reason": "Christmas Markets Magic",
                "details": "Ostrava's Christmas markets feature traditional Czech crafts, mulled wine, and festive atmosphere throughout the city center."
            },
            {
                "reason": "Industrial Heritage Winter Views",
                "details": "Snow-covered industrial architecture at Dolní Vítkovice creates a unique and dramatic winter landscape."
            },
            {
                "reason": "Holiday Atmosphere",
                "details": "Festive decorations and Christmas spirit throughout the historic city center and industrial heritage sites."
            },
            {
                "reason": "New Year's Preparation",
                "details": "December builds to spectacular New Year's Eve celebrations on Stodolní Street with fireworks and parties."
            },
            {
                "reason": "Cozy Indoor Culture",
                "details": "Perfect time for traditional Czech experiences in warm, atmospheric venues and industrial heritage museums."
            },
            {
                "reason": "Winter Industrial Photography",
                "details": "Unique opportunity to capture industrial heritage sites with dramatic winter lighting and snow-covered landscapes."
            },
            {
                "reason": "Traditional Czech Christmas",
                "details": "Experience authentic Czech Christmas traditions with local families and traditional holiday foods."
            }
        ],
        "reasons_to_avoid": [
            {
                "reason": "Cold Weather",
                "details": "December temperatures often drop below freezing, requiring heavy winter clothing for outdoor industrial tours."
            },
            {
                "reason": "Christmas Crowds",
                "details": "December attracts significant numbers of tourists for Christmas market visits and holiday celebrations."
            },
            {
                "reason": "Limited Daylight",
                "details": "Shortest days of the year with very limited sunshine hours for outdoor activities."
            },
            {
                "reason": "Higher Holiday Prices",
                "details": "Christmas and New Year's periods see increased prices for accommodations and dining throughout the city."
            },
            {
                "reason": "Weather-Dependent Activities",
                "details": "Many industrial heritage sites and outdoor attractions may be affected by winter weather conditions."
            }
        ],
        "weather": {
            "temperature_range": "-2°C to 3°C (28°F to 37°F)",
            "rainfall": "Low-Moderate",
            "snow": "Common",
            "daylight_hours": "8 hours"
        },
        "activities": [
            "Christmas market visits",
            "Industrial heritage indoor tours",
            "Winter photography workshops",
            "Traditional Czech Christmas experiences",
            "New Year's Eve celebrations on Stodolní Street",
            "Museum and gallery visits",
            "Cozy café culture",
            "Indoor cultural events"
        ]
    }
}