{
  "sites": [
    {
      "name": "Nidaros Cathedral",
      "type": "Religious Site",
      "description": "The northernmost medieval cathedral in the world, built over the burial site of St. Olav, the patron saint of Norway. Features stunning Gothic architecture, intricate stonework, stained glass windows, and serves as the traditional coronation site for Norwegian monarchs.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, but hours vary seasonally. Check website for current opening times and tour availability. Tower access may be restricted in winter or bad weather. Concerts and services held regularly.",
      "booking_tips": "Tickets can be bought online or at the visitor center. Combo tickets available for cathedral, crown regalia, and Archbishop's Palace Museum. Allow 1.5-2 hours for a visit, more if climbing the tower.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 63.4269,
      "longitude": 10.3970
    },
    {
      "name": "Old Town Bridge (Gamle Bybro)",
      "type": "Landmark",
      "description": "A picturesque wooden bridge dating back to 1861 (rebuilt), offering iconic views of the colorful warehouses along the Nidelva River and Nidaros Cathedral. Known as the 'Portal of Happiness'.",
      "indoor": false,
      "best_time": "Daytime/Sunset",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Particularly scenic during sunrise, sunset, and in the evening when lights reflect on the water. Can be icy in winter.",
      "booking_tips": "No booking required. Popular spot for photos. Connects the city center with the Bakklandet district. Allow 15-30 minutes.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 63.4286,
      "longitude": 10.4000
    },
    {
      "name": "Bakklandet",
      "type": "Urban Area",
      "description": "Charming, historic neighborhood with well-preserved wooden houses, cobblestone streets, independent shops, cozy cafés, and restaurants lining the Nidelva River. Known for its picturesque atmosphere and relaxed vibe.",
      "indoor": false,
      "best_time": "Afternoon/Evening",
      "price_range": "Free (exploration), Moderate (dining/shopping)",
      "seasonal_notes": "Beautiful year-round. Summer offers outdoor seating and a lively atmosphere. Winter is cozy with festive lights. Shops may have limited hours, especially on Sundays.",
      "booking_tips": "No booking needed to explore. Cafe/restaurant reservations can be useful, especially on weekends. Easily accessible by foot from the city center via the Old Town Bridge. Allow 1-3 hours to wander.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 63.4295,
      "longitude": 10.4025
    },
    {
      "name": "Kristiansten Fortress",
      "type": "Historic Site",
      "description": "A well-preserved fortress built in the 17th century to protect Trondheim after a major fire. Offers panoramic views of the city, the fjord, and surrounding areas. The grounds are open to the public, and the keep houses historical exhibits.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free (grounds), Low (keep/museum)",
      "seasonal_notes": "Grounds open year-round. Keep/museum typically open during summer months (check website for exact dates/times). Offers great views in all seasons, though access might be slippery in winter.",
      "booking_tips": "No booking required for grounds. Check opening times for the keep. Accessible by a steep walk from Bakklandet or by bus. Allow 1-1.5 hours.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 63.4282,
      "longitude": 10.4099
    },
    {
      "name": "Rockheim",
      "type": "Museum",
      "description": "Norway's national museum of popular music, showcasing the history of Norwegian pop and rock music from the 1950s to the present. Features interactive exhibits, listening stations, historical artifacts, and a changing light facade on the building.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, check website for current hours and exhibitions. Located in a former grain warehouse at the harbor.",
      "booking_tips": "Tickets can be purchased online or at the entrance. Allow 2-3 hours for a full experience. Located near the Hurtigruten terminal and easily accessible.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 3
      },
      "latitude": 63.4394,
      "longitude": 10.4026
    },
    {
      "name": "Ringve Museum",
      "type": "Museum",
      "description": "Norway's national museum for music and musical instruments, housed in a beautiful manor surrounded by botanical gardens. Exhibits cover music history and instruments from around the world. Guided tours often include live musical demonstrations.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Museum and gardens open year-round, but hours and tour availability vary seasonally (check website). Gardens are especially beautiful in summer.",
      "booking_tips": "Guided tours are the main way to see the instrument collection; check tour times and book if possible. Located slightly outside the city center, accessible by bus. Allow 2-3 hours including gardens.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 63.4479,
      "longitude": 10.4489
    },
    {
      "name": "Tyholttårnet",
      "type": "Landmark",
      "description": "A 124-meter tall radio tower with a revolving restaurant ('Egon') near the top, offering 360-degree panoramic views of Trondheim, the fjord, and the surrounding landscape. The restaurant floor completes a full rotation every hour.",
      "indoor": true,
      "best_time": "Sunset/Evening (for restaurant)",
      "price_range": "Moderate-High (restaurant visit required for view)",
      "seasonal_notes": "Open year-round. Views are best on clear days. Restaurant hours may vary; check website.",
      "booking_tips": "Reservations recommended for the Egon restaurant, especially for window tables or during peak times. Located outside the city center, accessible by bus or taxi. Primarily a dining experience combined with a view.",
      "ratings": {
        "cost_estimate": 30,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 2
      },
      "latitude": 63.4200,
      "longitude": 10.4327
    },
    {
      "name": "Munkholmen",
      "type": "Historic Site",
      "description": "A small island in the Trondheim Fjord with a rich history, serving variously as a execution site, monastery, fortress, and prison. Today, it's a popular summer destination for swimming, sunbathing, and exploring the historic structures.",
      "indoor": false,
      "best_time": "Summer",
      "price_range": "Low-Moderate (boat fare)",
      "seasonal_notes": "Accessible by boat ferry during summer months only (typically late May to early September). Check ferry schedule. Facilities like cafes may only operate in peak summer.",
      "booking_tips": "Purchase boat tickets at the Ravnkloa fish market pier. Ferries run regularly during the season. Allow 2-4 hours including boat trip and island exploration. Guided tours may be available on the island.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 3
      },
      "latitude": 63.4511,
      "longitude": 10.3897
    },
    {
      "name": "Trondheim Fjord",
      "type": "Nature",
      "description": "Norway's third-longest fjord, stretching 130 km inland. Offers opportunities for boat trips, fishing, kayaking, and enjoying scenic coastal landscapes near the city. Several smaller islands and coastal communities dot the fjord.",
      "indoor": false,
      "best_time": "Summer",
      "price_range": "Free (access), Moderate (tours/activities)",
      "seasonal_notes": "Accessible year-round, but water activities and boat tours are primarily summer activities (June-August). Ferry services operate to some fjord locations.",
      "booking_tips": "Various boat tours (sightseeing, fishing) depart from Trondheim harbor; booking in advance is recommended during peak season. Kayak rentals available. Public transport (bus/ferry) reaches some coastal areas.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 4.0,
        "cultural_significance": 3
      },
      "latitude": 63.5000,
      "longitude": 10.5000 
    },
    {
      "name": "Trondheim Science Museum (Vitensenteret)",
      "type": "Museum",
      "description": "Interactive science museum with hands-on exhibits covering physics, technology, mathematics, and natural sciences. Popular with families, the museum offers engaging learning experiences through experiments and demonstrations.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with consistent hours. Special exhibits and events may be scheduled during school holidays.",
      "booking_tips": "No advance booking required, but can be busy during weekends and school holidays. Located in the city center, easily accessible by public transport. Allow 2-3 hours for a full visit.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 3
      },
      "latitude": 63.4302,
      "longitude": 10.3881
    },
    {
      "name": "NTNU University Museum",
      "type": "Museum",
      "description": "Comprehensive museum showcasing natural history, archaeology, and cultural history of central Norway. Features exhibits on Viking artifacts, regional wildlife, geological specimens, and the indigenous Sami culture.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with seasonal exhibitions. Check website for current exhibitions and opening hours.",
      "booking_tips": "No advance booking necessary. Located near the city center at Kalvskinnet campus. Allow 1.5-2 hours for a thorough visit.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 63.4297,
      "longitude": 10.3918
    },
    {
      "name": "Stiftsgården",
      "type": "Historic Site",
      "description": "The royal residence in Trondheim, this is Scandinavia's largest wooden palace, built in the late 18th century. Used by the Norwegian royal family during visits to the city, it showcases elegant period furnishings and architecture.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open for guided tours most of the year, but may close for official functions and royal visits. Summer offers more frequent tours.",
      "booking_tips": "Tours are guided only and run at specific times; check schedule online. No photography allowed inside. Located in the city center. Allow 1 hour for tour.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 4
      },
      "latitude": 63.4305,
      "longitude": 10.3936
    },
    {
      "name": "Gråkallbanen Tram",
      "type": "Transportation/Attraction",
      "description": "Historic tram line running from the city center to the Bymarka forest and recreational area. One of the world's northernmost tram services, offering scenic views and access to hiking and skiing areas.",
      "indoor": false,
      "best_time": "Any season",
      "price_range": "Low",
      "seasonal_notes": "Operates year-round. Summer provides access to hiking trails, while winter connects to cross-country ski tracks and small alpine ski facilities.",
      "booking_tips": "No booking required; use regular public transport tickets. Trams run approximately hourly. Consider full-day outdoor activities at the terminus. Check timetable before planning.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 63.4228,
      "longitude": 10.3473
    },
    {
      "name": "Bymarka Forest",
      "type": "Nature",
      "description": "Extensive forest and recreational area west of Trondheim city center, covering over 80 square kilometers. Features numerous lakes, hiking trails, ski tracks, and scenic viewpoints overlooking the city and fjord.",
      "indoor": false,
      "best_time": "All seasons",
      "price_range": "Free",
      "seasonal_notes": "Popular for hiking and swimming in summer, mushroom and berry picking in autumn, and extensive cross-country skiing in winter. Over 200 km of prepared ski tracks in winter months.",
      "booking_tips": "Accessible by Gråkallbanen tram, bus or car. No booking required. Trail maps available online and at information points. Allow half or full day depending on activities planned.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 4.0,
        "cultural_significance": 3
      },
      "latitude": 63.4150,
      "longitude": 10.3000
    },
    {
      "name": "Trøndelag Folk Museum",
      "type": "Museum",
      "description": "Open-air museum showcasing the region's rural culture and architecture with over 80 historical buildings from the 16th to 20th centuries. Includes farmsteads, traditional dwelling houses, and a stave church.",
      "indoor": false,
      "best_time": "Summer",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, but summer offers the best experience with more buildings accessible, live demonstrations, and special events. Limited operations in winter.",
      "booking_tips": "No advance booking needed. Located at Sverresborg, accessible by bus from city center. Allow 2-4 hours to explore properly. Cafe on site.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 5
      },
      "latitude": 63.4142,
      "longitude": 10.3464
    },
    {
      "name": "Pirbadet",
      "type": "Recreation",
      "description": "Scandinavia's largest indoor water park, featuring swimming pools, water slides, diving boards, saunas, jacuzzis, and a wave pool. Located in the harbor area with large glass windows overlooking the fjord.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, making it an excellent bad-weather option. Can be busy during school holidays and weekends.",
      "booking_tips": "No advance booking required, but check website for busy periods. Located at Brattøra near the central station. Family tickets available. Allow 2-3 hours.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 1
      },
      "latitude": 63.4407,
      "longitude": 10.4032
    },
    {
      "name": "Archbishop's Palace Museum",
      "type": "Museum",
      "description": "Historical museum located in the medieval Archbishop's Palace complex adjacent to Nidaros Cathedral. Houses archaeological finds, church artifacts, and the Norwegian Crown Regalia (royal crown, scepter and sword).",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round, often included in combined tickets with Nidaros Cathedral. Crown Regalia exhibition may have separate hours.",
      "booking_tips": "No advance booking required. Combined tickets with Nidaros Cathedral offer better value. Located in the same complex as the cathedral. Allow 1-1.5 hours.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 63.4272,
      "longitude": 10.3977
    },
    {
      "name": "Solsiden",
      "type": "Urban Area",
      "description": "Modern shopping and dining district in a converted shipyard. Features restaurants with outdoor seating, boutiques, cafes, and bars in a pedestrian-friendly environment popular with locals and visitors alike.",
      "indoor": false,
      "best_time": "Afternoon/Evening",
      "price_range": "Free (exploration), Moderate-High (dining/shopping)",
      "seasonal_notes": "Outdoor restaurant seating in summer. Indoor shopping mall section open year-round. Very lively on warm summer evenings.",
      "booking_tips": "No booking required for exploring. Restaurant reservations recommended, especially on weekend evenings. Located east of the city center, walkable or by bus. Allow 2-3 hours for dining and shopping.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 2
      },
      "latitude": 63.4352,
      "longitude": 10.4102
    },
    {
      "name": "Ladestien Coastal Trail",
      "type": "Nature",
      "description": "Scenic 14 km hiking path following the coastline east of Trondheim center, passing beaches, forests, historic sites, and residential areas with beautiful views of the fjord.",
      "indoor": false,
      "best_time": "Spring/Summer/Fall",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round, but best from April to October. Parts may be muddy after rain or icy in winter. Several beaches good for swimming in summer.",
      "booking_tips": "No booking required. Start from Trondheim center or from various access points along the path. Public transportation available to/from different sections. Allow 3-5 hours for full trail or choose shorter segments.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 4.0,
        "cultural_significance": 2
      },
      "latitude": 63.4523,
      "longitude": 10.4584
    },
    {
      "name": "Trondheim Maritime Museum",
      "type": "Museum",
      "description": "Museum dedicated to the maritime history of Trondheim and the region, housed in a former customs warehouse. Exhibits focus on shipping, fishing industry, maritime trade, and boat building traditions.",
      "indoor": true,
      "best_time": "Anytime",
      "price_range": "Low",
      "seasonal_notes": "Open year-round with limited hours in winter. Check website for current opening times.",
      "booking_tips": "No advance booking needed. Located near the harbor and old town warehouses. Small museum; allow approximately 1 hour.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 63.4348,
      "longitude": 10.4022
    }
  ]
}