{
    "city_name": "Nice",
    "country": "France",
    "brief_description": "Nestled along the stunning French Riviera, Nice combines Mediterranean charm with French sophistication. This coastal gem offers a perfect blend of beach life, historic architecture, and cultural richness, making it one of France's most beloved destinations.",
    "nickname": "Queen of the French Riviera",
    "region": "Provence-Alpes-Côte d'Azur",
    "population": {
      "city": 0.34,
      "metro": 1.0,
      "unit": "million"
    },
    "sections": [
      {
        "title": "Mediterranean Paradise",
        "content": "Nice's stunning coastline along the Baie des Anges (Bay of Angels) features the famous Promenade des Anglais, where visitors can enjoy the Mediterranean sun and sea. The city's unique pebble beaches and azure waters create an idyllic setting for relaxation and recreation.",
        "icon": "beach"
      },
      {
        "title": "Historic Charm",
        "content": "The Old Town (Vieux Nice) captivates with its narrow streets, colorful buildings, and Italian-influenced architecture. The city's rich history is reflected in its Baroque churches, Belle Époque buildings, and the historic Castle Hill that offers panoramic views.",
        "icon": "castle"
      },
      {
        "title": "Artistic Heritage",
        "content": "Nice has inspired countless artists, including Chagall and Matisse, who left their mark on the city. The Musée Matisse and Musée Chagall showcase their works, while the city's light and colors continue to influence contemporary artists.",
        "icon": "palette"
      },
      {
        "title": "Mediterranean Cuisine",
        "content": "Nice's culinary scene celebrates Mediterranean flavors with specialties like Salade Niçoise, Socca, and Ratatouille. The city's markets, especially the famous Cours Saleya, offer fresh local produce and regional specialties.",
        "icon": "restaurant"
      }
    ],
    "why_visit": {
      "intro": "Nice offers a perfect blend of Mediterranean lifestyle and French culture, providing visitors with diverse experiences from beach relaxation to cultural exploration.",
      "highlights": [
        {
          "title": "Promenade des Anglais",
          "content": "This iconic waterfront promenade stretches along the Mediterranean, offering stunning views, beach access, and a perfect spot for people-watching and sunset viewing.",
          "image": "/images/nice/promenade.jpg"
        },
        {
          "title": "Old Town",
          "content": "Vieux Nice's narrow streets, colorful buildings, and bustling markets create an authentic Mediterranean atmosphere. The area is filled with restaurants, bars, and shops offering local specialties.",
          "image": "/images/nice/old-town.jpg"
        },
        {
          "title": "Castle Hill",
          "content": "The historic hilltop park offers panoramic views of Nice and the Mediterranean. The site features waterfalls, walking paths, and the ruins of an ancient castle.",
          "image": "/images/nice/castle-hill.jpg"
        },
        {
          "title": "Art Museums",
          "content": "Nice's art museums showcase works by Matisse, Chagall, and other artists inspired by the city's light and colors. The modern art museum (MAMAC) features contemporary works.",
          "image": "/images/nice/matisse-museum.jpg"
        },
        {
          "title": "Local Markets",
          "content": "The Cours Saleya market offers fresh produce, flowers, and local specialties. The market transforms into a vibrant evening scene with restaurants and bars.",
          "image": "/images/nice/market.jpg"
        },
        {
          "title": "Mediterranean Beaches",
          "content": "Nice's pebble beaches along the Baie des Anges provide perfect spots for swimming, sunbathing, and water sports, with the Alps visible in the background.",
          "image": "/images/nice/beach.jpg"
        }
      ]
    },
    "practical_info": {
      "language": "French",
      "currency": "Euro (€)",
      "timezone": "Central European Time (GMT+1)",
      "emergency_number": "112",
      "useful_phrases": [
        {"phrase": "Bonjour", "pronunciation": "bon-ZHOOR", "meaning": "Hello/Good day"},
        {"phrase": "Merci", "pronunciation": "mehr-SEE", "meaning": "Thank you"},
        {"phrase": "S'il vous plaît", "pronunciation": "seel voo PLEH", "meaning": "Please"},
        {"phrase": "Excusez-moi", "pronunciation": "ex-koo-zay MWAH", "meaning": "Excuse me"}
      ],
      "transport": {
        "airport_options": [
          {"name": "Nice Côte d'Azur (NCE)", "distance_to_center": "7 km", "transfer_options": ["Tram", "Bus", "Taxi"]}
        ],
        "public_transport": "Nice has an efficient public transportation system including trams, buses, and trains. The tram system provides easy access to major attractions and neighborhoods.",
        "passes": "The Ligne d'Azur pass offers unlimited travel on public transport for various durations."
      }
    },
    "seasonal_notes": {
      "spring": {
        "months": "April-June",
        "description": "Spring brings mild temperatures and blooming flowers, perfect for exploring the city and enjoying outdoor activities. The beaches become more accessible, and tourist crowds are moderate.",
        "highlights": ["Spring flowers", "Pleasant temperatures", "Fewer crowds"],
        "considerations": ["Occasional rain", "Variable weather"],
        "recommended": true
      },
      "summer": {
        "months": "July-August",
        "description": "Summer is peak season with perfect beach weather and numerous festivals. The city comes alive with outdoor events and beach activities.",
        "highlights": ["Beach activities", "Summer festivals", "Long days"],
        "considerations": ["Peak tourist season", "Higher prices", "Hot temperatures"],
        "recommended": true
      },
      "fall": {
        "months": "September-October",
        "description": "Autumn offers comfortable temperatures and fewer crowds while maintaining good weather for outdoor activities. The sea remains warm enough for swimming.",
        "highlights": ["Warm sea", "Fewer tourists", "Cultural events"],
        "considerations": ["Occasional rain", "Shorter days"],
        "recommended": true
      },
      "winter": {
        "months": "November-March",
        "description": "Winter brings mild temperatures compared to northern Europe, making Nice an attractive destination. The city maintains its charm with fewer tourists and lower prices.",
        "highlights": ["Lower prices", "Fewer crowds", "Mild climate"],
        "considerations": ["Cooler temperatures", "Some attractions closed", "Limited beach activities"],
        "recommended": true
      }
    },
    "meta": {
      "last_updated": "2024-03-24",
      "version": 1.0
    }
} 