{
    "sites": [
        {
            "name": "Cathédrale Saint-Pierre de Rennes",
            "type": "Gothic Cathedral",
            "description": "This impressive Gothic cathedral, built between the 12th and 19th centuries, is the main religious building in Rennes. The cathedral features a mix of architectural styles, with its most striking feature being the 19th-century neo-classical façade. Inside, visitors can admire the beautiful stained glass windows and the impressive organ.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. Summer brings long daylight hours for admiring the architecture. Spring and autumn offer pleasant weather for exploration. Winter visits are quieter with beautiful light through stained glass.",
            "booking_tips": "No advance booking required for general visits. Guided tours available in French. Check schedule for special events and organ concerts.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Parlement de Bretagne",
            "type": "Historic Building",
            "description": "This magnificent 17th-century building is the former seat of the Parliament of Brittany and one of Rennes' most iconic landmarks. The building features stunning classical architecture with elaborate decorations, including the famous ceiling paintings by Charles Le Brun. It's a symbol of Brittany's historical autonomy and architectural heritage.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with guided tours. Summer is peak tourist season. Winter offers intimate experiences with fewer crowds.",
            "booking_tips": "Advance booking required for guided tours. Tours available in French and English. Security check required before entry.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Place des Lices",
            "type": "Historic Market Square",
            "description": "This historic square has been the heart of Rennes since medieval times, originally serving as a tournament ground for knights. Today it hosts one of France's largest markets every Saturday, with over 300 vendors selling local produce, crafts, and regional specialties. The square is surrounded by beautiful half-timbered houses.",
            "indoor": false,
            "best_time": "Saturday Morning",
            "price_range": "Free",
            "seasonal_notes": "Most vibrant on Saturday mornings year-round. Summer brings fresh local produce and outdoor dining. Winter offers cozy indoor experiences in nearby cafés.",
            "booking_tips": "No booking required. Best visited early Saturday morning for the full market experience. Many cafés offer outdoor seating in good weather.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Les Champs Libres",
            "type": "Cultural Center",
            "description": "This modern cultural complex houses the Brittany Museum, the Science Space, and the Planetarium. The building itself is an architectural marvel designed by Christian de Portzamparc. It's the perfect place to learn about Breton culture, history, and science through interactive exhibits and temporary exhibitions.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Low to Moderate",
            "seasonal_notes": "Open year-round with climate control. Special exhibitions rotate seasonally. Less crowded on weekday afternoons.",
            "booking_tips": "No advance booking required for general admission. Audio guides available in French and English. Combined tickets available for multiple attractions.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 3,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Théâtre National de Bretagne",
            "type": "Theater",
            "description": "This prestigious theater is one of France's national theaters and a major cultural institution in Rennes. The building combines modern architecture with historic elements and hosts performances of theater, dance, and music. It's a great place to experience contemporary French and international performing arts.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate to High",
            "seasonal_notes": "Performance schedule varies throughout the year. Summer often features outdoor performances. Winter brings indoor productions.",
            "booking_tips": "Advance booking essential for performances. Check schedule online. Some performances offer student discounts.",
            "ratings": {
                "cost_estimate": 25,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Parc du Thabor",
            "type": "Public Garden",
            "description": "This beautiful 10-hectare park is one of Rennes' most beloved green spaces, featuring French and English gardens, a rose garden, an aviary, and a botanical garden. The park offers peaceful walking paths, beautiful flower displays, and is perfect for relaxation and photography.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Most beautiful in spring with blossoming flowers. Summer offers shade and cooler temperatures. Autumn brings beautiful foliage colors. Winter visits are peaceful but weather-dependent.",
            "booking_tips": "No booking required. Free access during daylight hours. Popular for jogging, picnics, and photography.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Musée des Beaux-Arts",
            "type": "Fine Arts Museum",
            "description": "This museum houses an impressive collection of paintings, sculptures, and decorative arts from the 14th to 20th centuries. The collection includes works by French and European artists, with particular emphasis on Breton art and the city's cultural heritage. The building itself is a beautiful 19th-century structure.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open year-round except Tuesdays. Air conditioned in summer. Special exhibitions rotate seasonally.",
            "booking_tips": "No advance booking required. Free guided tours available on weekends. Audio guides available in French and English.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Portes Mordelaises",
            "type": "Medieval City Gate",
            "description": "These impressive medieval gates are the last remaining entrance to the old walled city of Rennes. Built in the 15th century, they feature two massive towers and were once part of the city's defensive system. Today they stand as a reminder of Rennes' medieval past and make for excellent photography.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Visible year-round. Best photographed in morning light. The surrounding area is particularly pleasant in spring and autumn.",
            "booking_tips": "No booking required. Free to view from the street. Located near the cathedral and easily accessible.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Rue du Chapitre",
            "type": "Historic Street",
            "description": "This charming medieval street in the old town is lined with beautiful half-timbered houses dating from the 15th to 17th centuries. The street survived the great fire of 1720 and offers visitors a glimpse into Rennes' medieval architecture. It's perfect for a leisurely stroll and photography.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Summer brings outdoor café culture. Winter offers cozy indoor experiences. The street is particularly atmospheric in the evening.",
            "booking_tips": "No booking required. Best explored on foot. Many shops and cafés along the street.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Église Saint-Germain",
            "type": "Historic Church",
            "description": "This beautiful church, built in the 15th century, is one of Rennes' oldest religious buildings. The church features impressive Gothic architecture, beautiful stained glass windows, and a peaceful atmosphere. It's particularly known for its elegant spire and the quality of its stonework.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful lighting in afternoon hours. Special religious services during important feast days. Organ concerts occasionally held.",
            "booking_tips": "No booking required. Respect quiet during services. Check schedule for special events and concerts.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Place Sainte-Anne",
            "type": "Historic Square",
            "description": "This charming square in the old town is surrounded by historic buildings and traditional Breton restaurants. The square is a perfect place to experience the authentic atmosphere of Rennes and enjoy local Breton cuisine, including galettes and crêpes, while watching local life unfold.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Lively throughout the year. Summer brings outdoor dining and street life. Winter offers cozy indoor restaurant experiences. The square is particularly atmospheric in the evening.",
            "booking_tips": "No booking required. Many restaurants offer outdoor seating in good weather. Popular spot for traditional Breton cuisine.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Canal d'Ille-et-Rance",
            "type": "Historic Waterway",
            "description": "This historic canal, built in the 19th century, connects the Ille and Rance rivers and passes through the outskirts of Rennes. The canal is lined with walking and cycling paths and offers a peaceful route for exploring the city's green spaces. It's particularly beautiful in the evening when illuminated.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Spring brings fresh greenery along the banks. Summer evenings feature pleasant walks and cooling breezes. Autumn offers beautiful foliage colors.",
            "booking_tips": "No booking required. Free access at all times. Popular for evening strolls, cycling, and photography.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Marché des Lices",
            "type": "Traditional Market",
            "description": "This is one of France's largest and most vibrant markets, held every Saturday morning in Place des Lices. The market features over 300 vendors selling local Breton produce, seafood, crafts, and regional specialties. It's a perfect place to experience local culture and sample regional products.",
            "indoor": false,
            "best_time": "Saturday Morning",
            "price_range": "Free",
            "seasonal_notes": "Most vibrant on Saturday mornings year-round. Summer brings fresh local produce and seafood. Winter offers seasonal specialties and warm indoor experiences.",
            "booking_tips": "No booking required. Best visited early Saturday morning for the full market experience. Many vendors accept cash only.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Écomusée du Pays de Rennes",
            "type": "Local History Museum",
            "description": "This open-air museum showcases traditional Breton rural life and architecture. Located in a restored 17th-century farmhouse, it displays traditional farming tools, household items, and demonstrates how people lived in the region before modernization. It's a great way to understand Breton cultural heritage.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Low",
            "seasonal_notes": "Open year-round except Mondays. Summer offers outdoor demonstrations. Winter focuses on indoor exhibits.",
            "booking_tips": "No advance booking required. Guided tours available in French. Located slightly outside the city center.",
            "ratings": {
                "cost_estimate": 4,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        },
        {
            "name": "Place de la Mairie",
            "type": "City Hall Square",
            "description": "This elegant square is dominated by the impressive Hôtel de Ville (City Hall), built in the 18th century. The square features beautiful classical architecture and is often used for public events and celebrations. It's a perfect place to admire the city's administrative architecture and take photographs.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round. Summer brings outdoor events and festivals. Winter offers cozy indoor experiences in nearby cafés. The square is particularly atmospheric in the evening.",
            "booking_tips": "No booking required. Best explored on foot. Many cafés offer outdoor seating in good weather.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 48.1113,
            "longitude": -1.6800
        }
    ]
}