{
    "Spring": {
        "activities": [
            {
                "name": "Bologna Portico Festival",
                "type": "Cultural Festival",
                "description": "Celebrate Bologna's UNESCO World Heritage porticoes with special guided tours, exhibitions, and cultural events throughout the city.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Held in May, this festival highlights the city's unique portico system with special access to normally closed areas and cultural events.",
                "booking_tips": "Special tours require advance booking; free events are first-come-first-served."
            },
            {
                "name": "San Luca Pilgrimage",
                "type": "Religious Tradition",
                "description": "Join locals in the traditional spring pilgrimage along the world's longest portico to the Sanctuary of San Luca.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers perfect weather for the 3.8 km walk along the historic portico, with blooming flowers and pleasant temperatures.",
                "booking_tips": "No booking needed; start early to avoid midday heat and crowds."
            },
            {
                "name": "Bologna Food Festival",
                "type": "Food & Drink",
                "description": "Experience Bologna's rich culinary heritage with tastings, cooking demonstrations, and food market events.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Spring brings fresh local ingredients and perfect weather for outdoor food events and tastings.",
                "booking_tips": "Book cooking classes and special tastings in advance; market events are free."
            },
            {
                "name": "University Open Days",
                "type": "Cultural",
                "description": "Visit the historic University of Bologna buildings and courtyards during special spring open days.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings special access to historic university buildings and guided tours of the campus.",
                "booking_tips": "Check university website for open day schedules; some tours require advance registration."
            },
            {
                "name": "Giardini Margherita Spring Festival",
                "type": "Outdoor Festival",
                "description": "Enjoy spring activities in Bologna's largest public park, including concerts, food stalls, and family events.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Spring brings perfect weather for outdoor activities in the park, with blooming flowers and pleasant temperatures.",
                "booking_tips": "No booking needed for general events; check park website for special event schedules."
            },
            {
                "name": "Bologna Art Week",
                "type": "Cultural Festival",
                "description": "Experience contemporary art exhibitions and events throughout the city's galleries and cultural venues.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Spring brings special art exhibitions and cultural events to Bologna's historic venues.",
                "booking_tips": "Some exhibitions require advance booking; check event website for details."
            },
            {
                "name": "Easter Week Traditions",
                "type": "Religious Tradition",
                "description": "Experience Bologna's Holy Week celebrations and traditional Easter events in historic churches.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Holy Week brings special religious ceremonies and traditional celebrations to Bologna's historic churches.",
                "booking_tips": "Check church schedules for special events; arrive early for popular ceremonies."
            },
            {
                "name": "Colli Bolognesi Wine Tour",
                "type": "Food & Drink",
                "description": "Visit the wine-producing hills surrounding Bologna for tastings and vineyard tours.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers perfect weather for visiting vineyards and enjoying wine tastings in the countryside.",
                "booking_tips": "Book vineyard tours in advance; consider hiring a driver for wine tasting excursions."
            },
            {
                "name": "Bologna Bike Tour",
                "type": "Outdoor Activity",
                "description": "Explore Bologna's historic center and surrounding areas by bicycle during spring's pleasant weather.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring provides ideal conditions for cycling, with mild temperatures and blooming scenery.",
                "booking_tips": "Book guided tours in advance; bike rentals available throughout the city."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Bologna Estate Festival",
                "type": "Cultural Festival",
                "description": "Experience summer cultural events including outdoor concerts, theater performances, and film screenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Summer brings a full program of outdoor cultural events to Bologna's historic squares and venues.",
                "booking_tips": "Check festival website for program; popular events may require advance booking."
            },
            {
                "name": "San Luca Sunset Walk",
                "type": "Outdoor Activity",
                "description": "Walk the historic portico to San Luca in the evening for spectacular sunset views over Bologna.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings offer perfect conditions for the walk, with cooler temperatures and beautiful sunsets.",
                "booking_tips": "Start walking about 2 hours before sunset; bring water and comfortable shoes."
            },
            {
                "name": "Bologna Jazz Festival",
                "type": "Music Festival",
                "description": "Enjoy jazz performances in historic venues and outdoor spaces throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings international jazz artists to Bologna's historic venues.",
                "booking_tips": "Book tickets in advance for popular performances; some outdoor events are free."
            },
            {
                "name": "Mercato di Mezzo Summer Nights",
                "type": "Food & Drink",
                "description": "Experience extended evening hours at the historic food market with special summer events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings special evening events and extended hours to the historic food market.",
                "booking_tips": "No booking needed; arrive early for popular food stalls."
            },
            {
                "name": "Bologna Opera Festival",
                "type": "Performance",
                "description": "Attend opera performances in historic venues during the summer festival season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer brings special opera productions to Bologna's historic theaters.",
                "booking_tips": "Book tickets months in advance; dress code is formal for evening performances."
            },
            {
                "name": "Giardini Margherita Summer Events",
                "type": "Outdoor Festival",
                "description": "Enjoy summer concerts, food festivals, and outdoor activities in the city's largest park.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Summer brings a full program of outdoor events to the park, including concerts and food festivals.",
                "booking_tips": "Check park website for event schedule; bring picnic supplies for outdoor concerts."
            },
            {
                "name": "Bologna Summer Sales",
                "type": "Shopping",
                "description": "Take advantage of Italy's regulated summer sales season in Bologna's shopping districts.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "Summer sales officially begin in early July, offering substantial discounts on Italian fashion.",
                "booking_tips": "Shop early in the sales period for the best selection; no booking needed."
            },
            {
                "name": "Bologna Food Tour Experience",
                "type": "Food & Drink",
                "description": "Explore Bologna's culinary heritage with guided food tours and tastings.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers perfect weather for food tours, with extended daylight hours.",
                "booking_tips": "Book tours in advance; wear comfortable shoes for walking."
            },
            {
                "name": "Bologna Night Photography Tour",
                "type": "Photography",
                "description": "Capture Bologna's historic architecture and atmosphere during summer evenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions for night photography with warm evenings and extended twilight.",
                "booking_tips": "Book guided tours in advance; bring tripod and appropriate camera equipment."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Bologna Wine Festival",
                "type": "Food & Drink",
                "description": "Celebrate the wine harvest with tastings and events featuring local wines from the Colli Bolognesi.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings the wine harvest and perfect conditions for wine tasting events.",
                "booking_tips": "Book tastings in advance; consider purchasing a wine pass for multiple tastings."
            },
            {
                "name": "Bologna Film Festival",
                "type": "Entertainment",
                "description": "Experience international and Italian cinema at this annual festival.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in late September/early October, the festival brings premieres and special screenings.",
                "booking_tips": "Purchase tickets and festival passes online in advance; some screenings include director Q&A sessions."
            },
            {
                "name": "Vendemmia Experience",
                "type": "Food & Drink",
                "description": "Participate in the grape harvest tradition in the vineyards of Colli Bolognesi.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September and early October are harvest months for local grape varieties.",
                "booking_tips": "Book vineyard tours with harvest experiences through wineries or tour operators."
            },
            {
                "name": "Bologna Art Week",
                "type": "Cultural Festival",
                "description": "Experience contemporary art exhibitions and events throughout the city.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Autumn brings special art exhibitions and cultural events to historic venues.",
                "booking_tips": "Check event website for program; some exhibitions require advance booking."
            },
            {
                "name": "Bologna Food Week",
                "type": "Food & Drink",
                "description": "Celebrate Bologna's culinary heritage with special events, tastings, and cooking demonstrations.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings perfect weather for food events and showcases seasonal ingredients.",
                "booking_tips": "Book cooking classes and special tastings in advance; market events are free."
            },
            {
                "name": "Bologna Portico Walking Tour",
                "type": "Cultural",
                "description": "Explore Bologna's historic portico system with guided tours and special access.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers comfortable temperatures for walking tours and exploring the porticoes.",
                "booking_tips": "Book guided tours in advance; wear comfortable walking shoes."
            },
            {
                "name": "Bologna Jazz Festival",
                "type": "Music Festival",
                "description": "Enjoy jazz performances in historic venues throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings international jazz artists to Bologna's historic venues.",
                "booking_tips": "Book tickets in advance for popular performances; some events are free."
            },
            {
                "name": "Bologna Food Market Tour",
                "type": "Food & Drink",
                "description": "Explore traditional food markets and specialty shops in the historic center.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings seasonal ingredients and perfect weather for market visits.",
                "booking_tips": "Book guided tours in advance; bring reusable shopping bags."
            },
            {
                "name": "Bologna Architecture Tour",
                "type": "Cultural",
                "description": "Explore Bologna's historic architecture with guided tours and special access.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers comfortable temperatures for exploring the city's architecture.",
                "booking_tips": "Book guided tours in advance; wear comfortable walking shoes."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Bologna Christmas Market",
                "type": "Festival",
                "description": "Experience traditional Christmas markets and festive events in the historic center.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Winter brings festive markets and holiday celebrations to Bologna's historic squares.",
                "booking_tips": "Visit on weekday afternoons to avoid crowds; no booking needed."
            },
            {
                "name": "New Year's Eve in Piazza Maggiore",
                "type": "Festival",
                "description": "Celebrate New Year's Eve with concerts and fireworks in the historic main square.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "December 31st brings one of Bologna's largest public celebrations.",
                "booking_tips": "Arrive early to secure a good spot; restaurants require advance booking."
            },
            {
                "name": "Bologna Opera Season",
                "type": "Performance",
                "description": "Experience world-class opera at the historic Teatro Comunale.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter brings the main opera season with prestigious productions.",
                "booking_tips": "Purchase tickets months in advance; dress code is formal for evening performances."
            },
            {
                "name": "Bologna Winter Sales",
                "type": "Shopping",
                "description": "Take advantage of Italy's regulated winter sales season in Bologna's shopping districts.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "Winter sales officially begin in early January, offering substantial discounts.",
                "booking_tips": "Shop early in the sales period for the best selection; no booking needed."
            },
            {
                "name": "Bologna Food Tour Experience",
                "type": "Food & Drink",
                "description": "Explore Bologna's culinary heritage with guided food tours and tastings.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings perfect conditions for indoor food tours and tastings.",
                "booking_tips": "Book tours in advance; wear warm, comfortable clothing."
            },
            {
                "name": "Bologna Carnival Celebrations",
                "type": "Festival",
                "description": "Experience Bologna's unique take on Carnival with parades and celebrations.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Carnival brings street festivities and special events to the historic center.",
                "booking_tips": "Check municipal website for parade routes and official events."
            },
            {
                "name": "Bologna Portico Walking Tour",
                "type": "Cultural",
                "description": "Explore Bologna's historic portico system with guided tours.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers unique perspectives on the porticoes with seasonal decorations.",
                "booking_tips": "Book guided tours in advance; wear warm, comfortable clothing."
            },
            {
                "name": "Bologna Art Gallery Tour",
                "type": "Cultural",
                "description": "Visit Bologna's historic art galleries and museums.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings special exhibitions and comfortable conditions for gallery visits.",
                "booking_tips": "Check gallery websites for special exhibitions; some require advance booking."
            },
            {
                "name": "Bologna Food Market Tour",
                "type": "Food & Drink",
                "description": "Explore traditional food markets and specialty shops in the historic center.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings seasonal ingredients and perfect conditions for market visits.",
                "booking_tips": "Book guided tours in advance; bring warm, comfortable clothing."
            }
        ]
    }
} 