{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Weather",
                "details": "April brings ideal spring weather to Durres with warm, pleasant temperatures perfect for exploring the ancient Roman amphitheater, walking along the Adriatic coast, and enjoying outdoor dining at seaside restaurants."
            },
            {
                "reason": "Ancient History",
                "details": "Visit the Roman Amphitheater of Durres and the Archaeological Museum without the intense summer heat, making exploration of these UNESCO World Heritage sites more comfortable and enjoyable."
            },
            {
                "reason": "Adriatic Coast",
                "details": "April offers the perfect weather to stroll along Durres' beautiful beaches and promenade without the summer crowds, enjoying the fresh sea breeze and stunning sunset views over the Adriatic Sea."
            },
            {
                "reason": "Orthodox Easter",
                "details": "Experience traditional Albanian Orthodox Easter celebrations with special services at local churches, traditional Albanian Easter bread (kulakë), and family gatherings that showcase authentic Albanian culture."
            },
            {
                "reason": "Seafood Season",
                "details": "April marks the beginning of excellent seafood season in Durres, with fresh catches from the Adriatic served at beachfront restaurants and the local fish market coming alive."
            },
            {
                "reason": "Cultural Sites",
                "details": "Explore Durres' rich history including the Byzantine walls, Venetian Tower, and King Zog's former palace with comfortable spring weather and fewer tourist crowds than summer months."
            },
            {
                "reason": "Gateway to Albania",
                "details": "Use Durres as your base to explore nearby attractions like Krujë Castle, Tirana (30 minutes away), and the Albanian Riviera, with April's mild weather perfect for day trips."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Occasional Rain Showers",
                "details": "April in Durres can have occasional spring rain showers, though less frequent than northern European cities. Pack a light rain jacket for unexpected downpours."
            },
            {
                "reason": "Easter Period Crowds",
                "details": "Orthodox Easter (often in April or May) brings Albanian families and diaspora visitors to Durres, which can lead to busier restaurants and accommodations during holiday weekends."
            },
            {
                "reason": "Tourist Infrastructure",
                "details": "Some seasonal beach bars and tourist facilities may not be fully operational yet, as the main tourism season typically starts in May-June."
            }
        ],
        "first_half": {
            "date_range": "2025-04-01/2025-04-15",
            "weather": {
                "average_temperature": {
                    "high_celsius": 20,
                    "low_celsius": 12
                },
                "humidity_percent": 65,
                "wind_speed_kmh": 10,
                "precipitation": "April in Durres has moderate rainfall with about 8-10 rainy days. Spring showers are usually brief and followed by sunny periods.",
                "general_tips": "Pack light layers, comfortable walking shoes, and a light jacket for evenings. Sunscreen recommended for coastal walks.",
                "sunrise": "06:15",
                "sunset": "19:45"
            },
            "tourism_level": {
                "crowds": "Tourist numbers are low to moderate in April, making it an excellent time to visit major attractions without crowds. Local families begin spending more time at the beach.",
                "pricing": "Accommodation prices are very reasonable in April, as it's before peak summer season. Restaurants offer good value and fresh seafood specials.",
                "overall_atmosphere": "Durres has a relaxed, authentic feel with locals enjoying the spring weather. Cafes and restaurants extend outdoor seating along the promenade.",
                "wait_time_minutes": {
                    "roman_amphitheater": 5,
                    "archaeological_museum": 10,
                    "venetian_tower": 5
                },
                "public_transport_crowding": "Light, buses and furgons run regularly to Tirana and other cities"
            },
            "events_holidays": [
                {
                    "name": "Orthodox Easter",
                    "date": "2025-04-20/2025-04-21",
                    "description": "Traditional Albanian Orthodox Easter celebrations with special liturgies at local churches, family gatherings, and the traditional breaking of red eggs.",
                    "notes": "Many restaurants may have special Easter menus. Experience authentic Albanian hospitality during this important religious holiday.",
                    "website": "https://www.albania.al/",
                    "category": "Holiday",
                    "accessibility": "Churches and family celebrations welcome visitors respectfully dressed."
                },
                {
                    "name": "Durres Archaeological Festival",
                    "date": "Mid-April",
                    "description": "Annual festival celebrating Durres' rich history with guided tours of the Roman amphitheater, archaeological exhibitions, and cultural performances.",
                    "notes": "Perfect opportunity to learn about Durres' ancient history with expert guides and special access to archaeological sites.",
                    "website": "https://durres.gov.al/",
                    "category": "Cultural",
                    "accessibility": "Most events accessible, though ancient sites may have limited wheelchair access."
                }
            ],

            "local_foods_in_season": ["Fresh Seafood", "Spring Lamb", "Wild Asparagus", "Fresh Herbs (Oregano, Mint)", "Adriatic Fish", "Cheese (Djathë)", "Easter Bread (Kulakë)"]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "14°C"
                },
                "precipitation": "Late April becomes increasingly sunny with fewer rainy days. Perfect weather for beach walks and outdoor dining.",
                "general_tips": "Light clothing suitable for warm days, but bring a light sweater for evening strolls along the coast."
            },
            "tourism_level": {
                "crowds": "Still relatively quiet compared to peak summer, with increasing numbers of weekend visitors from Tirana and local day-trippers.",
                "pricing": "Accommodation remains affordable, restaurants begin extending hours and outdoor seating. Great value for money.",
                "overall_atmosphere": "The seaside promenade comes alive with evening strolls, outdoor cafes, and locals enjoying the warmer weather. Perfect for experiencing authentic Albanian coastal life."
            },
            "events_holidays": [
                {
                    "name": "Durres Spring Festival",
                    "date": "Late April",
                    "description": "Local spring festival celebrating the coastal lifestyle with traditional music, folk dancing, and seafood tastings along the waterfront.",
                    "notes": "A great opportunity to experience local culture and taste regional specialties. Usually features live music in the evenings."
                },
                {
                    "name": "International Workers' Day Preparation",
                    "date": "April 30",
                    "description": "Preparation for May 1st celebrations with community events and gatherings in Durres' parks and along the promenade.",
                    "notes": "May 1st is a national holiday in Albania, so late April sees preparation activities and a festive atmosphere building in the city."
                }
            ]
        }
    }
}