{
    "Spring": {
        "activities": [
            {
                "name": "Flores en la Ría Festival",
                "type": "Cultural",
                "description": "Experience Bilbao in bloom during this spring celebration featuring floral installations, garden exhibitions, and landscaping displays along the Nervión River.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Late March through April transforms Bilbao's riverfront walkways and bridges with spectacular floral displays celebrating spring's arrival.",
                "booking_tips": "No booking required; self-guided walking maps available at tourist information centers. Weekday visits offer a more relaxed experience."
            },
            {
                "name": "Basque Derby: Athletic Club vs. Real Sociedad",
                "type": "Sport",
                "description": "Experience the passion of Basque football at San Mamés Stadium during this historic rivalry between Bilbao's Athletic Club and San Sebastian's Real Sociedad.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Spring fixtures in La Liga season (typically March-May) offer more pleasant weather for match attendance than winter games.",
                "booking_tips": "Purchase tickets through Athletic Club's official website well in advance; matches often sell out. International ID required for ticket collection."
            },
            {
                "name": "Semana Santa (Holy Week) Processions",
                "type": "Cultural/Religious",
                "description": "Witness Bilbao's traditional Easter processions featuring religious brotherhoods carrying elaborate floats through the Old Town and city center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Dates vary each year (March-April) with processions throughout Holy Week, particularly impressive on Holy Thursday and Good Friday.",
                "booking_tips": "No booking required; arrive early to secure viewing spots along the main procession routes in Casco Viejo and Gran Vía."
            },
            {
                "name": "Mount Artxanda Bloom",
                "type": "Nature",
                "description": "Take the historic funicular railway to Mount Artxanda to experience panoramic views of Bilbao surrounded by spring blossoms and greenery.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget (funicular fare)",
                "seasonal_notes": "April and May offer lush green landscapes and clear days with optimal visibility of the surrounding mountains and cityscape.",
                "booking_tips": "No booking required for the funicular, which runs every 15 minutes. Visit on weekdays to avoid weekend crowds; bring a picnic to enjoy at the summit."
            },
            {
                "name": "Basque Spring Cuisine Tour",
                "type": "Food & Drink",
                "description": "Discover seasonal Basque delicacies featuring spring ingredients like white asparagus, anchovies, and spring lamb through restaurant special menus.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "April through June showcases the finest spring produce in Basque cuisine, with many restaurants offering special seasonal tasting menus.",
                "booking_tips": "Reserve tables at acclaimed restaurants like Mina or Zarate to experience their spring menus. Lunch reservations are easier to secure than dinner."
            },
            {
                "name": "Bilbao BBK Running Festival",
                "type": "Sport",
                "description": "Join or watch this popular running event with various race distances through Bilbao's most scenic neighborhoods and iconic landmarks.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget to participate, Free to watch",
                "seasonal_notes": "Typically held in May, the event offers comfortable spring temperatures ideal for running across Bilbao's distinctive city landscape.",
                "booking_tips": "Register online months in advance to participate in races. Spectators can watch for free along the route, with prime viewing spots near the Guggenheim and City Hall."
            },
            {
                "name": "Txakoli Wine Season",
                "type": "Food & Drink",
                "description": "Experience the release of new vintage Txakoli, the Basque Country's distinctive slightly sparkling white wine, with special tastings and pairings.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring marks the release of new Txakoli vintages, celebrated throughout Bilbao's wine bars and surrounding wine-producing areas like Getaria.",
                "booking_tips": "Reserve spots for guided Txakoli tastings through Bilbao tourism office or join a day trip to nearby Txakoli producers in Getaria or Bakio."
            },
            {
                "name": "Bilbao Architecture Week",
                "type": "Cultural",
                "description": "Explore Bilbao's renowned architectural heritage through special tours, exhibitions, and open buildings during this annual celebration.",
                "indoor": true,
                "best_time": "Varies",
                "price_range": "Varies",
                "seasonal_notes": "Held in May, this event celebrates Bilbao's transformation through architecture with unique access to significant buildings and special exhibitions.",
                "booking_tips": "Check the official website for program details; popular tours of iconic buildings like the Guggenheim behind-the-scenes should be booked well in advance."
            },
            {
                "name": "Day Trip to Urdaibai Biosphere Reserve",
                "type": "Nature",
                "description": "Explore this UNESCO-protected coastal ecosystem during spring migration season when thousands of birds pass through its marshes and forests.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "April and May are ideal for birdwatching as migratory species pass through, while spring flora transforms the landscape with vibrant colors.",
                "booking_tips": "Take the direct train from Bilbao-Atxuri station to Busturia-Itsasbegi for the Urdaibai Bird Center. Guided tours should be booked online in advance."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Aste Nagusia (Great Week) Festival",
                "type": "Festival",
                "description": "Experience Bilbao's largest festival featuring nine days of concerts, traditional sports, street performances, fireworks, and bullfights throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free entry (some events ticketed)",
                "seasonal_notes": "Held in late August, this massive celebration brings the entire city to life with festivities led by the symbolic figure Marijaia.",
                "booking_tips": "No booking needed for most events; accommodation should be reserved months in advance as the city fills completely during this period."
            },
            {
                "name": "Bilbao BBK Live Music Festival",
                "type": "Music",
                "description": "Attend one of Spain's premier music festivals featuring international headliners across multiple stages on Mount Cobetas overlooking the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held in early July, this three-day festival combines world-class music with stunning hillside views of Bilbao and camping options.",
                "booking_tips": "Purchase tickets months in advance; festival and camping passes sell out quickly. Shuttle buses run from central Bilbao to the venue."
            },
            {
                "name": "Beaches of Getxo and Sopelana",
                "type": "Outdoor Recreation",
                "description": "Escape the city heat at nearby coastal beaches accessible by metro, offering swimming, sunbathing, and renowned surfing conditions.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "June through September offers warm temperatures ideal for beach activities, with August being the busiest month as locals vacation.",
                "booking_tips": "No booking required; take Metro Line 1 to Algorta or Sopelana. Visit on weekdays to avoid weekend crowds."
            },
            {
                "name": "Kayaking on the Nervión River",
                "type": "Outdoor Recreation",
                "description": "Paddle through the heart of Bilbao on guided kayak tours offering unique perspectives of the city's iconic architecture from the water.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides calm water conditions and warm temperatures ideal for exploring Bilbao's rejuvenated riverfront by water.",
                "booking_tips": "Book tours through Bilboats or similar operators at least several days in advance, especially for weekend slots."
            },
            {
                "name": "Open-Air Cinema at Abandoibarra",
                "type": "Entertainment",
                "description": "Enjoy films under the stars with the illuminated Guggenheim and Nervión River as backdrop at this summer cinema series.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Screenings run through July and August, with films beginning after sunset around 10:00 PM in typical Spanish fashion.",
                "booking_tips": "Purchase tickets online or arrive early; bring something to sit on and light layers as evenings can cool down even in summer."
            },
            {
                "name": "Getxo International Jazz Festival",
                "type": "Music",
                "description": "Experience world-class jazz performances in the seaside district of Getxo, combining music with beautiful coastal scenery just outside Bilbao.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held in early July, this prestigious festival features performances in both indoor venues and outdoor stages near the historic port.",
                "booking_tips": "Purchase tickets online in advance; easily accessible from Bilbao via metro to Algorta station."
            },
            {
                "name": "Basque Coast Hiking Tour",
                "type": "Outdoor Recreation",
                "description": "Hike sections of the dramatic coastal path between Bilbao and San Sebastian, featuring stunning cliffs, fishing villages, and beaches.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "Summer offers the most reliable weather for coastal hiking, though early morning starts are recommended to avoid midday heat.",
                "booking_tips": "No booking required for self-guided hiking; public transportation connects various sections of the trail. The Uribe Kosta route from Plentzia to Sopelana is particularly accessible from Bilbao."
            },
            {
                "name": "San Mamés Stadium Tour",
                "type": "Sport",
                "description": "Visit Athletic Club's legendary stadium, known as 'The Cathedral of Football,' through guided tours explaining the club's unique Basque-only player policy and history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the chance to visit when no matches are scheduled, providing full access to areas normally restricted during the season.",
                "booking_tips": "Book tours online through Athletic Club's official website; English-language tours available on specific days."
            },
            {
                "name": "Vizcaya Bridge Experience",
                "type": "UNESCO Heritage",
                "description": "Visit the world's oldest transporter bridge, a UNESCO site connecting Portugalete and Getxo, with the option to ride the gondola or walk across the high panoramic walkway.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Summer provides clear views from the upper walkway, with pleasant temperatures for enjoying the coastal areas on either side of the bridge.",
                "booking_tips": "No booking required; regular gondola crossings operate throughout the day. The upper walkway requires a separate ticket and may close in windy conditions."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "BIME Live Music Festival and Conference",
                "type": "Music/Industry",
                "description": "Experience this dual music festival and industry conference featuring cutting-edge artists and music business innovators at the BEC venue.",
                "indoor": true,
                "best_time": "Evening for concerts, Day for conference",
                "price_range": "Expensive",
                "seasonal_notes": "Held in late October/early November, this event brings international music industry focus to Bilbao with both public concerts and professional conferences.",
                "booking_tips": "Purchase festival tickets online well in advance; industry conference passes available separately for music professionals."
            },
            {
                "name": "Rioja Alavesa Wine Harvest",
                "type": "Food & Drink",
                "description": "Experience the autumn grape harvest in the nearby Rioja Alavesa wine region with special winery tours, tastings, and harvest festivals.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "September and October mark the grape harvest season, when wineries come alive with activity and the countryside displays autumn colors.",
                "booking_tips": "Book guided tours from Bilbao with transportation included, or rent a car to explore independently. Major wineries like Ysios and Marqués de Riscal require advance reservations."
            },
            {
                "name": "Bilbao Mushroom Foraging",
                "type": "Food/Nature",
                "description": "Join guided mushroom hunting excursions in the forests surrounding Bilbao during peak season for this important Basque culinary tradition.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October and November offer ideal conditions for mushroom growth after autumn rains, with expert guides helping identify edible varieties.",
                "booking_tips": "Book through specialized tour operators like Bilbao Food Safari or local mycological associations; tours fill quickly during peak mushroom season."
            },
            {
                "name": "International Documentary Film Festival (Zinebi)",
                "type": "Cultural",
                "description": "Attend this prestigious documentary and short film festival featuring screenings, director talks, and workshops throughout Bilbao.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Held in November, this festival brings international documentary filmmakers to Bilbao during the atmospheric autumn season.",
                "booking_tips": "Purchase tickets online once the program is released; festival passes offer the best value for multiple screenings."
            },
            {
                "name": "Pintxo Championship Season",
                "type": "Food & Drink",
                "description": "Sample award-winning and competition pintxos as Bilbao's best bars compete in various autumn championships, creating innovative special offerings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Various pintxo competitions run through autumn, inspiring bars to create their most creative and delicious offerings to win prestigious titles.",
                "booking_tips": "No reservations needed for most pintxo bars; follow local food blogs or tourist office announcements to track which bars are competing and what their special competition pintxos are."
            },
            {
                "name": "Guggenheim Autumn Exhibition",
                "type": "Art",
                "description": "Experience the Guggenheim's major autumn exhibition, typically featuring international contemporary artists in specially curated shows.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn brings significant new exhibitions after the summer tourist season, often presenting the museum's most ambitious curatorial projects.",
                "booking_tips": "Purchase timed-entry tickets online to avoid queues; visit on weekday mornings for a more contemplative experience."
            },
            {
                "name": "Txotx Cider Season Opening",
                "type": "Food & Drink",
                "description": "Experience the beginning of Basque cider season with special events at sagardotegis (cider houses) featuring traditional cider-pouring rituals.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The cider season traditionally begins in late autumn, when new cider starts to mature and sagardotegis prepare for the official January opening.",
                "booking_tips": "Reserve spots for special pre-season events through local cider houses or join organized tours from Bilbao to nearby cider-producing regions."
            },
            {
                "name": "El Arenal Market Autumn Harvest",
                "type": "Market/Food",
                "description": "Explore Bilbao's historic market as it showcases autumn's bounty including wild mushrooms, game meats, and seasonal produce from the Basque countryside.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free entry (purchases extra)",
                "seasonal_notes": "October through December brings the richest seasonal products to the market, with specialized vendors offering foraged and hunted autumn delicacies.",
                "booking_tips": "No booking required; visit early on weekday mornings for the freshest selection and to watch locals selecting seasonal specialties."
            },
            {
                "name": "Basque Mountain Hiking",
                "type": "Outdoor Recreation",
                "description": "Experience the spectacular autumn colors in the mountains surrounding Bilbao, with hiking routes for all levels featuring dramatic landscapes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (transport costs only)",
                "seasonal_notes": "October provides ideal hiking conditions with comfortable temperatures, clear visibility, and forests transformed with fall colors.",
                "booking_tips": "Join guided hikes through mountain clubs or tourist operators for the best experience; popular routes include Gorbea Natural Park and Urkiola Natural Park."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Santo Tomás Festival",
                "type": "Cultural/Food",
                "description": "Experience Bilbao's traditional pre-Christmas market featuring Basque rural products, traditional txistorra sausage, and cultural demonstrations.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free entry (food purchases extra)",
                "seasonal_notes": "Held on December 21st, this festival transforms Plaza Nueva and the Old Town into a celebration of Basque rural traditions and winter foods.",
                "booking_tips": "No booking required; arrive early to avoid the largest crowds. Bring cash for food purchases from traditional farmhouse stalls."
            },
            {
                "name": "Txotx Cider Season",
                "type": "Food & Drink",
                "description": "Participate in the traditional Basque cider house experience, where new season's cider is poured directly from large barrels accompanied by a special menu.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The official season begins mid-January and runs through spring, with special opening ceremonies at major cider houses in the region.",
                "booking_tips": "Reserve well in advance for popular sagardotegis (cider houses); organized tours from Bilbao with transportation simplify the experience."
            },
            {
                "name": "Bilbao Arte Contemporary Art Winter Program",
                "type": "Art",
                "description": "Explore cutting-edge exhibitions by emerging artists at this dynamic art center housed in a converted warehouse in Bilbao's creative district.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter features thought-provoking exhibitions by artists-in-residence and the winter program typically offers the most experimental work.",
                "booking_tips": "No booking required; check their website for special events, artist talks, and workshop opportunities during exhibitions."
            },
            {
                "name": "Skiing Day Trip to Formigal",
                "type": "Sport",
                "description": "Take a day trip to the nearby Pyrenees for skiing and snowboarding at one of Spain's premier winter resorts, accessible from Bilbao.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "December through March offers reliable snow conditions, with January and February typically providing the best skiing weather.",
                "booking_tips": "Book organized day trips including transportation and lift tickets, or rent a car for more flexibility. Equipment rental available at the resort."
            },
            {
                "name": "Three Kings Parade (Cabalgata de Reyes)",
                "type": "Cultural",
                "description": "Experience Spain's most important Christmas tradition as the Three Kings parade through Bilbao distributing candies and bringing gifts to children.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on January 5th, the eve of Epiphany, this spectacular parade features elaborate floats and costumes across central Bilbao.",
                "booking_tips": "No booking required; arrive early for good viewing spots along Gran Vía and bring bags for children to collect thrown candies."
            },
            {
                "name": "Bilbao Winter Gastronomy",
                "type": "Food & Drink",
                "description": "Experience traditional Basque winter cuisine featuring hearty stews, bean dishes, and salt cod preparations at Bilbao's finest restaurants.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "January and February feature specialized winter menus highlighting warming dishes like alubias de Tolosa (black bean stew) and bacalao al pil-pil (cod in garlic sauce).",
                "booking_tips": "Reserve traditional restaurants like Restaurante Askora or Bascook to experience authentic winter Basque cuisine at its best. Lunch reservations are generally easier to secure than dinner."
            },
            {
                "name": "Athletic Club Football Match",
                "type": "Sport",
                "description": "Experience the passion of Basque football at San Mamés Stadium, known as 'The Cathedral,' during the heart of La Liga season.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Winter matches (December-February) often feature the most important fixtures of the season in comfortable conditions inside the state-of-the-art stadium.",
                "booking_tips": "Purchase tickets through Athletic Club's official website weeks in advance; international ID required for ticket collection. The atmosphere for derby matches against Real Sociedad or local rivals is particularly special."
            },
            {
                "name": "Carnival (Carnaval) in Bilbao",
                "type": "Festival",
                "description": "Experience Bilbao's version of carnival featuring costumes, parades, music, and the ceremonial burning of the carnival figure 'El Momo'.",
                "indoor": false,
                "best_time": "Afternoon and Evening",
                "price_range": "Free",
                "seasonal_notes": "Held in February or early March (date varies by liturgical calendar), bringing color and festivities to the city during the winter season.",
                "booking_tips": "No booking required for public celebrations; check the city's cultural agenda for specific events and parade routes."
            },
            {
                "name": "FIG Bilbao - International Printmaking Festival",
                "type": "Art",
                "description": "Explore this unique art fair dedicated to fine art printmaking, featuring galleries, master printers, and artists from around the world.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Typically held in November/December, this specialized art event showcases the rich tradition of printmaking in an intimate setting.",
                "booking_tips": "Purchase tickets online or at the venue; check the program for demonstrations, workshops, and artist talks that require separate registration."
            }
        ]
    }
}