{
    "neighborhoods": [
        {
            "name": "Casco Viejo",
            "alternate_names": [
                "Old Town",
                "Siete Calles",
                "Seven Streets"
            ],
            "character": "Bilbao's medieval heart with narrow cobblestone streets, historic buildings, and dense concentration of pintxo bars and traditional shops.",
            "location": {
                "central": true,
                "description": "Located on the eastern bank of the Nervión River, it's the original nucleus of Bilbao founded in 1300.",
                "borders": [
                    "Abando",
                    "Bilbao La Vieja",
                    "Nervión River",
                    "Uribarri"
                ],
                "landmarks": [
                    "Santiago Cathedral",
                    "Plaza Nueva",
                    "Ribera Market"
                ]
            },
            "history": {
                "overview": "The original medieval settlement of Bilbao founded in 1300, built around seven parallel streets that still form its core today.",
                "significance": "Represents the historical origins of Bilbao and survived both wars and devastating floods to remain the cultural heart of the city.",
                "notable_events": [
                    "Founding of Bilbao in 1300",
                    "Construction of Santiago Cathedral starting in the 14th century",
                    "Devastating floods in 1983 that damaged much of the district",
                    "Comprehensive restoration and pedestrianization in the 1990s"
                ]
            },
            "practical_info": {
                "transit": [
                    "Casco Viejo metro station (Lines 1 and 2)",
                    "Tram stops at Ribera and Arriaga",
                    "Multiple bus lines at the perimeter"
                ],
                "safety": "Very safe during day and evening; be aware of pickpockets during busy hours.",
                "best_time_to_visit": "Early evenings for the authentic pintxo experience; Sunday mornings for the traditional market.",
                "walkability": "Highly walkable pedestrianized zone with limited vehicle access."
            },
            "appeal": {
                "known_for": [
                    "Traditional pintxo bars",
                    "Historic architecture",
                    "Local shopping"
                ],
                "atmosphere": [
                    "Traditional",
                    "Lively",
                    "Authentic"
                ],
                "best_for": [
                    "Food enthusiasts",
                    "History buffs",
                    "First-time visitors"
                ]
            },
            "categories": {
                "touristy": 4,
                "residential": 3,
                "green_spaces": 1,
                "shopping": 4,
                "dining": 5,
                "nightlife": 4,
                "cultural": 5,
                "historic": 5
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Plaza Nueva",
                        "type": "Historic Square",
                        "description": "Neoclassical square completed in 1851 surrounded by arcaded walkways housing traditional bars and restaurants.",
                        "appeal": "Experience Bilbao's social heart where locals gather for pintxos, especially during Sunday markets and festivals."
                    },
                    {
                        "name": "Santiago Cathedral",
                        "type": "Religious Site",
                        "description": "Gothic cathedral dating from the 14th-15th centuries dedicated to Bilbao's patron saint with impressive vaulted interior.",
                        "appeal": "Explore Bilbao's most important religious building and a key stop on the northern route of the Camino de Santiago pilgrimage."
                    },
                    {
                        "name": "Mercado de la Ribera",
                        "type": "Market",
                        "description": "Europe's largest covered market renovated in Art Deco style, featuring fresh local produce and a vibrant food hall.",
                        "appeal": "Shop alongside locals for the finest Basque ingredients or enjoy pintxos with river views at the ground floor gastro space."
                    }
                ],
                "dining": [
                    {
                        "name": "Gure Toki",
                        "cuisine": "Modern Basque",
                        "price_range": "€€",
                        "known_for": "Award-winning creative pintxos that blend tradition with innovation",
                        "atmosphere": "Contemporary bar in Plaza Nueva with outdoor seating and lively ambiance."
                    },
                    {
                        "name": "Bar Zuga",
                        "cuisine": "Traditional Pintxos",
                        "price_range": "€€",
                        "known_for": "Classic Basque pintxos perfected over decades",
                        "atmosphere": "Authentic old-school tavern buzzing with locals and visitors alike."
                    },
                    {
                        "name": "Baster",
                        "cuisine": "Modern Basque",
                        "price_range": "€€",
                        "known_for": "Contemporary take on traditional flavors with visual flair",
                        "atmosphere": "Stylish yet casual space perfect for sampling innovative small plates."
                    }
                ],
                "activities": [
                    {
                        "name": "Pintxo Crawl",
                        "type": "Culinary",
                        "description": "Self-guided or organized tour of the old town's best pintxo bars sampling unique specialties at each stop.",
                        "suitable_for": [
                            "Food enthusiasts",
                            "Social travelers",
                            "Culture seekers"
                        ]
                    },
                    {
                        "name": "Seven Streets Tour",
                        "type": "Historical",
                        "description": "Guided walking tour exploring the original seven medieval streets that formed Bilbao's first urban layout.",
                        "suitable_for": [
                            "History buffs",
                            "Architecture enthusiasts",
                            "First-time visitors"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to be immersed in traditional Basque culture and cuisine.",
                "You prefer historic surroundings and authentic atmosphere.",
                "You want to be within walking distance of major cultural sites."
            ],
            "avoid_if": [
                "You're sensitive to noise (can be lively at night, especially weekends).",
                "You need modern amenities and spacious accommodations.",
                "You prefer proximity to contemporary attractions like the Guggenheim."
            ],
            "insider_tips": [
                "Thursday evening is 'pintxo-pote' night when many bars offer special prices for a pintxo and drink.",
                "Visit Mercado de la Ribera in the morning to see the best fish selection and local shopping activity.",
                "The Sunday antique market in Plaza Nueva offers unique souvenirs and local atmosphere."
            ]
        },
        {
            "name": "Abando",
            "alternate_names": [
                "Ensanche",
                "City Center",
                "Downtown Bilbao"
            ],
            "character": "Bilbao's elegant 19th-century expansion district featuring grand boulevards, upscale shopping, financial institutions, and the city's main cultural venues.",
            "location": {
                "central": true,
                "description": "Located on the west bank of the Nervión River, developed as Bilbao's 19th-century expansion when it became an industrial powerhouse.",
                "borders": [
                    "Casco Viejo",
                    "Indautxu",
                    "Nervión River",
                    "Abandoibarra"
                ],
                "landmarks": [
                    "Plaza Moyua",
                    "Gran Vía",
                    "Doña Casilda Park"
                ]
            },
            "history": {
                "overview": "Developed in the late 19th century as Bilbao's industrial wealth grew, designed as a grid-patterned expansion of the medieval city.",
                "significance": "Represents Bilbao's industrial golden age and transformation into a financial center with impressive architecture.",
                "notable_events": [
                    "1876 city expansion plan following the grid pattern of Barcelona's Eixample",
                    "Construction of Grand Buildings during mining and industrial boom (1880-1910)",
                    "Development as financial district in the 20th century",
                    "Urban renewal in the late 20th century preserving historic architecture"
                ]
            },
            "practical_info": {
                "transit": [
                    "Abando train station (national rail services)",
                    "Metro lines 1 and 2 at Abando and Moyua stations",
                    "Multiple tram and bus connections"
                ],
                "safety": "Very safe area with good lighting and police presence.",
                "best_time_to_visit": "Weekdays for shopping and business atmosphere; weekends for a more relaxed experience.",
                "walkability": "Excellent walkability with wide sidewalks and pedestrian-friendly areas."
            },
            "appeal": {
                "known_for": [
                    "Elegant architecture",
                    "Upscale shopping",
                    "Financial district"
                ],
                "atmosphere": [
                    "Sophisticated",
                    "Cosmopolitan",
                    "Vibrant"
                ],
                "best_for": [
                    "Shopping enthusiasts",
                    "Architecture admirers",
                    "Business travelers"
                ]
            },
            "categories": {
                "touristy": 3,
                "residential": 4,
                "green_spaces": 3,
                "shopping": 5,
                "dining": 4,
                "nightlife": 3,
                "cultural": 4,
                "historic": 4
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Plaza Moyua",
                        "type": "Urban Square",
                        "description": "Elegant circular plaza with gardens and the historic Carlton Hotel, forming the heart of the Ensanche district.",
                        "appeal": "Experience the geometric center of Bilbao's planned expansion with its impressive fountain and surrounding Belle Époque buildings."
                    },
                    {
                        "name": "Gran Vía Don Diego López de Haro",
                        "type": "Boulevard",
                        "description": "Bilbao's main commercial avenue lined with impressive buildings, department stores, and international brands.",
                        "appeal": "Shop at upscale stores or simply admire the architectural harmony of this boulevard modeled after major European cities."
                    },
                    {
                        "name": "Doña Casilda Park",
                        "type": "Urban Park",
                        "description": "Romantic English-style park featuring a pond, sculptures, and tree-lined promenades adjacent to the Fine Arts Museum.",
                        "appeal": "Enjoy a peaceful green respite from urban explorations with classical landscaping and frequent outdoor events."
                    }
                ],
                "dining": [
                    {
                        "name": "La Viña del Ensanche",
                        "cuisine": "Traditional Basque",
                        "price_range": "€€€",
                        "known_for": "Premium Iberian ham, classic pintxos, and extensive Spanish wine selection",
                        "atmosphere": "Historic tavern with marble bar, hanging hams, and elegant clientele."
                    },
                    {
                        "name": "Zortziko",
                        "cuisine": "High-end Basque",
                        "price_range": "€€€€",
                        "known_for": "Michelin-starred Basque cuisine in a belle époque setting",
                        "atmosphere": "Elegant dining room with classical décor and refined service."
                    },
                    {
                        "name": "El Globo",
                        "cuisine": "Traditional Café",
                        "price_range": "€€",
                        "known_for": "Historic café serving churros with chocolate and classic pastries",
                        "atmosphere": "Time-honored café with Art Deco elements frequented by locals of all generations."
                    }
                ],
                "activities": [
                    {
                        "name": "Architectural Walking Tour",
                        "type": "Cultural",
                        "description": "Guided or self-guided tour of the Ensanche's impressive buildings showcasing styles from Belle Époque to Art Deco.",
                        "suitable_for": [
                            "Architecture enthusiasts",
                            "History buffs",
                            "Photography lovers"
                        ]
                    },
                    {
                        "name": "Shopping Experience",
                        "type": "Retail",
                        "description": "Explore Gran Vía and surrounding streets featuring international brands, local boutiques, and department stores.",
                        "suitable_for": [
                            "Shopping enthusiasts",
                            "Fashion lovers",
                            "Luxury seekers"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want central accommodation with good transit connections.",
                "You're interested in upscale shopping and dining.",
                "You prefer elegant surroundings with good amenities."
            ],
            "avoid_if": [
                "You're seeking authentic old-world charm and medieval streets.",
                "You want to avoid business district prices and formality.",
                "You prefer a more local, less commercial neighborhood experience."
            ],
            "insider_tips": [
                "Visit Doña Casilda Park early morning to see locals practicing tai chi and traditional dance.",
                "The top floor of El Corte Inglés department store offers excellent city views and a good-value café.",
                "Many banks and institutions in Abando feature impressive lobby architecture that can be visited during business hours."
            ]
        },
        {
            "name": "Abandoibarra",
            "alternate_names": [
                "Riverside District",
                "Arts District",
                "Guggenheim Area"
            ],
            "character": "Bilbao's showcase regeneration zone transformed from industrial riverfront to cultural powerhouse featuring iconic architecture and public art.",
            "location": {
                "central": true,
                "description": "Located along the west bank of the Nervión River between Abando and Deusto, completely reimagined from former shipyards and docks.",
                "borders": [
                    "Abando",
                    "Deusto",
                    "Nervión River",
                    "Olabeaga"
                ],
                "landmarks": [
                    "Guggenheim Museum",
                    "Iberdrola Tower",
                    "Euskalduna Palace"
                ]
            },
            "history": {
                "overview": "Former industrial riverfront with shipyards and docks that was completely transformed beginning in the 1990s as part of Bilbao's urban renaissance.",
                "significance": "Symbolizes Bilbao's transformation from industrial decline to cultural and architectural showcase.",
                "notable_events": [
                    "Industrial activity along the riverfront through most of the 20th century",
                    "Economic crisis and deindustrialization in the 1980s",
                    "Opening of the Guggenheim Museum in 1997 catalyzing the area's rebirth",
                    "Ongoing development with parks, cultural venues, and architectural landmarks"
                ]
            },
            "practical_info": {
                "transit": [
                    "Metro lines 1 and 2 at Moyua station (short walk)",
                    "Euskalduna and Guggenheim tram stops",
                    "Bus connections along Abandoibarra Avenue"
                ],
                "safety": "Extremely safe area with excellent lighting and security presence.",
                "best_time_to_visit": "Morning for museum visits; sunset for dramatic light on the Guggenheim's titanium panels.",
                "walkability": "Outstanding riverside promenade connecting attractions with scenic views."
            },
            "appeal": {
                "known_for": [
                    "Guggenheim Museum",
                    "Contemporary architecture",
                    "Public art installations"
                ],
                "atmosphere": [
                    "Modern",
                    "Artistic",
                    "Spectacular"
                ],
                "best_for": [
                    "Architecture enthusiasts",
                    "Art lovers",
                    "Photographers"
                ]
            },
            "categories": {
                "touristy": 5,
                "residential": 2,
                "green_spaces": 4,
                "shopping": 3,
                "dining": 4,
                "nightlife": 2,
                "cultural": 5,
                "historic": 1
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "Guggenheim Museum Bilbao",
                        "type": "Museum/Architecture",
                        "description": "Frank Gehry's titanium-clad masterpiece housing contemporary art collections and large-scale installations.",
                        "appeal": "Experience the building that transformed Bilbao's global image, featuring works by major contemporary artists and the museum that sparked the term 'the Bilbao Effect.'"
                    },
                    {
                        "name": "Euskalduna Palace",
                        "type": "Concert Hall/Conference Center",
                        "description": "Striking performance venue designed to resemble a ship under construction, referencing the site's shipbuilding past.",
                        "appeal": "Attend world-class performances in one of Spain's leading concert halls or simply admire its innovative architecture symbolizing Bilbao's transformation."
                    },
                    {
                        "name": "Abandoibarra Riverfront Walk",
                        "type": "Urban Promenade",
                        "description": "Landscaped riverside walk featuring public art installations, gardens, and views of Bilbao's architectural landmarks.",
                        "appeal": "Stroll along the beautifully redesigned riverfront to experience Bilbao's renaissance, featuring works by artists like Daniel Buren, Jeff Koons, and Louise Bourgeois."
                    }
                ],
                "dining": [
                    {
                        "name": "Bistró Guggenheim",
                        "cuisine": "Modern Basque",
                        "price_range": "€€€",
                        "known_for": "Contemporary menu in remarkable museum setting",
                        "atmosphere": "Elegant dining space with museum views and artistic ambiance."
                    },
                    {
                        "name": "Nerua",
                        "cuisine": "Avant-garde Basque",
                        "price_range": "€€€€",
                        "known_for": "Michelin-starred minimalist cuisine focusing on pure flavors",
                        "atmosphere": "Sophisticated museum restaurant with understated design emphasizing the dining experience."
                    },
                    {
                        "name": "Azurmendi Prêt À Porter",
                        "cuisine": "Casual Gourmet",
                        "price_range": "€€€",
                        "known_for": "Accessible offerings from three-Michelin-starred chef Eneko Atxa",
                        "atmosphere": "Contemporary casual dining space within the striking architecture of Euskalduna Palace."
                    }
                ],
                "activities": [
                    {
                        "name": "Architectural Photography Tour",
                        "type": "Photography",
                        "description": "Self-guided or organized tour capturing Abandoibarra's architectural landmarks in different lights.",
                        "suitable_for": [
                            "Photography enthusiasts",
                            "Architecture buffs",
                            "Design lovers"
                        ]
                    },
                    {
                        "name": "Public Art Walk",
                        "type": "Cultural",
                        "description": "Stroll along the riverside to view major public artworks including 'Puppy' by Jeff Koons and 'Maman' by Louise Bourgeois.",
                        "suitable_for": [
                            "Art enthusiasts",
                            "Casual visitors",
                            "Families"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You want to be close to Bilbao's most iconic attractions.",
                "You're a fan of contemporary architecture and design.",
                "You prefer modern accommodations with riverside views."
            ],
            "avoid_if": [
                "You're seeking authentic local neighborhoods over tourist areas.",
                "You prefer historic buildings and traditional character.",
                "You're on a tight budget (accommodation tends to be expensive)."
            ],
            "insider_tips": [
                "Visit the Guggenheim in late afternoon to see how the titanium panels change color with the setting sun.",
                "The best photos of the museum can be taken from across the river in Deusto, especially at sunset.",
                "Many of the area's best architectural views are free, including the riverside walk and exterior sculptures."
            ]
        },
        {
            "name": "Bilbao La Vieja",
            "alternate_names": [
                "Bilbi",
                "San Francisco",
                "The Creative District"
            ],
            "character": "Former working-class neighborhood turned creative hub featuring street art, alternative culture, international influences, and emerging art scene.",
            "location": {
                "central": true,
                "description": "Located across the river from the Casco Viejo, one of Bilbao's oldest districts now experiencing creative regeneration.",
                "borders": [
                    "Casco Viejo",
                    "Nervión River",
                    "Zabala",
                    "Miribilla"
                ],
                "landmarks": [
                    "BilboRock (former church turned cultural center)",
                    "La Merced Market",
                    "Bilbao Art District murals"
                ]
            },
            "history": {
                "overview": "Originally developed in the medieval period outside the city walls, became a mining and working-class district before experiencing decline and recent creative resurgence.",
                "significance": "Represents Bilbao's edgier side and ongoing grassroots regeneration through arts and culture rather than top-down planning.",
                "notable_events": [
                    "Medieval development as area outside city walls",
                    "19th century mining and industrial worker housing",
                    "Period of decline and marginalization in late 20th century",
                    "Artist-led revival beginning in early 2000s with continuing transformation"
                ]
            },
            "practical_info": {
                "transit": [
                    "Casco Viejo metro station (across the river)",
                    "San Francisco tram stop",
                    "Multiple bus connections"
                ],
                "safety": "Improving but still transitional; safe during day and evening hours in main areas.",
                "best_time_to_visit": "Afternoon and early evening when galleries and creative spaces are open.",
                "walkability": "Very walkable though some streets have steep inclines."
            },
            "appeal": {
                "known_for": [
                    "Street art and murals",
                    "Alternative culture",
                    "Multicultural atmosphere"
                ],
                "atmosphere": [
                    "Edgy",
                    "Creative",
                    "Transforming"
                ],
                "best_for": [
                    "Urban explorers",
                    "Art enthusiasts",
                    "Budget travelers"
                ]
            },
            "categories": {
                "touristy": 2,
                "residential": 4,
                "green_spaces": 1,
                "shopping": 3,
                "dining": 3,
                "nightlife": 4,
                "cultural": 4,
                "historic": 3
            },
            "highlights": {
                "attractions": [
                    {
                        "name": "BilboRock",
                        "type": "Cultural Center",
                        "description": "Former church converted into alternative cultural venue hosting concerts, exhibitions, and creative events.",
                        "appeal": "Experience Bilbao's alternative cultural scene in a repurposed religious building symbolizing the area's transformation."
                    },
                    {
                        "name": "Street Art Route",
                        "type": "Urban Art",
                        "description": "Self-guided tour of large-scale murals and street art pieces throughout the district's buildings and walls.",
                        "appeal": "Discover how public art has helped transform the neighborhood while expressing social and cultural themes relevant to Bilbao."
                    },
                    {
                        "name": "La Merced Market",
                        "type": "Historic Building/Cultural Space",
                        "description": "Former market building now hosting creative businesses, workshops, and cultural events.",
                        "appeal": "Visit a center of the neighborhood's creative economy where traditional architecture meets contemporary use."
                    }
                ],
                "dining": [
                    {
                        "name": "Marzana 16",
                        "cuisine": "Fusion",
                        "price_range": "€€",
                        "known_for": "Creative cuisine blending Basque tradition with global influences",
                        "atmosphere": "Industrial-chic space with artistic touches and casual vibe."
                    },
                    {
                        "name": "El Perro Chico",
                        "cuisine": "Updated Basque",
                        "price_range": "€€",
                        "known_for": "Traditional recipes with contemporary execution",
                        "atmosphere": "Cozy tavern bridging traditional and modern in a historic building."
                    },
                    {
                        "name": "Mugi",
                        "cuisine": "International",
                        "price_range": "€",
                        "known_for": "Globally-inspired casual fare with vegetarian options",
                        "atmosphere": "Relaxed café with community focus and artistic clientele."
                    }
                ],
                "activities": [
                    {
                        "name": "Gallery Hopping",
                        "type": "Art",
                        "description": "Visit independent galleries and artist studios showcasing emerging talent and contemporary works.",
                        "suitable_for": [
                            "Art enthusiasts",
                            "Cultural explorers",
                            "Creative professionals"
                        ]
                    },
                    {
                        "name": "Alternative Bilbao Tour",
                        "type": "Cultural",
                        "description": "Guided exploration of the district's transformation, street art, and creative initiatives.",
                        "suitable_for": [
                            "Urban enthusiasts",
                            "Off-the-beaten-path travelers",
                            "Social history buffs"
                        ]
                    }
                ]
            },
            "stay_here_if": [
                "You seek authentic, non-touristy neighborhoods with creative energy.",
                "You're comfortable in urban areas in transition.",
                "You want budget-friendly accommodation with character."
            ],
            "avoid_if": [
                "You prefer polished, upscale environments.",
                "You're uncomfortable in neighborhoods still in transition.",
                "You want conventional tourist experiences and attractions."
            ],
            "insider_tips": [
                "First Friday monthly gallery nights bring openings and events across multiple venues.",
                "Some of the best views of the Old Town can be captured from the hillside streets of this district.",
                "Small creative shops offer unique, locally-made souvenirs at better prices than tourist areas."
            ]
        }
    ]
}