{
    "sites": [
        {
            "name": "Trsat Castle",
            "type": "Historic Castle",
            "description": "Perched on a hill 138 meters above sea level, Trsat Castle offers spectacular panoramic views of Rijeka, the Kvarner Bay, and the surrounding islands. Built in the 13th century, this medieval fortress has been beautifully restored and now houses a restaurant and cultural events. The castle's strategic position made it a key defensive point throughout history, and today it's one of Rijeka's most iconic landmarks. Visitors can explore the castle grounds, enjoy the restaurant with stunning views, or attend concerts and cultural events.",
            "indoor": false,
            "best_time": "Sunset",
            "price_range": "Free",
            "seasonal_notes": "Summer brings cultural events and outdoor dining. Spring and fall offer pleasant weather for exploring. Winter provides dramatic views but some facilities may have limited hours. The castle is particularly atmospheric at sunset when the city lights begin to glow.",
            "booking_tips": "No booking required for castle grounds. Restaurant reservations recommended during peak season. Access by car, bus, or a scenic 561-step staircase from the city center. Allow 1-2 hours for a comprehensive visit.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 45.3319,
            "longitude": 14.4583
        },
        {
            "name": "Korzo",
            "type": "Historic Street",
            "description": "Rijeka's main pedestrian promenade, Korzo is the heart of the city's social life. This elegant street runs parallel to the waterfront and is lined with historic buildings, cafes, shops, and restaurants. The street showcases a mix of Austro-Hungarian and Italian architectural styles, reflecting Rijeka's multicultural history. Korzo is perfect for people-watching, shopping, or enjoying a coffee at one of the many outdoor cafes. The street comes alive in the evening with locals and visitors enjoying the Mediterranean atmosphere.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Summer brings outdoor dining and street performances. Spring and fall offer pleasant weather for strolling. Winter has a cozy atmosphere with indoor cafes. The street is most vibrant in the evening when locals gather for their traditional 'korzo' walk.",
            "booking_tips": "No booking required. Visit in the evening to experience the traditional Croatian 'korzo' ritual where locals take their evening stroll. Many cafes and restaurants line the street for dining options.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Rijeka City Tower",
            "type": "Historic Monument",
            "description": "This iconic clock tower, built in the 13th century, stands as a symbol of Rijeka's medieval past. The tower marks the entrance to the old town and features a distinctive clock face and bell. Originally part of the city's defensive walls, it now serves as a beloved landmark and meeting point. The tower's architecture reflects the city's Venetian and Austro-Hungarian influences, and it's one of the few remaining structures from Rijeka's medieval period.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Visible year-round. Spring and summer offer the best photo opportunities with good lighting. The tower is particularly beautiful when illuminated at night. Early morning visits avoid crowds.",
            "booking_tips": "No booking required. The tower is located at the entrance to the old town and serves as a perfect starting point for exploring Rijeka's historic center. Allow 15-30 minutes to appreciate the architecture and take photos.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "St. Vitus Cathedral",
            "type": "Cathedral",
            "description": "This Baroque cathedral, dedicated to St. Vitus, is the main Catholic church in Rijeka. Built in the 17th century, the cathedral features impressive architecture with a distinctive dome and ornate interior. The church houses important religious artifacts and artwork, including paintings and sculptures from the Baroque period. The cathedral's location in the heart of the old town makes it a central landmark and important religious site for the local community.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round for worship and visitors. Summer brings more tourists. Winter offers a peaceful experience. The cathedral is particularly atmospheric during religious services. Dress respectfully as this is an active place of worship.",
            "booking_tips": "No booking required for the main cathedral. Dress respectfully as this is an active place of worship. Photography is permitted but flash is not allowed. Allow 30-45 minutes for a visit.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.75,
                "cultural_significance": 4
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Maritime and History Museum",
            "type": "Museum",
            "description": "Housed in the former Governor's Palace, this museum showcases Rijeka's rich maritime and industrial heritage. The collection includes ship models, maritime artifacts, historical documents, and exhibits on the city's development as a major port. The museum also covers Rijeka's multicultural history, from its Venetian and Austro-Hungarian periods to its role in modern Croatia. The building itself is an architectural gem with beautiful interiors.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with climate-controlled galleries. Summer brings higher visitor numbers. Winter offers a quieter experience. The museum is a good option for rainy days.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 1-1.5 hours for a comprehensive visit. Audio guides available in multiple languages. Combine with visits to nearby historic sites.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Peek & Poke Computer Museum",
            "type": "Museum",
            "description": "This unique museum showcases the history of computing and technology, featuring vintage computers, gaming consoles, and electronic devices from the 1970s to the present day. The interactive exhibits allow visitors to experience classic games and software, making it a fascinating destination for tech enthusiasts and families. The museum highlights Croatia's contributions to computing history and provides insight into the rapid evolution of technology.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with climate-controlled exhibits. Popular with families and tech enthusiasts. Weekends can be busy. The museum is a great option for rainy days.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 1-2 hours for a comprehensive visit. Many exhibits are interactive, making it engaging for all ages. Check the website for special events and workshops.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Rijeka Market",
            "type": "Market",
            "description": "This vibrant indoor market is the heart of Rijeka's culinary scene, offering fresh local produce, seafood, meats, cheeses, and traditional Croatian products. The market building, constructed in the early 20th century, features beautiful Art Nouveau architecture. Visitors can sample local delicacies, buy fresh ingredients, or simply soak up the authentic atmosphere. The market is a great place to experience local culture and taste traditional Croatian foods.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Busiest in the morning when locals shop for fresh produce. Summer brings seasonal fruits and vegetables. Winter offers hearty local products. The market is less crowded in the afternoon.",
            "booking_tips": "No booking required. Visit early morning for the freshest produce and most authentic experience. Bring cash for purchases. Many vendors offer samples of their products.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Molo Longo",
            "type": "Pier",
            "description": "This historic pier extends into the Kvarner Bay and offers spectacular views of the harbor, ships, and surrounding islands. Originally built for maritime purposes, it's now a popular spot for walking, fishing, and enjoying the sea breeze. The pier provides excellent photo opportunities of Rijeka's port and the Adriatic Sea. It's particularly beautiful at sunset when the harbor lights begin to glow.",
            "indoor": false,
            "best_time": "Sunset",
            "price_range": "Free",
            "seasonal_notes": "Summer brings pleasant evening walks and fishing activities. Spring and fall offer comfortable weather. Winter can be windy but provides dramatic sea views. The pier is most atmospheric at sunset.",
            "booking_tips": "No booking required. Wear comfortable walking shoes. The pier can be windy, so bring appropriate clothing. Perfect for photography and enjoying the maritime atmosphere.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Natural History Museum",
            "type": "Museum",
            "description": "This museum showcases the natural heritage of the Kvarner region, featuring exhibits on local flora and fauna, geology, and marine life. The collection includes fossils, minerals, taxidermy specimens, and interactive displays about the Adriatic ecosystem. The museum provides insight into the region's biodiversity and environmental conservation efforts. It's particularly educational for families and nature enthusiasts.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with climate-controlled exhibits. Popular with families and school groups. Weekends can be busy. The museum is a good option for rainy days.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 1-1.5 hours for a comprehensive visit. Many exhibits are interactive and educational. Check the website for special exhibitions.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Rijeka Carnival",
            "type": "Cultural Event",
            "description": "Rijeka hosts one of the largest and most famous carnivals in Croatia, featuring colorful parades, masked balls, and street performances. The carnival tradition dates back to the 19th century and attracts thousands of visitors each year. The event includes traditional costumes, music, dancing, and elaborate floats. The carnival celebrates the city's multicultural heritage and provides a unique cultural experience.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Held annually in February/March before Lent. The carnival coincides with peak winter season. Some events require tickets, others are free. The main parade is the highlight of the festival.",
            "booking_tips": "Book accommodation well in advance during carnival season. Some events require tickets purchased in advance. Check the carnival schedule online for specific events and timings.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 4,
                "cultural_significance": 5
            },
            "latitude": 45.3271,
            "longitude": 14.4422
        },
        {
            "name": "Kastav",
            "type": "Historic Town",
            "description": "This charming medieval town, located about 10 kilometers from Rijeka, offers a peaceful escape from the city. Kastav features well-preserved stone houses, narrow cobblestone streets, and a medieval castle. The town is known for its traditional architecture, local crafts, and cultural events. Visitors can explore the historic center, enjoy local restaurants, or attend one of the town's many festivals and cultural events.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Summer brings cultural festivals and outdoor dining. Spring and fall offer pleasant weather for exploring. Winter provides a peaceful atmosphere with fewer tourists. The town is accessible year-round by bus from Rijeka.",
            "booking_tips": "Reach Kastav by bus from Rijeka or by car. No booking required for general visits. Allow 2-3 hours for a comprehensive visit. The town is perfect for a half-day trip from Rijeka.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 3,
                "cultural_significance": 4
            },
            "latitude": 45.3750,
            "longitude": 14.3486
        },
        {
            "name": "Opatija",
            "type": "Historic Resort Town",
            "description": "This elegant seaside resort town, located about 15 kilometers from Rijeka, was a favorite destination of the Austro-Hungarian aristocracy. Opatija features beautiful Belle Époque architecture, lush gardens, and a scenic coastal promenade. The town is known for its therapeutic climate, historic hotels, and cultural heritage. Visitors can stroll along the Lungomare promenade, visit the Villa Angiolina park, or enjoy the town's sophisticated atmosphere.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Summer brings tourists and cultural events. Spring and fall offer pleasant weather for walking. Winter provides a peaceful atmosphere with beautiful coastal views. The town is accessible year-round by bus or train from Rijeka.",
            "booking_tips": "Reach Opatija by bus or train from Rijeka. No booking required for general visits. Allow 3-4 hours for a comprehensive visit. The Lungomare promenade is perfect for scenic walks.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 4,
                "cultural_significance": 4
            },
            "latitude": 45.3372,
            "longitude": 14.3083
        }
    ]
}