{
  "neighborhoods": [
    {
      "name": "Rhodes Old Town (Medieval City)",
      "alternate_names": [
        "Medieval Town",
        "Palia Poli",
        "Inside the Walls"
      ],
      "character": "A UNESCO World Heritage site, one of the best-preserved medieval towns in Europe. A labyrinth of narrow, cobbled streets enclosed by massive fortifications. Divided into the Collachium (Knight's Quarter) with the Palace and Street of the Knights, and the Hora (Burgo or Lower Town) with mosques, churches, squares (Hippocrates, Jewish Martyrs), shops, restaurants, and residences.",
      "location": {
        "central": true,
        "description": "The area enclosed by the medieval fortifications, adjacent to Mandraki Harbour.",
        "borders": [
          "Medieval Walls (surrounding)",
          "Mandraki Harbour area (north-east)",
          "New Town (surrounding outer sides)"
        ],
        "landmarks": [
          "Palace of the Grand Master",
          "Street of the Knights (Ippoton)",
          "Archaeological Museum (Hospital of the Knights)",
          "Suleiman Mosque",
          "Hippocrates Square (Platía Ippokrátous)",
          "Socratous Street (main shopping street)",
          "Clock Tower (Roloi)",
          "Byzantine Museum (Panagia tou Kastrou)",
          "Jewish Quarter & Synagogue (Kahal Shalom)"
        ]
      },
      "history": {
        "overview": "Ancient city rebuilt and heavily fortified by the Knights of St. John (1309-1522) after they acquired Rhodes. Served as their headquarters. Conquered by the Ottomans under Suleiman the Magnificent in 1522, leading to the addition of mosques, baths, and fountains. Later under Italian rule (1912-1943) which saw restoration efforts.",
        "significance": "An outstanding example of a fortified medieval city, showcasing Gothic architecture mixed with Ottoman and later influences. A living museum.",
        "notable_events": [
          "Knights Hospitaller rule (1309-1522)",
          "Ottoman Siege and Conquest (1522)",
          "Ottoman Period (mosques, baths added)",
          "Italian Rule and Restoration (early 20th C)",
          "UNESCO World Heritage designation (1988)"
        ]
      },
      "practical_info": {
        "transit": [
          "Mainly pedestrianized, limited vehicle access (residents/deliveries)",
          "Bus stops located outside the main gates (e.g., near Mandraki)",
          "Taxi access primarily at the gates",
          "Highly walkable, but can be maze-like and crowded"
        ],
        "safety": "Generally very safe, well-patrolled. Standard precautions in crowded tourist areas. Can feel deserted in some back alleys late at night.",
        "best_time_to_visit": "Anytime. Spring/Autumn for pleasant weather and fewer crowds. Summer is peak season, very busy. Evenings are atmospheric.",
        "walkability": "Excellent, but involves uneven cobblestones and steps. Getting lost is part of the charm."
      },
      "appeal": {
        "known_for": [
          "Palace of the Grand Master",
          "Street of the Knights",
          "Medieval walls and gates",
          "Atmospheric alleys and squares",
          "Shopping (Socratous Street)",
          "Restaurants and bars with unique settings"
        ],
        "atmosphere": [
          "Medieval",
          "Historic",
          "Labyrinthine",
          "Romantic",
          "Bustling (main streets)",
          "Quiet (back alleys)"
        ],
        "best_for": [
          "Everyone",
          "History buffs",
          "Culture seekers",
          "Photographers",
          "Shoppers",
          "Romantic getaways"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 3,
        "green_spaces": 1,
        "shopping": 4,
        "dining": 5,
        "nightlife": 4,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Palace of the Grand Master",
            "type": "Historic Castle / Museum",
            "description": "Dominant fortress-palace rebuilt by the Italians, housing museum exhibits and impressive mosaics.",
            "appeal": "Explore the main symbol of the Knights' power, see historical artifacts and grand halls."
          },
          {
            "name": "Street of the Knights (Ippoton)",
            "type": "Historic Street",
            "description": "Remarkably preserved medieval street lined with the Inns of the Knights' different 'Tongues'.",
            "appeal": "Walk back in time along this atmospheric, architecturally significant street."
          },
          {
            "name": "Archaeological Museum (Hospital of the Knights)",
            "type": "Museum / Historic Building",
            "description": "Housed in the former hospital, displaying artifacts from Rhodes and the Dodecanese.",
            "appeal": "Combine history of the Knights with ancient archaeological finds in a stunning building."
          }
        ],
        "dining": [
          {
            "name": "Old Town Tavernas & Restaurants",
            "cuisine": "Greek, Rhodian, Mediterranean, International",
            "price_range": "€€-€€€€",
            "known_for": "Atmospheric settings in squares or hidden courtyards, traditional Greek food, seafood, some tourist traps.",
            "atmosphere": "Varies from bustling tourist spots on main squares to quiet, romantic garden settings."
          },
          {
            "name": "Cafes & Bars",
            "cuisine": "Coffee, Drinks, Snacks, Cocktails",
            "price_range": "€€-€€€",
            "known_for": "Relaxing breaks in squares like Hippocrates, evening drinks, some rooftop bars with views.",
            "atmosphere": "Lively cafes for people-watching, atmospheric bars for evening relaxation."
          }
        ],
        "activities": [
          {
            "name": "Getting Lost in the Alleys",
            "type": "Exploration/Sightseeing",
            "description": "Wander away from the main thoroughfares (Socratous, Ippoton) to discover quiet corners, hidden squares, and residential life.",
            "suitable_for": [
              "Adventurous visitors",
              "Photographers"
            ]
          },
          {
            "name": "Shopping on Socratous Street",
            "type": "Shopping",
            "description": "Browse the main commercial street for souvenirs, leather goods, jewelry, ceramics, and clothing.",
            "suitable_for": [
              "Shoppers",
              "Souvenir hunters"
            ]
          },
          {
            "name": "Evening Drinks in Hippocrates Square",
            "type": "Social/Nightlife",
            "description": "Experience the lively evening atmosphere around the Castellania Fountain in the Old Town's main square.",
            "suitable_for": [
              "Everyone"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be immersed in history and atmosphere 24/7",
        "Easy walking access to major historical sites is paramount",
        "You enjoy staying in boutique hotels or guesthouses with character"
      ],
      "avoid_if": [
        "You need easy car access or parking nearby",
        "You dislike crowds (can be intense in peak season)",
        "You prefer modern amenities and large hotel facilities (better in New Town)"
      ],
      "insider_tips": [
        "Venture into the quieter southern part of the Old Town (south of Socratous) for a more residential feel.",
        "Look up! Many buildings have interesting architectural details, coats of arms, or Ottoman additions.",
        "Be aware that prices in prime locations (e.g., Hippocrates Square) can be higher."
      ]
    },
    {
      "name": "Rhodes New Town & Mandraki Harbour",
      "alternate_names": [
        "Modern Center",
        "Nea Poli",
        "Mandraki Waterfront",
        "Elli Beach Area"
      ],
      "character": "The modern commercial and administrative center of Rhodes, located outside the Old Town walls. Features Italian-era architecture (Governor's Palace, National Theatre, Nea Agora), the main harbour (Mandraki) with its iconic deer statues and windmills, Elli Beach (the city beach), the Aquarium, Casino, numerous hotels, shops, cafes, and restaurants.",
      "location": {
        "central": true,
        "description": "Area north and west of the Old Town walls, centered around Mandraki Harbour and extending towards the northern tip of the island.",
        "borders": [
          "Old Town Walls (south-east)",
          "Aegean Sea (north & west)",
          "Acropolis of Rhodes (Monte Smith) area (south-west)"
        ],
        "landmarks": [
          "Mandraki Harbour (inc. Deer Statues, Windmills, St. Nicholas Fortress)",
          "Nea Agora (New Market)",
          "Governor's Palace (Dodecanese Administration)",
          "National Theatre",
          "Evangelismos Church",
          "Elli Beach",
          "Rhodes Aquarium (Hydrobiological Station)",
          "Casino Rodos"
        ]
      },
      "history": {
        "overview": "Developed largely outside the medieval walls, especially during the Italian administration (1912-1943) which constructed many prominent public buildings in a distinctive architectural style. Mandraki served as the ancient city's military harbour. Elli Beach became a cosmopolitan hub.",
        "significance": "Represents the modern expansion of Rhodes, showcasing Italian colonial architecture alongside contemporary Greek life, commerce, and tourism infrastructure.",
        "notable_events": [
          "Presumed site of the Colossus of Rhodes (Harbour entrance)",
          "Italian construction boom (early 20th C)",
          "Development as a major tourist destination (mid-late 20th C)"
        ]
      },
      "practical_info": {
        "transit": [
          "Main hub for local buses (stops near Nea Agora/Mandraki)",
          "Taxi ranks readily available",
          "Main road access for cars and scooters",
          "Easy walking distance between Mandraki, Elli Beach, and shopping areas"
        ],
        "safety": "Generally very safe, busy commercial and tourist area. Standard precautions apply.",
        "best_time_to_visit": "Anytime. Lively day and night. Elli Beach best in summer. Waterfront pleasant year-round.",
        "walkability": "Excellent. Flat terrain along the waterfront and main streets."
      },
      "appeal": {
        "known_for": [
          "Mandraki Harbour views (deer, windmills)",
          "Italian architecture (Governor's Palace, Nea Agora)",
          "Elli Beach (city beach)",
          "Modern shopping and dining",
          "Casino and nightlife options",
          "Large hotels"
        ],
        "atmosphere": [
          "Cosmopolitan",
          "Commercial",
          "Lively",
          "Coastal",
          "Modern (compared to Old Town)"
        ],
        "best_for": [
          "Visitors wanting modern hotels and amenities",
          "Shoppers (brand name stores)",
          "Beachgoers (Elli Beach access)",
          "Those interested in Italian-era architecture",
          "Casino visitors"
        ]
      },
      "categories": {
        "touristy": 4,
        "residential": 3,
        "green_spaces": 2,
        "shopping": 5,
        "dining": 4,
        "nightlife": 4,
        "cultural": 3,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Mandraki Harbour",
            "type": "Harbour / Landmark",
            "description": "Picturesque harbour with deer statues at entrance, medieval windmills, Fortress of St. Nicholas, and mooring for yachts and excursion boats.",
            "appeal": "Iconic Rhodes scenery, departure point for boat trips, pleasant for strolling."
          },
          {
            "name": "Elli Beach & Aquarium",
            "type": "Beach / Attraction",
            "description": "Organized city beach with clear water, beach bars, and the distinctive Art Deco Aquarium building at its northern tip.",
            "appeal": "Convenient city beach experience, unique architecture of the Aquarium."
          },
          {
            "name": "Nea Agora (New Market)",
            "type": "Historic Building / Market",
            "description": "Impressive multi-sided Italian building originally designed as a market, now housing cafes, shops, and restaurants around a central courtyard.",
            "appeal": "Admire the architecture, enjoy a coffee or meal in a lively setting."
          }
        ],
        "dining": [
          {
            "name": "New Town Restaurants & Cafes",
            "cuisine": "Greek, International, Italian, Cafes",
            "price_range": "€€-€€€€",
            "known_for": "Wide variety of modern restaurants, cafes along the waterfront and main streets, international chains.",
            "atmosphere": "Ranges from casual cafes to upscale restaurants, often with outdoor seating."
          }
        ],
        "activities": [
          {
            "name": "Strolling the Mandraki Waterfront",
            "type": "Walk/Sightseeing",
            "description": "Walk from the Old Town edge, past the Nea Agora, along Mandraki Harbour towards the windmills and St. Nicholas Fortress.",
            "suitable_for": [
              "Everyone"
            ]
          },
          {
            "name": "Relaxing at Elli Beach",
            "type": "Beach/Relaxation",
            "description": "Sunbathe, swim, or enjoy a drink at one of the beach bars on Rhodes' main city beach.",
            "suitable_for": [
              "Beach lovers"
            ]
          },
          {
            "name": "Shopping in the New Town",
            "type": "Shopping",
            "description": "Explore the modern commercial streets for clothing boutiques, international brands, and department stores.",
            "suitable_for": [
              "Shoppers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You prefer large, modern hotels with pools and amenities",
        "Easy access to Elli Beach and the Casino is desired",
        "You want to be near modern shops and restaurants",
        "You need easier access for cars/taxis than the Old Town"
      ],
      "avoid_if": [
        "You seek the historic atmosphere and charm of the Old Town",
        "You prefer quiet, traditional accommodation",
        "You want to minimize exposure to traffic and commercial bustle"
      ],
      "insider_tips": [
        "The waterfront walk around Mandraki is especially pleasant in the early morning or evening.",
        "Elli Beach has a diving platform offshore which is popular with locals.",
        "Look out for the distinct architectural style of the public buildings constructed during the Italian period."
      ]
    },
    {
      "name": "Rhodes Old Town Walls",
      "alternate_names": [
        "Medieval Fortifications",
        "Kastro Walls",
        "Moat Walk"
      ],
      "character": "The immense system of medieval fortifications surrounding the Old Town, approximately 4km long. Includes massive stone walls, towers, bastions, impressive gates (like D'Amboise, St. Athanasius, Marine Gate), and a dry moat, parts of which are landscaped gardens. Offers unique perspectives on the Old Town and opportunities for walking.",
      "location": {
        "central": true,
        "description": "Encircling the Rhodes Old Town (Medieval City).",
        "borders": [
          "Rhodes Old Town (inside)",
          "New Town & Harbour Areas (outside)"
        ],
        "landmarks": [
          "Entire fortification circuit",
          "D'Amboise Gate",
          "St. John's Gate (Kokkini Porta)",
          "St. Athanasius Gate",
          "Marine Gate (Sea Gate)",
          "St. Paul's Gate",
          "Various Towers and Bastions (e.g., Tower of Naillac ruins)",
          "Moat Gardens"
        ]
      },
      "history": {
        "overview": "Existing Byzantine walls were significantly expanded and strengthened by the Knights of St. John between the 14th and early 16th centuries to create one of the strongest fortifications of the era. Designed to withstand sieges, particularly from Ottoman cannons. The moat was never filled with water.",
        "significance": "A prime example of medieval military architecture, remarkably well-preserved and defining the character of Rhodes Town.",
        "notable_events": [
          "Knights' construction period (14th-16th C)",
          "Survived numerous sieges, fell in 1522",
          "Restoration works during Italian period",
          "Parts of the moat converted to gardens/walkways"
        ]
      },
      "practical_info": {
        "transit": [
          "Walking is the only way to explore the walls/moat path",
          "Access points via various gates connecting Old and New Towns",
          "Limited official walk along the top (check locally for times/access)"
        ],
        "safety": "Generally safe during daylight hours. The moat path can feel isolated in some sections, especially after dark.",
        "best_time_to_visit": "Daytime for walking. Golden hour for photography of the walls.",
        "walkability": "Excellent along the moat path (mostly flat). Accessing the top of the walls (when possible) involves stairs."
      },
      "appeal": {
        "known_for": [
          "Impressive scale and preservation",
          "Majestic gates (D'Amboise, Marine Gate)",
          "Walking path through the moat gardens",
          "Unique views of the fortifications",
          "Photogenic scenery"
        ],
        "atmosphere": [
          "Historic",
          "Imposing",
          "Quiet (in the moat)",
          "Green (moat gardens)",
          "Impressive"
        ],
        "best_for": [
          "History & military architecture enthusiasts",
          "Walkers",
          "Photographers",
          "Anyone wanting a different perspective on the Old Town"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 0,
        "green_spaces": 3,
        "shopping": 0,
        "dining": 0,
        "nightlife": 0,
        "cultural": 4,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "The Fortification Circuit",
            "type": "Historic Structure",
            "description": "The entire system of walls, gates, towers, and bastions.",
            "appeal": "Appreciate the engineering and sheer scale of the medieval defenses."
          },
          {
            "name": "D'Amboise Gate",
            "type": "Historic Gate",
            "description": "One of the most impressive landward gates, near the Palace of the Grand Master.",
            "appeal": "Marvel at the defensive architecture and the Grand Master's coat of arms."
          },
          {
            "name": "Marine Gate (Sea Gate)",
            "type": "Historic Gate",
            "description": "The most ornate gate, facing the harbour, decorated with reliefs.",
            "appeal": "Iconic entrance from the harbour into the Old Town."
          }
        ],
        "dining": [],
        "activities": [
          {
            "name": "Walking the Moat Path",
            "type": "Walking/Sightseeing",
            "description": "Follow the pathways through the green spaces within the dry moat, offering close-up views of the walls from below.",
            "suitable_for": [
              "Walkers",
              "Families",
              "Photographers"
            ]
          },
          {
            "name": "Walking Along the Top (Limited Access)",
            "type": "Walking/Sightseeing",
            "description": "Check locally for the possibility of guided or timed walks along sections of the wall ramparts, usually starting near the Palace.",
            "suitable_for": [
              "History buffs",
              "View seekers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "Accommodation isn't typically located *on* the walls themselves, but staying just inside or outside offers proximity."
      ],
      "avoid_if": [
        "Not applicable as a residential area."
      ],
      "insider_tips": [
        "The moat walk offers a quieter alternative to the busy streets inside the Old Town.",
        "Different gates offer distinct architectural styles and historical context.",
        "Limited sections of the wall ramparts may be open for walking at specific times (often weekday afternoons) - inquire at the Palace ticket office."
      ]
    },
    {
      "name": "Lindos",
      "alternate_names": [
        "Lindos Village"
      ],
      "character": "A spectacularly picturesque village of whitewashed, sugar-cube houses nestled at the foot of a steep rock crowned by the ancient Acropolis. Features narrow, winding alleys (often vehicle-free), shops, rooftop restaurants, Byzantine churches, and proximity to beautiful bays (main beach and St. Paul's Bay).",
      "location": {
        "central": false,
        "description": "Located on the east coast of Rhodes island, approximately 50km south of Rhodes Town.",
        "borders": [
          "Aegean Sea",
          "Surrounding hills"
        ],
        "landmarks": [
          "Acropolis of Lindos",
          "Lindos Village (whitewashed houses)",
          "St. Paul's Bay",
          "Main Beach (Megalos Gialos)",
          "Church of Panagia"
        ]
      },
      "history": {
        "overview": "An important ancient city and maritime power, known for its Temple of Athena Lindia. Flourished through ancient, Roman, Byzantine, and Knights' periods. The village's current architecture largely reflects later periods, particularly the 17th-18th century wealth from shipping, seen in the 'Captains' Houses'.",
        "significance": "Combines a major archaeological site (Acropolis) with a beautifully preserved traditional village and stunning natural setting.",
        "notable_events": [
          "Prominence in ancient times",
          "Construction of Temple of Athena Lindia",
          "Fortification by Byzantines, Knights",
          "Development of traditional village architecture",
          "Emergence as a major tourist destination"
        ]
      },
      "practical_info": {
        "transit": [
          "Village center is largely pedestrianized",
          "Parking available outside the village (can be challenging in summer)",
          "Accessible by public bus or car/taxi from Rhodes Town (approx. 1 hour drive)",
          "Donkey transport available up to the Acropolis (controversial)"
        ],
        "safety": "Generally very safe, but alleys can be very crowded. Watch your step on uneven paths and stairs.",
        "best_time_to_visit": "Morning or late afternoon to avoid peak crowds and heat, especially for the Acropolis climb. Spring/Autumn offer ideal conditions.",
        "walkability": "Excellent within the village, but involves steep climbs, steps, and narrow passages. Acropolis climb is strenuous."
      },
      "appeal": {
        "known_for": [
          "Acropolis of Lindos",
          "Picturesque whitewashed village",
          "Stunning views",
          "St. Paul's Bay",
          "Rooftop restaurants",
          "Narrow, winding alleys"
        ],
        "atmosphere": [
          "Picturesque",
          "Historic",
          "Charming",
          "Romantic",
          "Touristy (can be very crowded)",
          "Traditional"
        ],
        "best_for": [
          "Day-trippers from Rhodes Town",
          "History & archaeology lovers",
          "Photographers",
          "Beach lovers (St. Paul's Bay)",
          "Visitors seeking iconic Greek island scenery"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 2,
        "green_spaces": 1,
        "shopping": 3,
        "dining": 4,
        "nightlife": 2,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Acropolis of Lindos",
            "type": "Major Archaeological Site",
            "description": "Ancient ruins including Temple of Athena, Roman structures, and Knights' fortifications atop a dramatic cliff.",
            "appeal": "Explore significant history, enjoy breathtaking panoramic views of the village and coastline."
          },
          {
            "name": "Lindos Village Exploration",
            "type": "Village/Sightseeing",
            "description": "Wander through the maze of narrow alleys, admire the whitewashed architecture and courtyards.",
            "appeal": "Experience the charm of a traditional Dodecanese village."
          },
          {
            "name": "St. Paul's Bay",
            "type": "Scenic Bay/Beach",
            "description": "Beautiful, almost enclosed bay with clear turquoise water, ideal for swimming and snorkeling.",
            "appeal": "Relax and swim in a stunningly scenic cove."
          }
        ],
        "dining": [
          {
            "name": "Rooftop Restaurants",
            "cuisine": "Greek, Mediterranean, Seafood",
            "price_range": "€€-€€€€",
            "known_for": "Spectacular views of the Acropolis (especially lit at night) and the bay.",
            "atmosphere": "Romantic and scenic, very popular for dinner (reservations often needed)."
          }
        ],
        "activities": [
          {
            "name": "Climbing to the Acropolis",
            "type": "Sightseeing/Activity",
            "description": "Ascend the path (by foot or donkey) to explore the ancient site at the top.",
            "suitable_for": [
              "Fit visitors",
              "History buffs"
            ]
          },
          {
            "name": "Swimming at St. Paul's Bay",
            "type": "Beach/Relaxation",
            "description": "Enjoy the clear waters and unique setting of this famous bay.",
            "suitable_for": [
              "Swimmers",
              "Sunbathers"
            ]
          },
          {
            "name": "Shopping for Crafts & Souvenirs",
            "type": "Shopping",
            "description": "Browse the numerous small shops in the village selling ceramics, textiles, clothing, and art.",
            "suitable_for": [
              "Shoppers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to experience the magic of Lindos after the day-trippers leave",
        "You desire accommodation with stunning Acropolis or sea views",
        "You prefer a village atmosphere over the city bustle (though Lindos gets very busy)"
      ],
      "avoid_if": [
        "You have mobility issues (steep climbs and steps are unavoidable)",
        "You dislike intense crowds (peak summer can be overwhelming)",
        "You need easy access to a wide range of nightlife or large resort facilities"
      ],
      "insider_tips": [
        "Visit the Acropolis first thing in the morning (when it opens) to beat the heat and crowds.",
        "Explore the alleys away from the main path to the Acropolis to find quieter spots.",
        "Book rooftop restaurants in advance, especially for sunset or evening views."
      ]
    }
  ],
  "activityTypes": {
    "spring": [
      "Exploring the Old Town and Lindos Acropolis in pleasant weather",
      "Walking the Old Town walls and moat gardens",
      "Hiking trails in the island's interior as nature blooms",
      "Enjoying outdoor cafes in Rhodes Town and Lindos",
      "Witnessing Orthodox Easter celebrations"
    ],
    "summer": [
      "Visiting numerous beaches (Elli, Faliraki, Kallithea, Lindos, Anthony Quinn Bay)",
      "Taking boat trips (e.g., to Symi, Marmaris, or along the coast)",
      "Exploring the Valley of the Butterflies (peak moth season July/August)",
      "Enjoying watersports and beach bars",
      "Experiencing the vibrant nightlife in Rhodes Town and Faliraki"
    ],
    "autumn": [
      "Exploring archaeological sites (Acropolis of Rhodes, Ancient Kamiros) with fewer crowds",
      "Swimming in the still-warm sea",
      "Visiting wineries inland",
      "Enjoying pleasant temperatures for walking and exploring",
      "Watching sunsets from Monte Smith or Monolithos"
    ],
    "winter": [
      "Exploring the Old Town in depth without crowds",
      "Visiting museums (Archaeological, Byzantine, Modern Art)",
      "Enjoying the local atmosphere in cafes and tavernas",
      "Taking scenic drives around the island",
      "Finding lower accommodation prices"
    ]
  }
} 