{
    "sites": [
        {
            "name": "Palace of the Grand Master of the Knights of Rhodes",
            "type": "Historic Castle/Museum",
            "description": "A magnificent medieval castle located at the highest point of the Old Town of Rhodes. Originally a Byzantine citadel, it was rebuilt by the Knights of St. John in the 14th century as their headquarters and palace. Now functions as a museum showcasing Rhodian history, mosaics, and medieval furniture.",
            "indoor": true,
            "best_time": "Morning/Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round, may have shorter hours in winter. Can get very crowded during peak season.",
            "booking_tips": "Purchase tickets at the entrance or consider a multi-site pass for the Old Town. Allow 1.5-2 hours. Audio guides available.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 36.4454,
            "longitude": 28.2246
        },
        {
            "name": "Archaeological Museum of Rhodes (Hospital of the Knights)",
            "type": "Archaeological Museum/Historic Building",
            "description": "Housed in the impressive medieval building of the Hospital of the Knights of Saint John (15th century). Displays a rich collection of artifacts from archaeological sites across Rhodes and the Dodecanese islands, covering periods from the Mycenaean era to Roman times. Includes sculptures, pottery, mosaics, and funerary objects.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled. Open year-round, check for seasonal hours.",
            "booking_tips": "Allow 1.5-2 hours. Located within the Old Town, near the Palace. Consider a combined ticket if available.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 36.4451,
            "longitude": 28.2264
        },
        {
            "name": "Street of the Knights (Ippoton Street)",
            "type": "Historic Street",
            "description": "One of the best-preserved medieval streets in Europe. This cobbled street stretches from the Archaeological Museum to the Palace of the Grand Master. Lined with the 'Inns' of the different 'Tongues' (nationalities) of the Knights of St. John, showcasing Gothic architecture and coats of arms.",
            "indoor": false,
            "best_time": "Anytime (less crowded early/late)",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round. Beautifully lit in the evening.",
            "booking_tips": "Free to walk. Takes about 15-20 minutes to stroll its length. Best appreciated by taking your time and observing the architectural details.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 36.4453,
            "longitude": 28.2255
        },
        {
            "name": "Acropolis of Rhodes (Monte Smith)",
            "type": "Ancient Ruins/Park",
            "description": "Located on the hill of Agios Stefanos (Monte Smith), west of Rhodes Town. Features ruins from the Hellenistic period (3rd-2nd century BC), including a partially reconstructed Temple of Apollo, an ancient stadium, and a small theatre (Odeon). Offers panoramic views of the city and the sea.",
            "indoor": false,
            "best_time": "Late Afternoon/Sunset",
            "price_range": "Free",
            "seasonal_notes": "Open area, accessible year-round. Best visited when cooler, minimal shade. Excellent sunset spot.",
            "booking_tips": "Free entry. Allow 1-1.5 hours. Accessible by foot (uphill walk), bus, or taxi from Rhodes Town.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 3
            },
            "latitude": 36.4400,
            "longitude": 28.2158
        },
        {
            "name": "Acropolis of Lindos",
            "type": "Major Archaeological Site",
            "description": "A stunning archaeological site perched on a steep cliff overlooking the picturesque village and bay of Lindos. Features ancient Greek ruins (including the Temple of Athena Lindia), Roman structures, a Byzantine church, and medieval walls built by the Knights. Offers breathtaking views.",
            "indoor": false,
            "best_time": "Morning (to avoid heat/crowds)",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. Very exposed and hot in summer, minimal shade. Can be extremely crowded.",
            "booking_tips": "Buy tickets online or at the entrance (can have long queues). Allow 1.5-2 hours on the site itself. Access involves walking up steep paths or steps from Lindos village (donkey rides available but controversial). Visit early.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 5
            },
            "latitude": 36.0906,
            "longitude": 28.0879
        },
        {
            "name": "Lindos Village & St. Paul's Bay",
            "type": "Picturesque Village/Bay",
            "description": "Charming traditional village with whitewashed houses, narrow alleys, shops, and tavernas, located below the Acropolis. Nearby St. Paul's Bay is a stunning, almost enclosed bay with clear waters, said to be where the Apostle Paul landed.",
            "indoor": false,
            "best_time": "Morning/Late Afternoon",
            "price_range": "Free (village), Beach facilities may charge",
            "seasonal_notes": "Village is bustling in summer. Bay is popular for swimming/sunbathing.",
            "booking_tips": "Explore the village on foot. St. Paul's Bay has limited parking and can get crowded. Lindos is about an hour's drive from Rhodes Town.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 4
            },
            "latitude": 36.0930,
            "longitude": 28.0860
        },
        {
            "name": "Anthony Quinn Bay",
            "type": "Scenic Bay/Beach",
            "description": "A beautiful small bay with emerald green waters and rocky surroundings, named after the actor who starred in 'The Guns of Navarone,' filmed partly in Rhodes. Popular for swimming and snorkeling.",
            "indoor": false,
            "best_time": "Morning/Early Afternoon",
            "price_range": "Free (beach), Sunbed rental typical",
            "seasonal_notes": "Very popular and crowded in summer. Water is generally calm.",
            "booking_tips": "Located near Faliraki, about 15km south of Rhodes Town. Limited parking available. Arrive early in peak season to secure a spot.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 2
            },
            "latitude": 36.3258,
            "longitude": 28.2086
        },
        {
            "name": "Mandraki Harbour & Colossus Site",
            "type": "Harbour/Historic Landmark",
            "description": "The main harbour of Rhodes Town, flanked by statues of a stag and doe (Elafos and Elafina) perched on columns where the feet of the Colossus of Rhodes are traditionally thought to have stood. Features medieval windmills and the Fortress of St. Nicholas.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Free",
            "seasonal_notes": "Bustling with boats (tourist excursions, yachts). Pleasant for a stroll year-round.",
            "booking_tips": "Free to walk around. Departure point for many boat trips. Combine with a visit to the nearby Old Town.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 36.4490,
            "longitude": 28.2275
        },
        {
            "name": "Kallithea Springs",
            "type": "Historic Spa/Beach",
            "description": "Restored Italian-era thermal spa complex known for its unique architecture, pebble mosaics, Rotonda hall, and gardens, set in a picturesque cove. While the therapeutic springs are no longer active, it's a popular spot for swimming, sunbathing, events, and admiring the elegant structures.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Budget (Entrance fee)",
            "seasonal_notes": "Open year-round. Popular beach club atmosphere in summer.",
            "booking_tips": "Small entrance fee applies. Allow 1-2 hours or longer if staying at the beach. Located south of Rhodes Town, before Faliraki.",
            "ratings": {
                "cost_estimate": 4,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 36.3798,
            "longitude": 28.2300
        },
        {
            "name": "Valley of the Butterflies (Petaloudes)",
            "type": "Natural Park",
            "description": "A unique nature park consisting of a shaded valley with streams and wooden walkways. From late June to early September, it hosts thousands of Jersey Tiger Moths (Panaxia Quadripunctaria), attracted by the resin of the Oriental Sweetgum trees.",
            "indoor": false,
            "best_time": "Morning (July/August for moths)",
            "price_range": "Budget",
            "seasonal_notes": "Moths are present only in summer (peak July/August). Visiting outside this period means seeing the valley itself, but few/no moths. Requires quiet walking to avoid disturbing the moths.",
            "booking_tips": "Entrance fee applies. Allow 1-1.5 hours. Wear comfortable shoes. Located inland, about 25km from Rhodes Town. Crucial not to disturb the resting moths.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 2
            },
            "latitude": 36.3375,
            "longitude": 28.0583
        },
        {
            "name": "Rhodes Old Town Walls Walk",
            "type": "Historic Fortifications",
            "description": "Walk along the top of the impressive medieval fortifications surrounding the Old Town of Rhodes. Offers unique perspectives of the Old Town, the moat, and the surrounding areas. Access is usually near the Palace of the Grand Master.",
            "indoor": false,
            "best_time": "Afternoon (limited opening hours)",
            "price_range": "Budget",
            "seasonal_notes": "Typically open only on weekday afternoons (e.g., Mon-Fri, 12:00-15:00, subject to change). Check locally for current schedule. Closed on rainy days.",
            "booking_tips": "Small fee applies. Allow 1 hour for the accessible section. Limited opening times require planning. Offers great photo opportunities.",
            "ratings": {
                "cost_estimate": 3,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 4
            },
            "latitude": 36.4460,
            "longitude": 28.2240
        },
        {
            "name": "Seven Springs (Epta Piges)",
            "type": "Natural Landmark/Park",
            "description": "A refreshing oasis featuring seven natural springs that converge to form a small lake. Surrounded by lush forest with peacocks and ducks. Features a narrow tunnel that visitors can walk through to reach the lake, or an alternative path around.",
            "indoor": false,
            "best_time": "Morning/Early Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. Particularly refreshing during hot summer months. Water flow varies seasonally.",
            "booking_tips": "No tickets required. Located about 30km from Rhodes Town. Allow 1-2 hours. Wear comfortable shoes. Combine with nearby Tsambika Beach.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 2
            },
            "latitude": 36.2528,
            "longitude": 28.1165
        },
        {
            "name": "Monolithos Castle",
            "type": "Medieval Ruins/Viewpoint",
            "description": "Dramatic castle ruins perched on a 236m-high rock overlooking the west coast of Rhodes. Built by the Knights of St. John in the 15th century to protect against pirate attacks. Little remains of the original structure, but the site offers spectacular panoramic views of the Aegean Sea and surrounding landscape.",
            "indoor": false,
            "best_time": "Late Afternoon/Sunset",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round but can be windy. Sunset views are particularly impressive.",
            "booking_tips": "Free entry. Located on the western coast, about 70km from Rhodes Town. Access involves a steep climb up stone steps. Allow 1 hour to explore and enjoy the views.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 3
            },
            "latitude": 36.1166,
            "longitude": 27.6999
        },
        {
            "name": "Tsambika Monastery",
            "type": "Religious Site/Viewpoint",
            "description": "A small Byzantine monastery dedicated to the Virgin Mary (Panagia Tsambika), perched on a 300m-high hill. Famous for its icon believed to help women with fertility issues. The climb up 297 steps is rewarded with breathtaking views of Tsambika Beach and the eastern coastline.",
            "indoor": true,
            "best_time": "Morning/Late Afternoon",
            "price_range": "Free (donations appreciated)",
            "seasonal_notes": "Open daily during daylight hours. Modest dress required (shoulders and knees covered). Very hot climb in summer months.",
            "booking_tips": "No entrance fee. Located between Rhodes Town and Lindos. The climb is strenuous but worth it for the views. Allow 1.5 hours including the ascent and descent.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 36.2299,
            "longitude": 28.1538
        },
        {
            "name": "Rhodes Modern Art Museum",
            "type": "Art Museum",
            "description": "Housed in a restored medieval building, this museum showcases modern Greek and international art with a particular focus on artists connected to Rhodes and the Dodecanese. Features paintings, sculptures, engravings, and a collection of maps of Rhodes through the centuries.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Budget",
            "seasonal_notes": "Climate-controlled. Open year-round with possible seasonal hours.",
            "booking_tips": "Small entrance fee. Located in the New Town of Rhodes. Allow 1-1.5 hours. Often less crowded than the historical sites.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 3
            },
            "latitude": 36.4502,
            "longitude": 28.2271
        }
    ]
}