{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Protochronia)",
          "notes": "New Year's Day is a public holiday throughout Greece. Most attractions, shops, and restaurants in Rhodes operate with limited hours. Traditional Greek New Year's celebrations include the cutting of the Vasilopita cake with a hidden coin bringing luck to whoever finds it. The city is relatively quiet as residents recover from New Year's Eve celebrations, though the harbor area may see locals taking traditional New Year's Day walks."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 2,
          "notes": "Early January in Rhodes features mild winter weather with average high temperatures around 15°C (59°F) and increased chances of rainfall. This is low season for tourism, so you'll find fewer crowds at major attractions like the Palace of the Grand Master, the Archaeological Museum, and the Old Town. Winter sales begin in shops throughout the city. This is a good time to explore indoor cultural sites and enjoy the island's famous Greek cuisine in cozy tavernas."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
          "score": 3,
          "notes": "Mid-January brings typical winter conditions to Rhodes. Unlike northern Greece, snowfall is extremely rare on the island. Indoor cultural attractions such as the Archaeological Museum (Hospital of the Knights), the Palace of the Grand Master, and exploration of the Old Town are excellent options during occasional rainy days. Winter specialties appear in local restaurants, including hearty soups and stews like fasolada (bean soup) and traditional Greek meat dishes, perfect for the season."
        },
        {
          "days": [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Late January sees Rhodes with mild winter conditions, with temperatures rarely dropping below 9°C (48°F). Winter days can often be sunny and pleasant enough for exploring the island. When the weather permits, take advantage of clear days to visit the Acropolis of Rhodes (Monte Smith) for panoramic views of the city and Aegean Sea. This is a perfect time to explore Rhodes' vibrant café culture, with many cozy establishments serving Greek coffee and traditional pastries."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 9,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "February continues with mild winter conditions but frequently features beautiful, clear days with comfortable temperatures. The first signs of spring can begin to appear toward the end of the month with almond trees blossoming in the countryside around Rhodes. Tourism remains low, making it an excellent time to enjoy the island's museums, Old Town streets, and indoor attractions without crowds. February is a good month to explore Rhodes' café culture, with locals spending hours in the city's numerous coffee shops. Winter sales continue in many shops, offering good value for shoppers."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 9,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 4,
          "notes": "Early March marks the transition from winter to spring, with gradually warming temperatures and occasional rainfall. This shoulder season is ideal for exploring both archaeological sites like the Acropolis of Lindos and cultural attractions with very manageable crowds. The countryside around Rhodes begins to show vibrant signs of spring with wildflowers appearing throughout the landscape."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Mid-March brings increasingly pleasant spring weather and longer days. The temperatures are perfect for exploring outdoor archaeological sites without the summer heat. This is an excellent time to visit the Acropolis of Lindos and other ancient sites on the island, as well as for hiking in the nearby countryside where spring wildflowers are beginning to bloom in abundance."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "notes": "Mid-March brings more reliable spring weather with temperatures continuing to rise. Outdoor cafés and restaurants begin setting up their terraces along Mandraki Harbor and in popular areas like the Old Town. This is an excellent time to explore the island's historic districts and enjoy the panoramic views from the Acropolis of Rhodes without summer crowds or heat."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Greek Independence Day (Ikostí Pémpti Martíou)",
          "notes": "March 25th is a major national holiday celebrating Greek Independence Day. A military and student parade takes place in central Rhodes Town, particularly along the main thoroughfares. Museums and archaeological sites may have modified hours but typically remain open. Many restaurants offer special menus featuring traditional Greek foods, particularly bakaliaros (fried cod) and skordalia (garlic sauce), which are traditionally eaten on this day."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Easter Preparations",
          "notes": "Late March may include Easter preparations (if Orthodox Easter falls in March/early April). The weather becomes increasingly pleasant with spring temperatures averaging around 18°C (64°F). If Easter falls in late March/early April, expect increased activity in churches around Rhodes, with special services and preparations for Holy Week."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 10,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21],
          "score": 5,
          "special": true,
          "event": "Holy Week & Easter (Megali Evdomada & Pascha)",
          "notes": "If Orthodox Easter falls in April, Rhodes observes Holy Week with solemn processions and religious ceremonies at churches across the island. Good Friday features evening processions of the Epitaphios (Christ's funeral bier) through neighborhoods across Rhodes Town. Easter Sunday is celebrated with special services, particularly the midnight Resurrection service on Saturday night with candles and fireworks, followed by traditional feasts featuring roast lamb. April brings reliable spring weather with wildflowers blooming throughout the countryside and archaeological sites. This is an excellent time for walking tours of the Old Town and visiting outdoor monuments like the Acropolis of Lindos, without the intense summer heat."
        },
        {
          "days": [22, 23],
          "score": 5,
          "special": true,
          "event": "Feast of Agios Georgios (St. George)",
          "notes": "On April 22nd and 23rd (or Easter Monday), celebrations for St. George (Agios Georgios) take place in Pastida village. This is a traditional Greek religious festival (panigiri) with food, music, and dancing. The improving spring weather makes this an excellent time to experience local culture and explore the inland villages of Rhodes."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Late April brings even more pleasant spring conditions, with daytime temperatures usually above 20°C (68°F). Tourism begins to increase, but the island is still relatively uncrowded compared to summer months. This is an excellent time to explore the entire island, both the coastal areas and inland villages. The Rhodes International Marathon typically takes place during this period, drawing participants from around the world."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 12,
      "tourismLevel": 6
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Ergatiki Protomagia)",
          "notes": "May 1st is International Workers' Day and a public holiday in Greece. Traditional celebrations include collecting flowers and making wreaths to hang on doors. Many Rhodes residents also use this holiday for excursions to nearby countryside areas or beaches. There may be organized labor demonstrations in central Rhodes Town."
        },
        {
          "days": [2, 3, 4, 5],
          "score": 5,
          "notes": "Early May brings ideal weather with warm, sunny days averaging 21°C (70°F) and minimal rainfall. Tourism increases but hasn't yet reached summer peak levels. This is considered one of the best months to visit Rhodes with perfect conditions for exploring archaeological sites like Lindos, Rhodes Old Town, and Kameiros. The beaches begin to warm up enough for swimming, and outdoor dining reaches its prime in the Old Town and along Mandraki Harbor. The countryside around Rhodes is spectacularly green and dotted with wildflowers before the summer heat sets in."
        },
        {
          "days": [6],
          "score": 5,
          "special": true,
          "event": "Muslim Celebration of St. George",
          "notes": "A unique cultural event happens on May 6th when the Muslim community of Rhodes celebrates St. George in Rodini Park. This interesting cultural fusion showcases the island's diverse history and traditions. The pleasant May weather makes it an ideal time to experience this unique celebration while exploring the beautiful Rodini Park."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "Mid to late May offers some of the best weather conditions of the year in Rhodes. Temperatures are comfortably warm, averaging 23-24°C (73-75°F) during the day, perfect for beach activities and sightseeing. The sea temperature rises to around 19°C (66°F), making swimming increasingly pleasant. Tourist numbers are building but still not at peak summer levels. This is an ideal time to visit attractions like the Valley of the Butterflies (though the butterflies are not yet present in large numbers) and the Seven Springs (Epta Piges), as well as taking day trips to nearby attractions like Symi Island."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 15,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 5,
          "special": true,
          "event": "Strawberry Festival",
          "notes": "At the beginning of June, the village of Paradisi hosts a Strawberry Festival celebrating the local harvest. This is a wonderful opportunity to taste local products and experience traditional Greek hospitality. Early June brings warm summer weather to Rhodes with temperatures typically around 27°C (81°F). This is an excellent time to visit the island before the peak heat and crowds of July and August."
        },
        {
          "days": [6, 7, 8, 9, 10],
          "score": 5,
          "special": true,
          "event": "Rhodes and South Aegean International Jazz Festival",
          "notes": "Early June features the Rhodes and South Aegean International Jazz Festival held inside the medieval Palace of the Grand Master. This prestigious event attracts talented musicians from around the world and offers a unique opportunity to enjoy world-class jazz in a historic setting. The weather is perfectly warm without the extreme heat of high summer."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "notes": "Mid-June brings full summer conditions to Rhodes, with temperatures averaging 29°C (84°F) and minimal chance of rain. Tourism increases as European summer holidays begin. The sea temperature reaches a very comfortable 23°C (73°F), perfect for swimming and water activities. All tourist facilities, restaurants, and attractions operate at full capacity. Early morning or evening visits to archaeological sites like the Acropolis of Lindos are recommended to avoid the midday heat. The Sound and Light Show in Rhodes Old Town begins its regular schedule, offering evening entertainment."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Medieval Festival at Kritinia Castle",
          "notes": "In late June, a two-day Medieval Festival takes place at the Castle of Kritinia, featuring medieval games, dances, acrobatics performances, and traditional food and drink. Cultural activities increase across the island with outdoor performances beginning in various venues, particularly the Medieval Moat Theatre 'Melina Merkouri'. The Greek Dance Theatre in the Old Town offers regular performances of traditional dances and music from the Dodecanese region."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 21,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "special": true,
          "event": "Maritime Week Celebration",
          "notes": "The first week of July celebrates Maritime Week with cultural events throughout Rhodes Town, including tours, free entry to museums, sports events, art exhibitions, and fireworks. Early July brings high summer with temperatures reaching 31°C (88°F) and virtually no rainfall. Tourism increases significantly as European summer holidays begin. Morning hours are best for visiting archaeological sites before the midday heat. The island's beaches become busy with locals and tourists seeking relief from the heat."
        },
        {
          "days": [8, 9, 10, 11, 12, 13],
          "score": 4,
          "notes": "Mid-July continues the high summer conditions with hot temperatures and crowded tourist attractions. This is peak beach season with all water sports and beach facilities in full operation. Early morning and evening activities are recommended to avoid the midday heat. The nightlife in Rhodes Town and Faliraki reaches its peak during this period, with bars, clubs, and restaurants bustling with activity well into the early hours."
        },
        {
          "days": [14, 15],
          "score": 4,
          "special": true,
          "event": "Watermelon Festival",
          "notes": "Around July 13th, the annual Watermelon Festival is held at the lake near the village of Apolakkia in southern Rhodes. This vibrant event features live music, dancing, watermelon sculpture competitions, and plenty of sweet watermelon to enjoy. This makes for a pleasant excursion from the coastal heat, though temperatures remain high across the island."
        },
        {
          "days": [16, 17, 18, 19],
          "score": 4,
          "special": true,
          "event": "Feast of Agia Marina",
          "notes": "On July 16th and 17th, celebrations for Agia Marina take place in Paradisi village. This traditional religious festival includes church services, local food, music, and dancing. The high temperatures of July continue, so attending evening celebrations is recommended to avoid the daytime heat."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "International Opera Festival and Multiple Village Celebrations",
          "notes": "From July 20th-30th, the International Opera Festival takes place in the courtyard of the Palace of the Grand Master, offering world-class performances in a magnificent setting. Throughout late July, numerous village festivals (panigiria) occur across the island, including celebrations for Prophet Elias in Ialyssos (July 19-20), Agios Panteleimon in Kattavia (July 25-27), and Agia Paraskevi in Ialyssos (July 25-26). These local celebrations provide authentic Greek cultural experiences with traditional food, music, and dance. The weather remains hot with daytime temperatures regularly exceeding 31°C (88°F)."
        }
      ],
      "weatherHighC": 31,
      "weatherLowC": 23,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early August brings Rhodes' hottest temperatures, often exceeding 31°C (88°F). This is the absolute peak tourist season with maximum crowds at all major attractions and beaches. Early morning or evening visits to archaeological sites are essential to avoid the midday heat. The sea is at its warmest temperature (around 26°C/79°F), making it perfect for swimming and water activities along Rhodes' coastline. The Sound and Light Show in Rhodes Old Town and performances at the Medieval Moat Theatre continue to provide evening entertainment options."
        },
        {
          "days": [15],
          "score": 4,
          "special": true,
          "event": "Dormition of the Virgin Mary (Koimisis tis Theotokou)",
          "notes": "August 15th is a major religious holiday celebrating the Dormition (Assumption) of the Virgin Mary. This is one of the most important feast days in the Greek Orthodox calendar. Special services are held at churches throughout Rhodes, particularly in Ialyssos and Kremasti where major celebrations take place. Many Greeks return to ancestral villages for this holiday, though tourist areas remain extremely busy."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "August Full Moon Events",
          "notes": "Around the August full moon, archaeological sites like the Acropolis of Lindos often host special evening events with extended hours and cultural performances. Late August maintains high summer conditions with hot temperatures around 31°C (88°F). This is still peak tourist season with maximum crowds at all major attractions. Evening activities dominate island life, with open-air cinemas, cultural events, and dining typically starting after 8 PM when temperatures begin to cool."
        }
      ],
      "weatherHighC": 31,
      "weatherLowC": 24,
      "tourismLevel": 10
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 5,
          "notes": "Early September brings ideal conditions with warm temperatures around 29°C (84°F) but without the extreme heat or crowds of August. Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather and more manageable visitor numbers. The sea remains warm enough (around 25°C/77°F) for comfortable swimming at Rhodes' beaches. This is a perfect time to explore the entire island, from the beaches to the inland villages."
        },
        {
          "days": [8],
          "score": 5,
          "special": true,
          "event": "Birthday of the Virgin Mary",
          "notes": "September 8th celebrates the Birthday of the Virgin Mary (Panagia), with special festivities at Panagia Tsambika of Archangelos and Panagia Skiadeni in Southern Rhodes. These religious celebrations attract many locals and offer visitors a chance to experience authentic Greek traditions and hospitality while enjoying the pleasant September weather."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "notes": "Mid-September continues to offer excellent weather conditions with temperatures typically around 28°C (82°F). The island begins to feel less crowded as many tourists have departed, though all facilities remain fully operational. This is one of the best times to visit Rhodes' popular attractions like Lindos Acropolis and the Valley of the Butterflies, where you can still see the Jersey Tiger Moths before they depart later in the month."
        },
        {
          "days": [16, 17, 18, 19],
          "score": 5,
          "special": true,
          "event": "International Folk Festival",
          "notes": "From September 16-19, Rhodes hosts the International Folk Festival featuring traditional folk dance and song groups, choirs, classical and marching bands, majorettes, and orchestras from around the world. This colorful cultural event showcases global traditions against the backdrop of Rhodes' historic settings."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Days of Music Festival",
          "notes": "Late September features the 'Days of Music' Festival, one of Greece's most popular music events including both popular and classical music performances from all over the world. The weather remains pleasantly warm, typically around 26°C (79°F), perfect for exploring archaeological sites and the city's historical center. The sea remains warm enough for swimming, but beaches are significantly less crowded than during summer months. This period is widely considered one of the best times to visit Rhodes."
        }
      ],
      "weatherHighC": 28,
      "weatherLowC": 20,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "notes": "October brings pleasant autumn weather to Rhodes with temperatures around 23°C (73°F). Tourism continues to decrease, creating ideal conditions for exploring the island and archaeological sites without crowds. The sea remains warm enough for swimming during the first half of the month (around 23°C/73°F). This is an excellent month for hiking in the countryside around Rhodes, with comfortable temperatures and beautiful autumn landscapes. The Valley of the Butterflies will be much quieter now that the moths have departed, but still offers beautiful scenery and peaceful walks."
        },
        {
          "days": [26, 27],
          "score": 5,
          "notes": "Late October continues with pleasant autumn weather and the possibility of occasional rainfall. This is still an excellent time to explore Rhodes' cultural attractions like the Archaeological Museum, which houses an impressive collection of ancient artifacts from across the island and surrounding regions."
        },
        {
          "days": [28],
          "score": 5,
          "special": true,
          "event": "Oxi Day (Epéteios tou Óhi)",
          "notes": "October 28th is 'Oxi Day' ('No' Day), commemorating Greece's refusal to surrender to Axis powers in 1940. A military and student parade takes place in central Rhodes Town. Most museums and archaeological sites remain open, though some may have modified hours. Schools and businesses are closed for this national holiday, and patriotic celebrations take place throughout the island."
        },
        {
          "days": [29, 30, 31],
          "score": 5,
          "notes": "Late October continues with pleasant autumn weather and the possibility of occasional rainfall. Temperatures typically remain comfortable around 23°C (73°F) during the day, dropping to around 16°C (61°F) at night. This is an excellent time for cultural experiences including museum visits and exploring the Old Town without summer crowds. Many restaurants and shops remain open, though some seasonal businesses begin to close for the winter."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 16,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 4,
          "notes": "Early November sees autumn conditions with temperatures around 20°C (68°F) and increased chances of rainfall. Tourism levels are low, making it an excellent time to explore the island's cultural attractions without crowds. The Archaeological Museum and the Palace of the Grand Master are particularly rewarding to visit during this period."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Olive Harvesting Season",
          "notes": "Mid-to-late November marks the beginning of the olive harvesting season in Rhodes. This is a significant cultural and agricultural tradition on the island. The weather becomes cooler with temperatures around 18°C (64°F) and increased chances of rainfall. This is an excellent time for cultural experiences including museum visits, the vibrant café culture, and enjoying Greek gastronomy featuring seasonal ingredients. Indoor attractions become particularly appealing, with many museums and historical sites still open but virtually empty of tourists. Late November sees the beginning of Christmas preparations with decorations starting to appear throughout Rhodes Town."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 13,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "special": true,
          "event": "Christmas Celebrations",
          "notes": "Throughout December, Rhodes Town hosts Christmas markets and festivities in central areas, particularly around Mandraki Harbor and the Old Town. The city center is decorated with Christmas lights and festive displays. Special cultural events, concerts, and performances take place at venues throughout the city. December brings mild winter weather with temperatures around 16°C (61°F) and increased rainfall, though clear, sunny winter days are also common."
        },
        {
          "days": [24, 25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Paramoni Christougennon & Christougenna)",
          "notes": "Christmas is celebrated throughout Rhodes with special services at churches, particularly at the Cathedral of the Annunciation. Many restaurants offer special Christmas menus, though some may close for family celebrations on Christmas Day. Most major archaeological sites and museums remain open during the holiday period but may have reduced hours on Christmas Eve and Day. The Christmas season in Greece traditionally extends through January 6 (Epiphany), so celebrations continue past Christmas Day."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is festive in Rhodes, with holiday decorations, special events, and a generally celebratory atmosphere. Shopping areas remain busy with winter sales beginning at some stores. Major tourist attractions maintain normal winter hours, and the city's cultural life continues with special holiday performances and events. This is a quieter time to experience the authentic character of Rhodes without summer crowds."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Paramoni Protochronias)",
          "notes": "New Year's Eve celebrations center around the Old Town and Mandraki Harbor with midnight countdowns, music, and fireworks. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. A unique Greek New Year's tradition is the smashing of a pomegranate on the doorstep at midnight for good luck. The city maintains a festive atmosphere with families and friends gathering to welcome the New Year."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 10,
      "tourismLevel": 3
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the Acropolis of Lindos and other archaeological sites with ideal temperatures",
      "Visiting the Archaeological Museum of Rhodes with its impressive collection",
      "Walking along the Street of the Knights and the medieval Old Town",
      "Food tours featuring seasonal spring ingredients and Greek specialties",
      "Hiking in the countryside around Rhodes during wildflower season",
      "Day trips to nearby traditional villages like Lindos and Archangelos",
      "Greek Easter celebrations and traditions (when applicable)",
      "Outdoor café culture in the Old Town and along Mandraki Harbor",
      "Photography excursions capturing spring light on monuments and landscapes"
    ],
    "summer": [
      "Early morning visits to archaeological sites like Lindos Acropolis before peak heat",
      "Cultural events at the Medieval Moat Theatre and other open-air venues",
      "Evening dining along Mandraki Harbor with views of the fortress",
      "Day trips to nearby beaches like Anthony Quinn Bay, Tsambika, and Lindos",
      "The Sound and Light Show in Rhodes Old Town",
      "Boat cruises around the island and to nearby Symi",
      "Summer festival events with music, dance, and theatrical performances",
      "Evening walking tours of the Old Town when temperatures cool",
      "Water sports at the beaches around Rhodes"
    ],
    "autumn": [
      "Perfect weather for extended exploration of archaeological sites",
      "Wine tasting featuring local Rhodian wines",
      "Museum visits including the Archaeological Museum in the Hospital of the Knights",
      "Hiking in the hills around Rhodes with panoramic coastal views",
      "Seasonal gastronomy featuring autumn ingredients at local tavernas",
      "Olive harvest experiences in nearby villages",
      "Photography walks capturing golden autumn light on monuments",
      "Day trips to less-visited sites like Monolithos Castle and Kritinia",
      "Cultural performances at indoor venues as the weather cools"
    ],
    "winter": [
      "Rhodes Christmas celebrations and festive markets",
      "New Year's celebrations and traditions",
      "Winter shopping in the Old Town and market areas",
      "Museum explorations during occasional rainy days",
      "Traditional winter cuisine featuring seasonal Greek specialties",
      "Cozy café culture centered around Greek coffee and traditional pastries",
      "Winter views from the medieval walls on clear days",
      "Indoor cultural performances at historic venues",
      "Greek Orthodox Christmas and Epiphany traditions"
    ]
  }
}