{
  "overview_paragraph": "Avignon is at its best in spring (April–June) and early fall (September–October), when the medieval streets are alive with visitors, outdoor cafés line the Place de l'Horloge, and the Palais des Papes glows in golden light. July brings the world-famous Festival d'Avignon with theater performances and cultural events—but also peak crowds and higher prices. August offers quieter exploration of the historic center while some locals are away. Winter (November–February) reveals the city's cozy medieval charm with fewer tourists—perfect for intimate museum visits, warm Provençal cuisine, and peaceful walks along the Rhône. March welcomes spring with blooming almond trees and the first outdoor terraces reopening.",
  "January": [
    "Palais des Papes without the crowds, steaming Provençal hot chocolate in Place de l'Horloge, and misty walks along the medieval ramparts.",
    "Winter light on the Pont d'Avignon, snug restaurants in the Old Town, and vintage hunts in the covered market."
  ],
  "February": [
    "Old Town at golden hour, romantic views from the Rocher des Doms, and traditional Provençal music nights in local venues.",
    "Shared local pastries, candlelit courtyard restaurants, and strolls past secret medieval passageways in the Vieille Ville."
  ],
  "March": [
    "First almond blossoms on the Rocher des Doms, terrace tables returning to Place de l'Horloge, and Old Town bookshop wanders.",
    "Morning croissants, museum afternoons in the Palais des Papes, and blue-hour walks along the Rhône welcoming spring back to Avignon."
  ],
  "April": [
    "Wildflowers in bloom around the Rocher des Doms, flaky Provençal pastries, and walks from the Place du Palais to the Old Town.",
    "Spring light on the Cathédrale Notre-Dame, gallery-hopping in Place de l'Horloge, sunset views over the Rhône from the Pont d'Avignon."
  ],
  "May": [
    "Picnics on the Rocher des Doms, markets brimming with local Provençal color, and twilight strolls along the medieval streets.",
    "Flowered courtyards, open-air café moments in Place de l'Horloge, and museum nights that stretch into starry walks through the Palais des Papes."
  ],
  "June": [
    "Long golden evenings, courtyard aperitifs in Place de l'Horloge, and the city humming with pre-festival excitement.",
    "Sun-splashed terraces, Provençal picnics, and late sunsets that turn every medieval tower into a postcard."
  ],
  "July": [
    "Festival d'Avignon performances, lazy afternoons in the Palais des Papes gardens, and moonlit walks along the Rhône.",
    "Summer markets, courtyard terraces, and museum cool-downs between sun-bright wanderings through medieval streets."
  ],
  "August": [
    "Quiet exploration of the Palais des Papes, easy museum days, and peaceful evenings with breezes off the Rhône.",
    "Shaded gardens, courtyard cafés, and golden hours when the medieval city feels like it's yours alone."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits in the Palais des Papes, lively terraces in Place de l'Horloge, and vineyard-tinted evenings in the Old Town.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering the medieval streets irresistible."
  ],
  "October": [
    "Autumn colors in the Rocher des Doms, restaurants aglow in medieval courtyards, and the local harvest festival in Place de l'Horloge.",
    "Cinnamon-spiced stalls, museum hideaways in the Palais des Papes, and sunset tones warming the Rhône waterfront."
  ],
  "November": [
    "Local Côtes du Rhône wine toasts, cozy Provençal restaurants, and Palais des Papes afternoons while the city slows to a hush.",
    "Foggy Rhône mornings, medieval color indoors, and snug cafés for long, lingering chats about Avignon's history."
  ],
  "December": [
    "Medieval street lights, Christmas markets at Place de l'Horloge, and strolling beneath grand Palais des Papes façades.",
    "Vin chaud in hand, Cathedral bells, and winter sparkle from the Rhône to the medieval passageways."
  ]
}

