{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day",
          "notes": "New Year's Day celebrations in Plaza del Ayuntamiento. Public holiday."
        },
        {
          "days": [2, 3, 4],
          "score": 3,
          "notes": "Off-season with fewer tourists and good hotel value. Mild winter climate with daytime temperatures around 16°C."
        },
        {
          "days": [5, 6],
          "score": 4,
          "special": true,
          "event": "Three Kings Celebration",
          "notes": "Three Kings celebration features a spectacular parade through Valencia and marks the main gift-giving tradition in Spain. January 6 is a public holiday."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
          "score": 3,
          "notes": "Winter sales begin mid-January in all shops and department stores. Museums and cultural venues are less crowded."
        },
        {
          "days": [18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "San Vicente Mártir",
          "notes": "Celebration of Valencia's patron saint with religious processions and special events, particularly in the historic center."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Low season continues with mild winter temperatures. Good time for cultural visits to City of Arts and Sciences, museums, and indoor attractions."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 6,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "Still relatively quiet tourist season with mild winter temperatures. Almond trees begin to blossom in the countryside surrounding Valencia."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "special": true,
          "event": "Carnival",
          "notes": "Pre-Lent celebrations with parades, costumes, and festivities in various neighborhoods. Smaller than other Spanish carnivals but still festive."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28],
          "score": 4,
          "notes": "Orange trees begin to blossom throughout the city, filling the air with their distinctive fragrance. Early signs of spring appear."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 7,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "notes": "Beginning of spring with orange blossoms at their peak, filling the city with fragrance. Excellent time for photography and garden visits."
        },
        {
          "days": [15, 16, 17, 18],
          "score": 5,
          "special": true,
          "event": "Las Fallas (main days)",
          "notes": "Valencia's most spectacular festival features hundreds of artistic monuments (fallas) throughout the city, daily firecracker displays (mascletà), parades, music, and street parties. The festival culminates with La Cremà on March 19 when all monuments are burned."
        },
        {
          "days": [19],
          "score": 5,
          "special": true,
          "event": "San José/La Cremà",
          "notes": "Culmination of Las Fallas when all monuments are ceremonially burned in a spectacular night of fire. Public holiday."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Post-Fallas period with city cleaning and gradual return to normal. Spring weather makes it ideal for exploring outdoor attractions and the Turia Gardens."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 9,
      "tourismLevel": 9
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 5,
          "notes": "Prime spring conditions with pleasant temperatures ideal for sightseeing and outdoor activities."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14],
          "score": 5,
          "special": true,
          "event": "Semana Santa Marinera (Holy Week - varies by year)",
          "notes": "Valencia's distinctive maritime Holy Week celebrations in the coastal districts of Cabanyal, Canyamelar, and Grau feature processions with nautical themes and unique maritime traditions."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Perfect spring weather with longer days and comfortable temperatures. Ideal time for beach activities beginning to pick up as waters warm slightly."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 11,
      "tourismLevel": 7
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "Labor Day",
          "notes": "Public holiday with events throughout the city. Many locals head to beaches and parks for picnics and celebrations."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 5,
          "notes": "Excellent weather with warm days perfect for beach activities and city exploration. Gardens and parks in full bloom."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Valencia Wine Week",
          "notes": "Celebration of regional wines with tastings, pairings, and events at restaurants and venues throughout the city. Features wines from nearby regions like Utiel-Requena and Alicante."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "Pre-summer conditions ideal for combining beach time with cultural visits. Restaurant terraces fully operational with pleasant evening temperatures."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 14,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 5,
          "notes": "Early summer brings consistent warm weather ideal for beach activities combined with city exploration. Waters warm enough for comfortable swimming."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16],
          "score": 5,
          "special": true,
          "event": "Festival de Les Arts",
          "notes": "Major music festival featuring international and Spanish indie and alternative bands. Held in the City of Arts and Sciences complex."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "notes": "Summer solstice period with longest days of the year. Beach establishments fully operational with extended hours."
        },
        {
          "days": [24],
          "score": 5,
          "special": true,
          "event": "San Juan Night",
          "notes": "Magical midsummer celebration with bonfires on Valencia's beaches, midnight swimming, and parties lasting until sunrise. One of the year's most beloved local celebrations."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Peak summer conditions begin with hot days but still comfortable evenings. Beach life in full swing."
        }
      ],
      "weatherHighC": 28,
      "weatherLowC": 18,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 4,
          "notes": "Peak summer begins with hot temperatures. Beach activities and water sports at their best. Morning and evening activities recommended in the city."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Great Valencia Fair (Feria de Julio)",
          "notes": "Month-long summer festival featuring concerts, bullfighting events, night parades, and cultural activities throughout the city. The Battle of Flowers parade on the final Sunday is a highlight."
        }
      ],
      "weatherHighC": 31,
      "weatherLowC": 21,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Hottest month of the year. Beach activities at their peak. Many businesses in the city close for holidays as locals vacation elsewhere."
        },
        {
          "days": [15],
          "score": 3,
          "special": true,
          "event": "Assumption Day",
          "notes": "Public holiday with limited business hours. Many restaurants and shops closed."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Peak summer heat continues. Good time for beach focus with limited city activities. Early morning or evening city exploration recommended."
        }
      ],
      "weatherHighC": 32,
      "weatherLowC": 22,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 5,
          "notes": "Excellent time to visit as summer crowds diminish but weather remains warm. Sea temperatures still comfortable for swimming."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Perfect late summer conditions with warm days and pleasant evenings. Cultural calendar resumes with new exhibitions and performances. Rice harvest begins in Albufera region."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 19,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8],
          "score": 5,
          "notes": "Excellent autumn weather with warm days perfect for sightseeing. Beach still viable option on warmer days."
        },
        {
          "days": [9],
          "score": 5,
          "special": true,
          "event": "Day of the Valencian Community (9 d'Octubre)",
          "notes": "Valencia's main regional holiday commemorating King James I's reconquest of the city in 1238. Features parades, traditional performances, and cultural events throughout the historic center."
        },
        {
          "days": [10, 11],
          "score": 4,
          "notes": "Continued celebrations around Valencian Community Day. Many museums offer free entry."
        },
        {
          "days": [12],
          "score": 4,
          "special": true,
          "event": "Hispanic Day",
          "notes": "National holiday commemorating Columbus's arrival in the Americas, with military parades and events."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Rice harvest season in Albufera Natural Park. Fall colors begin to appear in city parks. Pleasant temperatures ideal for urban exploration."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 15,
      "tourismLevel": 6
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day",
          "notes": "Public holiday with traditional cemetery visits and special services. Many businesses closed."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Mild autumn continues with good conditions for city exploration. Valencia Marathon typically held early in the month attracts international participants. Citrus fruit begins to ripen throughout the region."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 10,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "notes": "Early Christmas preparations with decorations appearing throughout the city. Orange harvest in full swing in surrounding regions."
        },
        {
          "days": [6],
          "score": 3,
          "special": true,
          "event": "Constitution Day",
          "notes": "Public holiday commemorating the Spanish Constitution. Many businesses closed."
        },
        {
          "days": [7],
          "score": 3,
          "notes": "'Puente' (bridge) holiday period between Constitution Day and Immaculate Conception."
        },
        {
          "days": [8],
          "score": 3,
          "special": true,
          "event": "Immaculate Conception",
          "notes": "Public holiday with special religious services. Many businesses closed."
        },
        {
          "days": [9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "special": true,
          "event": "Christmas Lights and Markets",
          "notes": "Valencia's Christmas lights illuminate the main shopping streets and plazas. Christmas markets in Plaza del Ayuntamiento and Plaza de la Reina offer traditional crafts and seasonal treats."
        },
        {
          "days": [25],
          "score": 3,
          "special": true,
          "event": "Christmas Day",
          "notes": "Public holiday with limited opening hours. Family celebration day."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Post-Christmas period with continued holiday atmosphere and festive decorations throughout the city."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve",
          "notes": "Celebrations throughout the city, particularly in Plaza del Ayuntamiento, with the tradition of eating 12 grapes at midnight. Many restaurants offer special New Year's dinners."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 7,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Las Fallas Festival in Mid-March",
      "Semana Santa Marinera Processions in Coastal Districts",
      "Orange Blossom Season throughout the City",
      "Albufera Nature Park Spring Birdwatching",
      "Valencia Marathon and Half Marathon",
      "Wine Week Events and Tastings",
      "Turia Gardens in Full Bloom",
      "MotoGP at Circuit Ricardo Tormo"
    ],
    "summer": [
      "Beach Life at La Malvarrosa and El Cabanyal",
      "San Juan Night Beach Bonfires",
      "Great Valencia Fair (Feria de Julio)",
      "Festival de Les Arts Music Events",
      "Albufera Sunset Boat Tours",
      "Open-Air Cinema in Turia Gardens",
      "Night Swimming at Oceanogràfic",
      "Marina Beach Club Experience"
    ],
    "autumn": [
      "Day of the Valencian Community Celebrations",
      "Rice Harvest in Albufera",
      "Valencia Culinary Festival",
      "Valencia Film Festival",
      "Mushroom Foraging Excursions",
      "Valencia Marathon",
      "Turia Gardens Autumn Colors",
      "Wine Harvest Festivals"
    ],
    "winter": [
      "Christmas Lights and Markets",
      "Three Kings Parade",
      "Orange Harvesting Season",
      "Thermal Baths at Montanejos",
      "San Vicente Mártir Celebrations",
      "Carnival Festivities",
      "Winter Paella at Albufera",
      "Las Hogueras de San Antón"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to high tourism",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}