{
    "Spring": {
        "activities": [
            {
                "name": "Las Fallas",
                "type": "Cultural/Festival",
                "description": "Experience Valencia's most famous festival featuring hundreds of enormous artistic monuments (fallas) that are burned on the final night, along with daily fireworks, parades, and traditional events throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Officially held March 15-19, but festivities begin from March 1 with daily mascletà firecracker displays at 2pm in Plaza del Ayuntamiento. The festival culminates with La Cremà (burning of the monuments) on March 19.",
                "booking_tips": "Book accommodation 6+ months in advance. Best viewing spots for the mascletà require arriving 1-2 hours early. The Night of Fire (March 18) and La Cremà (March 19) draw the largest crowds."
            },
            {
                "name": "Semana Santa Marinera",
                "type": "Cultural/Religious",
                "description": "Experience Valencia's distinctive maritime Holy Week celebrations in the coastal districts of Cabanyal, Canyamelar, and Grau, featuring processions with nautical themes and unique maritime traditions.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Dates vary each year (March-April). The coastal neighborhoods host distinctive processions that differ from inland Spanish cities, reflecting Valencia's strong connection to the sea.",
                "booking_tips": "Less crowded than Las Fallas but still requires advance accommodation booking. Main processions take place in the Poblats Marítims district, accessible by metro and tram."
            },
            {
                "name": "Orange Blossom Season",
                "type": "Nature",
                "description": "Experience the intoxicating fragrance of orange blossoms (azahar) that perfumes the entire city as Valencia's iconic orange trees bloom, creating a unique sensory experience.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Typically peaks in March-April, depending on weather conditions. The scent is strongest in areas with high concentrations of orange trees like Plaza de la Reina and throughout Turia Gardens.",
                "booking_tips": "No booking required. Early morning walks offer the most intense fragrance experience. Combine with a visit to historic areas where orange trees line the streets."
            },
            {
                "name": "Valencia Marathon and Half Marathon",
                "type": "Sport",
                "description": "Participate in or watch Valencia's acclaimed marathon events, known for their fast, flat courses through the city's most iconic areas including the City of Arts and Sciences.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to watch, Moderate to participate",
                "seasonal_notes": "The half marathon is typically held in late March with perfect running temperatures. The course is considered one of the fastest in Europe, attracting elite runners.",
                "booking_tips": "Register months in advance if participating. Spectators can watch from various points along the route; the finish at the City of Arts and Sciences offers spectacular views."
            },
            {
                "name": "Albufera Nature Park Spring Birdwatching",
                "type": "Nature",
                "description": "Observe migratory birds and spring wildlife in Valencia's remarkable wetland reserve, located just 10km south of the city.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to Low",
                "seasonal_notes": "Spring brings numerous migratory species to the lagoon and rice fields, with April-May offering peak birdwatching opportunities as birds establish breeding territories.",
                "booking_tips": "Guided tours available but advance booking essential. The visitor center provides information on current sightings. Visit at sunrise or sunset for best wildlife viewing."
            },
            {
                "name": "MotoGP Grand Prix of Valencia",
                "type": "Sport",
                "description": "Experience world-class motorcycle racing at the Ricardo Tormo Circuit, often serving as the exciting final race of the MotoGP World Championship season.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held in late April or early May, the Valencia circuit creates an amphitheater-like viewing experience with nearly 150,000 enthusiastic Spanish race fans.",
                "booking_tips": "Purchase tickets months in advance. General admission allows movement around the circuit while grandstand tickets offer assigned seating. Public transportation is arranged from Valencia city center."
            },
            {
                "name": "Gastronomy Week",
                "type": "Food & Drink",
                "description": "Experience special menus and culinary events at restaurants throughout Valencia during this celebration of Mediterranean cuisine.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Typically held in May, featuring special prix-fixe menus at participating restaurants highlighting seasonal spring ingredients and traditional Valencian dishes.",
                "booking_tips": "Reserve tables well in advance at participating restaurants. Popular venues sell out quickly, especially for weekend dinners."
            },
            {
                "name": "Turia Gardens Blooming Season",
                "type": "Nature",
                "description": "Enjoy the beautiful spring blooms throughout Valencia's 9km park built in the former riverbed of the Turia River.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "March through May brings spectacular flowering trees, roses, and seasonal blooms throughout the gardens, particularly beautiful in the sections near the City of Arts and Sciences.",
                "booking_tips": "No booking required. Bike rentals available throughout the park. Weekday mornings offer the most peaceful experience with fewer crowds."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Valencia Beach Life",
                "type": "Leisure",
                "description": "Enjoy Valencia's beautiful Mediterranean beaches, including La Malvarrosa and El Cabanyal, featuring golden sand, blue-flag water quality, and excellent beachfront dining.",
                "indoor": false,
                "best_time": "Morning/Evening",
                "price_range": "Free",
                "seasonal_notes": "Peak season runs June-September with lifeguards on duty. July-August brings the warmest water temperatures but also the largest crowds. Early morning or evening visits recommended to avoid intense midday heat.",
                "booking_tips": "Beach clubs and loungers require reservation in peak season. The popular beachfront restaurants (especially for paella) require advance booking for lunch."
            },
            {
                "name": "Great Valencia Fair (Feria de Julio)",
                "type": "Cultural/Festival",
                "description": "Experience Valencia's summer festival featuring concerts, bullfighting events, night parades, and cultural activities throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Runs throughout July with events concentrated on weekends. The Battle of Flowers parade on the final Sunday is a highlight with elaborate flower-decorated floats.",
                "booking_tips": "Most activities are free but ticketed events like concerts should be booked in advance. The Alameda promenade hosts many evening events and becomes particularly lively."
            },
            {
                "name": "Open-Air Cinema at La Filmoteca d'Estiu",
                "type": "Entertainment",
                "description": "Watch classic and contemporary films under the stars in the Gardens of the Turia (Jardines del Turia) at Valencia's summer open-air cinema.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "Runs July-September with screenings starting after sunset. Programming includes international films in original language with Spanish subtitles.",
                "booking_tips": "Tickets available at the venue but arriving early recommended for better seating. Bring cushions or blankets for more comfort. Check the schedule online as films vary nightly."
            },
            {
                "name": "L'Horta Summer Produce Tours",
                "type": "Culinary/Agricultural",
                "description": "Visit Valencia's historic market garden area (l'Horta) surrounding the city to see traditional irrigation systems and sample fresh summer produce directly from farmers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer brings abundant tomatoes, peppers, melons, and other Mediterranean produce. The ancient irrigation systems dating to Moorish times are still in use.",
                "booking_tips": "Guided tours must be booked in advance through tourism offices. Early morning tours recommended to avoid midday heat. Some tours include cooking demonstrations or farm-to-table meals."
            },
            {
                "name": "Valencian Summer Music Festivals",
                "type": "Music",
                "description": "Attend various music festivals in and around Valencia featuring international and Spanish artists across multiple genres.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Multiple festivals throughout summer including Festival de Les Arts (June), Diversity Valencia Festival (July), and Low Festival (July) featuring international artists and Spanish talent.",
                "booking_tips": "Purchase tickets well in advance as major acts sell out quickly. Many festivals offer day passes or full weekend options. Check transportation options as some venues are outside the city center."
            },
            {
                "name": "Albufera Sunset Boat Tours",
                "type": "Nature",
                "description": "Experience spectacular sunsets over Valencia's freshwater lagoon and rice fields on traditional wooden boats, learning about the unique ecosystem and cultural heritage.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Low",
                "seasonal_notes": "Summer evenings offer beautiful light conditions and pleasant temperatures after the day's heat. The lake is surrounded by rice fields in full summer growth.",
                "booking_tips": "Book tours in advance, especially for weekends. Tours depart from El Palmar village, accessible by bus from Valencia. Combine with dinner at a traditional rice restaurant in El Palmar."
            },
            {
                "name": "Agua de Valencia Route",
                "type": "Food & Drink",
                "description": "Sample Valencia's signature cocktail (a mix of cava, orange juice, vodka and gin) at historic cafés and bars throughout the city center.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for enjoying this refreshing Valencian cocktail. Many establishments offer special summer variations with seasonal fruits.",
                "booking_tips": "No reservations needed for most bars, but popular venues get crowded after 10pm. Café de las Horas in the historic center is famous for the original recipe."
            },
            {
                "name": "Night Swimming at Oceanogràfic",
                "type": "Entertainment/Educational",
                "description": "Experience Europe's largest aquarium after hours with special nighttime opening hours and themed events during summer months.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Special summer night events typically run Thursday-Saturday in July and August with extended hours until midnight and special programming.",
                "booking_tips": "Purchase tickets online in advance as these special events often sell out. Combined tickets with other City of Arts and Sciences venues offer savings."
            },
            {
                "name": "Marina Beach Club",
                "type": "Leisure/Nightlife",
                "description": "Enjoy Valencia's premier beach club featuring pool, restaurant, cocktail bars, and DJ sessions with Mediterranean views.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Open throughout summer with peak season in July-August. Day beds and VIP areas available, transitioning from relaxed daytime atmosphere to energetic nightlife venue after sunset.",
                "booking_tips": "Reserve sun beds or VIP areas well in advance, especially for weekends. Restaurant reservations recommended at least one week ahead. Dress code enforced in evening hours."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "9 d'Octubre (Valencian Community Day)",
                "type": "Cultural",
                "description": "Experience Valencia's regional holiday commemorating King James I's reconquest of the city in 1238, featuring parades, traditional performances, and cultural events.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Celebrated on October 9th with the main procession carrying the Senyera (Valencian flag) through the historic center, followed by traditional music and dance performances.",
                "booking_tips": "No booking required for public events. Main activities concentrate around Plaza del Ayuntamiento and the Cathedral. Museums offer free entry on this day."
            },
            {
                "name": "Rice Harvest in Albufera",
                "type": "Cultural/Agricultural",
                "description": "Witness or participate in traditional rice harvesting activities in the fields surrounding Valencia's Albufera lagoon, the birthplace of paella.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low to Moderate",
                "seasonal_notes": "September-October marks rice harvest season with traditional and modern harvesting methods on display. The landscape transforms as fields are gradually harvested.",
                "booking_tips": "Agricultural tourism experiences must be booked in advance. Combine with lunch at a traditional restaurant in El Palmar village serving new harvest rice."
            },
            {
                "name": "Valencia Culinary Festival",
                "type": "Food & Drink",
                "description": "Experience special menus, cooking demonstrations, and gastronomic events featuring top chefs and restaurants throughout Valencia.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Typically held in October, highlighting seasonal autumn ingredients and traditional Valencian cuisine with modern interpretations.",
                "booking_tips": "Reserve tables at participating restaurants well in advance. Special collaborative dinners with guest chefs sell out quickly. Check the festival website for the complete program."
            },
            {
                "name": "Valencia Film Festival (Mostra de València)",
                "type": "Cultural",
                "description": "Attend screenings, premieres, and events at Valencia's international film festival focusing on Mediterranean cinema.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Low to Moderate",
                "seasonal_notes": "Held in October, featuring films from countries surrounding the Mediterranean with special focus on Spanish productions. Venues throughout the city host screenings and events.",
                "booking_tips": "Purchase festival passes or individual screening tickets online when the program is announced. Opening and closing galas require early booking."
            },
            {
                "name": "Mushroom Foraging Excursions",
                "type": "Nature/Culinary",
                "description": "Join guided mushroom hunting trips to the forests and mountains surrounding Valencia during peak autumn mushroom season.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "October-November brings ideal conditions for mushroom growth following autumn rains. Nearby mountain areas like Sierra Calderona are popular foraging locations.",
                "booking_tips": "Book guided tours with mycology experts well in advance. Tours typically include transportation from Valencia, equipment, and often a mushroom-focused meal."
            },
            {
                "name": "Valencia Marathon",
                "type": "Sport",
                "description": "Participate in or watch Valencia's internationally acclaimed marathon, known for its fast, flat course and perfect racing conditions.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to watch, Moderate to participate",
                "seasonal_notes": "Held in early December with ideal running temperatures. The course is considered one of the fastest in the world, attracting elite international runners seeking personal bests.",
                "booking_tips": "Register months in advance if participating. The race typically sells out early. Spectators can watch from various points along the route; the finish at the City of Arts and Sciences offers spectacular views."
            },
            {
                "name": "Turia Gardens Autumn Colors",
                "type": "Nature",
                "description": "Experience the beautiful autumn foliage in Valencia's 9km urban park built in the former riverbed of the Turia River.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Late October through November brings colorful autumn foliage to deciduous trees throughout the gardens, creating a beautiful contrast with the city's palm trees and evergreens.",
                "booking_tips": "No booking required. Bike rentals available throughout the park. Morning light offers the best photography conditions."
            },
            {
                "name": "All Saints' Day Traditions",
                "type": "Cultural",
                "description": "Experience traditional All Saints' Day (Todos los Santos) celebrations featuring special pastries, cemetery visits, and cultural events.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Celebrated on November 1st, this traditional holiday features special sweets like buñuelos de calabaza (pumpkin fritters) and huesos de santo (marzipan sweets).",
                "booking_tips": "No booking required for public events. Traditional pastry shops get crowded; visit early in the day for the best selection. The General Cemetery hosts special commemorative events."
            },
            {
                "name": "Autumn Wine Harvest Festivals",
                "type": "Food & Drink",
                "description": "Participate in wine harvest celebrations in the wine regions surrounding Valencia, featuring tastings, winery tours, and traditional harvest activities.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "September-October brings wine harvest festivals to regions like Utiel-Requena and Valencia DO, celebrating the new vintage with traditional festivities.",
                "booking_tips": "Book organized tours from Valencia in advance. Many wineries offer special harvest experiences but require reservations. Public transportation options are limited, so driving or organized tours recommended."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Lights and Nativity Scenes",
                "type": "Cultural",
                "description": "Experience Valencia's beautiful Christmas illuminations and elaborate nativity scenes (belenes) displayed throughout the city center and in churches.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Lights typically illuminated from early December through Three Kings Day (January 6). The main displays center around Plaza del Ayuntamiento, Calle Colón, and Plaza de la Reina.",
                "booking_tips": "No booking required. The city offers guided 'Christmas Lights Routes' during December. The nativity scene in Plaza del Ayuntamiento is particularly elaborate."
            },
            {
                "name": "Three Kings Parade (Cabalgata de Reyes)",
                "type": "Cultural",
                "description": "Witness the grand Three Kings parade on January 5th, the main Christmas season celebration in Valencia featuring elaborate floats and candy distribution.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Held on January 5th, this is the most important Christmas celebration for Spanish children, with the Kings throwing sweets to spectators along the parade route.",
                "booking_tips": "No booking required but arrive early (at least 1-2 hours) for good viewing spots along the main route. Bring bags for collecting candy. The parade starts at Alameda and ends at Plaza del Ayuntamiento."
            },
            {
                "name": "Thermal Baths at Montanejos",
                "type": "Wellness/Nature",
                "description": "Enjoy natural thermal springs and dramatic scenery at Montanejos, a perfect winter day trip from Valencia.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Winter offers a magical experience as the 25°C thermal waters create steam in the cool air. The waters are renowned for therapeutic properties and can be enjoyed year-round.",
                "booking_tips": "Free natural pools require no booking but organized spa treatments should be reserved in advance. Public transportation is limited so driving or joining an organized tour is recommended."
            },
            {
                "name": "Orange Harvesting Season",
                "type": "Agricultural/Culinary",
                "description": "Experience Valencia's famous citrus harvest with tours of orange groves, freshly squeezed juice, and orange-themed culinary experiences.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low to Moderate",
                "seasonal_notes": "Peak season runs December-February when Valencia oranges are at their sweetest. The surrounding countryside is filled with orange groves heavy with bright fruit.",
                "booking_tips": "Agricultural tourism experiences must be booked in advance. Markets offer the freshest fruit and juice. Some tours include orange picking experiences and tastings of orange-based products."
            },
            {
                "name": "Las Hogueras de San Antón",
                "type": "Cultural",
                "description": "Experience traditional bonfires and festivities celebrating Saint Anthony, patron saint of animals, in villages surrounding Valencia.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Celebrated January 16-17 with bonfires, animal blessings, and traditional food in towns around Valencia like Canals, which hosts one of the largest celebrations.",
                "booking_tips": "No booking required but transportation to surrounding villages should be arranged in advance. Combine with sampling traditional winter treats like sweet potatoes and local sausages."
            },
            {
                "name": "Winter Paella at Albufera",
                "type": "Culinary",
                "description": "Experience authentic paella in its birthplace at the Albufera Natural Park, where winter brings a special atmosphere to the traditional rice restaurants.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers a more authentic experience with fewer tourists. Traditional wood-fired paellas are particularly satisfying in cooler weather. The rice used is from the autumn harvest.",
                "booking_tips": "Reserve tables at traditional restaurants in El Palmar village, especially for Sunday lunch which is the traditional paella day for locals. Arrive early to see the paella being prepared over orange wood fires."
            },
            {
                "name": "Carnival Celebrations",
                "type": "Cultural",
                "description": "Experience pre-Lenten carnival festivities with parades, costumes, and celebrations throughout Valencia and surrounding towns.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "February brings colorful carnival celebrations leading up to Lent. While not as famous as other Spanish carnivals, Valencia and nearby towns offer authentic local festivities.",
                "booking_tips": "No booking required for public events. The most elaborate celebrations often take place in smaller communities around Valencia like Vinaròs and Requena."
            },
            {
                "name": "Winter Bird Watching at Albufera",
                "type": "Nature",
                "description": "Observe migratory winter birds at Valencia's remarkable wetland reserve, including flamingos, herons, and numerous waterfowl species.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free to Low",
                "seasonal_notes": "Winter brings numerous migratory bird species that spend the cold months in the Mediterranean wetlands. The rice fields are flooded after harvest, creating ideal habitat for waterbirds.",
                "booking_tips": "Guided tours available but advance booking essential. Bring binoculars and dress warmly. The visitor center provides information on current sightings and best observation points."
            },
            {
                "name": "Winter Oceanogràfic Experience",
                "type": "Entertainment/Educational",
                "description": "Visit Europe's largest aquarium during the quieter winter season, with special winter programming and fewer crowds.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers a more relaxed experience with fewer tourists. Special holiday programming during Christmas season includes themed decorations and events.",
                "booking_tips": "Purchase tickets online for slight discounts. Combined tickets with other City of Arts and Sciences venues offer savings. Winter offers the advantage of shorter queues and more space to enjoy the exhibits."
            }
        ]
    }
}