{
    "Spring": {
        "activities": [
            {
                "name": "Walking the City Walls",
                "type": "Historical Walk",
                "description": "Explore the complete 1.94 km circuit of Dubrovnik's medieval walls, offering spectacular views of the Old Town and Adriatic Sea.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring provides pleasant temperatures and fewer crowds, making it ideal for this iconic activity.",
                "booking_tips": "Purchase tickets online to avoid queues and start early to avoid the midday heat."
            },
            {
                "name": "Cable Car to Mount Srđ",
                "type": "Sightseeing",
                "description": "Take the cable car to the top of Mount Srđ for panoramic views of Dubrovnik, the Adriatic Sea, and surrounding islands.",
                "indoor": false,
                "best_time": "Late afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers clear visibility and comfortable temperatures for enjoying the spectacular views.",
                "booking_tips": "Visit during sunset for the most dramatic views and photography opportunities."
            },
            {
                "name": "Visit to Lokrum Island",
                "type": "Nature Reserve",
                "description": "Explore the beautiful Lokrum Island, a nature reserve with botanical gardens, peacocks, and swimming spots.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring is perfect for island visits with mild weather and blooming gardens.",
                "booking_tips": "Take the first boat of the day to avoid crowds and bring swimwear for the Dead Sea lake."
            },
            {
                "name": "Game of Thrones Walking Tour",
                "type": "Cultural Tour",
                "description": "Discover filming locations from the popular TV series throughout the Old Town, including the Red Keep and King's Landing scenes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring weather is ideal for walking tours with comfortable temperatures and good lighting for photos.",
                "booking_tips": "Book in advance, especially for popular guides, and bring comfortable walking shoes."
            },
            {
                "name": "Beach Day at Lapad",
                "type": "Beach",
                "description": "Enjoy the beautiful pebble beaches of Lapad with crystal-clear waters, perfect for swimming and sunbathing.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring offers warm enough temperatures for swimming while avoiding the summer crowds.",
                "booking_tips": "Bring beach towels and arrive early to secure a good spot, especially on weekends."
            },
            {
                "name": "Dubrovnik Summer Festival Preview",
                "type": "Cultural Event",
                "description": "Experience early performances and preparations for the famous Dubrovnik Summer Festival, which begins in July.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Spring sees the beginning of cultural season preparations and early performances.",
                "booking_tips": "Check the festival schedule for early events and book tickets in advance."
            },
            {
                "name": "Wine Tasting Experience",
                "type": "Food & Drink",
                "description": "Sample local Croatian wines, particularly Plavac Mali and Pošip, at wine bars throughout the Old Town.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is ideal for wine tasting as the weather is pleasant for both indoor and outdoor venues.",
                "booking_tips": "Visit D'vino Wine Bar for an extensive selection of Croatian wines and knowledgeable staff."
            },
            {
                "name": "Photography Tour",
                "type": "Cultural Tour",
                "description": "Capture the beauty of Dubrovnik's architecture, sea views, and historic sites with professional photography guidance.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Expensive",
                "seasonal_notes": "Spring light is perfect for photography with golden hour providing ideal conditions.",
                "booking_tips": "Book a professional photographer for the best results and access to exclusive locations."
            },
            {
                "name": "Market Shopping in Gruž",
                "type": "Market",
                "description": "Explore the daily market in Gruž for fresh local produce, seafood, and authentic Croatian products.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets are bustling with fresh seasonal produce and local specialties.",
                "booking_tips": "Visit early for the best selection and bring cash for local vendors."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Dubrovnik Summer Festival",
                "type": "Cultural Festival",
                "description": "Experience the world-famous Dubrovnik Summer Festival featuring classical music, theater, and dance performances in historic venues.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "The festival runs from mid-July to late August, showcasing culture in stunning historic settings.",
                "booking_tips": "Book tickets well in advance as performances sell out quickly, especially for popular shows."
            },
            {
                "name": "Beach Hopping",
                "type": "Beach",
                "description": "Visit multiple beaches including Banje Beach, Copacabana, and hidden coves for swimming and water sports.",
                "indoor": false,
                "best_time": "Morning to afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer offers perfect conditions for beach activities with warm water and long daylight hours.",
                "booking_tips": "Start early to avoid crowds and bring water shoes for pebble beaches."
            },
            {
                "name": "Boat Tour to Elaphiti Islands",
                "type": "Boat Tour",
                "description": "Take a boat tour to the beautiful Elaphiti Islands (Koločep, Lopud, Šipan) for swimming, hiking, and island exploration.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions for island hopping with calm seas and warm weather.",
                "booking_tips": "Book tours in advance and bring snorkeling gear for underwater exploration."
            },
            {
                "name": "Water Sports at Copacabana Beach",
                "type": "Outdoor Activity",
                "description": "Enjoy water sports including jet skiing, paddleboarding, and parasailing at the popular Copacabana Beach.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers perfect conditions for water sports with warm water and calm seas.",
                "booking_tips": "Book activities in advance, especially for popular sports like jet skiing."
            },
            {
                "name": "Sunset Dinner at Restaurant 360°",
                "type": "Dining",
                "description": "Enjoy fine dining with panoramic views at Restaurant 360°, located on the city walls with spectacular sunset views.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings are perfect for rooftop dining with warm temperatures and stunning sunsets.",
                "booking_tips": "Reserve a table well in advance, especially for sunset dining, and request a window seat."
            },
            {
                "name": "Café Buža Cliff Jumping",
                "type": "Adventure",
                "description": "Visit the famous cliff bar Café Buža for drinks and the opportunity to jump into the crystal-clear Adriatic Sea.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Summer provides warm water temperatures perfect for swimming and cliff jumping.",
                "booking_tips": "Arrive early to secure a spot and be cautious when jumping - check water depth first."
            },
            {
                "name": "Open-Air Cinema at Fort Lovrijenac",
                "type": "Cinema",
                "description": "Watch classic films under the stars at the historic Fort Lovrijenac with the Old Town as a backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor cinema with warm temperatures and late sunsets.",
                "booking_tips": "Bring a blanket or cushion and arrive early to secure a good viewing spot."
            },
            {
                "name": "Seafood Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Croatian seafood dishes using fresh local ingredients and traditional methods.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the freshest seafood and ideal conditions for culinary learning.",
                "booking_tips": "Book classes in advance, especially for popular instructors, and check if market visits are included."
            },
            {
                "name": "Night Swimming at Banje Beach",
                "type": "Beach",
                "description": "Experience the magic of swimming under the stars at Banje Beach with the illuminated Old Town as a backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer nights offer warm water temperatures perfect for night swimming.",
                "booking_tips": "Bring a towel and be aware of beach access hours and safety considerations."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Historical Walking Tour",
                "type": "Cultural Tour",
                "description": "Explore Dubrovnik's rich history with guided tours of the Old Town, focusing on the Republic of Ragusa era.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn provides comfortable temperatures for walking tours with fewer crowds than summer.",
                "booking_tips": "Book tours in advance and choose knowledgeable guides for deeper historical insights."
            },
            {
                "name": "Wine Tasting at D'vino Wine Bar",
                "type": "Food & Drink",
                "description": "Sample Croatian wines including Plavac Mali, Graševina, and Teran at the renowned D'vino Wine Bar.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, making it ideal for wine tasting with fresh vintages available.",
                "booking_tips": "Reserve a table in advance and ask for wine pairing recommendations with local cheeses."
            },
            {
                "name": "Visit to Rector's Palace",
                "type": "Museum",
                "description": "Explore the historic Rector's Palace, once the seat of the Republic of Ragusa, with its impressive architecture and exhibits.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler days are perfect for indoor museum visits with fewer tourists.",
                "booking_tips": "Purchase tickets online to avoid queues and consider a guided tour for historical context."
            },
            {
                "name": "Photography Workshop",
                "type": "Workshop",
                "description": "Join a photography workshop to capture Dubrovnik's autumn beauty with professional guidance and tips.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn light is perfect for photography with golden hour providing ideal conditions.",
                "booking_tips": "Book workshops in advance and bring your own camera equipment."
            },
            {
                "name": "Cable Car Views of Autumn Colors",
                "type": "Sightseeing",
                "description": "Take the cable car to Mount Srđ to enjoy panoramic views of Dubrovnik and the surrounding autumn landscape.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn offers beautiful fall colors and comfortable temperatures for enjoying the views.",
                "booking_tips": "Visit during golden hour for the most dramatic lighting and photography opportunities."
            },
            {
                "name": "Local Market Shopping",
                "type": "Market",
                "description": "Explore local markets for autumn produce, including fresh figs, grapes, and seasonal Croatian specialties.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn markets are filled with seasonal produce and local harvest specialties.",
                "booking_tips": "Visit early for the best selection and bring cash for local vendors."
            },
            {
                "name": "Traditional Croatian Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Croatian dishes using seasonal ingredients and authentic recipes.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides abundant ingredients for learning traditional Croatian cuisine.",
                "booking_tips": "Book classes in advance and check if market visits are included in the experience."
            },
            {
                "name": "Beach Walks in Mild Weather",
                "type": "Outdoor Activity",
                "description": "Enjoy peaceful walks along Dubrovnik's beaches with comfortable autumn temperatures and fewer crowds.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn provides ideal conditions for beach walks with mild weather and beautiful light.",
                "booking_tips": "Bring comfortable walking shoes and a camera for beautiful autumn beach photography."
            },
            {
                "name": "Visit to Dubrovnik Cathedral",
                "type": "Historical Site",
                "description": "Explore the beautiful Dubrovnik Cathedral with its impressive architecture and religious art collections.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers a peaceful atmosphere for visiting religious sites with fewer tourists.",
                "booking_tips": "Check opening hours and dress appropriately for religious sites."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Peaceful Old Town Exploration",
                "type": "Walking Tour",
                "description": "Explore the Old Town during winter when crowds are minimal, allowing for intimate discovery of historic sites.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter offers the most peaceful experience of the Old Town with minimal tourist crowds.",
                "booking_tips": "Dress warmly and wear comfortable walking shoes for exploring the limestone streets."
            },
            {
                "name": "Café Culture in Old Town",
                "type": "Café",
                "description": "Experience authentic Croatian café culture in historic cafés throughout the Old Town, enjoying local coffee and pastries.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is perfect for indoor café culture, providing warmth and authentic local experience.",
                "booking_tips": "Visit Café Festival for traditional Croatian coffee and beautiful terrace views."
            },
            {
                "name": "Cable Car Winter Views",
                "type": "Sightseeing",
                "description": "Take the cable car to Mount Srđ for spectacular winter views of Dubrovnik and the Adriatic Sea.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides clear visibility and dramatic lighting for photography from the mountain.",
                "booking_tips": "Check weather conditions before visiting and dress warmly for the mountain top."
            },
            {
                "name": "Local Market Shopping",
                "type": "Market",
                "description": "Explore local markets for winter produce, fresh seafood, and traditional Croatian products with fewer crowds.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Winter markets offer authentic local experience with seasonal products and local vendors.",
                "booking_tips": "Visit early for the best selection and bring cash for local vendors."
            },
            {
                "name": "Traditional Croatian Dining",
                "type": "Dining",
                "description": "Enjoy traditional Croatian cuisine at local restaurants, featuring hearty winter dishes and local specialties.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is ideal for enjoying hearty Croatian dishes and local comfort food.",
                "booking_tips": "Try traditional dishes like peka (slow-cooked meat) and black risotto at local konobas."
            },
            {
                "name": "Photography in Winter Light",
                "type": "Photography",
                "description": "Capture Dubrovnik's beauty in winter light with dramatic skies and minimal crowds for unique photography opportunities.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and atmospheric conditions perfect for photography.",
                "booking_tips": "Bring warm clothing and arrive early for the best light conditions."
            },
            {
                "name": "Indoor Cultural Activities",
                "type": "Cultural Event",
                "description": "Participate in indoor cultural activities including museum visits, art exhibitions, and historical presentations.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for indoor cultural activities, providing warmth and educational experiences.",
                "booking_tips": "Check museum schedules and book tickets online to avoid queues."
            },
            {
                "name": "Historical Museum Visits",
                "type": "Museum",
                "description": "Explore Dubrovnik's museums including the Maritime Museum and Ethnographic Museum with minimal crowds.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers peaceful museum visits with fewer tourists and comfortable indoor temperatures.",
                "booking_tips": "Purchase museum passes for multiple visits and check opening hours in advance."
            },
            {
                "name": "Seafood Dining at Local Konobas",
                "type": "Dining",
                "description": "Enjoy fresh seafood at traditional konobas (taverns) featuring local Adriatic specialties and warm hospitality.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides the freshest seafood and authentic local dining experiences.",
                "booking_tips": "Try local specialties like grilled fish and seafood risotto at family-run konobas."
            }
        ]
    }
}