{
    "December": {
        "reasons_to_visit": [
            {
                "reason": "Historic Christmas Markets",
                "details": "Düsseldorf hosts several distinctive Christmas markets throughout the city. The main market in the Altstadt features hundreds of wooden stalls offering handcrafted ornaments, traditional toys, seasonal foods, and mulled wine (Glühwein) served in collectible mugs unique to each market. Additional markets include the romantic market in front of the City Hall, the modern market at the Kö-Bogen, and the international market offering alternative crafts and global cuisine."
            },
            {
                "reason": "Modern City Illuminations",
                "details": "Düsseldorf's modern skyline creates an enchanting winter backdrop when illuminated against the night sky. The Rhine Tower, Kö-Bogen, and various contemporary buildings are dramatically lit throughout December, creating a magical silhouette visible throughout the city and reflecting beautifully on the Rhine River during evening strolls along the Rhine Promenade."
            },
            {
                "reason": "World-Class Museum Collections",
                "details": "Düsseldorf's renowned museums feature special winter exhibitions, often with extended evening hours during December. The Kunstpalast, K21, and the NRW-Forum present curated seasonal collections in venues that offer both cultural enrichment and welcome warmth from winter temperatures. The museum quarter in the historic center becomes particularly atmospheric with holiday lighting and decorations."
            },
            {
                "reason": "Authentic German Holiday Cuisine",
                "details": "December is ideal for sampling authentic German winter specialties in Düsseldorf's traditional restaurants and cafés in the Altstadt (Old Town). Seasonal treats include traditional Christmas cookies, gingerbread, and warming German specialties, accompanied by local Altbier, Rhine wines, or festive mulled wine variations with regional spice blends and fruit additions."
            },
            {
                "reason": "Day Trips to Rhine Valley",
                "details": "Düsseldorf provides an excellent base for exploring some of Germany's most enchanting winter landscapes and historic towns. Nearby destinations like Cologne with its magnificent cathedral, the romantic castles along the Rhine, and the medieval Christmas market at Aachen offer unique winter experiences just a short train or bus journey from Düsseldorf."
            },
            {
                "reason": "World-Famous Christmas Music",
                "details": "December transforms Düsseldorf into a center of festive classical music, with the Tonhalle hosting seasonal concerts, the Deutsche Oper am Rhein presenting festive opera and ballet performances, and various churches offering traditional Christmas concerts. The city's rich musical tradition is particularly celebrated during Advent with concerts featuring both classical and contemporary holiday music."
            },
            {
                "reason": "New Year's Eve Celebrations",
                "details": "Experience a traditional German Silvester (New Year's Eve) with Düsseldorf's spectacular midnight fireworks display centered around the Rhine River and modern skyline. Restaurants and hotels offer special gala dinners, Rhine river cruises feature celebration packages, and public gathering spaces along riverbanks and the Rhine Promenade fill with revelers enjoying mulled wine and watching the illuminated cityscape and fireworks reflected on the water."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cold and Damp Weather",
                "details": "December in Düsseldorf brings consistently cold temperatures, frequently hovering between 0-4°C, with occasional drops below freezing. The high humidity from the Rhine River can make the cold feel more penetrating, and gray, overcast skies are common throughout the month with limited sunshine hours, often creating foggy conditions around the river valley."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "December offers minimal daylight with sunrise around 8:00am and sunset by 4:00pm, reducing effective sightseeing hours for outdoor attractions. The decreased sunlight can affect photography conditions of Düsseldorf's famous skyline, and some outdoor attractions operate with reduced winter hours or limited accessibility, particularly in parks and gardens."
            },
            {
                "reason": "Christmas Market Crowds",
                "details": "While festive and enchanting, Düsseldorf's Christmas markets draw substantial crowds, particularly on weekends and evenings between 5-8pm. The historic Altstadt market can become extremely congested, making movement difficult and creating long lines at food and beverage stalls during peak hours, especially on weekends and during special events."
            },
            {
                "reason": "Holiday Business Closures",
                "details": "Many restaurants, smaller shops, and family-owned businesses close for extended periods during the Christmas holidays (December 24-26) and between Christmas and New Year's Day. Cultural institutions often observe reduced hours or complete closures on public holidays, limiting indoor activity options during what might be the coldest days of your visit."
            },
            {
                "reason": "New Year's Eve Accommodation Premium",
                "details": "Hotels and vacation rentals in central Düsseldorf command significant price premiums for the New Year's period, often requiring minimum stays and advance bookings. Restaurants and entertainment venues frequently offer only fixed-price special event menus on December 31st at considerably higher rates than normal, and public transportation operates on limited schedules."
            }
        ],
        "first_half": {
            "date_range": "December 1–15",
            "weather": {
                "average_temperature": {
                    "high": "4°C",
                    "low": "-1°C"
                },
                "precipitation": "Moderate rainfall with occasional light snow, with some accumulation possible especially in the hillier districts surrounding the city center. December averages 50mm of precipitation, typically occurring as light rain, drizzle, or occasional snow flurries. Overcast conditions predominate with limited sunshine.",
                "general_tips": "Pack warm, waterproof outerwear, including hat, gloves, and scarf. Layering is essential as indoor spaces are well-heated while outdoor temperatures require winter clothing. Waterproof boots with good traction recommended as market areas and cobblestone streets can become slippery when wet or with light snow. Thermal underwear advisable for extended outdoor periods."
            },
            "tourism_level": {
                "crowds": "Moderate to high around Christmas markets, particularly on weekends and evenings. Museums and indoor attractions busier than usual, especially during inclement weather.",
                "pricing": "Mid-range for accommodations with good availability except during specific German holidays. Christmas market period commands higher rates than early November or January, but remains below summer peak pricing.",
                "overall_atmosphere": "Festively German with Christmas preparations in full swing. Markets create bustling, cheerful environments in the historic center while residential districts maintain their elegant character with holiday decorations illuminating modern and historic facades."
            },
            "events_holidays": [
                {
                    "name": "St. Nicholas Day (Nikolaustag)",
                    "date": "December 6",
                    "description": "Traditional German holiday when children receive small gifts and sweets in shoes left out the previous night. Public celebrations in schools, markets, and sometimes appearances of St. Nicholas figures at the Christmas markets and community events throughout Düsseldorf.",
                    "notes": "Not a public holiday but culturally significant; special pastries and chocolates shaped like St. Nicholas sold in bakeries and market stalls; some restaurants offer special menus; evening celebrations common on December 5th (St. Nicholas Eve); look for special children's programs at the Altstadt market on this day."
                },
                {
                    "name": "Christmas Market Opening Ceremony",
                    "date": "Early December (varies by year)",
                    "description": "Celebration marking the official opening of Düsseldorf's Christmas markets, featuring ceremonial lighting of the city's holiday decorations, traditional music performances, and the first official serving of mulled wine at the main market.",
                    "notes": "Major local tradition; ceremony typically begins at City Hall and continues to main market square; opportunity to experience traditional German Christmas customs; special market stands throughout city during December; arrive early for good viewing positions."
                },
                {
                    "name": "Advent Concerts at Tonhalle",
                    "date": "Throughout early December",
                    "description": "Special seasonal concerts held in Düsseldorf's iconic concert hall, featuring sacred music, orchestral performances, and choral concerts in one of Europe's most beautiful modern concert venues with exceptional acoustics.",
                    "notes": "Tickets sell out weeks in advance; different programs throughout December; performances typically early evening; dress warmly as concert hall can be cool despite heating; magnificent setting with candlelight during some evening performances; accessible via tram to central locations."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Altstadt Christmas Market",
                    "where": "Historic Old Town",
                    "description": "Experience Düsseldorf's main Christmas market with its distinctive atmosphere, traditional crafts, and festive foods including traditional German specialties, all beneath thousands of twinkling lights in the heart of the historic city.",
                    "practical_tips": "Most atmospheric after 4pm when fully illuminated; weekday mornings least crowded; try traditional mulled wine (served with or without alcohol) in commemorative mugs; food specialties include bratwurst, gingerbread, and traditional cookies; comfortable, warm footwear essential as market visits involve standing on cold ground for extended periods; accessible via multiple tram lines.",
                    "best_time": "Weekday afternoons or early evenings (4-6pm)",
                    "estimated_cost": "Free entry; €15-30 for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "Kunstpalast Museum",
                    "where": "Near Hofgarten",
                    "description": "Explore one of Germany's most comprehensive art collections housing works from the Middle Ages to contemporary art, featuring special winter exhibitions in venues that offer both cultural enrichment and welcome warmth from winter temperatures.",
                    "practical_tips": "Closed Mondays; allow 2-3 hours; audio guides available; photography without flash permitted in most sections; café on premises; accessible via tram; can be combined with nearby Christmas market visit.",
                    "best_time": "Morning for fewer crowds",
                    "estimated_cost": "€12 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Deutsche Oper am Rhein Evening Tour",
                    "where": "Opernhaus, central Düsseldorf",
                    "description": "Take an evening tour of Düsseldorf's magnificent opera house when illuminated for the holidays, featuring modern architecture, sumptuous interiors with festive decorations, and the opportunity to see one of Germany's most beautiful theaters without attending a performance.",
                    "practical_tips": "Advance booking recommended; tours in multiple languages; approximately 60 minutes duration; different atmosphere than daytime tours with building illuminated; combines well with evening Christmas market visit; dressy casual attire appropriate; does not include performance attendance; accessible via tram to central locations.",
                    "best_time": "Early evening",
                    "estimated_cost": "€12 for guided tour",
                    "weather_dependent": false
                },
                {
                    "activity": "Rhine Promenade Winter Stroll",
                    "where": "Rhine riverfront",
                    "description": "Experience Düsseldorf's modern riverside promenade in winter, with panoramic views of the Rhine River and contemporary skyline, particularly magical when Christmas illuminations reflect on the water and light snow dusts the modern landmarks.",
                    "practical_tips": "Free public promenade accessible via multiple points; dress very warmly as riverside location experiences wind chill; most spectacular at blue hour (4:30-5pm) when daylight fades and city lights emerge; photographers should bring tripod for night shots; can be combined with nearby Christmas market; hot drink vendors often positioned along the promenade in December.",
                    "best_time": "Late afternoon transitioning to evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "German Gastronomy Experience",
                    "where": "Altstadt (Old Town)",
                    "description": "Warm up in a traditional Düsseldorf restaurant featuring historic interiors, rustic decor, and hearty regional cuisine perfect for cold winter days, including traditional German specialties, local Altbier, and mulled wine.",
                    "practical_tips": "Traditional breweries and restaurants among most authentic options; reservations recommended for dinner hours; regional food tends to be hearty and perfect for cold weather; historic wine cellar restaurants provide atmospheric winter dining; many offer special Advent and December menus featuring game dishes and seasonal specials; accessible locations throughout historic center.",
                    "best_time": "Early evening (6-8pm)",
                    "estimated_cost": "€25-40 for meal with drinks",
                    "weather_dependent": false
                },
                {
                    "activity": "K21 Museum",
                    "where": "Ständehaus Park",
                    "description": "Escape winter weather in one of Germany's most striking modern art museums, featuring works from the 21st century, including the famous 'In Orbit' installation by Tomás Saraceno, in a beautifully renovated historic building.",
                    "practical_tips": "Closed Mondays; largest collection requires 2-3 hours to appreciate fully; heated interior makes this ideal for cold or wet days; audio guides available in multiple languages; café on premises for warm refreshments; accessible via tram to central locations.",
                    "best_time": "Midday",
                    "estimated_cost": "€10 regular admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Tonhalle Concert",
                    "where": "Near Hofgarten",
                    "description": "Experience classical music in one of Germany's most beautiful concert halls, with special Advent and Christmas concerts featuring seasonal music in a historic setting with exceptional acoustics.",
                    "practical_tips": "Advance tickets essential for Christmas season; arrive 30 minutes early for good seating; dress warmly as concert hall heating is modest; concerts typically 60-90 minutes without intermission; magnificent acoustics; accessible via tram to central locations.",
                    "best_time": "Evening performances (typically 7pm or 8pm)",
                    "estimated_cost": "€20-45 depending on seating",
                    "weather_dependent": false
                },
                {
                    "activity": "St. Lambertus Church Visit",
                    "where": "Altstadt",
                    "description": "Explore Düsseldorf's historic church, featuring distinctive twisted spire, Baroque architecture, and special Advent decorations, with the opportunity to attend seasonal concerts or simply appreciate the peaceful interior.",
                    "practical_tips": "Free entry to main church; quietest in early mornings; special Advent and Christmas services throughout December (check schedule); dress warmly as the historic building retains cold; illuminated dramatically after dark; guided tours available in multiple languages; directly accessible from Altstadt tram stops.",
                    "best_time": "Morning for fewer crowds, evening for illumination",
                    "estimated_cost": "Free for church entry",
                    "weather_dependent": false
                },
                {
                    "activity": "International Christmas Market",
                    "where": "Kö-Bogen",
                    "description": "Step into a world of international holiday traditions at Düsseldorf's modern Christmas market featuring crafts and cuisine from around the world, set against the backdrop of contemporary architecture and festive lighting.",
                    "practical_tips": "More diverse offerings than main Altstadt market; distinctive international food options; unique crafts from various countries; performers throughout market including international music; covered areas provide some weather protection; modern lighting creating unique atmosphere; accessible via tram to central locations.",
                    "best_time": "Afternoon into evening",
                    "estimated_cost": "Free entry; €15-30 for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "NRW-Forum",
                    "where": "Near Ehrenhof",
                    "description": "Discover contemporary art and culture in this modern museum featuring interactive exhibits, digital art, and special winter exhibitions perfect for engaging visitors during cold weather days.",
                    "practical_tips": "Closed Mondays; allow 1.5-2 hours; particularly good for families with different age groups; completely indoor activity ideal during inclement weather; special children's areas and interactive elements; quieter than major art museums; accessible via tram to central locations; can be combined with nearby Christmas market visit.",
                    "best_time": "Midday",
                    "estimated_cost": "€9 adult admission, family tickets available",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "December 16–31",
            "weather": {
                "average_temperature": {
                    "high": "3°C",
                    "low": "-2°C"
                },
                "precipitation": "Continued possibility of light snow, with increasing chance of freezing temperatures overnight. Rhine River fog common in early mornings, sometimes persisting throughout day. Occasional clear, crisp days offer beautiful winter lighting for photography of Düsseldorf's famous skyline.",
                "general_tips": "Winter wardrobe essential, particularly for evening activities. Thermal layers recommended for extended outdoor periods. Public transportation preferable to walking longer distances in potential snow or ice conditions. Many restaurants and attractions well-heated, so clothing layers that can be adjusted are ideal. Hand and foot warmers useful for Christmas market visits."
            },
            "tourism_level": {
                "crowds": "Variable, with pre-Christmas period (until December 23) remaining busy at markets and shopping districts. Brief lull on December 24-25, followed by increased domestic tourism between Christmas and New Year's.",
                "pricing": "Premium rates for accommodations during New Year's period, with many venues requiring minimum stays. Christmas week generally commands mid-range prices with good availability except at premium properties with Rhine views.",
                "overall_atmosphere": "Distinctly festive through Christmas, transitioning to New Year's celebrations. More German and European visitors than international tourists create authentic local holiday experience in one of Germany's most modern cities."
            },
            "events_holidays": [
                {
                    "name": "Christmas Eve (Heiligabend)",
                    "date": "December 24",
                    "description": "Traditional family celebration beginning with final Christmas market hours (typically ending mid-afternoon), followed by evening church services at St. Lambertus and neighborhood churches, with family gatherings in the evening.",
                    "notes": "Public holiday from afternoon onward; most restaurants and attractions close by 2-3pm; limited public transportation in evening; hotel restaurants remain open but typically offer set menus requiring advance reservations; Christmas markets have final day with shorter hours (typically closing by 2pm)."
                },
                {
                    "name": "Christmas Day (Weihnachten)",
                    "date": "December 25-26",
                    "description": "Two-day public holiday featuring family gatherings, special meals, and relaxed atmosphere throughout the city, with December 26 (Boxing Day) being the traditional day for visiting extended family and friends.",
                    "notes": "Major public holiday with most businesses closed both days; limited public transportation on holiday schedule; hotel restaurants and some international establishments open but reservations essential; museums typically closed December 25, some reopen December 26; Rhine promenade popular for afternoon strolls in case of good weather."
                },
                {
                    "name": "New Year's Eve (Silvester)",
                    "date": "December 31",
                    "description": "Celebration centered around midnight fireworks displays throughout the city, particularly spectacular along the Rhine River with the modern skyline as backdrop, featuring public gatherings, illuminated river cruises, and private parties.",
                    "notes": "Major celebration attracting domestic and international visitors; riverfront areas most crowded for fireworks viewing; public transportation runs extended hours; many restaurants offer only special fixed-price menus requiring advance booking; hotel parties typically require guest status or purchased tickets; Rhine Promenade and Oberkassel Bridge prime viewing areas but become extremely crowded after 10pm."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Christmas Eve Service at St. Lambertus",
                    "where": "Altstadt",
                    "description": "Experience a traditional German Christmas Eve service in the historic church with its distinctive twisted spire, featuring seasonal music, choral performances, and the atmospheric setting of Düsseldorf's most famous landmark illuminated for the holy night.",
                    "practical_tips": "Multiple services throughout day and evening; arrive 60-90 minutes early for popular evening services; non-religious visitors welcome to observe respectfully; dress warmly as heating limited in historic building; programs typically in German but atmosphere transcends language; exceptionally beautiful with candlelight and Christmas decorations; accessible on foot from most central hotels.",
                    "best_time": "Evening (services typically at 4pm, 7pm, and midnight)",
                    "estimated_cost": "Free (donations appreciated)",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Cologne",
                    "where": "Cologne (40km south of Düsseldorf)",
                    "description": "Visit the historic cathedral city featuring the magnificent Cologne Cathedral, Roman-Germanic Museum, and charming old town with winter decorations, and the opportunity to experience one of Germany's largest Christmas markets.",
                    "practical_tips": "Direct trains from Düsseldorf Hauptbahnhof every 15 minutes (journey approximately 30 minutes); cathedral offers fascinating tours showing historic architecture; historic center features large Christmas market (closed December 24-25); comfortable shoes recommended for city exploration; several traditional restaurants with German cuisine; frequent return trains to Düsseldorf; check reduced holiday schedules.",
                    "best_time": "Full day, departing Düsseldorf by 10am",
                    "estimated_cost": "€40-50 including transportation and admissions",
                    "weather_dependent": true
                },
                {
                    "activity": "Kunsthalle Düsseldorf",
                    "where": "Near Grabbeplatz",
                    "description": "Discover contemporary art exhibitions in this historic building featuring works by emerging and established artists, with a focus on innovative and experimental art forms—a fascinating indoor activity combining modern art with historic architecture.",
                    "practical_tips": "Less visited than the major museums making for quieter experience; closed Mondays; allow 1-2 hours; interactive elements engaging for various ages; completely indoor activity perfect for inclement weather; combines well with nearby Christmas market; audio guides enhance understanding of contemporary works; accessible via tram to central locations.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€12 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Rhine Tower",
                    "where": "Near Rhine Promenade",
                    "description": "Experience Düsseldorf's iconic telecommunications tower featuring an observation deck and revolving restaurant offering spectacular 360-degree views over the city rooftops and Rhine Valley, particularly beautiful during winter evenings with city lights.",
                    "practical_tips": "Indoor activity ideal for winter days; accessible via short walk from central locations; incredible detail rewards extended viewing; elevated platform provides different perspectives; timed light changes simulate day and night; advance tickets recommended; restaurant on premises.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€10 for observation deck",
                    "weather_dependent": false
                },
                {
                    "activity": "Christmas Dinner in Historic Restaurant",
                    "where": "Altstadt (Old Town)",
                    "description": "Enjoy a traditional German Christmas dinner in one of Düsseldorf's historic restaurants, featuring festive decorations, seasonal specialties, and the atmospheric setting of centuries-old dining rooms with stone walls and wooden beams.",
                    "practical_tips": "Advance reservations essential for Christmas period; traditional breweries and historic restaurants among most atmospheric options; special holiday menus typically feature goose, venison, or carp (traditional Christmas dishes); request English menus when booking if needed; hotel concierge can assist with recommendations and reservations; accessible locations throughout historic center.",
                    "best_time": "Evening",
                    "estimated_cost": "€40-60 per person for festive meal with drinks",
                    "weather_dependent": false
                },
                {
                    "activity": "Kunst im Tunnel",
                    "where": "Near Rhine Promenade",
                    "description": "Visit this unique underground gallery space featuring contemporary art exhibitions and experimental installations in a beautifully renovated tunnel—a moving indoor experience during the reflective year-end period.",
                    "practical_tips": "Closed Mondays and during Christmas holidays; allow 1-2 hours; audio guides in multiple languages; remarkable architecture in converted tunnel; completely indoor activity ideal during inclement weather; café on premises; accessible via tram from central Düsseldorf.",
                    "best_time": "Midday",
                    "estimated_cost": "€10 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Festive Afternoon Tea at Breidenbacher Hof",
                    "where": "Breidenbacher Hof Hotel, central Düsseldorf",
                    "description": "Indulge in a refined afternoon tea with holiday-themed pastries, sandwiches, and festive decorations at one of Düsseldorf's most elegant hotels, offering warm respite from winter weather in sophisticated surroundings.",
                    "practical_tips": "Advance reservations essential; smart casual dress appropriate; special holiday-themed tea service throughout December; vegetarian options available with advance notice; service typically between 3-5pm; located in central Düsseldorf near Königsallee; accessible via tram to central locations.",
                    "best_time": "Afternoon (3-5pm)",
                    "estimated_cost": "€35-45 per person",
                    "weather_dependent": false
                },
                {
                    "activity": "NRW-Forum",
                    "where": "Near Ehrenhof",
                    "description": "Explore this unique cultural center focused on contemporary art, photography, and digital culture, featuring interactive exhibits and thoughtful presentations in a thoroughly heated modern facility—perfect for families during winter days.",
                    "practical_tips": "Closed Mondays; allow 2-3 hours; excellent for families with children; completely indoor activity ideal during inclement weather; engages multiple age groups with interactive elements; less crowded than art museums; café on premises; accessible via tram from central Düsseldorf.",
                    "best_time": "Midday",
                    "estimated_cost": "€9 adult admission, family tickets available",
                    "weather_dependent": false
                },
                {
                    "activity": "New Year's Eve Gala at Breidenbacher Hof",
                    "where": "Breidenbacher Hof Hotel, central Düsseldorf",
                    "description": "Celebrate New Year's Eve in grand style at one of Düsseldorf's most prestigious hotels, featuring an elegant multi-course dinner, live music and dancing, and a champagne toast at midnight with views of the fireworks over the modern skyline.",
                    "practical_tips": "Advance booking essential (often months ahead); formal attire required; typically includes multi-course gourmet dinner, wine pairings, entertainment program, and midnight champagne; prices escalate with premium wine packages and after-party options; central location provides easy access to midnight fireworks viewing; accommodations at hotel can be combined for convenient celebration package.",
                    "best_time": "Evening of December 31 (typically beginning 7-8pm)",
                    "estimated_cost": "€200-300 per person",
                    "weather_dependent": false
                },
                {
                    "activity": "New Year's Day Concert",
                    "where": "Tonhalle",
                    "description": "Begin the new year with a classical music tradition, attending a New Year's concert featuring light classical favorites, waltzes, and celebratory compositions performed by the renowned Düsseldorfer Symphoniker.",
                    "practical_tips": "Advance tickets essential; performances typically in afternoon to accommodate late New Year's Eve celebrations; elegant but not formal attire appropriate; popular tradition that sells out weeks in advance; program typically features accessible classical works with festive character; central locations accessible on foot from many hotels or via public transportation.",
                    "best_time": "Afternoon of January 1 (typically 3-6pm)",
                    "estimated_cost": "€40-90 depending on venue and seating category",
                    "weather_dependent": false
                }
            ]
        }
    }
}