{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Rhine Spring Climate",
                "details": "May offers ideal weather conditions in Düsseldorf with warm, sunny days averaging 16-20°C, minimal rainfall, and pleasant evenings perfect for exploring the Altstadt, strolling along the Rhine promenade, and enjoying the city's sophisticated outdoor café culture without summer's crowds or winter's chill."
            },
            {
                "reason": "Palace Gardens in Full Bloom",
                "details": "The Benrath Palace gardens and Hofgarten reach peak beauty in May, with historic rose collections, tulips, and rhododendrons creating magnificent displays of color and fragrance. Düsseldorf's extensive parks like Nordpark and Südpark similarly burst with spring blooms, offering vibrant green spaces within the urban landscape."
            },
            {
                "reason": "Rhine River Culture",
                "details": "May brings ideal conditions for enjoying Düsseldorf's beautiful Rhine riverfront when it comes fully alive with outdoor cafés, beer gardens, cultural activities, and locals enjoying the riverside. The views of the modern skyline and historic towers across the water are particularly spectacular in the clear spring light."
            },
            {
                "reason": "Altstadt Beer Culture Peak",
                "details": "May marks the height of Düsseldorf's Altbier season when the city's traditional breweries and beer halls fully open their outdoor seating, offering the perfect setting to enjoy local Altbier and regional specialties in atmospheric settings throughout the Altstadt and along the Rhine."
            },
            {
                "reason": "Düsseldorf Jazz Rally",
                "details": "May hosts the prestigious Düsseldorf Jazz Rally, one of Germany's most important jazz festivals, featuring world-class musicians performing in atmospheric venues throughout the city, from historic churches to modern concert halls."
            },
            {
                "reason": "Neander Valley Nature",
                "details": "May offers the ideal opportunity to explore the nearby Neander Valley with spring hiking trails through scenic landscapes, as well as the charming towns along the Rhine with their vineyards in fresh green growth and picturesque historic centers just 30-45 minutes from the city."
            },
            {
                "reason": "Düsseldorf Culinary Awakening",
                "details": "May brings perfect weather for enjoying Düsseldorf's distinctive cuisine on outdoor terraces, from traditional restaurants in the Altstadt to sophisticated riverside establishments offering Rhine views, with seasonal specialties featuring fresh spring ingredients from the fertile Rhine Valley region."
            },
            {
                "reason": "Day Trip Perfection",
                "details": "May provides ideal conditions for excursions to nearby destinations like Cologne with its cathedral, the romantic castles of the Rhine Valley, the picturesque wine region of the Middle Rhine, and the historic city of Aachen, all at their most beautiful with spring flowers and comfortable temperatures."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cultural Event Popularity",
                "details": "As a major European cultural center, Düsseldorf hosts several significant music festivals and cultural events in May, which can impact hotel availability and rates, particularly in the Altstadt area and city center, requiring earlier booking than other months."
            },
            {
                "reason": "Holiday Weekend Crowds",
                "details": "May contains several German public holidays (Labor Day, Ascension Day, Pentecost) which create long weekends that bring increased domestic tourism to Düsseldorf, particularly around the Altstadt and Rhine promenade, with corresponding rises in accommodation prices and need for restaurant reservations."
            },
            {
                "reason": "Rhine Water Levels",
                "details": "Spring water levels on the Rhine can occasionally affect river cruise schedules or riverside promenade access during May, particularly after heavy rainfall periods in the river's Alpine source regions, though serious flooding is relatively rare in this season."
            },
            {
                "reason": "Variable Spring Weather",
                "details": "While generally reliable, Düsseldorf's temperate climate can bring occasional unpredictable weather changes in May, with afternoon thunderstorms possible and temperature differences between sunny and cloudy days requiring adaptable clothing and flexible planning."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C",
                    "low": "6°C"
                },
                "precipitation": "Moderate rainfall with generally pleasant conditions and occasional brief showers, particularly in afternoons. Increasing sunshine with spring warmth, though temperatures can still vary from day to day.",
                "general_tips": "Light clothing suitable for warm days with layers for cooler evenings. Temperature drops noticeably after sunset requires an extra layer for riverside dining or evening activities. Rain protection recommended for occasional showers. Comfortable walking shoes essential for Düsseldorf's historic streets and Rhine promenade."
            },
            "tourism_level": {
                "crowds": "Moderate tourism levels with busier periods around weekends and holidays; major attractions like the Kunstpalast, Rhine Tower, and museums seeing increasing visitor numbers but still manageable, especially on weekdays.",
                "pricing": "Mid-range pricing for accommodations with good availability except during major music festival events; advance booking recommended during cultural events and holiday weekends.",
                "overall_atmosphere": "Pleasantly vibrant with locals and visitors enjoying outdoor lifestyle along the Rhine, in Altstadt squares, and at terrace cafés, creating a lively but not overwhelming ambiance typical of Düsseldorf's refined character."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Tag der Arbeit)",
                    "date": "May 1",
                    "description": "Public holiday celebrated with demonstrations, cultural events, and many locals enjoying the day off in parks, particularly along the Rhine promenade and in beer gardens throughout the city.",
                    "notes": "Many businesses and some attractions closed; restaurants typically open but may have special hours; popular day for locals to gather in Hofgarten and Rhine meadows for picnics; public transportation runs on holiday schedule; political demonstrations may occur in central areas."
                },
                {
                    "name": "Düsseldorf Jazz Rally Opening",
                    "date": "Early May (varies annually)",
                    "description": "The prestigious Düsseldorf Jazz Rally begins with opening concerts featuring world-class performances in venues throughout the city, including the Tonhalle, Deutsche Oper am Rhein, and historic churches.",
                    "notes": "One of Germany's most important jazz festivals; tickets for popular performances sell out well in advance; combination tickets available for multiple concerts; venues include historical churches and modern concert halls; festival program booklets available at tourist information centers; international audience creates cosmopolitan atmosphere."
                },
                {
                    "name": "Early Summer Markets",
                    "date": "Various dates in May",
                    "description": "Neighborhood markets taking place throughout Düsseldorf's diverse districts, featuring local food, artisanal products, and culture with authentic experiences away from main tourist areas.",
                    "notes": "Carlstadt, Flingern, and Pempelfort neighborhoods known for artisanal markets; dates vary annually and by district; excellent opportunities to experience authentic Rhine culture; food and craft stalls with local specialties; live music typically features local artists; family-friendly atmosphere with emphasis on regional traditions."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Rhine Tower Without Crowds",
                    "where": "Near Rhine Promenade",
                    "description": "Experience Düsseldorf's iconic telecommunications tower with fewer visitors than summer months, allowing for more contemplative appreciation of its stunning architecture, panoramic views, and powerful symbolism of post-war reconstruction.",
                    "practical_tips": "Morning visits before 10AM offer best interior light and smallest crowds; elevator access; timed entry limits crowding at top; revolving restaurant available; less crowded than summer months; excellent photo opportunities of city and Rhine Valley; interior especially beautiful on sunny mornings; guided tours available in English but less frequent than summer.",
                    "best_time": "Early morning (8-10AM)",
                    "estimated_cost": "€10 for tower entry; €20-30 for restaurant",
                    "weather_dependent": false
                },
                {
                    "activity": "Rhine Promenade Stroll",
                    "where": "Between Rhine Tower and Altstadt",
                    "description": "Enjoy Düsseldorf's beautiful riverside promenade in perfect May conditions with the first full month of outdoor cafés, cultural activities, and locals embracing the riverside lifestyle with spectacular views of the city skyline and modern architecture.",
                    "practical_tips": "North bank features sprawling meadows popular with locals; south bank offers more formal promenades; Oberkassel bridge area particularly scenic; several beer gardens and cafés along route; riverside paths stretch for several kilometers in both directions; bicycle rentals available for longer exploration; sunset particularly beautiful from promenade.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "Free for walking; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Kunstpalast Museum",
                    "where": "Near Hofgarten",
                    "description": "Visit one of Germany's most important art collections featuring masterpieces from the Middle Ages to contemporary art, housed in the magnificent museum complex with fewer crowds than summer months.",
                    "practical_tips": "Recently renovated galleries with world-famous works; weekday mornings less crowded; excellent audio guide available in multiple languages; photography without flash permitted; combine with NRW-Forum and K21 in same complex; café in museum courtyard opens for season; perfect indoor option if caught in a spring shower.",
                    "best_time": "Weekday morning",
                    "estimated_cost": "€12 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Hofgarten by Miniature Train",
                    "where": "Hauptallee",
                    "description": "Experience Düsseldorf's magnificent formal park when spring displays reach their peak, with historic monuments, themed gardens, and large ponds easily accessible via the charming narrow-gauge park railway that loops through the grounds.",
                    "practical_tips": "Free admission to park makes this exceptional value; historic monuments and cultural institutions within park; miniature steam train circles park with multiple stops; rose garden approaching peak bloom; several café options with outdoor seating; easily accessible via tram; botanical areas particularly rewarding during this season; less crowded on weekday mornings; rental boats available on main pond.",
                    "best_time": "Morning or late afternoon for best light",
                    "estimated_cost": "Free park admission; €4.50 for park railway round trip",
                    "weather_dependent": true
                },
                {
                    "activity": "Altstadt Beer Experience",
                    "where": "Historic Altstadt district",
                    "description": "Discover Düsseldorf's vibrant beer culture when traditional breweries and beer halls fully open for the season, offering authentic experiences of the local Altbier scene alongside regional cuisine in a historic atmosphere.",
                    "practical_tips": "Uerige, Füchschen, and Schumacher among popular options; outdoor seating fills quickly on warm evenings—arrive early; traditional Altbier served in small glasses; regional food specialties reflect Altstadt's character; Bolkerstraße particularly lively; less touristy atmosphere than Rhine promenade; Thursday and Friday evenings particularly lively.",
                    "best_time": "Early evening (6-8PM)",
                    "estimated_cost": "€15-25 for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "K21 Museum",
                    "where": "Ständehaus Park",
                    "description": "Explore one of Germany's most important contemporary art collections featuring works from the 21st century, including the famous 'In Orbit' installation by Tomás Saraceno, with significantly fewer visitors than during summer season.",
                    "practical_tips": "Recently renovated galleries with world-famous works; weekday mornings nearly empty compared to summer; excellent audio guide available in multiple languages; heating makes this comfortable regardless of weather; combine with Kunstpalast and NRW-Forum in same area; café on premises for warming refreshments.",
                    "best_time": "Morning, first entry slot",
                    "estimated_cost": "€10 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Rhine River Cruise",
                    "where": "Departing from Rhine promenade pier",
                    "description": "Enjoy Düsseldorf's historic cityscape from the water aboard one of the city's modern river cruise vessels, with May offering comfortable temperatures, blooming riverside landscapes, and fewer passengers than summer months.",
                    "practical_tips": "Various cruise options from 1.5-hour city cruise to longer journeys toward Cologne or Duisburg; modern vessels offer comfortable viewing areas; upper deck ideal in good weather; advance booking advised for weekend departures; multilingual commentary available; on-board dining options available; special sunset dinner cruises particularly atmospheric.",
                    "best_time": "Early afternoon for best light",
                    "estimated_cost": "€22 for standard cruise; €40+ for longer journeys",
                    "weather_dependent": true
                },
                {
                    "activity": "Deutsche Oper am Rhein Experience",
                    "where": "Opernhaus, Heinrich-Heine-Allee",
                    "description": "Visit Düsseldorf's magnificent opera house, either through a daytime guided tour of its opulent interior or by attending an evening opera, ballet, or concert performance in one of Europe's most beautiful and acoustically perfect theaters.",
                    "practical_tips": "Daytime tours in multiple languages require advance booking but May offers better availability than summer; performance tickets more readily available than in high season but advance purchase still recommended; dress code relatively formal for evening performances; building itself an architectural masterpiece; acoustics considered among world's finest; evening performances typically start at 7PM; box office opens daily for last-minute availability.",
                    "best_time": "Daytime for tours; evening for performances",
                    "estimated_cost": "€13 for guided tour; €40-120 for performance tickets",
                    "weather_dependent": false
                },
                {
                    "activity": "NRW-Forum",
                    "where": "Ehrenhof, near Hofgarten",
                    "description": "Visit Düsseldorf's contemporary art and design center featuring thoughtful exhibitions on digital culture, photography, and modern design housed in a historic building dramatically transformed by modern interventions.",
                    "practical_tips": "Located near city center but easily reached by tram; never overcrowded; contemporary approach to art focuses on digital and modern culture; viewing platform offers city views; chronological and thematic exhibitions; multi-sensory experiences; café on premises; architecture itself worth visiting; excellent indoor activity during inclement weather.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€12 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Kunsthalle Düsseldorf",
                    "where": "Grabbeplatz",
                    "description": "Discover Düsseldorf's artistic courtyards featuring themed facade designs including modern art installations, along with unique shops, cafés, and artistic workshops in a creative micro-district.",
                    "practical_tips": "Series of interconnected galleries each with distinct theme; modern art installations particularly notable; small independent shops with handcrafted items; several excellent cafés with outdoor seating opening for spring season; uncrowded mornings best for photography; combines well with general Altstadt exploration; May brings outdoor art installations and performances to the courtyards.",
                    "best_time": "Mid-morning or late afternoon",
                    "estimated_cost": "Free for exploration; €10-15 for café stops",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "9°C"
                },
                "precipitation": "Moderate rainfall with generally pleasant conditions and occasional brief thunderstorms, particularly in afternoons. Consistent sunshine with warmer temperatures approaching early summer levels.",
                "general_tips": "Summer clothing appropriate during day with light layers for evening, especially along the Rhine where breezes can be cooler. Increased importance of sun protection, particularly during midday hours. Rain protection still recommended for occasional showers. Outdoor dining pleasant throughout the evening."
            },
            "tourism_level": {
                "crowds": "Moderate to high, increasing as the month progresses and European tourism season begins. Kunstpalast, Rhine Tower, and museums seeing higher visitor numbers, particularly on weekends and around Ascension Day and Pentecost holidays.",
                "pricing": "Higher than early May, with accommodations implementing early summer season rates, particularly during major cultural events, festivals, and holiday weekends.",
                "overall_atmosphere": "Vibrant pre-summer ambiance with outdoor dining in full swing, evening activities extending later as temperatures remain pleasant after sunset, and increasing presence of international visitors alongside locals enjoying the refined outdoor culture Düsseldorf is famous for."
            },
            "events_holidays": [
                {
                    "name": "Ascension Day (Christi Himmelfahrt)",
                    "date": "Late May (varies annually)",
                    "description": "Public holiday with special religious observances, traditionally also celebrated as Father's Day with outdoor group activities particularly in parks and along the Rhine meadows.",
                    "notes": "Public holiday with government offices and many businesses closed; traditionally men go on group outings with wagons of beer in parks or along the Rhine; many locals take Friday off creating long weekend; outdoor restaurants particularly busy; advance reservations recommended for popular venues; St. Lambertus and St. Andreas hold special services."
                },
                {
                    "name": "Pentecost/Whitsun (Pfingsten)",
                    "date": "Late May/early June (varies annually)",
                    "description": "Important religious holiday weekend with special church services, cultural events, and many locals enjoying the extended weekend outdoors in parks and along the Rhine River.",
                    "notes": "Both Sunday and Monday are public holidays; many businesses closed Monday; traditional time for cultural outings; notable increase in domestic tourism; accommodation prices rise for holiday weekend; churches hold significant services with special music; public transportation runs holiday schedule."
                },
                {
                    "name": "Düsseldorf Jazz Rally",
                    "date": "Late May (varies annually)",
                    "description": "Europe's largest jazz festival featuring hundreds of musicians performing throughout the city, from concert halls to river boats, public squares and beer gardens, creating a festive atmosphere throughout Düsseldorf.",
                    "notes": "Over 40 years of tradition; combines ticketed concerts with numerous free performances; special riverboat jazz cruises highly popular; historic venues and outdoor stages throughout city; international performers alongside local musicians; festival pass available for multiple events; Altstadt especially lively during festival weekend; accommodation books quickly for this period."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Evening Rhine River Cruise",
                    "where": "Departing from Rhine promenade pier",
                    "description": "Enjoy Düsseldorf's magnificent modern skyline and bridges during a warm May evening on a river cruise, with longer daylight hours and pleasant temperatures creating perfect conditions for seeing the city from its defining waterway.",
                    "practical_tips": "Modern vessels offer various cruising options; evening departures increasingly popular as days lengthen; upper deck best in good weather; dinner cruises available but simple sightseeing cruises offer more flexibility for photography; pre-booking advised for weekend evenings; sunset cruises particularly atmospheric as city illumination begins.",
                    "best_time": "Departure 7-8PM for ideal light",
                    "estimated_cost": "€18-22 for standard cruise; dinner cruises €45+",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Neander Valley",
                    "where": "Neander Valley (30 minutes from Düsseldorf)",
                    "description": "Experience one of Germany's most significant archaeological sites when spring brings lush green forests contrasting with dramatic limestone cliffs, perfect hiking weather, and magnificent viewpoints over the Düssel River valley.",
                    "practical_tips": "Direct S-Bahn trains from Düsseldorf to Neanderthal followed by short bus connection; famous Neanderthal Museum accessible without extensive hiking; various trail options from easy walks to challenging climbs; nearby Mettmann offers historical complement to natural wonders; less crowded weekdays recommended; proper hiking shoes advised even for easier trails; organized tours available but independent travel straightforward.",
                    "best_time": "Full day starting early",
                    "estimated_cost": "€30-50 including transportation and entrance fees",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Cologne",
                    "where": "Cologne (30 minutes from Düsseldorf)",
                    "description": "Visit the picturesque medieval city famous for its cathedral, featuring a magnificent Gothic cathedral, historic old town, winding cobblestone streets, and the opportunity to tour the historic chocolate museum.",
                    "practical_tips": "Regular ICE train connections from Düsseldorf Hauptbahnhof; combined ticket available for cathedral and museums; chocolate factory tour includes demonstration workshop and museum; compact old town easily walkable; less touristy than Düsseldorf despite proximity; several traditional Rhine restaurants in market square; riverside promenade beginning to green beautifully in May.",
                    "best_time": "Full day starting morning",
                    "estimated_cost": "€35-45 including transportation and entrance fees",
                    "weather_dependent": true
                },
                {
                    "activity": "Düsseldorf's Contemporary Art Scene",
                    "where": "K21 and Kunsthalle Düsseldorf",
                    "description": "Explore Düsseldorf's vibrant contemporary art scene through its modern art collections, from German Romanticism to present day, housed in the beautifully renovated K21 and avant-garde exhibitions at Kunsthalle Düsseldorf.",
                    "practical_tips": "K21 houses both 19th century masters and contemporary German artists; Kunsthalle features rotating contemporary exhibitions in former factory space; Gerhard Richter Archive in K21 highlights Düsseldorf-born painter; less visited than Kunstpalast; good English information available; special exhibitions typically launched in spring; combines well with street art exploration in Flingern.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€12 for K21; free or small donation for Kunsthalle",
                    "weather_dependent": false
                },
                {
                    "activity": "Benrath Palace Gardens",
                    "where": "Benrath (southern Düsseldorf)",
                    "description": "Visit Düsseldorf's beautiful riverside palace combining Baroque and Rococo architectural styles when its magnificent gardens reach peak spring beauty, featuring blooming rhododendrons, formal parterres, and Europe's oldest camellia plant.",
                    "practical_tips": "Accessible via direct bus from city center or scenic boat trip on Rhine; palace houses several museums including Palace Museum and Arts and Crafts Museum; magnificent gardens free to explore; hillside vineyards and park create beautiful setting; historic camellia tree in protective greenhouse; riverside restaurant with terrace; comfortable walking shoes recommended for garden exploration.",
                    "best_time": "Morning to allow time for palace and gardens",
                    "estimated_cost": "€8 for palace museums, gardens free; plus transportation (€4-18 depending on mode)",
                    "weather_dependent": true
                },
                {
                    "activity": "Carlsplatz Market",
                    "where": "Carlstadt",
                    "description": "Visit the 'Most Beautiful Market in Düsseldorf' with its spectacular array of fresh produce, artisanal goods, and local specialties, combining practical shopping with cultural sightseeing in an authentic local setting.",
                    "practical_tips": "Functioning market since 1800s; spectacular variety of fresh produce and local specialties; small space can be crowded but May offers better conditions than summer; limited photography allowed; small café areas for refreshments; excellent food souvenirs; located in Carlstadt district easily combined with other activities in this area; market vendors accustomed to tourists; reasonable prices despite tourist popularity.",
                    "best_time": "Mid-morning on weekdays",
                    "estimated_cost": "Free entry; purchases extra",
                    "weather_dependent": false
                },
                {
                    "activity": "Königsallee Evening Stroll",
                    "where": "Königsallee, City Center",
                    "description": "Experience 'The Kö' during warm May evenings when locals and visitors promenade along this elegant shopping boulevard offering spectacular views of luxury boutiques, historic architecture, and sunset colors behind the modern skyline.",
                    "practical_tips": "Historic shopping boulevard connecting major city landmarks; several cafés and restaurants with outdoor terraces; street performers appear in warmer weather; sunset views particularly stunning; less crowded in evening than afternoon; connects to Hofgarten which often has extended hours; perfect activity before or after dinner in city center.",
                    "best_time": "Early evening around sunset",
                    "estimated_cost": "Free for walking; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Hygiene Museum",
                    "where": "Lingnerplatz 1",
                    "description": "Visit Düsseldorf's unique museum focused on the human body, health, and well-being, featuring interactive exhibitions on biology, nutrition, sexuality, and medical history in a striking modernist building set within the Nordpark area.",
                    "practical_tips": "More engaging than name suggests; excellent for families; distinctive mixture of historic artifacts and modern interactive displays; famous transparent anatomical models; temporary exhibitions on social aspects of health; accessible for non-German speakers; less crowded than Altstadt attractions; comfortable indoor environment if afternoon turns rainy; café on premises with outdoor seating in good weather.",
                    "best_time": "Midday",
                    "estimated_cost": "€9 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "St. Lambertus Vespers",
                    "where": "Altstadt",
                    "description": "Experience a Vespers service with the famous St. Lambertus choir performing in Düsseldorf's oldest church, continuing a musical tradition dating to the 13th century and offering an authentic cultural and spiritual experience beyond typical tourism.",
                    "practical_tips": "Vespers typically held Saturday afternoons at 5PM; arrive 30-45 minutes early for seating; offerings requested rather than fixed ticket price; choir has performed continuously since 1300s; church rebuilt after WWII in simplified form; concert schedule varies so verify performance dates; church located in Altstadt; respectful attire appropriate; photography not permitted during services.",
                    "best_time": "Saturday afternoon",
                    "estimated_cost": "Free (donations welcomed)",
                    "weather_dependent": false
                },
                {
                    "activity": "Volkswagen Transparent Factory",
                    "where": "Straßburger Platz",
                    "description": "Tour Volkswagen's unique transparent assembly facility where electric vehicles are assembled in a striking architectural showcase, offering insights into automotive manufacturing, e-mobility, and sustainable production methods in a museum-like environment.",
                    "practical_tips": "Advance booking recommended but May offers good availability; guided tours in German and English available; photography permitted in most areas; interactive exhibition on future mobility; opportunity to test drive electric vehicles for licensed drivers; architectural design as impressive as production process; accessible via public transportation (tram); approximately 90-minute tour experience.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "€7 for factory tour; test drives may require valid license",
                    "weather_dependent": false
                }
            ]
        }
    }
}