{
  "sites": [
    {
      "name": "Museo del Prado",
      "type": "Museum/Art",
      "description": "The Prado Museum is Spain's premier art gallery and one of the world's most important museums. Housed in a neoclassical building designed by Juan de Villanueva in 1785, it contains one of the world's finest collections of European art from the 12th to early 20th century. The museum's collection includes masterpieces by Spanish artists such as Velázquez, Goya, and El Greco, as well as works by Flemish, Italian, and German masters. The building itself is a work of art, with its grand entrance hall and elegant galleries.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with climate-controlled galleries. Less crowded on weekday mornings. Free entry 6-8 PM Monday-Saturday and 5-7 PM Sundays. Special exhibitions rotate seasonally. Summer brings extended hours and increased visitors. The museum's central location makes it easily accessible in any weather.",
      "booking_tips": "Online tickets recommended to avoid queues. Audio guides available in multiple languages. Guided tours offer deeper insights and require advance booking. Photography not permitted in permanent collection galleries. Museum café offers pleasant courtyard seating. Combined tickets with other museums available.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 40.4138,
      "longitude": -3.6920
    },
    {
      "name": "Palacio Real",
      "type": "Historic Monument/Palace",
      "description": "The Royal Palace of Madrid is the official residence of the Spanish royal family, though it is now only used for state ceremonies. Built between 1738 and 1755, it is the largest functioning royal palace in Europe. The palace features over 3,000 rooms, including the stunning Throne Room, Hall of Mirrors, and Royal Chapel. The building combines Baroque and Classical architectural styles, with lavish interiors decorated with works by artists such as Goya, Velázquez, and Caravaggio.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Less crowded on weekday mornings. Summer brings longer hours and increased visitors. Changing of the Guard ceremony occurs weekly. Special state ceremonies may affect access. Winter offers fewer crowds but shorter hours. Spring and autumn provide ideal visiting conditions.",
      "booking_tips": "Online tickets recommended to avoid queues. Guided tours available in multiple languages. Photography permitted in most areas. Comfortable walking shoes recommended. Audio guides provide detailed historical context. Combined tickets with other royal sites available. Free entry for EU citizens on certain days.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 40.4180,
      "longitude": -3.7142
    },
    {
      "name": "Parque del Retiro",
      "type": "Park",
      "description": "El Retiro Park is Madrid's most famous park and a UNESCO World Heritage site. Originally created as a royal garden in the 17th century, it was opened to the public in 1868. The park features beautiful gardens, fountains, sculptures, and the iconic Crystal Palace. The artificial lake, where visitors can rent rowboats, is a popular attraction. The park also houses several museums and exhibition spaces, making it both a recreational and cultural destination.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round from sunrise to sunset. Spring brings blooming flowers and pleasant temperatures. Summer offers outdoor activities and evening entertainment. Autumn features beautiful fall colors. Winter provides clear views and fewer crowds. Special events and performances throughout the year. Rowboat rentals available in warmer months.",
      "booking_tips": "No booking required for general access. Rowboat rentals available on-site. Multiple entrances provide convenient access. Comfortable walking shoes recommended. Park maps available at information points. Street performers and artists common in good weather. Café kiosks provide refreshments throughout the day.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.4147,
      "longitude": -3.6820
    },
    {
      "name": "Plaza Mayor",
      "type": "Historic Site/Public Square",
      "description": "Plaza Mayor is Madrid's grand central square, built during the Habsburg period. This rectangular plaza, surrounded by three-story residential buildings with 237 balconies facing the square, has been the site of various public events since its construction in 1619. The square features the Casa de la Panadería (Bakery House) with its distinctive painted facade, and the equestrian statue of Philip III. Today, it serves as a popular gathering place with numerous restaurants and cafés.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Summer evenings bring outdoor dining and street performers. Christmas market transforms the square in December. Spring and autumn offer pleasant temperatures for outdoor enjoyment. Winter brings holiday decorations and seasonal events. Street artists and performers frequent the square in good weather.",
      "booking_tips": "No booking required for general access. Restaurant terraces operate first-come basis. Tourist information center located nearby. Historical plaques explain the square's evolution. Multiple transportation connections available. Street performers frequently present, especially weekends and evenings.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 40.4154,
      "longitude": -3.7074
    },
    {
      "name": "Museo Nacional Centro de Arte Reina Sofía",
      "type": "Museum/Contemporary Art",
      "description": "The Reina Sofía Museum is Spain's national museum of 20th-century art. Housed in a former hospital building with modern extensions, it is best known for housing Picasso's masterpiece 'Guernica'. The collection focuses on Spanish artists including Dalí, Miró, and Juan Gris, as well as international contemporary artists. The museum's architecture combines historic and modern elements, with the glass elevators by Jean Nouvel being particularly notable.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with climate-controlled galleries. Free entry 7-9 PM Monday-Saturday and 1:30-7 PM Sundays. Less crowded on weekday afternoons. Special exhibitions rotate seasonally. Summer brings extended hours. The museum's central location makes it easily accessible in any weather.",
      "booking_tips": "Online tickets recommended to avoid queues. Audio guides available in multiple languages. Guided tours offer deeper insights and require advance booking. Photography permitted in most areas. Museum café offers pleasant seating. Combined tickets with other museums available.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 40.4078,
      "longitude": -3.6946
    },
    {
      "name": "Puerta del Sol",
      "type": "Historic Site/Public Square",
      "description": "Puerta del Sol is one of Madrid's most famous and busiest squares. Historically the site of one of the city's gates, it is now a major public space and transportation hub. The square features the iconic clock tower of the Casa de Correos (Post Office), the statue of the Bear and Strawberry Tree (symbol of Madrid), and the Kilometer Zero plaque marking the center of Spain's road network. It is a popular gathering place and the site of New Year's celebrations.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. New Year's Eve brings massive crowds for the grape-eating tradition. Summer evenings particularly lively with street performers. Christmas season features special lighting and decorations. Spring and autumn offer pleasant temperatures. Winter brings holiday festivities. Street artists and performers frequent the square in good weather.",
      "booking_tips": "No booking required for general access. Multiple transportation connections available. Tourist information center located nearby. Historical plaques explain the square's significance. Street performers frequently present, especially weekends and evenings. Major shopping areas easily accessible.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 40.4168,
      "longitude": -3.7038
    },
    {
      "name": "Museo Thyssen-Bornemisza",
      "type": "Museum/Art",
      "description": "The Thyssen-Bornemisza Museum houses one of the world's most important private art collections, spanning from the 13th to the 20th century. The collection was acquired by the Spanish state in 1993 and is displayed in the Villahermosa Palace. The museum features works by major artists including Van Gogh, Monet, Degas, and Picasso, offering a comprehensive overview of Western art history. The building itself combines historic architecture with modern exhibition spaces.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with climate-controlled galleries. Less crowded on weekday mornings. Special exhibitions rotate seasonally. Summer brings extended hours. Free entry on Mondays 12-4 PM. The museum's central location makes it easily accessible in any weather.",
      "booking_tips": "Online tickets recommended to avoid queues. Audio guides available in multiple languages. Guided tours offer deeper insights and require advance booking. Photography permitted in most areas. Museum café offers pleasant seating. Combined tickets with other museums available.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.4159,
      "longitude": -3.6959
    },
    {
      "name": "Gran Via",
      "type": "Historic Street/Shopping",
      "description": "Gran Via is Madrid's most famous street, known for its early 20th-century architecture and vibrant atmosphere. Built between 1910 and 1929, it features numerous Art Deco and Neo-Baroque buildings, including the iconic Metropolis Building and the Telefónica Building. The street is lined with shops, theaters, restaurants, and hotels, making it a major commercial and entertainment hub. The architecture reflects Madrid's early 20th-century modernization.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Summer evenings bring outdoor dining and street performers. Christmas season features elaborate light displays. Spring and autumn offer pleasant temperatures. Winter brings holiday decorations. Street artists and performers frequent the area in good weather. Theater season runs September-June.",
      "booking_tips": "No booking required for general access. Theater tickets available at box offices or online. Multiple transportation connections available. Comfortable walking shoes recommended. Street performers frequently present, especially weekends and evenings. Major shopping areas easily accessible.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.4192,
      "longitude": -3.7015
    },
    {
      "name": "Templo de Debod",
      "type": "Historic Monument",
      "description": "The Temple of Debod is an ancient Egyptian temple that was dismantled and rebuilt in Madrid's Parque de la Montaña. Dating from the 2nd century BCE, it was gifted to Spain by Egypt in 1968 in gratitude for Spanish help in saving other temples from flooding during the construction of the Aswan Dam. The temple is one of the few Egyptian temples outside Egypt and offers a unique opportunity to see ancient Egyptian architecture in Europe.",
      "indoor": true,
      "best_time": "Sunset",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Sunset views particularly spectacular. Summer brings longer hours and increased visitors. Winter offers clearer views but shorter hours. Spring and autumn provide ideal visiting conditions. The temple's location in a park makes it pleasant to visit in good weather.",
      "booking_tips": "No booking required for general access. Free entry. Photography permitted. Comfortable walking shoes recommended. Historical plaques explain the temple's significance. Located in a park, can be combined with other nearby attractions.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 40.4236,
      "longitude": -3.7178
    },
    {
      "name": "Mercado de San Miguel",
      "type": "Market/Food",
      "description": "The San Miguel Market is a historic covered market near Plaza Mayor, featuring a beautiful iron and glass structure from 1916. Renovated in 2009, it has become a popular gourmet food market offering high-quality tapas, fresh seafood, and Spanish specialties. The market combines traditional market atmosphere with modern culinary trends, making it a favorite destination for both locals and tourists seeking authentic Spanish food experiences.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Evening hours particularly lively. Summer brings outdoor seating and extended hours. Winter offers cozy indoor atmosphere. Spring and autumn provide pleasant visiting conditions. Special events and tastings throughout the year. Holiday season brings special offerings.",
      "booking_tips": "No booking required for general access. Popular times may require patience. Multiple vendors offer different specialties. Standing room only at most counters. Cash and cards accepted. Located near Plaza Mayor for convenient sightseeing. Guided food tours available.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 40.4154,
      "longitude": -3.7074
    },
    {
      "name": "Santiago Bernabéu Stadium",
      "type": "Sports/Football",
      "description": "The Santiago Bernabéu Stadium is home to Real Madrid and one of the most iconic football venues in the world. It hosts thrilling matches, offers an extensive museum, and provides guided tours that celebrate the club's rich history.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Tours available year-round with some restrictions on match days. Peak visiting times coincide with the football season, while off-season tours offer a quieter experience.",
      "booking_tips": "Advance booking is recommended for stadium tours. Guided tours are available, and photography is allowed only in designated areas. Check the match schedule before visiting.",
      "ratings": {
        "cost_estimate": 18,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.4531,
      "longitude": -3.6883
    },
    {
      "name": "El Rastro",
      "type": "Market/Flea Market",
      "description": "El Rastro is Madrid's most famous open-air flea market, offering a diverse range of antiques, clothing, and unique souvenirs. Held every Sunday and public holiday, the bustling market reflects the city's vibrant culture.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Varies",
      "seasonal_notes": "Open on Sundays and public holidays. Mornings tend to be less crowded, while late mornings can be busy. Weather conditions can affect the overall experience.",
      "booking_tips": "No booking required. Comfortable walking shoes are recommended, and visitors should be mindful of their belongings. Bargaining is a common practice.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.4143,
      "longitude": -3.7114
    },
    {
      "name": "Real Jardín Botánico",
      "type": "Garden/Botanical",
      "description": "The Royal Botanical Garden offers a peaceful retreat in the heart of Madrid. Home to an extensive collection of plants from around the world, it provides a serene setting for leisurely strolls and educational experiences.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Low",
      "seasonal_notes": "Open year-round, although some sections may be closed for maintenance in winter. Spring and summer showcase vibrant blooms, making it ideal for picnics and quiet reflection.",
      "booking_tips": "No booking required. Guided tours are available and photography is permitted. Check the schedule for seasonal events and special exhibitions.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 40.4140,
      "longitude": -3.6883
    },
    {
      "name": "CaixaForum Madrid",
      "type": "Cultural Center/Exhibition",
      "description": "CaixaForum Madrid is a dynamic cultural center housed in a former power station. It features contemporary art exhibitions, workshops, and educational programs in a striking architectural space.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with rotating exhibitions. Crowds may increase during major events and weekend programs, with special discounts often available for students and seniors.",
      "booking_tips": "Advance booking for special exhibitions is recommended. Check the official website for current events and program schedules. Photography policies may vary by exhibition.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 40.4106,
      "longitude": -3.6961
    },
    {
      "name": "Teatro Real",
      "type": "Opera/Theater",
      "description": "Teatro Real is Madrid's premier opera house, renowned for its impressive architecture and world-class performances. It hosts operas, ballets, and concerts, offering a rich cultural experience in the performing arts.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Expensive",
      "seasonal_notes": "The performance schedule varies seasonally, with peak times during opera festivals and holiday seasons. Evening performances are most popular, so booking well in advance is advised.",
      "booking_tips": "Tickets should be booked online early. Check for any discount offers and be aware of the dress code. Guided tours of the theater are also available on non-performance days.",
      "ratings": {
        "cost_estimate": 30,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 40.4161,
      "longitude": -3.7070
    },
    {
      "name": "Círculo de Bellas Artes",
      "type": "Cultural Center/Art",
      "description": "The Círculo de Bellas Artes is a cultural institution offering exhibitions, film screenings, and workshops. Its rooftop provides stunning panoramic views of Madrid and hosts various events and performances.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with a busy schedule of events. Evening rooftop exhibitions and programs are particularly popular, especially during the cooler months.",
      "booking_tips": "Tickets are required for events and rooftop access. Online booking is recommended, and visitors should check event schedules for any special exhibitions or performances.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 40.4241,
      "longitude": -3.7069
    },
    {
      "name": "Museo Arqueológico Nacional",
      "type": "Museum/History",
      "description": "The National Archaeological Museum of Spain houses an extensive collection of artifacts spanning from prehistoric times to the early modern period. It offers deep insights into Spain's rich historical and cultural heritage.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with climate-controlled galleries. Peak visiting times are typically weekends and school holidays, with special temporary exhibitions rotating seasonally.",
      "booking_tips": "Online tickets are recommended to avoid queues. Audio guides are available and photography is permitted in designated areas. Guided tours can enhance the visit for groups.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 40.4175,
      "longitude": -3.7050
    },
    {
      "name": "Casa de Campo",
      "type": "Park/Nature",
      "description": "Casa de Campo is Madrid's largest public park, offering expansive green spaces, a lake, and a variety of outdoor recreational activities. It is a popular spot for picnics, cycling, and boating, providing an escape from the city's hustle and bustle.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Summer weekends can be crowded, while mornings and weekdays are quieter. Autumn and spring offer pleasant weather ideal for outdoor activities.",
      "booking_tips": "No booking is required for general access. On-site bike rentals and boat rides are available, making it a great choice for family outings and group activities.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 3
      },
      "latitude": 40.4122,
      "longitude": -3.7370
    },
    {
      "name": "Matadero Madrid",
      "type": "Cultural Center/Arts",
      "description": "Matadero Madrid is a contemporary arts center housed in a former slaughterhouse. It hosts a range of exhibitions, performances, and cultural events, offering a unique blend of industrial architecture and creative expression.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Low to Moderate",
      "seasonal_notes": "Open year-round with varying schedules for exhibitions and events. Crowds may increase during major cultural festivals and special installations.",
      "booking_tips": "Online booking is recommended for special events. Visitors should check the official schedule and note that photography policies may vary by exhibition.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 40.3917,
      "longitude": -3.6740
    },
    {
      "name": "Puerta de Alcalá",
      "type": "Historic Monument",
      "description": "Puerta de Alcalá is a grand neoclassical gateway and one of Madrid's most iconic landmarks. Erected in the 18th century, it once served as one of the city's main gates and now stands as a symbol of Madrid's rich architectural heritage.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Evening illumination enhances its beauty, making it a popular spot for photography and leisurely strolls, especially in spring and autumn.",
      "booking_tips": "No booking required. Easily accessible by public transportation and located near several cafés for refreshments.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 40.4200,
      "longitude": -3.6880
    }
  ]
}
