{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Late Spring Weather",
                "details": "May offers arguably the best weather in Rhodes: reliably sunny, pleasantly warm (average highs 24-27°C), ideal for exploring the Old Town, Lindos, beaches, and the island before summer intensity hits."
            },
            {
                "reason": "Lush Landscapes & Wildflowers",
                "details": "The Rhodian countryside is still relatively green after winter rains, often adorned with late spring wildflowers, especially inland and on hillsides. Great for scenic drives."
            },
            {
                "reason": "Ideal for Sightseeing Before Peak Crowds",
                "details": "Explore Rhodes Old Town, the Palace, Lindos Acropolis, and ancient Kamiros with comfortable temperatures and more manageable crowds than in July/August."
            },
            {
                "reason": "Beach Season Starts Comfortably",
                "details": "Sea temperatures rise significantly (around 20-22°C), making swimming very enjoyable. Beaches like Tsambika, Faliraki, and Kallithea are less crowded than peak summer."
            },
            {
                "reason": "Medieval Rose Festival (Potential)",
                "details": "Rhodes often hosts its popular Medieval Rose Festival in late May/early June, transforming the Old Town with medieval-themed events, parades, and performances (check exact dates annually)."
            },
            {
                "reason": "Hiking & Outdoor Activities",
                "details": "Pleasant temperatures make May suitable for hiking (e.g., trails near Profitis Ilias) or exploring the island by bike or car before the serious heat sets in."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks the clear start of the high season. Expect growing crowds, especially later in the month at key sites and popular beaches. Prices for flights, accommodation, and rentals rise noticeably."
            },
            {
                "reason": "May Day Holiday & Potential Disruptions",
                "details": "May 1st (May Day/Labor Day) is a major public holiday. Expect widespread closures (sites, museums, shops) and potentially transport disruptions. Many locals head to beaches or villages."
            },
            {
                "reason": "Booking Ahead Becomes Important",
                "details": "It's wise to book popular hotels (especially in Lindos or Old Town), rental cars, and specific boat trips (like Symi) in advance, especially for late May."
            },
            {
                "reason": "Strong Mediterranean Sun",
                "details": "Even with pleasant air temperatures, the sun is strong in May. High SPF sunscreen, hats, and sunglasses are essential protection."
            },
            {
                "reason": "Potential for Early Meltemi Wind",
                "details": "The northerly Meltemi wind can begin blowing, usually intermittently at first, potentially affecting west coast beaches or boat trips later in the month."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "24°C",
                    "low": "16°C"
                },
                "precipitation": "Low chance of rain, mostly sunny and pleasantly warm. Sea temperatures reach around 20-21°C, becoming good for swimming.",
                "general_tips": "Pack light layers: t-shirts, light trousers/skirts, shorts, swimwear. A light jacket or sweater for evenings. Comfortable walking shoes/sandals. Sunscreen, hat, sunglasses vital."
            },
            "tourism_level": {
                "crowds": "Moderate to High, noticeably busier around the May 1st holiday. Key sites like Rhodes Old Town and Lindos Acropolis see steady visitor numbers but are generally manageable.",
                "pricing": "Shoulder/High season prices. Book ahead, especially if traveling around May 1st.",
                "overall_atmosphere": "Vibrant late spring feel. Superb weather for all activities – sightseeing, beaches, exploring. Potential closures/busyness around May 1st."
            },
            "events_holidays": [
                {
                    "name": "May Day / Labor Day (Protomagia)",
                    "date": "May 1",
                    "description": "Major public holiday. Tradition of flower wreath making ('stefania'). Many locals enjoy picnics or head to beaches.",
                    "notes": "Widespread closures (sites, museums, shops). Check transport. Roads to popular beaches can be busy."
                },
                {
                    "name": "Flower Festival (possible local events)",
                    "date": "Early May",
                    "description": "Some villages might hold small local flower festivals or celebrations related to Protomagia.",
                    "notes": "Check locally for specific events."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Lindos Acropolis & Village",
                    "where": "Lindos, East Coast",
                    "description": "Explore the stunning Acropolis and wander the whitewashed village in ideal temperatures before the main summer rush.",
                    "practical_tips": "Go early morning to avoid midday sun and growing crowds. Wear good shoes for the climb. Enjoy the views.",
                    "best_time": "Morning",
                    "estimated_cost": "Moderate (entry fee + transport)",
                    "weather_dependent": true
                },
                {
                    "activity": "Enjoy First Beach Days (Tsambika, Faliraki)",
                    "where": "East Coast Beaches",
                    "description": "Take advantage of pleasant sea temperatures and fewer crowds for swimming and sunbathing at popular sandy beaches.",
                    "practical_tips": "Tsambika offers stunning scenery, Faliraki has extensive facilities. Check wind conditions.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport) to Moderate (sunbeds/food)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Rhodes Old Town & Palace",
                    "where": "Medieval City, Rhodes Town",
                    "description": "Wander the historic streets, visit the Palace of the Grand Master, and explore the Archaeological Museum with comfortable weather.",
                    "practical_tips": "Allow ample time. Wear comfortable shoes. Consider indoor sites during warmest part of the day.",
                    "best_time": "Anytime, evenings atmospheric",
                    "estimated_cost": "Free to wander / Moderate for site entries",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Dine at Mandraki Harbour",
                    "where": "Rhodes New Town Waterfront",
                    "description": "Stroll along the picturesque harbour, see the deer statues, windmills, and enjoy coffee or a meal at the numerous cafes and restaurants.",
                    "practical_tips": "Lively area, especially evenings. Good spot for people-watching.",
                    "best_time": "Late Afternoon / Evening",
                    "estimated_cost": "Moderate to High (if dining)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "27°C",
                    "low": "18°C"
                },
                "precipitation": "Very low chance of rain. Consistently sunny and warm, feeling like proper early summer. Sea temperature comfortably above 21°C.",
                "general_tips": "Pack light summer clothing, swimwear essential. High SPF sunscreen, hat, sunglasses non-negotiable. Stay hydrated."
            },
            "tourism_level": {
                "crowds": "High and increasing rapidly. Popular spots feel busy. Book popular tours/activities in advance.",
                "pricing": "High season prices are the norm for flights, accommodation, and rentals.",
                "overall_atmosphere": "Beautiful early summer buzz. Perfect beach weather. Lively evenings. Feels like the season is in full swing."
            },
            "events_holidays": [
                 {
                    "name": "Medieval Rose Festival (Potential Timing)",
                    "date": "Often late May / Early June (check specific dates annually)",
                    "description": "Major festival transforming Rhodes Old Town with medieval theme: parades, jousting, music, crafts, food stalls. A highlight if it falls during your visit.",
                    "notes": "Check official festival website/local announcements for exact dates and program. Attracts large crowds."
                 },
                 {
                    "name": "Start of Regular Summer Events",
                    "date": "Late May onwards",
                    "description": "Look for the beginning of regular summer concert series, beach bar events, or cultural performances.",
                    "notes": "Check local listings and venue schedules."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience the Medieval Rose Festival (if occurring)",
                    "where": "Rhodes Old Town",
                    "description": "Immerse yourself in the medieval atmosphere with street performances, parades, markets, and themed events throughout the Old Town.",
                    "practical_tips": "Check the official schedule. Be prepared for large crowds within the Old Town walls. Plan transport/parking.",
                    "best_time": "Festival days/evenings (check program)",
                    "estimated_cost": "Free to wander (paid events/food extra)",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Symi Island",
                    "where": "Departing Mandraki Harbour",
                    "description": "Visit the stunningly beautiful neighbouring island known for its colourful neoclassical harbour and Panormitis Monastery.",
                    "practical_tips": "Book ferry/excursion tickets in advance as demand increases. Long day trip. Bring sun protection.",
                    "best_time": "Full Day",
                    "estimated_cost": "High (ferry/excursion + expenses on Symi)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Kallithea Springs",
                    "where": "East coast, south of Rhodes Town",
                    "description": "Explore the unique restored Italian spa complex with beautiful architecture, gardens, and a bay for swimming and sunbathing.",
                    "practical_tips": "Requires transport. Entrance fee applies. Has facilities. Good photo opportunities.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (transport + entry + extras)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Enjoy Sunset Drinks with a View",
                    "where": "Rooftop bars in Old/New Town, cafes near Mandraki, spots like Monte Smith",
                    "description": "Find a bar or viewpoint offering great views over the sea, harbour, or Old Town and enjoy a relaxing drink as the sun goes down.",
                    "practical_tips": "Popular spots fill up early. Enjoy the pleasant evening temperatures.",
                    "best_time": "Sunset / Early Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                 }
            ]
        }
    }
}