{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Beautiful Pre-Summer Weather",
                "details": "May offers arguably the best weather in Faro: consistently sunny, warm days (avg. 22-24°C high) perfect for beach visits and exploring, without the intense heat of mid-summer."
            },
            {
                "reason": "Beach Season Begins in Earnest",
                "details": "Ideal conditions for enjoying Praia de Faro and other Algarve beaches. The sun is warm, the sea is warming up (around 18-19°C), and beaches are less crowded than July/August."
            },
            {
                "reason": "Ria Formosa Natural Park Exploration",
                "details": "Perfect weather for boat trips through the Ria Formosa lagoon system. Enjoy the sunshine, spot diverse birdlife (including nesting birds like storks), and visit the beautiful barrier islands."
            },
            {
                "reason": "Shoulder Season Advantages",
                "details": "Experience the Algarve with pleasant weather and longer days, but with generally fewer crowds and slightly better prices than the absolute peak months."
            },
            {
                "reason": "Outdoor Dining & Activities",
                "details": "Ideal temperatures for enjoying Faro's outdoor cafes and restaurants, hiking/cycling the Ecovia Litoral, golfing, and exploring nearby towns."
            },
            {
                "reason": "Spring Wildflowers Linger",
                "details": "Catch the tail end of the spring wildflower season, especially in the Ria Formosa park or on walks in the Barrocal region inland."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Increasing Tourist Numbers",
                "details": "May marks a clear ramp-up towards high season. Expect more visitors than in April, particularly noticeable at popular spots and on weekends."
            },
            {
                "reason": "Rising Prices",
                "details": "Accommodation and flight prices increase as demand grows. Booking in advance is recommended for better deals and availability."
            },
            {
                "reason": "Sea Still Refreshing",
                "details": "While warming, the sea temperature (18-19°C) might still be considered cool by some for prolonged swimming."
            },
            {
                "reason": "Strong Sun",
                "details": "The sun's intensity increases significantly in May. Sunscreen, hats, and sunglasses are essential, especially during midday."
            },
            {
                "reason": "Fewer Major Events than Porto/Lisbon",
                "details": "While local events occur, May in Faro lacks the massive city-wide festivals found elsewhere in Portugal during this month (like Porto's Queima das Fitas)."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "22°C",
                    "low": "13°C"
                },
                "precipitation": "Very low chance of rain, typically only 3-5 days with light showers possible. Mostly sunny and pleasant.",
                "general_tips": "Pack layers suitable for warm days and slightly cooler evenings (t-shirts, light trousers/shorts, a light jacket/sweater). Sunscreen and sunglasses essential. Comfortable walking shoes."
            },
            "tourism_level": {
                "crowds": "Moderate. Noticeably busier than April, especially around Labour Day (May 1st) if it creates a long weekend.",
                "pricing": "Shoulder to high season prices. Booking ahead advised.",
                "overall_atmosphere": "Pleasant, vibrant spring/early summer feel. Ideal weather for being outdoors. City feels lively but not overcrowded."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (Dia do Trabalhador)",
                    "date": "May 1",
                    "description": "Public holiday. Quiet day, some union events possible. Locals often head to the beach or countryside.",
                    "notes": "Public holiday: Banks, schools, many shops closed. Tourist attractions usually open. Holiday transport schedule."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Beach Time at Praia de Faro",
                    "where": "Faro beach peninsula",
                    "description": "Enjoy the sunshine and gradually warming sea on Faro's main beach. Relax, sunbathe, walk along the shore, and try beachfront cafes.",
                    "practical_tips": "Accessible by bus (No. 16) or car (parking starts getting busier). Water still cool for some.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport cost) + extras",
                    "weather_dependent": true
                },
                {
                    "activity": "Boat Trip in Ria Formosa",
                    "where": "Departs Faro marina",
                    "description": "Take a scenic boat tour through the lagoon's channels and islands. Spot birdlife, see shellfish farms, and enjoy the views.",
                    "practical_tips": "Various tour lengths and types available (island stops, nature focused). Book ahead for popular tours. Bring sun protection.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Faro Old Town (Cidade Velha)",
                    "where": "Inside the city walls",
                    "description": "Wander the charming historic center in pleasant weather. Visit the Cathedral, Arco da Vila, municipal museum, and enjoy the atmosphere.",
                    "practical_tips": "Ideal temperatures for walking exploration. Fewer crowds than summer.",
                    "best_time": "Morning / Late Afternoon",
                    "estimated_cost": "Low (museum/cathedral entry)",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll along Faro Marina",
                    "where": "Near Jardim Manuel Bivar",
                    "description": "Enjoy a leisurely walk around the marina, looking at boats and enjoying the waterfront cafes and restaurants.",
                    "practical_tips": "Connects easily to the Baixa (downtown) and Old Town. Pleasant spot for evening drinks.",
                    "best_time": "Late Afternoon / Evening",
                    "estimated_cost": "Free (drinks/food extra)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "24°C",
                    "low": "15°C"
                },
                "precipitation": "Extremely low chance of rain. Days are consistently sunny and warm, feeling like early summer.",
                "general_tips": "Summer clothing (shorts, t-shirts, dresses) appropriate. High SPF sunscreen essential. Stay hydrated."
            },
            "tourism_level": {
                "crowds": "Moderate to High. Continues to build towards peak season. Weekends noticeably busier.",
                "pricing": "High season pricing becomes more standard. Book well in advance.",
                "overall_atmosphere": "Established early summer vibe. Perfect weather for beaches and outdoor activities. Lively evenings."
            },
            "events_holidays": [
                 {
                    "name": "FIA - Feira Internacional do Algarve (Algarve International Fair - sometimes)",
                    "date": "Check dates (often later, June/July)",
                    "description": "Large regional fair sometimes held in late May/June near Faro (Estoi), showcasing crafts, agriculture, industry, gastronomy, and entertainment.",
                    "notes": "Check specific dates and location annually as it varies."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Ilha Deserta",
                    "where": "Ferry from Faro",
                    "description": "Take a ferry to the Algarve's most pristine barrier island. Enjoy miles of untouched beach, boardwalks through dunes, and clear waters.",
                    "practical_tips": "Bring everything you need (water, shade, snacks) or use the island's single (pricier) restaurant. Ferry schedules increase in frequency.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate (ferry cost)",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Tavira",
                    "where": "East of Faro (train/bus)",
                    "description": "Explore the charming town of Tavira with its Gilão River, Roman bridge, churches, and consider taking the ferry to Ilha de Tavira beach.",
                    "practical_tips": "Easy and scenic train journey. Ilha de Tavira offers long sandy beaches and beach bars.",
                    "best_time": "Full Day",
                    "estimated_cost": "Low to Moderate (transport + ferry + food)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Outdoor Dining in Baixa/Old Town",
                    "where": "Downtown Faro & Cidade Velha",
                    "description": "Enjoy dinner or drinks at one of the many restaurants with outdoor seating in the pleasant evening temperatures.",
                    "practical_tips": "Popular spots can get busy, especially on weekends. Explore different streets for variety.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Hiking/Walking Trails",
                    "where": "Ecovia Litoral, Ria Formosa trails, Barrocal region",
                    "description": "Take advantage of the excellent weather for walking. Explore coastal paths (Ecovia Litoral sections) or trails with blooming flowers inland.",
                    "practical_tips": "Start early to avoid midday heat. Bring water and sun protection. Research specific trail routes.",
                    "best_time": "Morning / Late Afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}