{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Easter Markets",
                "details": "Traditional Czech Easter markets in Old Town Square featuring local crafts, Easter decorations, and seasonal treats like mazanec (Easter bread)."
            },
            {
                "reason": "Spring Mountain Views",
                "details": "Ještěd Mountain offers spectacular spring views as snow melts and the landscape awakens, perfect for hiking and photography."
            },
            {
                "reason": "Botanical Garden Bloom",
                "details": "Liberec Botanical Garden comes alive with spring flowers and the butterfly house is at peak activity, creating a beautiful natural escape."
            },
            {
                "reason": "Perfect Weather",
                "details": "Mild temperatures (8-16°C) and increasing sunshine make April ideal for outdoor activities and exploring the city's parks and mountain trails."
            },
            {
                "reason": "Cultural Events",
                "details": "Spring cultural events and exhibitions at the Regional Gallery and Liberec Castle showcase local art and history."
            }
        ],
        "reasons_to_avoid": [
            {
                "reason": "Spring Showers",
                "details": "April can bring frequent rain showers requiring flexible outdoor planning and rain gear, especially for mountain activities."
            },
            {
                "reason": "Easter Crowds",
                "details": "Easter markets and celebrations can be very crowded, especially on weekends and holidays."
            },
            {
                "reason": "Price Increases",
                "details": "Accommodation and dining prices begin rising as tourist season approaches."
            }
        ],
        "weather": {
            "temperature_range": "4°C to 16°C (39°F to 61°F)",
            "rainfall": "Moderate to high",
            "snow": "Rare, possible on Ještěd Mountain",
            "daylight_hours": "13-14 hours"
        },
        "activities": [
            "Easter market shopping and traditional celebrations",
            "Ještěd Mountain hiking and cable car rides",
            "Botanical garden visits",
            "Regional Gallery exhibitions",
            "Harcov reservoir walks",
            "Liberec Castle cultural events",
            "Outdoor café culture returns",
            "Spring photography tours"
        ],
        "special_events": [
            {
                "event": "Easter Markets",
                "dates": "Late March through April",
                "location": "Old Town Square",
                "description": "Traditional Czech Easter markets with crafts, decorations, and local food"
            },
            {
                "event": "Easter Celebrations",
                "dates": "Variable (Easter Sunday)",
                "location": "Citywide",
                "description": "Traditional Czech Easter traditions including egg painting and willow whipping (pomlázka)"
            },
            {
                "event": "Spring Cultural Festival",
                "dates": "Throughout April",
                "location": "Various venues",
                "description": "Cultural events and exhibitions celebrating spring and local traditions"
            }
        ],
        "local_tips": [
            "Visit Easter markets early in the morning to avoid crowds",
            "Check weather before planning mountain activities on Ještěd",
            "Book restaurants in advance during Easter period",
            "Combine Ještěd Tower visit with Easter market shopping",
            "Don't miss the butterfly house at the Botanical Garden",
            "Try traditional Easter bread (mazanec) at local bakeries"
        ]
    }
}