{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather & Long Days",
                "details": "May often brings delightful, mild spring weather (avg highs ~20°C/68°F) with significantly longer daylight hours, perfect for exploring Basel's Altstadt, strolling the Rhine promenade, and enjoying parks."
            },
            {
                "reason": "Parks & Gardens in Bloom",
                "details": "Experience Basel's green spaces like the University Botanical Garden, Merian Gärten, and Kannenfeldpark coming alive with spring colours and vibrant blooms."
            },
            {
                "reason": "Outdoor Cafes & Rhine Ambiance",
                "details": "Terraces ('Terrassen') at cafes and restaurants flourish, especially in Marktplatz, Barfüsserplatz, and along the Rhine. Riverside 'Buvetten' (seasonal bars) start opening."
            },
            {
                "reason": "Shoulder Season Before Peak Crowds",
                "details": "Enjoy Basel's world-class museums (Kunstmuseum, Fondation Beyeler, Tinguely), the Minster, and Altstadt charm with fewer tourists than in July/August."
            },
            {
                "reason": "Ideal for Excursions & Outdoor Activities",
                "details": "Comfortable temperatures for cycling along the Rhine, walking through the Old Town, or taking day trips to nearby Alsace (France) or the Black Forest (Germany)."
            },
            {
                "reason": "Rhine Ferries & Promenade Life",
                "details": "The four 'Fähri' Rhine ferries operate frequently, offering charming cross-river trips. The Rhine promenade becomes a popular spot for walking, relaxing, and socializing."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather",
                "details": "May can still be unpredictable, with potential for rainy days, cooler spells, or afternoon thunderstorms interrupting outdoor plans."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May sees a noticeable increase in tourism. Expect more people at key sites (especially museums) and rising prices for flights/accommodation as summer approaches."
            },
            {
                "reason": "Public Holidays Impact",
                "details": "May 1st (Labour Day) and Ascension Day (Jeudi de l'Ascension - variable date) are public holidays with widespread shop closures affecting shopping and some services."
            },
            {
                "reason": "Pollen Season Peaks",
                "details": "Grass pollen levels are often high in May, potentially causing discomfort for allergy sufferers spending time outdoors in parks or along the Rhine."
            },
            {
                "reason": "Rhine Water Still Very Cold",
                "details": "Despite warmer air temperatures, the Rhine's water is generally far too cold for comfortable swimming for most people in May (swimming season usually starts June/July)."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C (66°F)",
                    "low": "8°C (46°F)"
                },
                "precipitation": "Mix of sunny, pleasant spring days and periods of rain or showers. Still potential for cooler days, especially early May.",
                "general_tips": "Pack layers: t-shirts, sweaters, a light to medium-weight jacket (waterproof useful), comfortable walking shoes. Sunscreen, sunglasses needed for sunny days. Allergy medication if needed."
            },
            "tourism_level": {
                "crowds": "Moderate and increasing. Busy around May 1st holiday and potentially Ascension Day if early. More relaxed than summer.",
                "pricing": "Shoulder/High season prices begin. Book ahead, especially around public holidays or if large conferences are scheduled.",
                "overall_atmosphere": "City bursts into spring colours. Parks are beautiful. Outdoor cafe culture thrives. May 1st brings closures/demonstrations."
            },
            "events_holidays": [
                {
                    "name": "Labour Day (Tag der Arbeit)",
                    "date": "May 1",
                    "description": "Public holiday. Expect potential demonstrations. Widespread closures of shops, banks, offices.",
                    "notes": "Check opening hours for museums/attractions (many open). Public transport usually runs normally."
                },
                 {
                    "name": "Ascension Day (Auffahrt / Jeudi de l'Ascension)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday creating a long weekend for many. Shops closed.",
                    "notes": "Check date for the year. Attractions usually open. Can be a busy travel weekend."
                },
                 {
                    "name": "Potential Basel Museum Night (Museumsnacht)",
                    "date": "Sometimes a Friday in May (Check exact dates!)",
                    "description": "Many Basel museums open late with special programs, workshops, music, and food, usually for a single entry fee ('Kulturpass').",
                    "notes": "Date varies yearly! Often January, but sometimes May. Check official program ('Museumsnacht Basel'). Very popular."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the Altstadt (Grossbasel & Kleinbasel)",
                    "where": "Both sides of the Rhine",
                    "description": "Wander the historic streets, admire the architecture, visit the Basel Minster (climb towers for views), see the Rathaus (Town Hall), and browse unique shops.",
                    "practical_tips": "Wear comfortable shoes for cobblestones. Kleinbasel offers trendy shops/cafes; Grossbasel has more historical sites.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking) to Moderate/High (dining/shopping/Minster towers)",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll Through the University Botanical Garden",
                    "where": "Near Spalentor",
                    "description": "Enjoy the diverse plant collections in Basel's historic botanical garden, showcasing spring blooms outdoors and varied climates in the greenhouses.",
                    "practical_tips": "Free entry. A peaceful escape. Greenhouses offer shelter if it rains.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Kunstmuseum Basel",
                    "where": "Grossbasel, near Rhine",
                    "description": "Explore Switzerland's largest public art collection, spanning Old Masters to modern art, in its impressive main building and Neubau extension.",
                    "practical_tips": "Allow several hours. Check opening times (closed Mondays). Book tickets online potentially.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Take a Fähri Across the Rhine",
                    "where": "Four crossing points: St. Alban, Münster, Klingental, St. Johann",
                    "description": "Enjoy a charming, short ride on a traditional current-powered ferry, offering unique perspectives of the city skyline from the water.",
                    "practical_tips": "Small cash fee required. A relaxing way to cross between Grossbasel and Kleinbasel.",
                    "best_time": "Daylight hours",
                    "estimated_cost": "Very Low",
                    "weather_dependent": true
                 }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "21°C (70°F)",
                    "low": "10°C (50°F)"
                },
                "precipitation": "Often features more stable, warm, and sunny weather, feeling like early summer. However, afternoon showers or thunderstorms remain possible.",
                "general_tips": "Likely need lighter clothing (t-shirts, light trousers/shorts), but keep a sweater/light jacket for evenings/cooler days. Sun protection essential."
            },
            "tourism_level": {
                "crowds": "High season feeling develops. Busy, especially on sunny weekends and around any late public holidays.",
                "pricing": "High season prices generally apply. Advance booking for accommodation strongly recommended.",
                "overall_atmosphere": "Beautiful late spring/early summer. Ideal conditions for enjoying the Rhine banks, parks, and outdoor dining. Vibrant city life."
            },
            "events_holidays": [
                 {
                    "name": "Ascension Day (Auffahrt / Jeudi de l'Ascension)",
                    "date": "Varies (Thursday, 40 days after Easter - often late May)",
                    "description": "Public holiday creating a long weekend for many. Shops closed.",
                    "notes": "Check date for the year. Attractions usually open. Can be a busy travel weekend."
                 },
                 {
                    "name": "Whit Monday (Pfingstmontag) (Potential Timing)",
                    "date": "Varies (50 days after Easter - often late May/early June)",
                    "description": "Public holiday. Widespread shop closures.",
                    "notes": "Check date for the year. Attractions typically open."
                 },
                 {
                    "name": "Merian Gärten in Full Bloom",
                    "date": "Late May onwards",
                    "description": "Visit the expansive Merian Gärten in Brüglingen to see impressive collections of irises, peonies, roses, and more reaching their peak.",
                    "notes": "Accessible by tram. A beautiful large park south of the city."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Visit Fondation Beyeler",
                    "where": "Riehen (short tram ride)",
                    "description": "Explore the world-class modern and contemporary art collection in Renzo Piano's stunning building, set within a beautiful park.",
                    "practical_tips": "Allow 2-3 hours plus travel. Check opening hours. Combine with a walk in the park.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate-High (entry fee)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Relax at a Rhine Buvette",
                    "where": "Various locations along the Kleinbasel Rhine promenade",
                    "description": "Enjoy drinks and snacks at one of the seasonal riverside kiosks ('Buvetten'), soaking up the sun and atmosphere as locals do.",
                    "practical_tips": "Casual atmosphere. Opening times weather-dependent. Great people-watching spots.",
                    "best_time": "Sunny afternoons / Evenings",
                    "estimated_cost": "Low to Moderate",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Explore the Tinguely Museum",
                    "where": "Solitude Park, Kleinbasel",
                    "description": "Discover the playful and fascinating kinetic sculptures of Swiss artist Jean Tinguely in a dedicated museum by the Rhine.",
                    "practical_tips": "Interactive exhibits. Allow 1-2 hours. Combine with a walk in Solitude Park.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Day Trip to Alsace or Black Forest",
                    "where": "Nearby regions in France / Germany",
                    "description": "Take advantage of Basel's location for a day trip. Explore charming French villages like Colmar or Eguisheim, or hike/visit towns in Germany's Black Forest.",
                    "practical_tips": "Easily accessible by train or car. Plan your route and check transport schedules.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate to High (transport, food)",
                    "weather_dependent": true
                 }
            ]
        }
    }
}