{
    "Spring": {
        "activities": [
            {
                "name": "Marché aux Fleurs",
                "type": "Market",
                "description": "Explore the vibrant flower markets that bloom across Toulouse in spring, particularly at Place du Capitole and Saint-Aubin, offering a stunning variety of plants, flowers, and gardening accessories.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring transforms Toulouse's markets with colorful displays of regional blooms, potted plants, and garden accessories. The Saint-Aubin Sunday market is particularly spectacular.",
                "booking_tips": "No booking required. Visit early morning (before 10am) for the freshest selection and to avoid crowds, especially on Sundays."
            },
            {
                "name": "Canal du Midi Cycling Tour",
                "type": "Outdoor Activity",
                "description": "Discover the UNESCO-listed Canal du Midi by bicycle during its most beautiful season, when the historic plane trees lining the waterway burst into fresh greenery and wildflowers bloom along the banks.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers perfect temperatures and lush scenery for cycling this historic waterway, with fewer tourists than summer months.",
                "booking_tips": "Rent bicycles from VélôToulouse stations throughout the city or from private rental shops near Port Saint Sauveur for longer rides. Consider a guided historical tour through the tourism office."
            },
            {
                "name": "Toulouse International Fair",
                "type": "Exhibition",
                "description": "Experience this major springtime event at the Parc des Expositions featuring hundreds of exhibitors showcasing regional products, home innovations, international cuisine, and cultural presentations.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "This April event attracts over 100,000 visitors with themed exhibition areas, demonstrations, and entertainment throughout the expansive exhibition center.",
                "booking_tips": "Purchase tickets online to avoid entrance lines. Weekday visits are significantly less crowded than weekends. Check the program for specialty days focused on particular themes."
            },
            {
                "name": "Jardin des Plantes & Jardin Royal",
                "type": "Park",
                "description": "Wander through Toulouse's historic botanical gardens during peak bloom season, when thousands of plant species, including exotic collections and regional flora, create spectacular displays of color and fragrance.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings magnificent blooms to these connected 18th and 19th-century gardens, with the Japanese cherry trees, magnolias, and bulb collections creating particularly impressive displays.",
                "booking_tips": "No booking required. The gardens are less crowded on weekday afternoons. Visit the Natural History Museum within the same complex for a combined experience."
            },
            {
                "name": "Rio Loco Festival",
                "type": "Festival",
                "description": "Celebrate world music and culture at this vibrant festival held along the Garonne River, featuring international musicians, cultural exhibitions, food stalls, and art installations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This June festival transforms the Prairie des Filtres park into a global celebration with multiple stages and performances spanning several days.",
                "booking_tips": "Purchase tickets in advance for headline performances. Many peripheral activities and smaller stages are free to access. Bring a blanket for seating on the grass areas."
            },
            {
                "name": "Toulouse Food Tours",
                "type": "Food & Drink",
                "description": "Discover Toulouse's culinary heritage through guided food walks featuring seasonal spring specialties, market visits, and tastings at traditional and innovative food establishments.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring tours highlight seasonal delicacies like fresh asparagus, spring garlic, early strawberries, and young regional cheeses that aren't available other times of year.",
                "booking_tips": "Book at least one week in advance through the tourism office or specialized culinary tour companies. Tours focusing on the Victor Hugo Market are especially popular."
            },
            {
                "name": "Japanese Garden Cherry Blossoms",
                "type": "Park",
                "description": "Experience the breathtaking cherry blossom season at Toulouse's Japanese Garden in Compans Caffarelli park, one of the largest authentic Japanese gardens in France.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Late March to early April brings spectacular pink and white blossoms to this meticulously designed garden, creating a peaceful oasis of Japanese springtime traditions.",
                "booking_tips": "No booking required. Early morning visits offer the best light for photography and quieter conditions for contemplation. Cherry blossom viewing is weather-dependent and lasts only 1-2 weeks."
            },
            {
                "name": "Marathon International de Toulouse Métropole",
                "type": "Sporting Event",
                "description": "Join or watch this major spring running event that takes participants through Toulouse's most beautiful districts, historic sites, and along the Garonne River and Canal du Midi.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "This April event includes various distance options from 10K to full marathon, with the pleasant spring temperatures ideal for both runners and spectators.",
                "booking_tips": "Register months in advance if participating as a runner. Spectators need no tickets but should check the route map to find good viewing locations, particularly near Place du Capitole and the finish line."
            },
            {
                "name": "Toulouse Craft Beer Festival",
                "type": "Food & Drink",
                "description": "Sample creations from dozens of regional and international craft breweries at this spring festival celebrating the booming artisanal beer scene in southwestern France.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring editions often feature seasonal beer varieties utilizing fresh local ingredients and lighter styles perfect for warming weather.",
                "booking_tips": "Purchase tickets online at least two weeks before the event as they frequently sell out. VIP tickets offer early entry and special tastings but cost significantly more."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Toulouse Plages",
                "type": "Beach",
                "description": "Enjoy this urban beach installation along the Garonne River featuring imported sand, loungers, palm trees, water activities, and cultural performances throughout the summer months.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "From mid-July to late August, the Prairie des Filtres park transforms into a beach destination with swimming pools, sports areas, and evening concerts.",
                "booking_tips": "No booking required. Arrive early to secure loungers on weekends. Evening cultural events sometimes require free ticket reservations available online."
            },
            {
                "name": "Fête Nationale Fireworks",
                "type": "Festival",
                "description": "Experience Toulouse's spectacular Bastille Day celebrations with one of France's largest and most impressive pyrotechnic displays launched over the Garonne River.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "July 14th traditions include military parades, firefighter balls, and a massive coordinated fireworks show synchronized to music that lights up the city's historic bridges and riverfront.",
                "booking_tips": "Arrive several hours early to secure prime viewing spots along the river banks or on the Pont Saint-Pierre. The Prairie des Filtres offers good viewing with more space."
            },
            {
                "name": "Violon sur le Sable",
                "type": "Concert",
                "description": "Attend free classical and contemporary music concerts at the riverside urban beach, where professional orchestras perform against the backdrop of the Garonne River and historic Toulouse.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This summer concert series combines classical music with accessible programming in the relaxed atmosphere of Toulouse Plages during July and August.",
                "booking_tips": "No formal booking required. Bring a blanket or beach towel for seating on the sand. Arrive at least an hour before performances for good viewing positions."
            },
            {
                "name": "Night Market at Victor Hugo",
                "type": "Market",
                "description": "Experience the lively summer night markets at Place Victor Hugo, where food stalls, local producers, craftspeople, and musicians create a festive evening atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "These Thursday evening markets from June through September transform the area around the daytime covered market into an open-air festival of food and culture.",
                "booking_tips": "No booking required. Food stands can have long lines; arrive early (around 6-7pm) to avoid the biggest crowds. Bring cash as not all vendors accept cards."
            },
            {
                "name": "Garonne River Cruise",
                "type": "Boat Tour",
                "description": "Cruise the Garonne River on traditional flat-bottomed boats, experiencing Toulouse from a unique water perspective while learning about the city's relationship with its river through the centuries.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evening cruises offer relief from the heat and beautiful views of the sunset reflected on Toulouse's distinctive pink buildings along the waterfront.",
                "booking_tips": "Book at least one day in advance through the tourism office or directly with operators like Bateaux Toulousains. Sunset cruises are most popular and often sell out."
            },
            {
                "name": "Siestes Électroniques",
                "type": "Festival",
                "description": "Experience this unique electronic music festival held in the gardens of the Natural History Museum, featuring experimental sounds, ambient music, and avant-garde performances in a laid-back outdoor setting.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This June festival encourages listeners to relax on the grass while experiencing cutting-edge electronic music in the historic botanical garden setting.",
                "booking_tips": "No booking required. Bring a blanket or mat for comfortable listening. The event may relocate indoors in case of rain."
            },
            {
                "name": "Tangopostale",
                "type": "Festival",
                "description": "Immerse yourself in the passionate world of Argentine tango at this international festival featuring performances, workshops, outdoor milongas (dance events), and concerts throughout Toulouse.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This early July festival transforms various venues across Toulouse into tango spaces, with outdoor dancing along the Garonne being a highlight of summer evenings.",
                "booking_tips": "Register online for workshops well in advance. Many outdoor milongas are free, but indoor performances require tickets purchased through the festival website."
            },
            {
                "name": "Open-Air Cinema at Cité de l'Espace",
                "type": "Cinema",
                "description": "Watch space-themed films under the stars at Toulouse's space museum, with the massive Ariane rocket and space exhibits creating a dramatic backdrop for evening screenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer screenings combine science fiction classics with documentaries and new releases related to space exploration, taking advantage of warm evenings and dark skies.",
                "booking_tips": "Book tickets online as these special events often sell out. Bring warm layers as temperatures can drop even on summer nights. Some screenings include access to exhibits."
            },
            {
                "name": "31 Notes d'Été",
                "type": "Concert",
                "description": "Follow this traveling summer festival that brings free concerts, theatrical performances, and cultural activities to historic sites and picturesque villages throughout the Haute-Garonne department.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This August festival presents diverse musical styles in exceptional heritage settings both in Toulouse and surrounding communities, often accompanied by local food and wine tastings.",
                "booking_tips": "No booking required for most performances. Check the festival program online for complete schedule. Performances in smaller villages offer the most authentic regional experience."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Piano aux Jacobins",
                "type": "Festival",
                "description": "Experience world-class piano performances in the stunning setting of the 13th-century Jacobins Convent, known for its remarkable palm tree-like column and extraordinary acoustics.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "This September festival attracts internationally renowned pianists and emerging talents for recitals in the convent's remarkable interior, with acoustics perfectly suited to solo piano.",
                "booking_tips": "Purchase tickets at least one month in advance for popular performers. The central 'palm tree' column creates unique acoustics throughout the space with no bad seats."
            },
            {
                "name": "Toulouse d'Été Wine Harvest",
                "type": "Excursion",
                "description": "Participate in wine tourism experiences in the nearby Fronton wine region during the autumn harvest, with vineyard tours, grape picking opportunities, and tastings of the distinctive local Négrette grape variety.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September and October bring the excitement of grape harvest to vineyards just 30 minutes from Toulouse, with special events and behind-the-scenes access during this crucial time.",
                "booking_tips": "Book vineyard experiences through the Toulouse tourism office or contact wineries directly at least two weeks in advance. Some offer harvest participation with advance reservation."
            },
            {
                "name": "Festival Toulouse les Orgues",
                "type": "Festival",
                "description": "Discover the magnificent historic organs of Toulouse through this festival featuring concerts, masterclasses, and behind-the-scenes access to instruments normally closed to the public.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This October festival celebrates Toulouse's exceptional heritage of historic pipe organs, with performances in the city's most beautiful churches and cathedrals.",
                "booking_tips": "Purchase tickets for popular venues like the Basilique Saint-Sernin well in advance. Some lunchtime recitals offer free entry but arrive early to secure seating."
            },
            {
                "name": "Marché au Gras",
                "type": "Market",
                "description": "Visit traditional 'fat markets' that begin in autumn, showcasing the finest foie gras, duck confit, and other southwestern French delicacies as the region prepares for the festive season.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Starting in October, these specialized markets highlight the gastronomic traditions of the region, with producers offering tastings and explaining traditional preparation methods.",
                "booking_tips": "No booking required. The Victor Hugo Market hosts special foie gras events on weekend mornings. Come hungry and prepared to sample regional specialties."
            },
            {
                "name": "Cartoon Forum",
                "type": "Festival",
                "description": "Discover Europe's premier animation event where new cartoon projects are pitched to industry professionals, with public screenings, exhibitions, and animation-related activities throughout Toulouse.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free-Budget",
                "seasonal_notes": "This September event transforms Toulouse into the European capital of animation, reflecting the city's important role in the animation industry.",
                "booking_tips": "Industry professionals must register in advance, but many public screenings and exhibitions are free or low cost. Check the website for program details."
            },
            {
                "name": "Jardin des Plantes Autumn Colors",
                "type": "Park",
                "description": "Experience the spectacular fall foliage in Toulouse's historic botanical garden, when ancient specimens of maple, oak, and exotic trees create a tapestry of autumn colors.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "October and November bring golden and crimson hues to this 200-year-old garden, with special seasonal plantings and mushroom exhibitions at the adjacent Natural History Museum.",
                "booking_tips": "No booking required. Weekday visits offer a more tranquil experience. Photography is best in the late afternoon when the low sunlight illuminates the colorful leaves."
            },
            {
                "name": "Festival Occitania",
                "type": "Festival",
                "description": "Celebrate the cultural heritage of Occitanie through this festival featuring traditional music, dance, crafts, language workshops, and gastronomic events throughout Toulouse.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free-Budget",
                "seasonal_notes": "This October festival highlights the distinct regional identity of Toulouse and its surroundings, with events exploring both historic traditions and contemporary expressions of Occitan culture.",
                "booking_tips": "Most street performances and exhibitions are free. Ticketed concerts should be booked in advance through the festival website or tourist office."
            },
            {
                "name": "Toulouse Game Show",
                "type": "Convention",
                "description": "Immerse yourself in pop culture at this major gaming, anime, manga, and sci-fi convention featuring celebrity guests, cosplay competitions, gaming tournaments, and exclusive merchandise.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "This November event at the Parc des Expositions attracts tens of thousands of fans with exhibitors, workshops, and performances spanning all aspects of gaming and geek culture.",
                "booking_tips": "Purchase tickets online to avoid entrance lines. VIP packages for celebrity access sell out quickly. Consider multi-day passes for the complete experience."
            },
            {
                "name": "Festival Cinéma d'Automne",
                "type": "Festival",
                "description": "Discover international and independent films at this autumn film festival featuring screenings, director discussions, and cinematography workshops across various Toulouse venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "This November festival brings thought-provoking cinema from around the world to Toulouse's historic and modern theaters, with a focus on emerging filmmakers and artistic innovation.",
                "booking_tips": "Purchase festival passes for the best value or tickets for individual screenings. Events featuring director Q&As tend to sell out first."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Marché de Noël du Capitole",
                "type": "Market",
                "description": "Experience the magic of Toulouse's Christmas Market in Place du Capitole, featuring wooden chalets selling artisanal gifts, regional foods, mulled wine, and festive decorations against the backdrop of the illuminated Capitole building.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "From late November through December, the market transforms the heart of Toulouse with twinkling lights, seasonal aromas, and holiday music creating a festive atmosphere.",
                "booking_tips": "No booking required. Visit on weekday evenings for a less crowded experience. The market is most magical after dark when all the lights are glowing."
            },
            {
                "name": "Festival des Lanternes",
                "type": "Festival",
                "description": "Marvel at hundreds of monumental Chinese lantern sculptures illuminating winter nights at this spectacular festival that has become one of the region's most popular winter events.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This December-February event transforms the Toulouse region with hand-crafted silk lanterns creating magical light displays, accompanied by Chinese cultural performances.",
                "booking_tips": "Purchase tickets online in advance to avoid lines. Visit on weeknights rather than weekends for smaller crowds. Allow at least two hours to see all displays."
            },
            {
                "name": "Violon sur le Zinc",
                "type": "Concert",
                "description": "Warm up in Toulouse's historic cafés and bars with this winter festival bringing classical musicians into intimate venues for accessible performances paired with food and drink.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This January festival creates a cozy cultural experience during the coldest month, with string quartets, solo performers, and small ensembles in unconventional, intimate settings.",
                "booking_tips": "Book tickets for specific venues in advance as seating is limited. Some performances include food and drink in the ticket price, while others require separate purchase."
            },
            {
                "name": "Patinoire du Capitole",
                "type": "Outdoor Activity",
                "description": "Glide across the ice at Toulouse's winter skating rink installed in Place du Capitole, surrounded by the city's magnificent architecture and festive decorations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "From December through early January, this temporary rink offers winter recreation in the heart of the usually mild southern city, with special themed skating sessions and music nights.",
                "booking_tips": "No advance booking needed. Skate rental is included in the entry fee. Weekday mornings offer the least crowded experience for beginners."
            },
            {
                "name": "Détours de Chant",
                "type": "Festival",
                "description": "Discover French chanson and contemporary singer-songwriters at this winter festival featuring intimate concerts, musical discoveries, and vocal innovations across various Toulouse venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget-Moderate",
                "seasonal_notes": "This late January-early February festival celebrates the rich tradition of French song, with performances ranging from traditional chanson to experimental vocal arts.",
                "booking_tips": "Book tickets for individual performances through the festival website. Some smaller venue shows sell out quickly, so reserve well in advance for popular artists."
            },
            {
                "name": "Cassoulet Cooking Workshop",
                "type": "Workshop",
                "description": "Learn to prepare authentic Toulouse cassoulet, the iconic southwestern French winter dish, through hands-on cooking classes taught by local chefs using traditional methods and ingredients.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is the perfect season to master this hearty bean and meat stew that defines Toulouse cuisine, with classes focusing on both traditional and modern interpretations.",
                "booking_tips": "Book at least two weeks in advance through cooking schools like L'Atelier de Cuisine or Chef Simon. Classes typically include wine pairing and a full meal enjoying your creation."
            },
            {
                "name": "Musée des Augustins Winter Collection",
                "type": "Museum",
                "description": "Experience special winter exhibitions and extended evening hours at Toulouse's fine arts museum housed in a former medieval monastery, offering a warm cultural refuge on cold days.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter brings focused exhibitions highlighting different aspects of the museum's extensive collection, with the medieval cloisters and Gothic church particularly atmospheric during this season.",
                "booking_tips": "No advance booking required for general admission. Special exhibitions or guided tours may require separate tickets. Free entry on the first Sunday of each month."
            },
            {
                "name": "Toulouse Rugby Match",
                "type": "Sporting Event",
                "description": "Experience the passion of French rugby by attending a Stade Toulousain home game at Ernest Wallon Stadium, supporting one of Europe's most successful rugby clubs in their legendary red and black colors.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "The winter months feature crucial Top 14 and European Champions Cup matches, with the excitement of the games warming up even the coldest days.",
                "booking_tips": "Purchase tickets well in advance through the club website as games frequently sell out, especially for major European fixtures or matches against rival teams."
            },
            {
                "name": "Carnival of Toulouse",
                "type": "Festival",
                "description": "Participate in Toulouse's colorful winter carnival celebrations featuring costume parades, street performances, music, traditional giant puppets, and confetti battles throughout the city center.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "This February/March event (dates vary based on the liturgical calendar) brings vibrant energy to the end of winter with distinctly Occitan carnival traditions.",
                "booking_tips": "No booking required for most activities. Check the city's event calendar for parade routes and schedules, which change annually. Wear costume elements to fully participate in the festive spirit."
            }
        ]
    }
}