{
  "neighborhoods": [
    {
      "name": "Capitole",
      "alternate_names": [
        "Centre Historique",
        "Le Capitole"
      ],
      "character": "The historic heart of Toulouse with elegant red-brick buildings, lively squares, upscale shopping, and a vibrant café culture, embodying the quintessential 'Ville Rose' (Pink City) atmosphere.",
      "location": {
        "central": true,
        "description": "Located in the very center of Toulouse, the Capitole district is characterized by its grand central square, historic administrative buildings, and a network of narrow medieval streets radiating outward.",
        "borders": [
          "Carmes",
          "Saint-Georges",
          "Arnaud Bernard",
          "Saint-Cyprien"
        ],
        "landmarks": [
          "Place du Capitole",
          "Théâtre du Capitole",
          "Basilique Saint-Sernin",
          "Hôtel d'Assézat"
        ]
      },
      "history": {
        "overview": "The historic core of Roman Tolosa and medieval Toulouse, the Capitole district has been the administrative, commercial, and cultural center of the city since ancient times, with the iconic Capitole building serving as city hall since the 12th century.",
        "significance": "Represents the historical and cultural heart of Toulouse, showcasing the distinctive pink terracotta architecture that earned the city its nickname 'La Ville Rose'.",
        "notable_events": [
          "Construction of the Capitole building beginning in the 12th century",
          "Development as a major commercial hub during the pastel trade boom in the 15th-16th centuries",
          "Renovation and expansion of Place du Capitole in the 18th-19th centuries"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro stations: Capitole, Jean-Jaurès, and Esquirol",
          "Multiple bus lines connecting to all districts",
          "Limited vehicle access with pedestrianized streets"
        ],
        "safety": "Very safe area both day and night, with frequent police presence and good lighting.",
        "best_time_to_visit": "Early morning for photography; midday for markets and shopping; evening for dining and people-watching.",
        "walkability": "Extremely walkable with many pedestrianized streets, though some narrow medieval lanes have cobblestones."
      },
      "appeal": {
        "known_for": [
          "Historic architecture",
          "Cultural institutions",
          "Café culture",
          "Upscale shopping"
        ],
        "atmosphere": [
          "Elegant",
          "Vibrant",
          "Historic",
          "Cosmopolitan"
        ],
        "best_for": [
          "First-time visitors",
          "History enthusiasts",
          "Shoppers",
          "Foodies"
        ]
      },
      "categories": {
        "touristy": 5,
        "residential": 3,
        "green_spaces": 2,
        "shopping": 5,
        "dining": 5,
        "nightlife": 4,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Place du Capitole",
            "type": "Historic square",
            "description": "Monumental central square dominated by the neoclassical Capitole building, which houses the city hall and opera house, surrounded by arcaded walkways with cafés and shops.",
            "appeal": "The iconic heart of Toulouse with impressive architecture and vibrant atmosphere."
          },
          {
            "name": "Basilique Saint-Sernin",
            "type": "Religious site",
            "description": "UNESCO-listed Romanesque basilica from the 11th-12th centuries, one of the largest remaining Romanesque churches in Europe and an important stop on the Santiago de Compostela pilgrimage route.",
            "appeal": "Architectural masterpiece with stunning Romanesque sculptures and an imposing octagonal bell tower."
          },
          {
            "name": "Hôtel d'Assézat",
            "type": "Historic building",
            "description": "Renaissance mansion built in the 16th century for a wealthy pastel merchant, now housing the Bemberg Foundation art collection with works by Bonnard, Monet, and Toulouse-Lautrec.",
            "appeal": "Magnificent example of Renaissance architecture with an elegant courtyard and significant art collection."
          }
        ],
        "dining": [
          {
            "name": "Le Bibent",
            "cuisine": "Traditional French Brasserie",
            "price_range": "€€€",
            "known_for": "Classic French cuisine in a Belle Époque setting",
            "atmosphere": "Opulent historic brasserie with ornate decor"
          },
          {
            "name": "Michel Sarran",
            "cuisine": "Gastronomic French",
            "price_range": "€€€€",
            "known_for": "Creative haute cuisine by the renowned chef and TV personality",
            "atmosphere": "Elegant and refined dining room"
          },
          {
            "name": "No. 5 Wine Bar",
            "cuisine": "Wine Bar with Gourmet Tapas",
            "price_range": "€€€",
            "known_for": "Award-winning wine selection with sophisticated small plates",
            "atmosphere": "Modern, intimate wine bar with self-service enomatic machines"
          }
        ],
        "activities": [
          {
            "name": "Shopping on Rue Saint-Rome",
            "type": "Retail experience",
            "description": "Browse this historic pedestrianized shopping street connecting Place du Capitole to Esquirol, lined with boutiques, specialty shops, and cafés.",
            "suitable_for": [
              "Shoppers",
              "Fashion enthusiasts",
              "Souvenir hunters"
            ]
          },
          {
            "name": "Capitole Cultural Tour",
            "type": "Architectural exploration",
            "description": "Discover the ornate Salle des Illustres inside the Capitole with its elaborate 19th-century murals depicting Toulouse's history.",
            "suitable_for": [
              "History buffs",
              "Art lovers",
              "Architecture enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to be in the heart of historic Toulouse with attractions at your doorstep",
        "You enjoy vibrant café culture and people-watching",
        "You prioritize access to dining, shopping, and cultural attractions"
      ],
      "avoid_if": [
        "You're sensitive to noise, as this area can be lively well into the evening",
        "You need easy parking access",
        "You prefer spacious, modern accommodations"
      ],
      "insider_tips": [
        "Visit the Capitole's grand staircase and Salle des Illustres outside of busy times (early morning or late afternoon) for a more peaceful experience.",
        "The small streets between Rue de Taur and Rue Pargaminières contain some of the district's best independent boutiques and cafés.",
        "The Victor Hugo covered market offers an exceptional food shopping experience in the morning, while the upstairs restaurants are perfect for an authentic lunch."
      ]
    },
    {
      "name": "Carmes",
      "alternate_names": [
        "Les Carmes",
        "Quartier des Carmes"
      ],
      "character": "A trendy yet historic district with a bohemian atmosphere, characterized by its vibrant market, independent boutiques, wine bars, and a perfect blend of traditional and contemporary Toulouse life.",
      "location": {
        "central": true,
        "description": "Located southeast of the Capitole in central Toulouse, Carmes is centered around its covered market and the former Carmelite monastery, with picturesque streets extending toward the Garonne River.",
        "borders": [
          "Capitole",
          "Saint-Étienne",
          "Saint-Michel"
        ],
        "landmarks": [
          "Marché des Carmes",
          "Place de la Trinité",
          "Musée des Augustins",
          "Garonne River quays"
        ]
      },
      "history": {
        "overview": "Named after the Carmelite monastery established in the 13th century, the district evolved from a religious center to a bustling commercial quarter, particularly known for its market traditions dating back to medieval times.",
        "significance": "Embodies Toulouse's transformation through the centuries while maintaining its authentic character, now representing the city's contemporary creative energy.",
        "notable_events": [
          "Establishment of the Carmelite monastery in the 13th century",
          "Development of the market tradition since medieval times",
          "Gentrification and cultural renaissance since the 1990s"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro stations: Carmes and Esquirol",
          "Several bus lines",
          "VélôToulouse bike sharing stations"
        ],
        "safety": "Generally very safe, though exercise normal urban precautions in the evening.",
        "best_time_to_visit": "Mornings for the market; afternoons for shopping; evenings for wine bars and dining.",
        "walkability": "Highly walkable neighborhood with many pedestrianized streets and pleasant walking areas along the river."
      },
      "appeal": {
        "known_for": [
          "Carmes Market",
          "Independent boutiques",
          "Wine bars and bistros",
          "Artistic atmosphere"
        ],
        "atmosphere": [
          "Trendy",
          "Authentic",
          "Bohemian",
          "Sophisticated"
        ],
        "best_for": [
          "Foodies",
          "Young professionals",
          "Cultural travelers",
          "Boutique shoppers"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 4,
        "green_spaces": 2,
        "shopping": 4,
        "dining": 5,
        "nightlife": 4,
        "cultural": 4,
        "historic": 4
      },
      "highlights": {
        "attractions": [
          {
            "name": "Marché des Carmes",
            "type": "Food market",
            "description": "Bustling covered market offering the finest fresh produce, meats, cheeses, and regional specialties, with surrounding cafés and wine bars serving market-fresh cuisine.",
            "appeal": "Authentic culinary heart of the neighborhood showcasing the best of southwestern French produce."
          },
          {
            "name": "Musée des Augustins",
            "type": "Museum",
            "description": "Fine arts museum housed in a former Augustinian monastery, featuring an impressive collection of Romanesque sculptures, Gothic art, and paintings from the 14th to 20th centuries.",
            "appeal": "Architectural treasure combining medieval religious architecture with significant art collections."
          },
          {
            "name": "Place de la Trinité",
            "type": "Historic square",
            "description": "Charming square with a Renaissance fountain, surrounded by cafés and historic buildings, embodying the relaxed Toulousain lifestyle.",
            "appeal": "Perfect spot for people-watching and experiencing local life away from main tourist flows."
          }
        ],
        "dining": [
          {
            "name": "La Compagnie Française",
            "cuisine": "Modern French",
            "price_range": "€€€",
            "known_for": "Market-inspired cuisine with creative presentation",
            "atmosphere": "Contemporary elegance in a historic setting"
          },
          {
            "name": "Les P'tits Fayots",
            "cuisine": "Innovative French",
            "price_range": "€€",
            "known_for": "Creative southwestern cuisine with excellent value",
            "atmosphere": "Intimate and welcoming"
          },
          {
            "name": "N°5 Wine Bar",
            "cuisine": "Wine Bar with Gourmet Tapas",
            "price_range": "€€-€€€",
            "known_for": "World's Best Wine Bar with extraordinary selection",
            "atmosphere": "Sophisticated yet accessible"
          }
        ],
        "activities": [
          {
            "name": "Boutique Shopping",
            "type": "Retail therapy",
            "description": "Explore the district's numerous independent boutiques offering everything from local designers to artisanal crafts and gourmet products.",
            "suitable_for": [
              "Fashion enthusiasts",
              "Gift shoppers",
              "Design lovers"
            ]
          },
          {
            "name": "Gourmet Market Experience",
            "type": "Culinary immersion",
            "description": "Visit the Marché des Carmes in the morning to observe locals shopping, sample regional specialties, and enjoy coffee or wine at surrounding establishments.",
            "suitable_for": [
              "Foodies",
              "Cultural travelers",
              "Photography enthusiasts"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want to experience authentic Toulouse life beyond the main tourist center",
        "You're a food enthusiast interested in local markets and dining",
        "You appreciate a blend of historic charm and contemporary energy"
      ],
      "avoid_if": [
        "You prefer ultra-quiet residential areas",
        "You need very easy parking or access",
        "You want primarily modern surroundings"
      ],
      "insider_tips": [
        "The upstairs of Marché des Carmes has excellent restaurants serving market-fresh ingredients - arrive before noon to secure a table without reservation.",
        "Visit the hidden courtyard of the Hôtel de Pierre (private mansion) on Rue de la Dalbade for a magnificent example of Renaissance architecture rarely seen by tourists.",
        "The narrow streets between Rue des Filatiers and the river contain some of the city's best independent fashion boutiques and concept stores."
      ]
    },
    {
      "name": "Saint-Cyprien",
      "alternate_names": [
        "Rive Gauche",
        "Left Bank"
      ],
      "character": "A vibrant, diverse district across the Garonne River from the historic center, known for its artistic community, cultural institutions, riverside parks, and increasingly trendy atmosphere while maintaining authentic local character.",
      "location": {
        "central": true,
        "description": "Located on the left bank of the Garonne River, Saint-Cyprien is the gateway to western Toulouse, connected to the historic center by the iconic Pont Neuf and other bridges.",
        "borders": [
          "Garonne River",
          "Patte d'Oie",
          "Bourrassol",
          "Croix-de-Pierre"
        ],
        "landmarks": [
          "Les Abattoirs Museum",
          "Hôpital de La Grave",
          "Pont Neuf",
          "Port Viguerie"
        ]
      },
      "history": {
        "overview": "Originally a working-class suburb outside the city walls, Saint-Cyprien developed around the 12th-century hospital of La Grave and was historically home to artisans and river workers before evolving into an artistic and multicultural neighborhood.",
        "significance": "Symbolizes Toulouse's social diversity and cultural regeneration, having transformed from a flood-prone working district to a dynamic artistic hub.",
        "notable_events": [
          "Devastating flood of 1875 which led to major reconstruction",
          "Conversion of the former slaughterhouses into the contemporary art museum in 2000",
          "Recent gentrification while maintaining social and cultural diversity"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro stations: Saint-Cyprien République and Patte d'Oie",
          "Multiple bus lines crossing to the city center",
          "VélôToulouse bike sharing stations"
        ],
        "safety": "Generally safe, though exercise normal urban precautions in the evening in less busy areas.",
        "best_time_to_visit": "Mornings for market and cafés; afternoons for museums; evenings for riverside walks and dining.",
        "walkability": "Very walkable with pleasant riverside paths and good pedestrian infrastructure."
      },
      "appeal": {
        "known_for": [
          "Contemporary art scene",
          "Riverside promenades",
          "Cultural diversity",
          "Emerging gastronomic scene"
        ],
        "atmosphere": [
          "Artistic",
          "Diverse",
          "Relaxed",
          "Up-and-coming"
        ],
        "best_for": [
          "Art enthusiasts",
          "Cultural travelers",
          "Young professionals",
          "Families"
        ]
      },
      "categories": {
        "touristy": 2,
        "residential": 5,
        "green_spaces": 4,
        "shopping": 3,
        "dining": 4,
        "nightlife": 3,
        "cultural": 5,
        "historic": 3
      },
      "highlights": {
        "attractions": [
          {
            "name": "Les Abattoirs",
            "type": "Museum",
            "description": "Contemporary art museum housed in former slaughterhouses, featuring modern and contemporary works with a focus on art from the second half of the 20th century to the present.",
            "appeal": "Important cultural institution combining industrial heritage with cutting-edge art in spacious galleries."
          },
          {
            "name": "Hôpital de La Grave",
            "type": "Historic landmark",
            "description": "Distinctive domed chapel and historic hospital complex dating from the 12th century, an emblematic landmark on the left bank skyline.",
            "appeal": "Architecturally significant complex with the recognizable copper dome visible throughout the area."
          },
          {
            "name": "Prairie des Filtres",
            "type": "Urban park",
            "description": "Large riverside park offering views of the historic center, popular for picnics, sports, and public events including summer festivals and Bastille Day celebrations.",
            "appeal": "Expansive green space providing respite from urban surroundings with panoramic city views."
          }
        ],
        "dining": [
          {
            "name": "Le Genty Magre",
            "cuisine": "Creative French",
            "price_range": "€€€",
            "known_for": "Innovative cuisine with southwestern influences",
            "atmosphere": "Intimate and refined"
          },
          {
            "name": "La Pêcherie",
            "cuisine": "Seafood",
            "price_range": "€€",
            "known_for": "Fresh fish and shellfish in casual setting",
            "atmosphere": "Bright, modern space with nautical touches"
          },
          {
            "name": "Le J'Go",
            "cuisine": "Southwestern French",
            "price_range": "€€-€€€",
            "known_for": "Quality meats from local farms and Pyrenean producers",
            "atmosphere": "Rustic-chic with farm-to-table ethos"
          }
        ],
        "activities": [
          {
            "name": "Riverbank Stroll",
            "type": "Outdoor experience",
            "description": "Walk along the landscaped banks of the Garonne for spectacular views of Toulouse's historic skyline, particularly beautiful at sunset.",
            "suitable_for": [
              "Photographers",
              "Couples",
              "Fitness enthusiasts"
            ]
          },
          {
            "name": "Saint-Cyprien Market",
            "type": "Local experience",
            "description": "Explore the neighborhood's covered market for authentic local shopping, followed by coffee at one of the surrounding cafés.",
            "suitable_for": [
              "Foodies",
              "Cultural travelers",
              "Early risers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You want an authentic Toulouse experience away from the main tourist areas",
        "You're interested in contemporary art and culture",
        "You appreciate riverside scenery and green spaces"
      ],
      "avoid_if": [
        "You want to be directly in the historic center",
        "You prefer luxury accommodations and upscale shopping",
        "You're uncomfortable in more diverse, evolving urban neighborhoods"
      ],
      "insider_tips": [
        "The small cafés around Place de l'Estrapade offer more authentic local experiences than those on the main squares.",
        "Visit the Vide-Greniers (neighborhood flea markets) frequently held at Place Lange for unique finds and local atmosphere.",
        "The riverside path provides the best sunset views of Toulouse's historic skyline - bring a camera and picnic provisions from the nearby market."
      ]
    },
    {
      "name": "Saint-Étienne",
      "alternate_names": [
        "Quartier Saint-Étienne",
        "Cathédrale"
      ],
      "character": "An elegant, upscale district with refined atmosphere, distinctive architecture, and cultural significance, centered around the imposing Cathedral of Saint-Étienne and characterized by prestigious residences, museums, and quiet sophistication.",
      "location": {
        "central": true,
        "description": "Located in the eastern part of central Toulouse, Saint-Étienne is an affluent residential and cultural district built around its namesake cathedral, featuring tree-lined boulevards and distinguished architecture.",
        "borders": [
          "Capitole",
          "Carmes",
          "Côte Pavée",
          "Jardin des Plantes"
        ],
        "landmarks": [
          "Cathédrale Saint-Étienne",
          "Musée des Augustins",
          "Jardin Royal",
          "Jardin Grand Rond"
        ]
      },
      "history": {
        "overview": "Developed around the cathedral from the Middle Ages onward, Saint-Étienne became the preferred residential area for Toulouse's aristocracy and wealthy merchants, particularly during the Renaissance and later periods, with significant religious and cultural institutions.",
        "significance": "Represents the ecclesiastical power and aristocratic legacy of Toulouse, preserving architectural heritage from various periods within a cohesive neighborhood.",
        "notable_events": [
          "Construction of the asymmetrical Cathedral beginning in the 13th century",
          "Development as an aristocratic district in the 17th-18th centuries",
          "Integration of public gardens and cultural institutions in the 19th century"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro station: François Verdier",
          "Bus lines connecting to city center",
          "VélôToulouse bike sharing stations"
        ],
        "safety": "Very safe district with low crime rates and well-maintained public spaces.",
        "best_time_to_visit": "Mornings for cathedral visits; afternoons for museums and gardens; evenings for refined dining.",
        "walkability": "Excellent walkability with wide sidewalks, parks, and pedestrian-friendly streets."
      },
      "appeal": {
        "known_for": [
          "Cathedral architecture",
          "Elegant townhouses",
          "Historic gardens",
          "Refined culture"
        ],
        "atmosphere": [
          "Sophisticated",
          "Tranquil",
          "Cultured",
          "Prestigious"
        ],
        "best_for": [
          "Architecture enthusiasts",
          "Museum visitors",
          "Garden lovers",
          "Sophisticated travelers"
        ]
      },
      "categories": {
        "touristy": 3,
        "residential": 5,
        "green_spaces": 4,
        "shopping": 3,
        "dining": 4,
        "nightlife": 2,
        "cultural": 5,
        "historic": 5
      },
      "highlights": {
        "attractions": [
          {
            "name": "Cathédrale Saint-Étienne",
            "type": "Religious site",
            "description": "Unusual cathedral featuring mismatched architectural styles due to its complex construction history, with a distinctive asymmetrical layout and magnificent rose window.",
            "appeal": "Architectural curiosity showcasing different Gothic styles and containing notable artworks and religious treasures."
          },
          {
            "name": "Jardin Royal",
            "type": "Historic garden",
            "description": "Toulouse's oldest public garden, dating from the 18th century, featuring formal French design, fountains, and mature trees in an elegant setting.",
            "appeal": "Peaceful oasis offering respite from urban surroundings in a historically significant landscape."
          },
          {
            "name": "Fondation Bemberg",
            "type": "Museum",
            "description": "Private art collection housed in the Renaissance Hôtel d'Assézat, featuring works spanning from the Renaissance to the 20th century, including paintings by Bonnard, Matisse, and Toulouse-Lautrec.",
            "appeal": "Exceptional collection in an architectural jewel, offering intimate encounters with significant artworks."
          }
        ],
        "dining": [
          {
            "name": "Le Py-r",
            "cuisine": "Gastronomic Modern French",
            "price_range": "€€€€",
            "known_for": "Michelin-starred creative cuisine with artistic presentation",
            "atmosphere": "Refined minimalist elegance"
          },
          {
            "name": "La Table d'Uzès",
            "cuisine": "Sophisticated French",
            "price_range": "€€€",
            "known_for": "Classical French techniques with modern execution",
            "atmosphere": "Elegant townhouse setting"
          },
          {
            "name": "Les Jardins de l'Opéra",
            "cuisine": "Haute Cuisine",
            "price_range": "€€€€",
            "known_for": "Refined gastronomy with regional influences",
            "atmosphere": "Classic luxury with garden terrace"
          }
        ],
        "activities": [
          {
            "name": "Historic Architecture Tour",
            "type": "Self-guided exploration",
            "description": "Discover the neighborhood's impressive hôtels particuliers (private mansions), featuring ornate doorways, hidden courtyards, and distinctive Toulousain brick architecture.",
            "suitable_for": [
              "Architecture enthusiasts",
              "History buffs",
              "Photographers"
            ]
          },
          {
            "name": "Garden Circuit",
            "type": "Leisurely stroll",
            "description": "Connect the district's elegant public gardens - Jardin Royal, Grand Rond, and Jardin des Plantes - for a green respite in the heart of the city.",
            "suitable_for": [
              "Nature lovers",
              "Families",
              "Relaxation seekers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You appreciate quiet sophistication and elegant surroundings",
        "You're interested in cultural attractions and historic architecture",
        "You prefer upscale residential areas with proximity to gardens"
      ],
      "avoid_if": [
        "You're seeking vibrant nightlife and entertainment",
        "You prefer contemporary, trendy environments",
        "You're on a tight budget"
      ],
      "insider_tips": [
        "Visit the Cathedral in the late afternoon when the light through the rose window is most spectacular.",
        "Explore the smaller streets around Rue Croix-Baragnon for boutique shopping in historic settings without the crowds of the city center.",
        "The tranquil Jardin Royal is often overlooked by tourists but offers a perfect spot for a midday break between sightseeing."
      ]
    },
    {
      "name": "Minimes-Barrière de Paris",
      "alternate_names": [
        "Les Minimes",
        "Barrière de Paris"
      ],
      "character": "A diverse, working-class district north of the center, undergoing gradual transformation with a mix of historic features, residential areas, multicultural influences, and emerging creative spaces.",
      "location": {
        "central": false,
        "description": "Located in the northern part of Toulouse, this primarily residential district stretches from the Canal du Midi northward, with distinct sub-neighborhoods including the historic Minimes area and the more industrial Barrière de Paris.",
        "borders": [
          "Canal du Midi",
          "Sept Deniers",
          "Bonnefoy",
          "Lalande"
        ],
        "landmarks": [
          "Canal du Midi",
          "Église des Minimes",
          "Place des Minimes",
          "Cité Madrid"
        ]
      },
      "history": {
        "overview": "Named after the Minimes religious order that established a monastery here in the 17th century, the district developed as a working-class area during industrialization, with significant growth in the post-WWII period to accommodate Toulouse's expanding population.",
        "significance": "Represents Toulouse's industrial heritage and working-class history, now evolving with urban renewal and cultural diversity.",
        "notable_events": [
          "Establishment of the Minimes monastery in the 17th century",
          "Industrial development alongside the Canal du Midi in the 19th century",
          "Significant postwar housing developments and more recent urban renewal"
        ]
      },
      "practical_info": {
        "transit": [
          "Metro Line B: stations Minimes-Claude Nougaro, Barrière de Paris, and La Vache",
          "Bus lines connecting to city center",
          "Canal du Midi bicycle path"
        ],
        "safety": "Generally safe but exercise normal urban precautions, particularly in the evening in less populated areas.",
        "best_time_to_visit": "Weekdays for authentic local life; weekend mornings for markets and community atmosphere.",
        "walkability": "Moderately walkable, though distances can be greater than in central districts."
      },
      "appeal": {
        "known_for": [
          "Authentic local atmosphere",
          "Cultural diversity",
          "Affordable lifestyle",
          "Canal-side spaces"
        ],
        "atmosphere": [
          "Working-class",
          "Diverse",
          "Evolving",
          "Unpretentious"
        ],
        "best_for": [
          "Budget-conscious travelers",
          "Cultural explorers",
          "Longer-term visitors",
          "Canal enthusiasts"
        ]
      },
      "categories": {
        "touristy": 1,
        "residential": 5,
        "green_spaces": 2,
        "shopping": 2,
        "dining": 3,
        "nightlife": 2,
        "cultural": 2,
        "historic": 2
      },
      "highlights": {
        "attractions": [
          {
            "name": "Canal du Midi",
            "type": "Historic waterway",
            "description": "UNESCO World Heritage waterway forming the southern boundary of the district, with towpaths ideal for walking and cycling.",
            "appeal": "Engineering marvel offering pleasant green corridor through the urban landscape."
          },
          {
            "name": "Église des Minimes",
            "type": "Religious site",
            "description": "18th-century baroque church serving as the district's architectural centerpiece, with an impressive façade and notable artworks.",
            "appeal": "Historical landmark providing insight into the district's religious heritage."
          },
          {
            "name": "Marché des Minimes",
            "type": "Local market",
            "description": "Authentic neighborhood market reflecting the district's diverse population, with produce, household goods, and multicultural food offerings.",
            "appeal": "Genuine local experience away from tourist paths showcasing everyday Toulousain life."
          }
        ],
        "dining": [
          {
            "name": "Ô Saveurs d'Afrique",
            "cuisine": "West African",
            "price_range": "€",
            "known_for": "Authentic African specialties in generous portions",
            "atmosphere": "Casual and welcoming"
          },
          {
            "name": "Le Caminito",
            "cuisine": "Argentine",
            "price_range": "€€",
            "known_for": "Grilled meats and empanadas",
            "atmosphere": "Warm South American vibe"
          },
          {
            "name": "Café des Minimes",
            "cuisine": "French Bistro",
            "price_range": "€",
            "known_for": "Traditional local dishes at affordable prices",
            "atmosphere": "Authentic neighborhood café"
          }
        ],
        "activities": [
          {
            "name": "Canal du Midi Cycling",
            "type": "Outdoor activity",
            "description": "Rent a bike and explore the UNESCO-listed Canal du Midi towpath that runs along the district's southern edge, connecting to both the city center and countryside.",
            "suitable_for": [
              "Active travelers",
              "Nature lovers",
              "Photography enthusiasts"
            ]
          },
          {
            "name": "Multicultural Food Exploration",
            "type": "Culinary experience",
            "description": "Sample the diverse international cuisines found in the district, from West African to North African, Asian and South American traditions.",
            "suitable_for": [
              "Adventurous eaters",
              "Budget travelers",
              "Cultural explorers"
            ]
          }
        ]
      },
      "stay_here_if": [
        "You're seeking affordable accommodation with good public transport links",
        "You want to experience authentic local life away from tourist areas",
        "You're interested in multicultural urban environments"
      ],
      "avoid_if": [
        "You prefer polished, tourist-oriented neighborhoods",
        "You want immediate access to major attractions",
        "You're uncomfortable in areas undergoing transition"
      ],
      "insider_tips": [
        "The stretch of Canal du Midi in this district is less crowded than central sections, making for more peaceful walks and cycling.",
        "The small Place des Minimes hosts occasional community events and has cafés where locals gather, especially on market days.",
        "Bus routes along Avenue des Minimes provide direct and frequent connections to the historic center, often more convenient than changing metro lines."
      ]
    }
  ]
}