{
  "sites": [
    {
      "name": "Place du Capitole",
      "type": "Square",
      "description": "The heart of Toulouse, this grand square is dominated by the neoclassical Capitole building, which houses the city hall and theater. The square features cafés, restaurants, and shops under its arched galleries. The Capitole's facade is adorned with pink marble columns, and its interior contains lavish state rooms and artwork.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Hosts markets and events throughout the year. Christmas market in December transforms the square. Summer evenings are particularly lively with outdoor dining.",
      "booking_tips": "No booking required for the square. Tours of the Capitole building's interior are available at specific times.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 43.6045,
      "longitude": 1.4442
    },
    {
      "name": "Basilique Saint-Sernin",
      "type": "Church",
      "description": "The largest remaining Romanesque church in Europe, this UNESCO World Heritage site was built between the 11th and 14th centuries. The basilica features a distinctive octagonal bell tower, remarkable Romanesque sculptures, and houses important religious relics. It was a major stop on the pilgrimage route to Santiago de Compostela.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Special masses and events during religious holidays. Quieter in the early morning hours for contemplative visits.",
      "booking_tips": "No booking required. Respect services if visiting during worship times. Small fee for access to the crypt.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 43.6078,
      "longitude": 1.4419
    },
    {
      "name": "Cité de l'Espace",
      "type": "Science Museum",
      "description": "A theme park focused on space exploration and astronomy, featuring full-scale replicas of spacecraft, including the Ariane 5 rocket, Mir space station, and Soyuz modules. Interactive exhibits, planetarium shows, and IMAX theater provide insights into astronomy and the challenges of space travel.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Expensive",
      "seasonal_notes": "Less crowded on weekdays outside school holidays. Special night events during summer and astronomical events.",
      "booking_tips": "Advance booking recommended, especially during holiday periods. Plan at least half a day to enjoy the full experience.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 4,
        "cultural_significance": 4
      },
      "latitude": 43.5879,
      "longitude": 1.4939
    },
    {
      "name": "Musée des Augustins",
      "type": "Museum",
      "description": "Housed in a former Augustinian monastery, this fine arts museum contains an impressive collection of paintings and sculptures from the Middle Ages to the early 20th century. The Gothic church and cloisters provide a striking architectural backdrop for the collections, which include works by Delacroix, Ingres, and Toulouse-Lautrec.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Special exhibitions throughout the year. The medieval cloister is particularly atmospheric in all seasons.",
      "booking_tips": "No advance booking required. Closed on Tuesdays. Free entry on the first Sunday of each month.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 43.6004,
      "longitude": 1.4465
    },
    {
      "name": "Canal du Midi",
      "type": "Waterway",
      "description": "This UNESCO World Heritage site is a 17th-century engineering marvel connecting the Atlantic to the Mediterranean. In Toulouse, the canal offers pleasant walking and cycling paths lined with plane trees. Boat tours provide a unique perspective on the city and its historic locks and bridges.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful in spring and autumn. Boat tours operate primarily from April to October. The banks are popular for picnics in summer.",
      "booking_tips": "Walking/cycling requires no booking. Boat tours should be booked in advance during peak season.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 43.6114,
      "longitude": 1.4291
    },
    {
      "name": "Couvent des Jacobins",
      "type": "Historical Monument",
      "description": "This Dominican monastery built in the 13th-14th centuries is a masterpiece of Southern Gothic architecture. Its church features a remarkable 'palm tree' column, where 22 ribs spread from a single pillar to support the ceiling. The peaceful cloister and chapel once housed the remains of Saint Thomas Aquinas.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Inexpensive",
      "seasonal_notes": "Light streaming through the stained glass windows is most impressive on sunny mornings. Hosts classical music concerts throughout the year.",
      "booking_tips": "No advance booking required. Guided tours available at specific times.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 43.6040,
      "longitude": 1.4401
    },
    {
      "name": "Jardin Japonais Pierre Baudis",
      "type": "Garden",
      "description": "One of the largest Japanese gardens in France, featuring traditional elements such as a tea pavilion, red bridges, stone lanterns, zen garden, and koi pond. The garden offers a tranquil escape from the urban environment with its carefully designed landscape and plant selections.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Cherry blossoms in spring (March-April) are spectacular. Autumn foliage provides another season of distinctive beauty.",
      "booking_tips": "No booking required. Located in Compans Caffarelli park, near the Toulouse Business School.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 43.6126,
      "longitude": 1.4302
    },
    {
      "name": "Marché Victor Hugo",
      "type": "Market",
      "description": "Toulouse's premier covered food market houses approximately 100 vendors selling fresh produce, meats, cheeses, seafood, pastries, and regional specialties. The upper floor contains several restaurants serving market-fresh cuisine, many offering set lunch menus that are popular with locals.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest on weekend mornings. Closed Mondays. Some vendors close by early afternoon. Seasonal produce varies throughout the year.",
      "booking_tips": "No booking required for shopping. Restaurant reservations recommended for lunch, especially on weekends.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 43.6036,
      "longitude": 1.4512
    },
    {
      "name": "Fondation Bemberg",
      "type": "Museum",
      "description": "Housed in the Renaissance Hôtel d'Assézat, this private collection includes impressive European paintings from the 16th to 20th centuries, with works by Bonnard, Matisse, Picasso, and Toulouse-Lautrec. The building itself, with its elegant courtyard and facade, is a noteworthy example of Renaissance architecture.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round except Mondays. The Renaissance courtyard is particularly beautiful in good weather.",
      "booking_tips": "No advance booking required for individuals. Groups should book guided tours ahead of time.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 43.6012,
      "longitude": 1.4414
    },
    {
      "name": "Pont Neuf",
      "type": "Bridge",
      "description": "Despite its name meaning 'New Bridge,' this is Toulouse's oldest bridge, built between 1544 and 1632. Its distinctive design features large arched openings above the piers, intended to reduce resistance during the Garonne River's frequent floods. The bridge offers excellent views of the river and city skyline.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Beautiful at sunset and when illuminated at night. The banks of the Garonne near the bridge are popular gathering spots in warm weather.",
      "booking_tips": "No booking required. Connect your visit with the nearby Prairie des Filtres park for riverside relaxation.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 43.5997,
      "longitude": 1.4391
    },
    {
      "name": "Musée des Abattoirs",
      "type": "Museum",
      "description": "Contemporary art museum housed in a former slaughterhouse, featuring rotating exhibitions of modern and contemporary art. The permanent collection includes works by notable 20th-century artists and the museum is known for its thought-provoking temporary exhibitions and installations.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Exhibitions change regularly throughout the year. The museum hosts special events and extended hours during contemporary art festivals.",
      "booking_tips": "No advance booking required. Closed on Mondays. Free entry on the first Sunday of each month.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 43.5947,
      "longitude": 1.4320
    },
    {
      "name": "Cathédrale Saint-Étienne",
      "type": "Church",
      "description": "An unusual cathedral with mismatched architectural styles due to its construction over multiple centuries. The nave and choir are not aligned, creating a distinctive kink in the building's layout. Features impressive stained glass windows, including a magnificent rose window, and various artistic treasures.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Light through the stained glass is best in morning hours. Special services during major religious holidays.",
      "booking_tips": "No booking required. Respect services if visiting during worship times.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 43.6010,
      "longitude": 1.4503
    },
    {
      "name": "Aeroscopia",
      "type": "Museum",
      "description": "Aviation museum located near the Airbus factory, featuring a collection of historic and notable aircraft including two Concorde supersonic airliners, an A300B, and various military aircraft. Interactive exhibits cover the principles of flight and the history of aviation in Toulouse, a major center for the aerospace industry.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Can be combined with Airbus factory tours (separate booking required).",
      "booking_tips": "No advance booking required for the museum, but Airbus factory tours must be booked well in advance. Located outside the city center in Blagnac; accessible by tram.",
      "ratings": {
        "cost_estimate": 14,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 3
      },
      "latitude": 43.6656,
      "longitude": 1.3736
    },
    {
      "name": "Église Notre-Dame de la Daurade",
      "type": "Church",
      "description": "Originally a 5th-century Visigothic temple, later a Benedictine monastery, and now a basilica overlooking the Garonne River. Known for housing the Black Madonna statue, an important object of pilgrimage, and for its historical role in the production of pastel dye, once Toulouse's primary industry.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Special celebrations for the Assumption of Mary (August 15). The riverside location is particularly pleasant in spring and summer.",
      "booking_tips": "No booking required. Respect services if visiting during worship times.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 43.6022,
      "longitude": 1.4372
    },
    {
      "name": "Muséum de Toulouse",
      "type": "Museum",
      "description": "One of the largest natural history museums in France, with extensive collections of minerals, fossils, zoological specimens, and ethnographic artifacts. The museum focuses on the relationship between humans and nature, featuring interactive exhibits, gardens, and temporary exhibitions on scientific and environmental themes.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Popular with families during school holidays. The botanical gardens are most enjoyable in spring and summer.",
      "booking_tips": "No advance booking required. Closed on Mondays. Located in the Jardin des Plantes, which is worth exploring separately.",
      "ratings": {
        "cost_estimate": 8,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 43.5920,
      "longitude": 1.4498
    },
    {
      "name": "Les Abattoirs",
      "type": "Museum",
      "description": "Contemporary art museum housed in a former slaughterhouse, featuring rotating exhibitions of modern and contemporary art. The permanent collection includes works by notable 20th-century artists and the museum is known for its thought-provoking temporary exhibitions and installations.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Exhibitions change regularly throughout the year. The museum hosts special events and extended hours during contemporary art festivals.",
      "booking_tips": "No advance booking required. Closed on Mondays. Free entry on the first Sunday of each month.",
      "ratings": {
        "cost_estimate": 7,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 43.5947,
      "longitude": 1.4320
    },
    {
      "name": "Hôtel d'Assézat",
      "type": "Historical Building",
      "description": "One of Toulouse's finest Renaissance buildings, constructed in the 16th century for a wealthy pastel merchant. The building features an elegant courtyard with ornate stone facades and detailed sculptures. Today it houses the Bemberg Foundation art collection and the Toulouse Academy of Sciences.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "The courtyard is particularly beautiful in spring and summer. Art collection requires separate admission.",
      "booking_tips": "No booking required to view the courtyard. Foundation Bemberg requires separate admission and is closed on Mondays.",
      "ratings": {
        "cost_estimate": 4,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 43.6012,
      "longitude": 1.4414
    },
    {
      "name": "Prairie des Filtres",
      "type": "Park",
      "description": "Large riverside park along the Garonne, offering grassy lawns, walking paths, and spectacular views of Pont Neuf and the city skyline. Popular with locals for picnics, sports, and relaxation. The park hosts major public events including the Bastille Day celebrations and summer festivals.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Particularly lively in summer with open-air concerts and events. Beautiful at sunset with views of the illuminated historic buildings across the river.",
      "booking_tips": "No booking required. Public toilets and occasional food vendors available during peak seasons and events.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 2
      },
      "latitude": 43.5975,
      "longitude": 1.4367
    },
    {
      "name": "Musée Saint-Raymond",
      "type": "Museum",
      "description": "Archaeological museum housed in a Renaissance college building, showcasing Toulouse's Roman and early Christian history. The collection includes sculptures, mosaics, and artifacts from the Roman city of Tolosa and the nearby villa of Chiragan, one of the largest collections of Roman portraits outside Italy.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Inexpensive",
      "seasonal_notes": "Open year-round. Less crowded on weekday mornings. Special exhibitions rotate throughout the year.",
      "booking_tips": "No advance booking required. Located near the Basilica of Saint-Sernin. Closed on Mondays.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 43.6082,
      "longitude": 1.4407
    },
    {
      "name": "Quai de la Daurade",
      "type": "Waterfront",
      "description": "Popular riverside promenade along the Garonne with excellent views of Pont Neuf and the sunset. The area features several bars and restaurants with outdoor terraces, making it a favorite gathering place for locals, especially during warm summer evenings.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Most lively in summer when the steps along the quay are filled with people enjoying picnics and drinks at sunset. Hosts occasional markets and events.",
      "booking_tips": "No booking required for the public space. Restaurants along the quay should be booked in advance during peak season.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 43.6022,
      "longitude": 1.4372
    }
  ]
}