{
    "Spring": {
        "activities": [
            {
                "name": "Ještěd Mountain Hiking",
                "type": "Outdoor Activity",
                "description": "Explore the scenic hiking trails on Ještěd Mountain as the snow melts and spring flowers begin to bloom. The mountain offers spectacular views of northern Bohemia and the Jizera Mountains.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings mild temperatures and beautiful wildflowers, making it perfect for mountain hiking. The trails are less crowded than summer.",
                "booking_tips": "Check weather conditions before hiking and bring appropriate gear. The cable car operates year-round for easy access."
            },
            {
                "name": "Liberec Zoo Spring Visit",
                "type": "Zoo",
                "description": "Visit Liberec Zoo during spring when animals are most active and baby animals are born. The zoo features over 170 species including rare white tigers and Amur leopards.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is ideal for zoo visits as animals are more active in cooler temperatures and many species have newborns.",
                "booking_tips": "Purchase tickets online for discounts and arrive early to see animals during their most active hours."
            },
            {
                "name": "Harcov Reservoir Walks",
                "type": "Nature Walk",
                "description": "Enjoy peaceful walks around the Harcov Dam reservoir as the surrounding trees and flowers come to life. The area offers beautiful lakeside views and mountain scenery.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring brings fresh greenery and blooming flowers around the reservoir, creating a picturesque setting for walks.",
                "booking_tips": "Combine with a visit to Rybářská bašta restaurant for lakeside dining with mountain views."
            },
            {
                "name": "Botanical Garden Spring Bloom",
                "type": "Garden",
                "description": "Explore the Liberec Botanical Garden as spring flowers bloom in the outdoor sections. The garden features over 8,000 plant species with beautiful spring displays.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low",
                "seasonal_notes": "Spring is the best time to see the outdoor gardens in bloom, while the greenhouses provide year-round attractions.",
                "booking_tips": "Visit early morning for the best light and fewer crowds. Don't miss the butterfly house which operates year-round."
            },
            {
                "name": "Easter Markets in Old Town",
                "type": "Market",
                "description": "Experience traditional Czech Easter markets in Liberec's Old Town Square, featuring local crafts, Easter decorations, and seasonal treats like mazanec (Easter bread).",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Easter markets are a cherished Czech tradition, typically held in the weeks leading up to Easter Sunday.",
                "booking_tips": "Visit on weekends for the most vendors and festive atmosphere. Try traditional Easter foods like decorated eggs and sweet pastries."
            },
            {
                "name": "Cable Car to Ještěd Tower",
                "type": "Transportation",
                "description": "Take the scenic cable car ride to the iconic Ještěd Tower for panoramic views of the spring landscape. The tower offers dining and observation decks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers clear views of the surrounding mountains and valleys as the landscape awakens from winter.",
                "booking_tips": "Book restaurant reservations in advance if planning to dine at the tower. Check weather for best visibility."
            },
            {
                "name": "Regional Gallery Spring Exhibitions",
                "type": "Museum",
                "description": "Visit the Regional Gallery in its beautiful Art Nouveau building to see spring exhibitions and the impressive collection of Czech and European art.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Spring exhibitions often feature local artists and seasonal themes, making it a perfect indoor activity during unpredictable weather.",
                "booking_tips": "Check the gallery's website for current exhibitions and special events. The building itself is an architectural gem."
            },
            {
                "name": "Liberec Castle Park Walk",
                "type": "Park",
                "description": "Stroll through the peaceful castle park as spring flowers bloom and the historic Liberec Castle serves as a cultural center with rotating exhibitions.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The castle park is particularly beautiful in spring with blooming trees and flowers, offering a peaceful retreat in the city center.",
                "booking_tips": "Combine with a visit to the castle's Regional Museum for a full cultural experience."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Aquapark Babylon",
                "type": "Water Park",
                "description": "Cool off at the indoor Aquapark Babylon with multiple pools, water slides, and tropical environment. The complex also includes shopping and entertainment options.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is perfect for water park visits, though the indoor facility operates year-round with consistent tropical temperatures.",
                "booking_tips": "Visit on weekdays to avoid weekend crowds. Online tickets often provide discounts."
            },
            {
                "name": "Ještěd Mountain Summer Activities",
                "type": "Outdoor Activity",
                "description": "Enjoy summer activities on Ještěd Mountain including hiking, mountain biking, and paragliding. The mountain offers spectacular views and cooler temperatures.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer provides the best weather for mountain activities with long daylight hours and comfortable temperatures.",
                "booking_tips": "Take the cable car up and hike down, or book guided activities through local adventure companies."
            },
            {
                "name": "Harcov Reservoir Swimming",
                "type": "Swimming",
                "description": "Swim and relax at designated swimming areas around the Harcov Dam reservoir, surrounded by beautiful mountain scenery and walking paths.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer is the only season suitable for swimming in the reservoir, with water temperatures reaching comfortable levels.",
                "booking_tips": "Check designated swimming areas and safety conditions. Bring your own towels and refreshments."
            },
            {
                "name": "Liberec Summer Festival",
                "type": "Festival",
                "description": "Attend the Liberec Summer Festival featuring outdoor concerts, cultural performances, and family entertainment in various venues around the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "The festival takes advantage of warm summer evenings and long daylight hours for outdoor performances.",
                "booking_tips": "Check the festival schedule in advance and arrive early for popular performances."
            },
            {
                "name": "Botanical Garden Summer Tours",
                "type": "Garden",
                "description": "Explore the Liberec Botanical Garden's outdoor sections in full summer bloom, including themed gardens and the popular butterfly house.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low",
                "seasonal_notes": "Summer showcases the garden's full beauty with all outdoor sections in bloom and the butterfly house at peak activity.",
                "booking_tips": "Visit early morning to avoid heat and see butterflies at their most active. Bring water and comfortable walking shoes."
            },
            {
                "name": "Mountain Biking Trails",
                "type": "Sports",
                "description": "Explore mountain biking trails around Liberec and the Jizera Mountains, offering various difficulty levels and beautiful summer scenery.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer provides the best conditions for mountain biking with dry trails and pleasant temperatures.",
                "booking_tips": "Rent bikes from local shops or bring your own. Check trail conditions and difficulty levels before setting out."
            },
            {
                "name": "Outdoor Dining at Rybářská bašta",
                "type": "Dining",
                "description": "Enjoy lakeside dining at Rybářská bašta restaurant with panoramic views of the Harcov reservoir and surrounding mountains.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings are perfect for outdoor dining with beautiful sunset views over the reservoir.",
                "booking_tips": "Reserve a table in advance, especially for sunset dining. Request a window seat for the best views."
            },
            {
                "name": "Liberec Zoo Summer Evenings",
                "type": "Zoo",
                "description": "Experience the zoo during extended summer hours, when many animals are most active in the cooler evening temperatures.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings offer a unique zoo experience with fewer crowds and active nocturnal animals.",
                "booking_tips": "Check for special evening events and feeding times. Bring a camera for beautiful evening lighting."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Ještěd Mountain Fall Colors",
                "type": "Nature Walk",
                "description": "Hike through the beautiful autumn foliage on Ještěd Mountain, experiencing spectacular fall colors and crisp mountain air.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings stunning fall colors to the mountain forests, creating a picturesque hiking experience.",
                "booking_tips": "Check weather conditions and bring warm clothing. The cable car operates year-round for easy access."
            },
            {
                "name": "Liberec Castle Autumn Exhibitions",
                "type": "Museum",
                "description": "Visit Liberec Castle for autumn exhibitions and cultural events. The castle houses the Regional Museum with collections focusing on local history.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Autumn's cooler weather makes indoor cultural activities ideal, and the castle park is beautiful with fall colors.",
                "booking_tips": "Check the museum's website for current exhibitions and special autumn events."
            },
            {
                "name": "Harcov Reservoir Autumn Walks",
                "type": "Nature Walk",
                "description": "Enjoy peaceful autumn walks around the Harcov reservoir, surrounded by beautiful fall colors and crisp autumn air.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers beautiful fall foliage around the reservoir and comfortable walking temperatures.",
                "booking_tips": "Combine with a warm meal at Rybářská bašta restaurant to enjoy the autumn atmosphere."
            },
            {
                "name": "Liberec Farmers Market",
                "type": "Market",
                "description": "Visit the weekly farmers market for autumn produce, local crafts, and seasonal specialties like fresh apples, mushrooms, and homemade preserves.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn markets feature seasonal produce including apples, pears, mushrooms, and traditional Czech preserves.",
                "booking_tips": "Visit early for the best selection of fresh produce and local specialties."
            },
            {
                "name": "Regional Gallery Autumn Collections",
                "type": "Museum",
                "description": "Explore the Regional Gallery's autumn exhibitions and permanent collections, housed in a beautiful Art Nouveau building.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Autumn is perfect for indoor cultural activities as the weather cools down.",
                "booking_tips": "Check for special autumn exhibitions and guided tours. The gallery shop offers unique local crafts."
            },
            {
                "name": "Mushroom Foraging",
                "type": "Outdoor Activity",
                "description": "Join guided mushroom foraging tours in the forests around Liberec, learning about local mushroom varieties and traditional Czech mushroom dishes.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is mushroom season in the Czech Republic, with forests offering abundant varieties of edible mushrooms.",
                "booking_tips": "Book guided tours with local experts who can identify safe mushroom varieties. Never forage without proper knowledge."
            },
            {
                "name": "Liberec Autumn Cultural Festival",
                "type": "Festival",
                "description": "Attend the Liberec Autumn Cultural Festival featuring music, theater, and art exhibitions throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "The festival celebrates autumn culture with indoor and outdoor events as the weather cools.",
                "booking_tips": "Check the festival program in advance and book tickets for popular performances."
            },
            {
                "name": "Botanical Garden Autumn Display",
                "type": "Garden",
                "description": "Visit the Botanical Garden to see autumn flowers and the changing seasons, with the indoor greenhouses providing year-round attractions.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Low",
                "seasonal_notes": "Autumn brings beautiful fall colors to the garden's outdoor sections, while greenhouses provide warm retreats.",
                "booking_tips": "Visit early morning for the best light and fewer crowds. Don't miss the tropical greenhouses."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Ještěd Ski Resort",
                "type": "Winter Sports",
                "description": "Hit the slopes at the Liberec-Rochlice ski resort on Ještěd Mountain, offering various difficulty levels and beautiful mountain views.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides the best skiing conditions with natural and artificial snow, typically operating from December to March.",
                "booking_tips": "Book ski passes online for discounts. Rent equipment at the base or bring your own. Check snow conditions before visiting."
            },
            {
                "name": "Ještěd Tower Winter Views",
                "type": "Observation",
                "description": "Visit the iconic Ještěd Tower for spectacular winter views of the snow-covered landscape. The tower offers dining and warm observation areas.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers the most dramatic views from the tower, with snow-covered mountains and valleys creating a magical landscape.",
                "booking_tips": "Take the cable car up and enjoy warm dining with panoramic views. Book restaurant reservations in advance."
            },
            {
                "name": "Liberec Christmas Markets",
                "type": "Market",
                "description": "Experience the magical Christmas markets in Liberec's Old Town Square, featuring traditional Czech crafts, mulled wine (svařák), and festive atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Christmas markets are a cherished Czech tradition, typically running from late November through December.",
                "booking_tips": "Visit in the evening for the best atmosphere with festive lights. Try traditional Czech Christmas treats and mulled wine."
            },
            {
                "name": "Harcov Reservoir Winter Walks",
                "type": "Nature Walk",
                "description": "Enjoy peaceful winter walks around the frozen Harcov reservoir, surrounded by snow-covered trees and mountain scenery.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter transforms the reservoir into a peaceful snowy landscape, perfect for quiet walks and photography.",
                "booking_tips": "Dress warmly and wear appropriate footwear for snowy conditions. The area is beautiful but can be slippery."
            },
            {
                "name": "Liberec Castle Winter Exhibitions",
                "type": "Museum",
                "description": "Visit Liberec Castle for winter exhibitions and cultural events, offering a warm retreat from the cold weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Winter is ideal for indoor cultural activities, and the castle offers a cozy atmosphere with rotating exhibitions.",
                "booking_tips": "Check for special winter exhibitions and events. The castle park is beautiful covered in snow."
            },
            {
                "name": "Regional Gallery Winter Collections",
                "type": "Museum",
                "description": "Explore the Regional Gallery's winter exhibitions and permanent collections in the warm, elegant Art Nouveau building.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Low",
                "seasonal_notes": "Winter provides the perfect opportunity for indoor art appreciation, with the gallery offering a warm cultural retreat.",
                "booking_tips": "Check for special winter exhibitions and guided tours. The gallery is less crowded during winter months."
            },
            {
                "name": "Hot Chocolate at Local Cafés",
                "type": "Café",
                "description": "Warm up with traditional Czech hot chocolate and pastries at local cafés like Café Central, enjoying the cozy winter atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for enjoying warm beverages and traditional Czech pastries in cozy café settings.",
                "booking_tips": "Visit during off-peak hours to avoid crowds. Try traditional Czech pastries like vánočka (Christmas bread)."
            },
            {
                "name": "Liberec Zoo Winter Visit",
                "type": "Zoo",
                "description": "Experience the zoo during winter when many animals are more active in the cooler temperatures, and crowds are smaller.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers a unique zoo experience with active animals and beautiful snowy scenery, though some outdoor exhibits may be limited.",
                "booking_tips": "Dress warmly and check which exhibits are open during winter months. Indoor tropical pavilions provide warm retreats."
            }
        ]
    }
}