{
    "sites": [
        {
            "name": "Ještěd Tower",
            "type": "Tower",
            "description": "This iconic hyperboloid tower and ski hotel, designed by architect Karel Hubáček, sits atop Ještěd Mountain at 1,012 meters above sea level. A UNESCO-protected architectural gem, it offers panoramic views of northern Bohemia and serves as both a television transmitter and unique hotel. The futuristic design from the 1960s has made it a symbol of Liberec and one of the most recognizable landmarks in the Czech Republic.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Clear days offer the best panoramic views. Winter provides skiing opportunities, while summer is perfect for hiking. The cable car operates year-round but may be closed during severe weather.",
            "booking_tips": "Take the cable car from Liberec or drive up the mountain road. The restaurant requires reservations, especially for dinner. Hotel stays should be booked well in advance due to limited rooms.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 50.7319,
            "longitude": 15.0128
        },
        {
            "name": "Liberec Zoo",
            "type": "Zoo",
            "description": "One of the oldest zoos in the Czech Republic, founded in 1904, Liberec Zoo is renowned for its conservation efforts and diverse collection of animals from around the world. The zoo spans 13 hectares and is home to over 170 species, including rare white tigers, Amur leopards, and various endangered species. The zoo's commitment to breeding programs and species conservation has earned it international recognition.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Animals are most active in cooler morning hours. Spring and summer offer the best experience with outdoor exhibits fully operational. Some indoor tropical pavilions provide year-round attractions.",
            "booking_tips": "Purchase tickets online for discounts. Allow at least half a day to see all exhibits. The zoo offers guided tours and special feeding sessions that can be booked in advance.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 4,
                "cultural_significance": 4
            },
            "latitude": 50.7664,
            "longitude": 15.0572
        },
        {
            "name": "Liberec Town Hall",
            "type": "Town Hall",
            "description": "This magnificent Neo-Renaissance town hall, built between 1888-1893, is considered one of the most beautiful town halls in Central Europe. Designed by Viennese architect Franz von Neumann, it features a striking 65-meter tower and elaborate facade decorations. The building houses the city administration and offers guided tours showcasing its ornate interior, including the ceremonial hall with beautiful frescoes and stained glass windows.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Low",
            "seasonal_notes": "Guided tours are available year-round. The tower offers excellent views but requires climbing stairs. Summer weddings often take place in the ceremonial hall.",
            "booking_tips": "Tours must be booked in advance through the tourist information center. Tower visits may be limited during official city events. Photography inside requires special permission.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 50.7674,
            "longitude": 15.0562
        },
        {
            "name": "Botanical Garden Liberec",
            "type": "Garden",
            "description": "Established in 1895, this botanical garden spans 3 hectares and features over 8,000 plant species from around the world. The garden includes nine tropical and subtropical greenhouses, an alpine garden, and themed outdoor sections. Notable collections include orchids, cacti, carnivorous plants, and a impressive butterfly house. The garden serves both educational and research purposes while providing a peaceful retreat in the city center.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Low",
            "seasonal_notes": "Greenhouses provide year-round attractions, while outdoor gardens are most beautiful from spring to autumn. The butterfly house is particularly popular with children and operates with tropical temperatures year-round.",
            "booking_tips": "No advance booking required for general admission. Special exhibitions and events may require separate tickets. The garden offers educational programs for groups that should be booked in advance.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 50.7691,
            "longitude": 15.0583
        },
        {
            "name": "Regional Gallery Liberec",
            "type": "Gallery",
            "description": "Housed in a beautiful Art Nouveau building from 1898, the Regional Gallery showcases an impressive collection of Czech and European art from the 16th to 21st centuries. The gallery features works by prominent Czech artists, temporary exhibitions, and a notable collection of glass art reflecting the region's glassmaking tradition. The building itself is an architectural gem with ornate decorations and period interiors.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Low",
            "seasonal_notes": "The gallery hosts rotating temporary exhibitions throughout the year. Summer months often feature special outdoor installations in the surrounding park. Workshops and lectures are regularly organized.",
            "booking_tips": "Check the website for current exhibitions and events. Group tours can be arranged in advance. The gallery shop offers unique glass art pieces and local crafts.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 50.7678,
            "longitude": 15.0571
        },
        {
            "name": "Liberec Castle",
            "type": "Castle",
            "description": "Originally built in the 16th century and later reconstructed in Neo-Renaissance style, Liberec Castle serves as a cultural center and museum. The castle houses the Regional Museum with collections focusing on local history, decorative arts, and the region's industrial heritage, particularly textile production. The castle's park provides a pleasant setting for walks and cultural events throughout the year.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Low",
            "seasonal_notes": "The museum is open year-round with rotating exhibitions. Summer concerts and cultural events are held in the castle courtyard and park. Winter months offer a more intimate museum experience.",
            "booking_tips": "Standard museum admission allows access to permanent collections. Special exhibitions may require separate tickets. Guided tours of the castle's history can be arranged for groups.",
            "ratings": {
                "cost_estimate": 7,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 50.7647,
            "longitude": 15.0534
        },
        {
            "name": "Aquapark Babylon",
            "type": "Water Park",
            "description": "Part of the large Babylon Liberec entertainment complex, this aquapark features multiple pools, water slides, wellness facilities, and a tropical environment maintained year-round. The complex also includes the Babylon Center with shopping, dining, and entertainment options, making it a popular destination for families and relaxation seekers.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Operating year-round with consistent tropical temperatures. Summer weekends can be crowded with families. Weekday visits offer a more relaxed experience.",
            "booking_tips": "Online tickets often provide discounts. Day passes include access to all aquapark facilities. Combination tickets with other Babylon Center attractions are available.",
            "ratings": {
                "cost_estimate": 18,
                "suggested_duration_hours": 3,
                "cultural_significance": 2
            },
            "latitude": 50.7419,
            "longitude": 15.0436
        },
        {
            "name": "North Bohemian Museum",
            "type": "Museum",
            "description": "The largest museum in the Liberec region, showcasing comprehensive collections of natural history, regional history, and decorative arts. The museum features impressive displays of minerals and fossils, ethnographic collections, and exhibitions on the region's textile industry heritage. Special attention is given to the area's glassmaking tradition and folk culture.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Low",
            "seasonal_notes": "The museum operates year-round with changing temporary exhibitions. Family-friendly programs and workshops are regularly scheduled. Winter months provide focused time for detailed exploration of collections.",
            "booking_tips": "Standard admission covers all permanent exhibitions. Audio guides are available in multiple languages. School groups and educational programs should be booked in advance.",
            "ratings": {
                "cost_estimate": 6,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 50.7683,
            "longitude": 15.0547
        },
        {
            "name": "F. X. Šalda Theatre",
            "type": "Theatre",
            "description": "Named after the famous Czech critic F. X. Šalda, this regional theatre is an important cultural institution in Liberec. Built in the early 20th century, the theatre presents a diverse repertoire including drama, opera, and ballet. The building features beautiful period architecture and an intimate auditorium that creates a special atmosphere for performances.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "The theatre season typically runs from September to June. Summer may feature outdoor performances or guest productions. Advance booking is essential for popular shows.",
            "booking_tips": "Tickets can be purchased online or at the box office. Popular performances sell out quickly. Student and senior discounts are available. Programs are typically in Czech, but some international productions are offered.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 50.7671,
            "longitude": 15.0558
        },
        {
            "name": "Liberec Main Square",
            "type": "Square",
            "description": "The historic heart of Liberec, this triangular square is surrounded by beautiful 19th and early 20th-century architecture, including the impressive Town Hall, regional library, and various merchant houses. The square serves as the main gathering place for festivals, markets, and cultural events. The mix of architectural styles reflects the city's rich history as a textile industry center.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Christmas markets transform the square in December. Summer outdoor cafes and restaurants extend into the square. Spring and autumn offer pleasant weather for walking and photography.",
            "booking_tips": "No booking required for general visits. The square hosts various events throughout the year - check local calendars. Surrounding cafes and restaurants provide excellent viewing points.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 50.7672,
            "longitude": 15.0561
        },
        {
            "name": "Liberec-Rochlice Ski Resort",
            "type": "Ski Resort",
            "description": "A local ski area offering slopes for various skill levels, situated on the slopes of Ještěd Mountain. While smaller than major Alpine resorts, it provides accessible winter sports opportunities with well-maintained slopes, ski rentals, and lessons. The resort offers beautiful views of the surrounding Bohemian landscape and is popular with local families and beginners.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Operating from December to March, weather dependent. Artificial snow-making extends the season. Weekends can be crowded with local skiers. Cross-country skiing trails are also available.",
            "booking_tips": "Day passes can be purchased on-site or online. Ski equipment rental is available at the base. Ski lessons should be booked in advance, especially for children's programs.",
            "ratings": {
                "cost_estimate": 20,
                "suggested_duration_hours": 4,
                "cultural_significance": 2
            },
            "latitude": 50.7389,
            "longitude": 15.0222
        },
        {
            "name": "Wallenstein Gardens",
            "type": "Park",
            "description": "A peaceful urban park in the city center, featuring walking paths, mature trees, and seasonal flower displays. The park provides a green oasis for relaxation and recreation, with benches, playgrounds for children, and open spaces for outdoor activities. It's a popular spot for locals to enjoy nature without leaving the city.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Spring brings beautiful blooming flowers and trees. Summer provides shade and cool walking paths. Autumn colors make for scenic photography. Winter walks are possible but paths may be icy.",
            "booking_tips": "No booking required. The park is accessible 24 hours. Perfect for jogging, walking, or family picnics. Nearby cafes provide refreshments.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 50.7658,
            "longitude": 15.0549
        }
    ]
}