{
    "Spring": {
        "activities": [
            {
                "name": "Liege Botanical Garden Visit",
                "type": "Garden",
                "description": "Explore the beautiful botanical gardens with their diverse plant collections and spring blooms.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring is perfect as the gardens come alive with colorful flowers and new growth.",
                "booking_tips": "No booking required, free entry to the gardens."
            },
            {
                "name": "Liege Literary Festival",
                "type": "Festival",
                "description": "A celebration of literature with Belgian and international authors, readings, and cultural events.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held annually in April, perfect for book enthusiasts.",
                "booking_tips": "Check the program online and arrive early for popular author events."
            },
            {
                "name": "Passerelle La Belle Liégeoise Walk",
                "type": "Scenic Walk",
                "description": "Stroll across this elegant footbridge connecting Guillemins station to La Boverie park, enjoying spring views of the Meuse River.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring provides pleasant temperatures and beautiful riverside scenery.",
                "booking_tips": "No booking required, combine with a visit to La Boverie art museum."
            },
            {
                "name": "Spring Markets at La Batte",
                "type": "Market",
                "description": "Experience Belgium's oldest and largest market along the Meuse River, especially vibrant in spring with fresh produce and flowers.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings the best selection of seasonal produce and plants.",
                "booking_tips": "Visit on Sunday mornings when the market is at its fullest."
            },
            {
                "name": "Liege Cherry Blossom Festival",
                "type": "Cultural Event",
                "description": "Celebrate the arrival of spring with Japanese-inspired events under the cherry trees in various Liege parks.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Early April is typically the best time to see the blossoms at their peak.",
                "booking_tips": "Check the city's event calendar for specific dates as they vary with the weather."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Les Ardentes Music Festival",
                "type": "Music Festival",
                "description": "One of Belgium's biggest music festivals featuring international artists across multiple genres.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Held in July, summer weather enhances the outdoor festival experience.",
                "booking_tips": "Purchase tickets well in advance as they sell out quickly."
            },
            {
                "name": "Festival de Liège",
                "type": "Cultural Festival",
                "description": "A summer-long performing arts festival with theater, dance, and music performances throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Warm evenings make outdoor performances particularly enjoyable.",
                "booking_tips": "Book tickets for popular performances in advance online."
            },
            {
                "name": "Meuse River Cruise",
                "type": "Boat Tour",
                "description": "Enjoy a scenic cruise along the Meuse River, taking in Liege's historic architecture and beautiful bridges.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides the best weather for river cruising.",
                "booking_tips": "Book in advance during peak tourist season (July-August)."
            },
            {
                "name": "August 15th Outremeuse Festival",
                "type": "Folk Festival",
                "description": "Experience Liege's biggest traditional festival with parades, folk characters, music, and typical foods in the Outremeuse district.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Mid-August event celebrating local folklore and traditions.",
                "booking_tips": "Book accommodation well in advance if staying overnight, as the city fills up."
            },
            {
                "name": "La Boverie Park",
                "type": "Park",
                "description": "Relax in this beautiful park on an island in the Meuse River, home to the La Boverie art museum and perfect for picnics.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer is ideal for outdoor activities and lounging in the park.",
                "booking_tips": "Combine with a visit to the art museum (separate ticket required)."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Liege Organ Festival",
                "type": "Music Festival",
                "description": "A prestigious festival celebrating organ music in Liege's magnificent churches and concert halls.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn acoustics in historic churches create perfect sound conditions.",
                "booking_tips": "Book tickets online in advance for popular performances."
            },
            {
                "name": "Liege Beer Lovers' Festival",
                "type": "Festival",
                "description": "Sample from hundreds of Belgian beers with a focus on local breweries from the Wallonia region.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn's cooler weather pairs perfectly with hearty Belgian beers.",
                "booking_tips": "Purchase a tasting package online for the best experience."
            },
            {
                "name": "Museum Night",
                "type": "Cultural Event",
                "description": "Explore Liege's museums after hours with special exhibitions, performances, and events.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "November event that brightens the darkening autumn evenings.",
                "booking_tips": "Buy a combined ticket for access to all participating museums."
            },
            {
                "name": "BIAM (Biennial of Contemporary Art)",
                "type": "Art Exhibition",
                "description": "Discover contemporary art installations throughout the city in this biennial event.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is perfect for indoor art appreciation with occasional outdoor installations.",
                "booking_tips": "Get a map of all exhibition locations from the tourist office."
            },
            {
                "name": "Grand Curtius Museum Tour",
                "type": "Museum",
                "description": "Explore this comprehensive museum housed in a 17th-century mansion, covering Liege's art and history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler days make it ideal for indoor cultural exploration.",
                "booking_tips": "Audio guides are available in multiple languages."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Liege Christmas Village",
                "type": "Market",
                "description": "Experience one of Belgium's largest and oldest Christmas markets with over 200 chalets selling crafts, food, and seasonal drinks.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter lights and decorations create a magical atmosphere in the city center.",
                "booking_tips": "Visit on weekdays to avoid weekend crowds."
            },
            {
                "name": "Ice Skating at Place Cathédrale",
                "type": "Ice Skating",
                "description": "Enjoy ice skating in the heart of Liege with the beautiful backdrop of historic buildings.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "A perfect winter activity running from late November through early January.",
                "booking_tips": "Skate rental available on-site, but bring your own gloves."
            },
            {
                "name": "Winter Lights Festival",
                "type": "Festival",
                "description": "A spectacular light installation route throughout the city center, illuminating Liege's historic buildings and streets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Brightens the winter evenings during December and early January.",
                "booking_tips": "Download the festival map to follow the complete light trail."
            },
            {
                "name": "Cathedral Concerts",
                "type": "Concert",
                "description": "Enjoy classical music and choir performances in the stunning Saint Paul's Cathedral.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The cathedral's acoustics are particularly magical during winter concerts.",
                "booking_tips": "Book tickets early for Christmas and New Year special performances."
            },
            {
                "name": "La Boverie Museum Winter Exhibition",
                "type": "Museum",
                "description": "Visit the premier art museum of Liege, which hosts special winter exhibitions in its beautiful building in La Boverie park.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for indoor art appreciation away from the cold.",
                "booking_tips": "Check the museum website for current exhibitions and online ticket options."
            }
        ]
    }
}