{
  "overview_paragraph": "Limoges is at its best in spring (April–June) and early fall (September–October), when café terraces hum around Place de la Motte and Place de la République, the Jardin Botanique de l'Évêché blooms with seasonal flowers, and touring weather is ideal. July brings long evenings and vibrant festivals—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days at Musée National Adrien Dubouché, local patisserie stops, and twinkling holiday lights—while March begins to warm with the odd shower and blooming trees around the historic medieval squares.",
  "January": [
    "Musée National Adrien Dubouché without the lines, steaming French hot chocolate, and misty walks between cozy local shops around the medieval quarter.",
    "Winter light on Place de la Motte, snug restaurants in the Place de la République district, and vintage hunts in Marché Central de Limoges."
  ],
  "February": [
    "Medieval quarter at golden hour, romantic views from the Cathédrale Saint-Étienne tower, and traditional Limousin music nights in local venues.",
    "Shared local pastries, candlelit restaurants, and strolls past secret courtyards in the Old Town."
  ],
  "March": [
    "First wildflowers in the Jardin Botanique de l'Évêché, terrace tables returning around Place de la Motte, and Limousin bookshop wanders.",
    "Morning croissants, museum afternoons, and blue-hour walks welcoming spring back to Limoges."
  ],
  "April": [
    "Spring blooms in the Jardin Botanique de l'Évêché, flaky French pastries, and walks from Place de la Motte to the medieval quarter.",
    "Spring light on Cathédrale Saint-Étienne, gallery-hopping in Musée des Beaux-Arts, sunset views over the historic rooftops."
  ],
  "May": [
    "Picnics in the Jardin Botanique de l'Évêché, markets brimming with local color, and twilight strolls around Place de la Motte.",
    "Flowered promenades, open-air café moments along Place de la République, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, Limousin aperitifs, and the city humming for Fête de la Musique.",
    "Sun-splashed walking trails, garden picnics, and late sunsets that turn every Place de la Motte viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over Place de la Motte, lazy afternoons exploring the Limousin region, and moonlit medieval architecture walks.",
    "Summer markets, outdoor terraces, and museum cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet Jardin Botanique trails, easy museum days, and peaceful evenings with breezes through the historic squares.",
    "Shaded gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits at Musée des Beaux-Arts, lively terraces, and wine-tinted evenings in Place de la Motte.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering through the medieval quarter irresistible."
  ],
  "October": [
    "Autumn colors in the Jardin Botanique de l'Évêché, restaurants aglow, and the local harvest festival in the historic squares.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the medieval architecture views."
  ],
  "November": [
    "Local wine toasts, cozy restaurants, and Musée National Adrien Dubouché afternoons while the city slows to a hush.",
    "Foggy Limousin mornings, French porcelain indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Place de la Motte lights, Christmas markets, and strolling beneath grand medieval façades.",
    "Vin chaud in hand, cathedral bells, and winter sparkle from city center to the Jardin Botanique."
  ]
}

