{
    "city_name": "Limoges",
    "country": "France",
    "brief_description": "The historic capital of the Limousin region, Limoges is a city of medieval heritage where Gothic architecture meets world-famous porcelain craftsmanship. With its magnificent Cathédrale Saint-Étienne, the iconic Place de la Motte, and its role as a center for Limousin traditions and porcelain culture, Limoges offers visitors a unique blend of French elegance and artistic heritage.",
    "nickname": "The Porcelain Capital of France",
    "region": "Nouvelle-Aquitaine",
    "population": {
      "city": 0.13,
      "metro": 0.28,
      "unit": "million"
    },
    "sections": [
      {
        "title": "Porcelain Heritage",
        "content": "Limoges's unique character is defined by its world-famous porcelain industry, with the city serving as the historic center of French porcelain craftsmanship. The magnificent Musée National Adrien Dubouché and the surrounding porcelain workshops create a striking urban identity that showcases the city's importance as a center of artistic excellence during the 18th and 19th centuries.",
        "icon": "building"
      },
      {
        "title": "Medieval Legacy",
        "content": "The city's rich medieval history is preserved in landmarks like the Gothic Cathédrale Saint-Étienne and the historic Place de la Motte. These structures tell the story of Limoges's importance as a religious and cultural center during the Middle Ages, with architecture that reflects the city's spiritual significance and medieval wealth.",
        "icon": "church"
      },
      {
        "title": "Limousin Innovation",
        "content": "Limoges is globally recognized as a center for Limousin culture and porcelain heritage, which has shaped the city's modern identity. The city's cultural heritage continues to drive innovation, while Limoges has evolved into a center for technology and university culture, balancing traditional heritage with contemporary excellence.",
        "icon": "building"
      },
      {
        "title": "Limousin Culture",
        "content": "Limoges embodies the warm hospitality and rich traditions of the Limousin region. Visitors experience this through traditional Limousin cuisine featuring local specialties like chestnuts, Limousin beef, and local wines, the lively atmosphere of local markets, and the genuine friendliness of residents who are proud to share their city's unique story.",
        "icon": "heart"
      }
    ],
    "why_visit": {
      "intro": "Limoges offers visitors a unique opportunity to experience a French city that combines medieval charm with world-famous porcelain craftsmanship and Limousin culture, featuring authentic local traditions, fascinating history, and a distinctive architectural character that's unlike anywhere else in France.",
      "highlights": [
        {
          "title": "Medieval Architecture",
          "content": "Limoges's distinctive medieval and Gothic architecture creates a unique urban landscape that's become the city's signature feature. The historic buildings, city views, and elegant structures transform ordinary streets into striking architectural statements, making every street corner a potential photo opportunity and creating a magical atmosphere throughout the city.",
          "image": "/images/limoges/medieval-buildings.jpg"
        },
        {
          "title": "Place de la Motte",
          "content": "The heart of Limoges, this magnificent square is surrounded by important landmarks including the historic center, the Cathédrale Saint-Étienne, and beautiful medieval architecture. It's the perfect starting point for exploring the city and experiencing the daily life of Limoges's residents.",
          "image": "/images/limoges/place-de-la-motte.jpg"
        },
        {
          "title": "Cathédrale Saint-Étienne",
          "content": "This magnificent Gothic cathedral, located in the heart of the city, now offers spectacular architecture and insights into the city's medieval heritage with its stunning design and cultural significance. The cathedral's design represents the pinnacle of medieval religious architecture.",
          "image": "/images/limoges/cathedral.jpg"
        },
        {
          "title": "Vieux Limoges",
          "content": "Limoges's medieval center offers authentic local experiences where visitors can explore narrow cobblestone streets, discover hidden courtyards, and admire the distinctive medieval architecture. The area is particularly atmospheric in the evening when the historic buildings take on a magical quality against the city backdrop.",
          "image": "/images/limoges/vieux-limoges.jpg"
        },
        {
          "title": "Musée National Adrien Dubouché",
          "content": "In the center of the city, the iconic porcelain museum offers spectacular insights into Limoges's artistic heritage and the surrounding Limousin landscape. Accessible by walking, it provides a unique perspective on the city's cultural importance and opportunities for artistic appreciation in a historic setting.",
          "image": "/images/limoges/porcelain-museum.jpg"
        },
        {
          "title": "Porcelain Heritage",
          "content": "The city's cultural heritage is celebrated through its museums, markets, and traditional crafts, with the Musée National Adrien Dubouché offering insights into the region's artistic history and the famous Limousin cuisine adding a unique dimension to the city's cultural landscape.",
          "image": "/images/limoges/porcelain-heritage.jpg"
        }
      ]
    },
    "practical_info": {
      "language": "French",
      "currency": "Euro (EUR)",
      "timezone": "Central European Time (CET/CEST)",
      "emergency_number": "112",
      "useful_phrases": [
        {"phrase": "Bonjour", "pronunciation": "bon-ZHOOR", "meaning": "Hello"},
        {"phrase": "Merci", "pronunciation": "mer-SEE", "meaning": "Thank you"},
        {"phrase": "S'il vous plaît", "pronunciation": "seel voo PLEH", "meaning": "Please"},
        {"phrase": "Au revoir", "pronunciation": "oh reh-VWAR", "meaning": "Goodbye"}
      ],
      "transport": {
        "airport_options": [
          {"name": "Limoges Airport (LIG)", "distance_to_center": "8 km", "transfer_options": ["Bus", "Taxi", "Private transfer"]}
        ],
        "public_transport": "Limoges has an efficient bus system that serves the city and surrounding areas. Taxis are readily available and the city center is compact and walkable, making it easy to explore on foot.",
        "passes": "Single tickets and day passes are available for public transport. The city center is easily navigable on foot, with most major attractions within walking distance."
      }
    },
    "seasonal_notes": {
      "spring": {
        "months": "March-May",
        "description": "Spring brings pleasant temperatures and blooming flowers to Limoges, making it an ideal time to explore the city on foot. The weather is comfortable for outdoor activities, and the surrounding Limousin landscape comes to life with seasonal colors.",
        "highlights": ["Comfortable walking weather", "Spring blooms", "Fewer tourists", "Outdoor café culture"],
        "considerations": ["Occasional rain showers", "Variable temperatures"],
        "recommended": true
      },
      "summer": {
        "months": "June-August",
        "description": "Summer in Limoges is pleasant, with the city's many parks and the nearby Limousin countryside providing cool retreats. Evening temperatures are comfortable, making it perfect for enjoying the city's vibrant café culture and outdoor dining scene.",
        "highlights": ["Long daylight hours", "Outdoor dining", "City escapes", "Cultural festivals"],
        "considerations": ["Peak tourist season", "Higher prices", "Some attractions busy"],
        "recommended": true
      },
      "autumn": {
        "months": "September-November",
        "description": "Autumn offers mild temperatures and beautiful fall colors, particularly in the surrounding Limousin landscape. The weather is ideal for exploring the city and nearby natural attractions, with fewer crowds than the summer months.",
        "highlights": ["Pleasant weather", "Autumn colors", "Fewer tourists", "Cultural events"],
        "considerations": ["Increasing rainfall", "Shorter days"],
        "recommended": true
      },
      "winter": {
        "months": "December-February",
        "description": "Winter in Limoges can be cold and occasionally rainy. The city takes on a cozy atmosphere, with indoor attractions like museums and the historic center providing warm refuge. The nearby Limousin countryside offers winter landscape beauty.",
        "highlights": ["Indoor cultural sites", "Cozy atmosphere", "Lower prices", "Winter landscape beauty"],
        "considerations": ["Cold weather", "Shorter daylight hours", "Some outdoor activities limited"],
        "recommended": false
      }
    },
    "monthly_activities": {
      "january": {
        "title": "Visit the Musée National Adrien Dubouché",
        "description": "Explore the history of Limoges porcelain in the magnificent museum building",
        "price": "€7",
        "type": "Cultural Heritage"
      },
      "february": {
        "title": "Warm up with Limousin Cuisine",
        "description": "Experience local specialties in historic restaurants",
        "price": "€15-€30",
        "type": "Cultural Experience"
      },
      "march": {
        "title": "Walk in Vieux Limoges",
        "description": "Spring blooms and peaceful cobblestone streets",
        "price": "Free",
        "type": "Outdoor Activity"
      },
      "april": {
        "title": "Explore Place de la Motte",
        "description": "Central square with historic medieval architecture and modern amenities",
        "price": "Free",
        "type": "City Center"
      },
      "may": {
        "title": "Visit the Place de la République",
        "description": "Historic administrative square with panoramic city views",
        "price": "Free",
        "type": "Outdoor Activity"
      },
      "june": {
        "title": "Visit Cathédrale Saint-Étienne",
        "description": "Gothic cathedral with distinctive architecture",
        "price": "Free",
        "type": "Religious Site"
      },
      "july": {
        "title": "Evening Stroll in Vieux Limoges",
        "description": "Cool evening temperatures and atmospheric lighting",
        "price": "Free",
        "type": "Walking Tour"
      },
      "august": {
        "title": "Shop at Marché Central de Limoges",
        "description": "Traditional market with local foods and crafts",
        "price": "Free",
        "type": "Market"
      },
      "september": {
        "title": "Visit Église Saint-Michel-des-Lions",
        "description": "Historic church with beautiful medieval architecture",
        "price": "Free",
        "type": "Religious Site"
      },
      "october": {
        "title": "Explore the Limousin Landscape",
        "description": "Walking trails in the surrounding countryside",
        "price": "Free",
        "type": "Outdoor Activity"
      },
      "november": {
        "title": "Museum Hopping",
        "description": "Visit art museums and cultural centers",
        "price": "€7-€15",
        "type": "Cultural Experience"
      },
      "december": {
        "title": "Holiday Market Shopping",
        "description": "Seasonal markets and festive atmosphere",
        "price": "Free",
        "type": "Seasonal"
      }
    },
    "meta": {
      "last_updated": "2025-03-24",
      "version": 1.0
    }
  }