{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing at Jardin Botanique de l'Évêché",
                "type": "Botanical Garden",
                "description": "Experience the stunning cherry blossoms in full bloom at the Jardin Botanique de l'Évêché, offering beautiful views over the city and home to numerous cherry trees that create a magical pink canopy.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is the perfect time to enjoy the cherry blossoms, which typically bloom from late March to mid-April in Limoges's mild Limousin climate.",
                "booking_tips": "Arrive early to avoid crowds and bring a picnic blanket to enjoy a relaxing morning under the blossoms with views of the city."
            },
            {
                "name": "Visit to the Musée National Adrien Dubouché",
                "type": "Porcelain Museum",
                "description": "Discover the fascinating history of Limoges porcelain at the Musée National Adrien Dubouché, housed in a magnificent building showcasing the city's rich ceramic heritage and artistic treasures.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "€7",
                "seasonal_notes": "Spring showers can be unpredictable, making an indoor museum visit an ideal activity while learning about Limoges's world-famous porcelain heritage.",
                "booking_tips": "Entry fee required, and guided tours are available in multiple languages. Visit on weekdays to avoid school group crowds."
            },
            {
                "name": "Limoges Spring Festival",
                "type": "Cultural Event",
                "description": "Participate in the annual Limoges Spring Festival, where the city comes alive with music performances, art exhibitions, and cultural events celebrating the arrival of spring.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free to Moderate",
                "seasonal_notes": "This annual event celebrates Limousin culture and the renewal of spring, making it a must-do spring activity.",
                "booking_tips": "Check the festival schedule online and arrive early for popular performances. Many events are free and open to the public."
            },
            {
                "name": "Picnic at Place de la Motte",
                "type": "Historic Square",
                "description": "Enjoy a leisurely picnic at the Place de la Motte, accessible by walking, surrounded by beautiful spring flowers, fresh air, and panoramic views of Limoges and the surrounding Limousin countryside.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The historic square comes alive in spring with blooming flowers and pleasant weather perfect for outdoor activities.",
                "booking_tips": "Walk from the center for stunning views. Bring your own food and drinks as options are limited at the square."
            },
            {
                "name": "Rooftop Bar at Place de la République",
                "type": "Bar",
                "description": "Sip cocktails while enjoying panoramic views of Limoges from rooftop bars around Place de la République, offering a modern rooftop experience with views of the city and surrounding Limousin landscape.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Spring evenings are mild and perfect for enjoying the outdoor terraces with beautiful sunset views of the city.",
                "booking_tips": "Reserve a table in advance, especially for sunset dining. Dress smartly as it's an upscale venue."
            },
            {
                "name": "Limoges Flower Market",
                "type": "Market",
                "description": "Visit the vibrant flower market in central Limoges, featuring seasonal blooms, local plants, and the perfect opportunity to experience local spring traditions.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the most colorful and diverse selection of flowers and plants to the market.",
                "booking_tips": "Visit early morning for the freshest selection and best prices. Bring cash for purchases."
            },
            {
                "name": "Explore Place de la République District",
                "type": "Walking Tour",
                "description": "Stroll through the elegant Place de la République district, visiting historic cafes, boutique shops, and experiencing the vibrant atmosphere of Limoges's most fashionable area.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The spring weather is ideal for walking tours, with comfortable temperatures and blooming window boxes.",
                "booking_tips": "Visit on weekends for the liveliest atmosphere and wear comfortable shoes for exploring the area."
            },
            {
                "name": "Vieux Limoges Walk",
                "type": "Outdoor Activity",
                "description": "Enjoy a peaceful walk through the historic center of Limoges, featuring narrow cobblestone streets, historic medieval buildings, and a chance to see local life.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Springtime offers pleasant weather for outdoor walks, with the historic area awakening from winter and new growth appearing.",
                "booking_tips": "Start from Place de la Motte and follow the cobblestone streets. Bring water and comfortable walking shoes."
            },
            {
                "name": "Marché Central de Limoges",
                "type": "Market",
                "description": "Explore the traditional Marché Central de Limoges, offering fresh produce, traditional Limousin goods, and local cuisine in a vibrant market atmosphere.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature seasonal Limousin produce and a vibrant atmosphere as locals prepare for the warmer months.",
                "booking_tips": "Visit early on Saturday for the best selection and to experience the authentic local market atmosphere."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Open Air Cinema at Jardin Botanique de l'Évêché",
                "type": "Cinema",
                "description": "Enjoy films under the stars at Jardin Botanique de l'Évêché, with outdoor screenings during summer months offering a unique cinematic experience.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor cinema, with warm temperatures and late sunsets creating an ideal atmosphere.",
                "booking_tips": "Bring a picnic, blankets, and arrive early to secure a good spot. Check the schedule online for current screenings."
            },
            {
                "name": "Limoges Summer Festival",
                "type": "Festival",
                "description": "Experience the vibrant Limoges Summer Festival, featuring live music, dance performances, art exhibitions, and cultural events throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "This summer tradition showcases Limousin arts and culture at its finest, with events in various venues across the city.",
                "booking_tips": "Check the festival program online and book tickets for popular performances in advance. Many events are free."
            },
            {
                "name": "Swimming at Piscine de Limoges",
                "type": "Sport",
                "description": "Cool off at the Piscine de Limoges swimming complex, featuring Olympic-size pools, diving facilities, and a perfect way to escape the summer heat.",
                "indoor": false,
                "best_time": "Morning or Late Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Summer is the best time to enjoy outdoor swimming, with warm temperatures and extended opening hours.",
                "booking_tips": "Visit during off-peak hours to avoid crowds. Bring your own towel and swimming gear."
            },
            {
                "name": "Place de la Motte Hiking",
                "type": "Outdoor Activity",
                "description": "Explore hiking trails around the Place de la Motte area, offering stunning views of Limoges, fresh air, and various difficulty levels for all hikers.",
                "indoor": false,
                "best_time": "Early Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer provides the best conditions for hiking with clear skies and warm weather, though early starts are recommended to avoid afternoon heat.",
                "booking_tips": "Start early to avoid the midday heat. Bring plenty of water, sunscreen, and sturdy hiking shoes."
            },
            {
                "name": "Limoges Jazz Festival",
                "type": "Music Festival",
                "description": "Attend the annual Limoges Jazz Festival, featuring local and international jazz artists performing in various venues across the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The summer-long festival offers world-class jazz music in intimate venues throughout Limoges.",
                "booking_tips": "Book tickets early for popular performances and check the venue locations as they vary throughout the festival."
            },
            {
                "name": "Cycling in Jardin Botanique de l'Évêché",
                "type": "Outdoor Activity",
                "description": "Rent a bike and cycle through Jardin Botanique de l'Évêché, enjoying the scenic paths, flower gardens, and beautiful summer greenery.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "The summer climate is ideal for outdoor cycling, with long daylight hours and scenic routes through the park.",
                "booking_tips": "Rent bikes from the park entrance and be aware of pedestrian traffic. Early morning offers the coolest temperatures."
            },
            {
                "name": "Rooftop Dining at Place de la République",
                "type": "Dining",
                "description": "Dine at rooftop restaurants in the Place de la République district, offering contemporary French and international cuisine with stunning city views.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings provide spectacular views across Limoges with extended daylight hours and pleasant temperatures.",
                "booking_tips": "Reserve a table well in advance, especially for sunset dining with window seats. Dress smartly for upscale venues."
            },
            {
                "name": "Cathédrale Saint-Étienne",
                "type": "Historical Site",
                "description": "Explore the fascinating Cathédrale Saint-Étienne, offering insights into Limoges's medieval history and Gothic architecture.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer offers extended opening hours and the cool stone interior provides relief from the heat.",
                "booking_tips": "Entry is free, but allow several hours to explore the site thoroughly and appreciate the architecture."
            },
            {
                "name": "Limoges Nightlife Tour",
                "type": "Cultural Tour",
                "description": "Experience Limoges's vibrant nightlife scene, from traditional Limousin bars to modern clubs, with guided tours introducing you to the best venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer nights are ideal for exploring the city's nightlife, with warm weather and extended evening activities.",
                "booking_tips": "Book tours in advance and be prepared for a late night. Many venues don't open until late evening."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Explore the Musée National Adrien Dubouché",
                "type": "Museum",
                "description": "Visit the Musée National Adrien Dubouché, home to a vast collection of Limoges porcelain from the 18th century to contemporary works, including regional Limousin pieces.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "€7",
                "seasonal_notes": "Autumn is a great time to explore indoor attractions as the weather cools down and the city becomes more comfortable for cultural visits.",
                "booking_tips": "Entry fee required but check for special exhibitions. Consider a guided tour to understand the historical context of the porcelain artworks."
            },
            {
                "name": "Limoges International Film Festival",
                "type": "Cultural Event",
                "description": "Experience the annual Limoges International Film Festival, featuring premieres, international cinema, and French film showcases across various venues.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This annual event celebrates cinema and attracts film lovers from around the world, making autumn a cultural highlight.",
                "booking_tips": "Book tickets early as popular screenings sell out quickly, and check for Q&A sessions with filmmakers."
            },
            {
                "name": "Traditional Limousin Coffee Experience",
                "type": "Food & Drink",
                "description": "Discover traditional French coffee culture in historic cafes around Place de la Motte, such as local bistros and other authentic establishments.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is perfect for cozy cafe visits, with traditional French coffee and sweet pastries providing warmth as temperatures cool.",
                "booking_tips": "Visit during off-peak hours for a more authentic experience and try traditional French coffee preparation methods."
            },
            {
                "name": "Opéra de Limoges",
                "type": "Theater",
                "description": "Catch a world-class opera or theater performance at the Opéra de Limoges, home to some of France's finest performing arts.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn launches the new theater season with fresh productions and returning favorites, making it an ideal time for cultural enrichment.",
                "booking_tips": "Book tickets in advance for popular shows, and check the schedule for both French and international productions."
            },
            {
                "name": "Autumn Walk in Jardin Botanique de l'Évêché",
                "type": "Park",
                "description": "Take a leisurely walk through Jardin Botanique de l'Évêché, enjoying spectacular autumn foliage and peaceful paths away from the city center.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "The park is particularly beautiful in autumn with vibrant fall colors and crisp air, offering a peaceful escape from urban life.",
                "booking_tips": "Wear comfortable walking shoes and bring a camera for the stunning autumn scenery. Visit on weekdays for fewer crowds."
            },
            {
                "name": "Visit to the Place de la Motte",
                "type": "Historical Site",
                "description": "Explore the historic Place de la Motte in the old town, one of Limoges's most recognizable landmarks with its distinctive architecture and central location.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn's shorter days make historical landmarks an ideal choice for cultural exploration, with comfortable temperatures for walking tours.",
                "booking_tips": "Entry is free, but check opening hours. Combine with a visit to nearby Place de la République for a complete historical experience."
            },
            {
                "name": "French National Day Celebrations",
                "type": "Festival",
                "description": "Join the celebrations for French National Day on July 14th, with parades, cultural events, and festivities throughout the city.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This national holiday celebrates France's independence with spectacular parades and cultural events.",
                "booking_tips": "Arrive early for the main parade on Place de la Motte. Many events are free and open to the public."
            },
            {
                "name": "Explore Marché Central de Limoges",
                "type": "Shopping",
                "description": "Wander through the traditional Marché Central de Limoges, featuring unique shops, traditional Limousin products, and beautiful architecture while enjoying the autumn atmosphere.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The covered market provides shelter from autumn weather while offering authentic Limousin shopping experiences.",
                "booking_tips": "Visit during the day for the best selection and browse the market for traditional Limousin crafts and souvenirs."
            },
            {
                "name": "Attend a Traditional Limousin Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook seasonal French dishes with local chefs, focusing on autumn ingredients like chestnuts, mushrooms, and traditional Limousin recipes.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides excellent seasonal ingredients for culinary exploration of traditional Limousin cuisine.",
                "booking_tips": "Book early for popular classes and check if the class includes a market tour to source authentic ingredients."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Ice Skating at Piscine de Limoges",
                "type": "Sport",
                "description": "Enjoy ice skating at the Piscine de Limoges Sports Complex, offering indoor ice rinks perfect for winter activities while staying warm and active.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter transforms the sports complex into a winter sports destination, providing indoor entertainment during colder months.",
                "booking_tips": "Book sessions online in advance, especially on weekends. Skate hire is available and lessons are offered for beginners."
            },
            {
                "name": "Visit Christmas Markets",
                "type": "Market",
                "description": "Explore Limoges's charming Christmas markets at Place de la Motte and various locations, offering festive treats, traditional French crafts, and holiday gifts.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter markets create a magical festive atmosphere throughout Limoges, with traditional French holiday traditions on display.",
                "booking_tips": "Visit in the evening for the best festive lighting and atmosphere. Bring cash for purchases and traditional French souvenirs."
            },
            {
                "name": "Concert at Cathédrale Saint-Étienne",
                "type": "Concert",
                "description": "Experience cultural performances and concerts in the historic Cathédrale Saint-Étienne, known for its stunning Gothic architecture and cultural significance.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter evenings provide a perfect atmosphere for cultural performances in historic settings, offering warmth and cultural enrichment.",
                "booking_tips": "Check the schedule for cultural events and book tickets in advance. Respect the religious nature of the venue."
            },
            {
                "name": "Explore the Musée National Adrien Dubouché",
                "type": "Museum",
                "description": "Visit the Musée National Adrien Dubouché in central Limoges, showcasing the city's rich cultural heritage and the famous Limoges porcelain collection in a comprehensive display.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "€7",
                "seasonal_notes": "Winter's cold makes it an ideal time for indoor cultural exploration, with the museum offering fascinating insights into Limoges's porcelain heritage.",
                "booking_tips": "Entry fee required for permanent collections. Book timed slots for special exhibitions online and allow several hours for a thorough visit."
            },
            {
                "name": "Traditional French Tea Experience",
                "type": "Café",
                "description": "Warm up with traditional French tea and pastries at historic cafes around the city, featuring local specialties and authentic French hospitality.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is the perfect season for the traditional French tea experience, providing warmth and cultural immersion during colder months.",
                "booking_tips": "Visit traditional cafes in the old town area for the most authentic experience. Try local tea varieties and traditional French sweets."
            },
            {
                "name": "Visit to Place de la Motte",
                "type": "Historical Site",
                "description": "Explore the historic Place de la Motte, a medieval square in the city center, offering insights into the city's ancient past and defensive architecture.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers fewer crowds and cozy historical interiors, plus the opportunity to explore the square's fascinating history.",
                "booking_tips": "Take a guided tour for the best historical insights and check opening hours as they may vary during winter months."
            },
            {
                "name": "Traditional Limousin Music Performances",
                "type": "Theater",
                "description": "Enjoy traditional French folk music and dance performances at various cultural venues, experiencing the rich musical heritage of the Limousin region.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is a time for traditional cultural performances, with indoor venues providing warmth and authentic French entertainment.",
                "booking_tips": "Book early for popular performances and check for traditional music festivals that often occur during winter months."
            },
            {
                "name": "Visit the Cathédrale Saint-Étienne",
                "type": "Historical Site",
                "description": "Explore the iconic Cathédrale Saint-Étienne, a stunning Gothic cathedral that offers unique insights into the city's architectural heritage.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter offers a unique perspective on this architectural landmark, with fewer tourists and the opportunity to appreciate its imposing presence.",
                "booking_tips": "Entry is free, but check current access. Combine with a visit to nearby Église Saint-Michel-des-Lions for a complete historical experience."
            },
            {
                "name": "Limoges Winter Cultural Festival",
                "type": "Cultural Event",
                "description": "Experience the annual Limoges Winter Cultural Festival, featuring indoor performances, art exhibitions, and cultural events that celebrate French arts during the winter season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free to Moderate",
                "seasonal_notes": "Winter festivals provide a warm cultural experience during colder months, showcasing the best of French arts and culture.",
                "booking_tips": "Check the festival program online and book tickets for popular performances in advance. Many events are free and family-friendly."
            }
        ]
    }
}