{
  "sites": [
    {
      "name": "Place de la Libération",
      "type": "Historic Square",
      "description": "The magnificent main square of Dijon, designed by Jules Hardouin-Mansart in the 17th century. This elegant square is surrounded by the Palais des Ducs (Ducal Palace), the Hôtel de Ville, and beautiful arcades. It's the heart of the city and a perfect starting point for exploring Dijon's rich heritage.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, but spring and autumn offer pleasant temperatures for walking. Summer can be warm, winter can be cold with occasional snow.",
      "booking_tips": "No booking required. Best visited early morning to avoid crowds and enjoy the peaceful atmosphere.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Palais des Ducs",
      "type": "Palace",
      "description": "The magnificent Ducal Palace, once home to the powerful Dukes of Burgundy, now houses the Musée des Beaux-Arts and the Hôtel de Ville. This stunning building showcases Burgundian Gothic and Renaissance architecture, with the Philippe le Bon Tower offering panoramic views of the city.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The museum is perfect for rainy days. The tower views are spectacular in any weather.",
      "booking_tips": "Free entry to the palace grounds. Museum entry is free. Tower access requires a small fee. Guided tours available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Cathédrale Saint-Bénigne",
      "type": "Cathedral",
      "description": "A stunning Romanesque cathedral with a distinctive rotunda, one of the largest in Europe. The cathedral features beautiful stained glass windows, intricate stone carvings, and a crypt dating back to the 6th century. It's one of Dijon's most important religious and architectural landmarks.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The stained glass creates beautiful light effects. Respectful dress required.",
      "booking_tips": "No booking required. Guided tours available. Don't miss the crypt and the rotunda.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Musée des Beaux-Arts",
      "type": "Art Museum",
      "description": "One of France's most important art museums, housed in the Palais des Ducs. Features an exceptional collection of medieval art, Renaissance paintings, and modern works. The museum's highlight is the tombs of the Dukes of Burgundy, masterpieces of medieval sculpture.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Perfect for rainy days or any weather. Air-conditioned and comfortable year-round.",
      "booking_tips": "Free entry. Book online in advance during peak season. Guided tours available. Allow 2-3 hours for the full experience.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Église Notre-Dame",
      "type": "Church",
      "description": "A magnificent Gothic church known for its unique facade with 51 gargoyles and the famous Jacquemart clock. The church features beautiful stained glass windows and is one of Dijon's most recognizable landmarks, representing the city's medieval heritage.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The gargoyles are particularly impressive in good light. Beautiful stained glass effects.",
      "booking_tips": "No booking required. Guided tours available. Don't miss the gargoyles and the Jacquemart clock.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Historic Center (Vieille Ville)",
      "type": "Historic District",
      "description": "The medieval heart of Dijon featuring narrow cobblestone streets, half-timbered houses, hidden courtyards, and distinctive Burgundian architecture. The area is particularly atmospheric in the evening when the historic buildings take on a magical quality.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Year-round attraction. Spring and autumn offer pleasant walking weather. Summer evenings are magical.",
      "booking_tips": "No booking required. Wear comfortable shoes for cobblestone streets. Guided walking tours available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Les Halles Centrales",
      "type": "Market",
      "description": "A vibrant covered market where locals shop for fresh produce, cheese, wine, and regional Burgundian specialties. The market is housed in a beautiful 19th-century building and offers authentic local experience with traditional Burgundian products and foods.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest in the morning. Year-round activity. Covered market provides shelter from weather.",
      "booking_tips": "No booking required. Respectful photography. Try local Burgundian foods and interact with vendors.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Rue des Forges",
      "type": "Historic Street",
      "description": "One of Dijon's most beautiful historic streets, lined with elegant mansions, boutique shops, and traditional restaurants. The street showcases Burgundian architecture and is perfect for shopping, dining, and admiring the city's architectural heritage.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Most lively in the afternoon and weekends. Summer offers outdoor dining, winter has cozy indoor venues.",
      "booking_tips": "No booking required for most venues. Popular restaurants may require reservations on weekends.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Tour Philippe le Bon",
      "type": "Historic Tower",
      "description": "A medieval tower that forms part of the Palais des Ducs, offering spectacular panoramic views of Dijon and the surrounding Burgundian countryside. The tower is named after Philip the Good, one of the most powerful Dukes of Burgundy.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer pleasant temperatures and clear views.",
      "booking_tips": "Small fee required. Book in advance during peak season. Combine with a visit to the Palais des Ducs.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Jardin Darcy",
      "type": "Park",
      "description": "A beautiful urban park featuring walking trails, flower gardens, playgrounds, and the iconic Darcy bear statue. Popular with locals for recreation and relaxation. Offers a peaceful escape from the city center with views of the surrounding area.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Beautiful in all seasons. Spring brings blooming flowers, summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Popular spot for picnics and outdoor activities.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Porte Guillaume",
      "type": "Historic Gate",
      "description": "A historic gate that once formed part of Dijon's medieval fortifications. While mostly in ruins, it's an important historical site and offers insight into Dijon's medieval past. The surrounding area has been developed with restaurants and cafes.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer pleasant temperatures for exploring the ruins.",
      "booking_tips": "No booking required. Combine with a meal at one of the nearby restaurants. Limited historical information on site.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Musée de la Vie Bourguignonne",
      "type": "Museum",
      "description": "A fascinating museum showcasing traditional Burgundian life and culture, housed in a beautiful historic building. Features exhibits on rural life, traditional crafts, and the region's rich cultural heritage.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Air-conditioned for comfortable visits in any weather. Perfect for understanding local culture.",
      "booking_tips": "Free entry. Guided tours available. Allow 1.5-2 hours for the full experience.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Hôtel de Ville",
      "type": "Historic Building",
      "description": "The city hall of Dijon, housed in a beautiful historic building with distinctive architecture. While not open to the public, the building is worth seeing for its architectural interest and the surrounding Place de la Libération is a popular gathering spot.",
      "indoor": false,
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "No booking required to view from outside. Consider attending public events held in the plaza.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Parc de la Colombière",
      "type": "Park",
      "description": "A scenic park located on the outskirts of Dijon offering beautiful gardens, walking trails, and peaceful atmosphere. Features walking trails, viewpoints, and is popular with families and nature lovers. Perfect for photography and relaxation.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer the most pleasant conditions. Summer can be warm.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Opéra de Dijon",
      "type": "Theatre",
      "description": "A prestigious cultural venue hosting opera, theatre, and classical music performances. The building itself is architecturally significant and represents Dijon's commitment to high culture. Check the schedule for performances during your visit.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Performance season runs year-round. Book tickets in advance for popular performances.",
      "booking_tips": "Book tickets online or at the box office. Dress appropriately for performances. Guided tours of the building available.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Maison des Cariatides",
      "type": "Historic Building",
      "description": "A beautiful Renaissance mansion known for its distinctive facade featuring caryatids (sculpted female figures). This architectural gem showcases Dijon's Renaissance heritage and is one of the city's most photographed buildings.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The facade looks impressive at night when illuminated.",
      "booking_tips": "View from outside. The building is private property. Perfect for photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Marché aux Vins",
      "type": "Wine Market",
      "description": "A traditional wine market where locals and visitors can sample and purchase Burgundian wines. Offers authentic local experience and opportunities to taste traditional Burgundian wines and learn about the region's viticulture.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest in the morning. Year-round activity. Covered market provides shelter from weather.",
      "booking_tips": "No booking required. Respectful photography. Try local Burgundian wines and interact with vendors.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Université de Bourgogne",
      "type": "Educational Institution",
      "description": "A prestigious university with a beautiful campus featuring interesting architecture and green spaces. The campus is a center of student life and the surrounding area has many student-friendly cafes and bookstores.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Campus is most lively during the academic year. Summer is quieter but still worth visiting.",
      "booking_tips": "No booking required. Respect that this is an active educational institution. Campus tours may be available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Bibliothèque Municipale",
      "type": "Library",
      "description": "A heritage library housed in a beautiful historic building with interesting architecture. While primarily a research facility, the building is worth seeing and the surrounding area is pleasant for walking.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "View from outside unless you have research needs. The surrounding area is good for photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    },
    {
      "name": "Jardin botanique de l'Arquebuse",
      "type": "Botanical Garden",
      "description": "A peaceful botanical garden featuring native Burgundian plants and trees. Offers walking paths, benches for relaxation, and educational displays about local flora. A perfect escape from the city's hustle and bustle.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful in spring when flowers are blooming. Summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 47.3220,
      "longitude": 5.0415
    }
  ]
}