{
    "Spring": {
        "activities": [
            {
                "name": "Archaeological Site Exploration",
                "type": "Historical",
                "description": "Explore the Roman Amphitheatre and ancient city walls in perfect spring weather, when temperatures are mild and crowds are smaller.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers ideal weather for archaeological exploration with comfortable temperatures and blooming wildflowers around ancient ruins.",
                "booking_tips": "Visit early morning for best lighting and photography opportunities. Combined tickets available for multiple archaeological sites."
            },
            {
                "name": "Durres Beach Walking",
                "type": "Outdoor",
                "description": "Take peaceful walks along the Adriatic coastline, enjoying mild temperatures and fewer crowds before the summer tourist season begins.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Spring beaches offer tranquil atmosphere with pleasant weather perfect for long coastal walks and beachcombing.",
                "booking_tips": "Best enjoyed in late afternoon with sunset views. Bring light jacket for evening breezes."
            },
            {
                "name": "Local Market Visits",
                "type": "Cultural",
                "description": "Experience authentic Albanian culture at Durres Central Market, featuring fresh spring produce, local crafts, and traditional Albanian products.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets showcase seasonal Albanian produce including fresh herbs, early vegetables, and mountain cheese.",
                "booking_tips": "Visit early morning for freshest selection. Bring cash and practice basic Albanian phrases for better interactions."
            },
            {
                "name": "Ferry Day Trip to Italy",
                "type": "Transportation/Tourism",
                "description": "Take advantage of mild spring weather for a day trip to Bari, Italy, via the regular ferry service from Durres port.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers pleasant crossing conditions and opportunity to experience both Albanian and Italian cultures in one trip.",
                "booking_tips": "Book ferry tickets in advance for better prices. Day trips are possible with early morning departure."
            },
            {
                "name": "Traditional Albanian Cooking Classes",
                "type": "Cultural Workshop",
                "description": "Learn to prepare traditional Albanian dishes using spring ingredients, including fresh herbs, lamb, and seasonal vegetables.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring ingredients like wild herbs and young lamb make this the perfect season for authentic Albanian culinary experiences.",
                "booking_tips": "Book through local hotels or cultural centers. Classes often include market visits and recipe cards to take home."
            },
            {
                "name": "Venetian Tower Sunset Views",
                "type": "Historical/Photography",
                "description": "Climb the 15th-century Venetian Tower for panoramic views of Durres and spectacular spring sunsets over the Adriatic Sea.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Spring evenings offer clear skies and perfect lighting for photography, with comfortable climbing conditions.",
                "booking_tips": "Arrive 30 minutes before sunset for best positioning. Bring camera for stunning panoramic shots."
            },
            {
                "name": "Albanian Wine Tasting",
                "type": "Food & Drink",
                "description": "Discover Albanian wines at local establishments, featuring varieties from the nearby wine regions paired with traditional Albanian mezze.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is ideal for wine tasting as new vintages become available and outdoor terraces reopen.",
                "booking_tips": "Book at Castello Wine Bar or ask hotels for recommendations. Try Kallmet white wine, a local specialty."
            },
            {
                "name": "Cape of Rodon Day Trip",
                "type": "Natural Site",
                "description": "Visit the dramatic Cape of Rodon with Skanderbeg's castle ruins, offering stunning coastal scenery and Albanian historical significance.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring weather is perfect for hiking and exploring this rugged coastline with comfortable temperatures and clear visibility.",
                "booking_tips": "Arrange transportation from Durres (30km). Bring water, sun protection, and comfortable hiking shoes."
            },
            {
                "name": "Archaeological Museum Visit",
                "type": "Museum",
                "description": "Explore Durres Archaeological Museum housing extensive collections of Illyrian, Greek, Roman, and Byzantine artifacts from the region.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Perfect spring afternoon activity, especially during occasional spring showers, with air-conditioned comfort.",
                "booking_tips": "Very affordable entry fee. Allow 1-2 hours for visit. English descriptions available for major exhibits."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Adriatic Beach Life",
                "type": "Beach",
                "description": "Enjoy the full Adriatic beach experience with swimming, sunbathing, beach volleyball, and water sports along Durres' sandy coastline.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Summer is peak beach season with warm Adriatic waters perfect for swimming and vibrant beachfront atmosphere.",
                "booking_tips": "Arrive early for best beach spots. Umbrella and sunbed rentals available. Many beachfront cafes and restaurants."
            },
            {
                "name": "Evening Promenade Strolls",
                "type": "Leisure",
                "description": "Take romantic evening walks along the Durres waterfront promenade, enjoying sea breezes, street food, and spectacular Adriatic sunsets.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings come alive with locals and tourists enjoying the cool sea breeze and vibrant atmosphere.",
                "booking_tips": "Perfect time to try local street food and gelato. Evening promenade is busiest from 7-10 PM."
            },
            {
                "name": "Fresh Seafood Dining",
                "type": "Culinary",
                "description": "Experience the best of Adriatic cuisine at beachfront restaurants and tavernas, featuring daily fresh catch and traditional Albanian seafood preparations.",
                "indoor": false,
                "best_time": "Lunch/Dinner",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the finest seafood selection with outdoor dining and sea views enhancing the culinary experience.",
                "booking_tips": "Ask about daily catch specials. Beachfront restaurants offer best atmosphere. Try grilled whole fish with Albanian herbs."
            },
            {
                "name": "Water Sports Activities",
                "type": "Adventure",
                "description": "Enjoy various water sports including jet skiing, parasailing, boat rentals, and scuba diving in the clear Adriatic waters.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions for water sports with warm water temperatures and reliable weather.",
                "booking_tips": "Equipment rental available on main beach. Book boat trips to nearby coastal areas. Safety equipment provided."
            },
            {
                "name": "Traditional Albanian Folk Festivals",
                "type": "Cultural Event",
                "description": "Experience local summer festivals featuring traditional Albanian music, dancing, crafts, and cuisine celebrating regional culture.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer festivals showcase authentic Albanian culture with outdoor performances and community celebrations.",
                "booking_tips": "Check with tourist information for festival dates. Free events often held in central squares and beach areas."
            },
            {
                "name": "Currila Beach Escape",
                "type": "Beach",
                "description": "Visit the quieter Currila Beach for a more peaceful alternative to the main beach, offering cleaner waters and local atmosphere.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer alternative for those seeking quieter beach experience away from main tourist crowds.",
                "booking_tips": "Short trip south of main beach. Fewer facilities but more peaceful environment. Local beach bars available."
            },
            {
                "name": "Ferry Terminal Maritime Watching",
                "type": "Cultural",
                "description": "Experience the bustling maritime activity at Durres port, watching ferries to/from Italy and local fishing boat operations.",
                "indoor": false,
                "best_time": "Morning/Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer brings peak ferry traffic and maritime activity, offering authentic glimpses of port city life.",
                "booking_tips": "Best viewing from harbor walkway. Ferry schedules available online. Early morning for fishing boat activity."
            },
            {
                "name": "Rooftop Bar Summer Nights",
                "type": "Nightlife",
                "description": "Enjoy cocktails and panoramic views at Sky Lounge Durres and other rooftop venues, perfect for warm summer evenings.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings provide perfect weather for rooftop dining and drinking with stunning sunset views.",
                "booking_tips": "Reservations recommended for sunset hours. Try local raki cocktails and enjoy panoramic city and sea views."
            },
            {
                "name": "Beach Volleyball and Sports",
                "type": "Sports",
                "description": "Join beach volleyball games, football, and other beach sports popular among locals and tourists during summer months.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer beach culture includes active sports participation and social interaction with locals and fellow travelers.",
                "booking_tips": "Equipment often available for rent or join pickup games. Great way to meet locals and other travelers."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Grape Harvest Festivals",
                "type": "Cultural Event",
                "description": "Participate in traditional Albanian grape harvest celebrations, featuring wine making, folk music, and autumn feast traditions.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn marks the traditional harvest season in Albania, with community celebrations and wine-making activities.",
                "booking_tips": "Contact local venues about harvest festivals. Great opportunity to experience authentic Albanian traditions."
            },
            {
                "name": "Peaceful Beach Walks",
                "type": "Leisure",
                "description": "Enjoy tranquil autumn beach walks with fewer crowds, comfortable temperatures, and beautiful light for photography.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers peaceful beach atmosphere with comfortable walking weather and stunning light conditions.",
                "booking_tips": "Perfect for photography and peaceful reflection. Bring light jacket for evening walks."
            },
            {
                "name": "Traditional Raki Tasting",
                "type": "Cultural/Culinary",
                "description": "Experience Albania's national spirit with traditional raki tasting, learning about production methods and cultural significance.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Autumn is traditional time for new raki production, offering freshest varieties and authentic cultural experiences.",
                "booking_tips": "Try at traditional tavernas. Ask about different varieties including grape, plum, and herb-infused raki."
            },
            {
                "name": "Archaeological Site Photography",
                "type": "Photography",
                "description": "Capture the Roman Amphitheatre and other historical sites in beautiful autumn light, with comfortable temperatures for extended exploration.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn light provides excellent photography conditions with warm, golden tones and comfortable exploration weather.",
                "booking_tips": "Golden hour photography especially stunning. Bring tripod for low-light shots and multiple lenses."
            },
            {
                "name": "Local Handicraft Shopping",
                "type": "Shopping",
                "description": "Browse local markets and shops for traditional Albanian handicrafts, textiles, and artisan products during comfortable autumn weather.",
                "indoor": true,
                "best_time": "Morning/Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn shopping offers comfortable weather for exploring markets and finding authentic Albanian products.",
                "booking_tips": "Central Market best in morning. Negotiate prices politely. Look for traditional Albanian textiles and crafts."
            },
            {
                "name": "Seafood Restaurant Hopping",
                "type": "Culinary",
                "description": "Explore Durres' seafood restaurants during the comfortable autumn season, enjoying fresh Adriatic catch in cozy indoor settings.",
                "indoor": true,
                "best_time": "Dinner",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn dining offers comfortable weather for restaurant exploration and seasonal seafood specialties.",
                "booking_tips": "Try different restaurants to compare preparations. Ask about seasonal fish and traditional Albanian seafood dishes."
            },
            {
                "name": "Cultural Museum Tours",
                "type": "Cultural",
                "description": "Deep exploration of Durres museums and cultural sites, taking advantage of cooler weather and fewer summer crowds.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn provides perfect weather for museum visits and cultural exploration with comfortable indoor temperatures.",
                "booking_tips": "Combine archaeological museum with historical sites. Allow full afternoon for comprehensive cultural experience."
            },
            {
                "name": "Ferry Terminal People Watching",
                "type": "Cultural",
                "description": "Observe the fascinating mix of travelers, locals, and maritime activity at Durres' busy ferry terminal connecting Albania to Italy.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn ferry traffic offers interesting cultural observation opportunities with comfortable outdoor temperatures.",
                "booking_tips": "Bring coffee from nearby cafes. Marina Bar offers good vantage point for observing port activity."
            },
            {
                "name": "Traditional Albanian Theater",
                "type": "Cultural Event",
                "description": "Attend performances at Aleksandër Moisiu Theatre, experiencing Albanian cultural performances and theatrical traditions.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Autumn theater season features traditional and contemporary Albanian performances in comfortable indoor settings.",
                "booking_tips": "Check schedule at theatre or tourist information. Performances usually in Albanian but cultural experience valuable."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Cozy Taverna Dining",
                "type": "Culinary",
                "description": "Experience authentic Albanian hospitality in traditional tavernas, enjoying hearty winter dishes like tavë kosi and warming raki.",
                "indoor": true,
                "best_time": "Dinner",
                "price_range": "Moderate",
                "seasonal_notes": "Winter dining emphasizes warm, hearty Albanian comfort foods and indoor socializing in traditional settings.",
                "booking_tips": "Try Taverna Tradicionale Iliria for authentic atmosphere. Order traditional winter warming dishes and local raki."
            },
            {
                "name": "Archaeological Museum Deep Dive",
                "type": "Cultural",
                "description": "Spend extended time exploring Durres Archaeological Museum, perfect for cooler winter days with detailed artifact examination.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter provides ideal conditions for thorough museum exploration with comfortable indoor environment.",
                "booking_tips": "Allow 2-3 hours for comprehensive visit. Ask about guided tours and detailed historical explanations."
            },
            {
                "name": "Traditional Coffee House Culture",
                "type": "Cultural",
                "description": "Experience authentic Albanian coffee culture in traditional coffee houses, enjoying Turkish coffee and local socializing traditions.",
                "indoor": true,
                "best_time": "Morning/Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter coffee house visits offer authentic cultural immersion and warm indoor social environments.",
                "booking_tips": "Try Cafe Central or Bar Kafe Shqiponja for authentic experience. Order traditional Turkish coffee and local pastries."
            },
            {
                "name": "Ferry Day Trips to Italy",
                "type": "Transportation/Tourism",
                "description": "Take advantage of winter ferry schedules for day trips to Bari or other Italian ports, experiencing cross-cultural travel.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Winter ferries offer comfortable heated indoor travel and opportunity to experience Italian culture as day trip.",
                "booking_tips": "Check winter schedules as some services reduced. Book cabins for comfortable crossing in cooler weather."
            },
            {
                "name": "Indoor Market Exploration",
                "type": "Shopping/Cultural",
                "description": "Explore covered markets and indoor shopping areas, discovering local products and traditional Albanian crafts in warm environments.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Winter market visits provide cultural immersion and shopping opportunities in comfortable indoor settings.",
                "booking_tips": "Central Market partially covered. Look for traditional textiles, crafts, and preserved foods. Bring cash for purchases."
            },
            {
                "name": "Historical Site Indoor Exploration",
                "type": "Historical",
                "description": "Focus on indoor historical attractions including covered archaeological areas and museum sections of ancient sites.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter exploration emphasizes covered archaeological areas and museum buildings with comfortable indoor access.",
                "booking_tips": "Combined tickets still valuable. Focus on museum areas and covered ruins. Dress warmly for outdoor portions."
            },
            {
                "name": "Traditional Albanian Workshops",
                "type": "Cultural Workshop",
                "description": "Participate in indoor cultural workshops learning traditional Albanian crafts, cooking, or music during winter months.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter workshops offer immersive cultural learning experiences in warm, indoor educational environments.",
                "booking_tips": "Book through cultural centers or hotels. Traditional craft workshops and cooking classes available year-round."
            },
            {
                "name": "Wine and Raki Appreciation",
                "type": "Food & Drink",
                "description": "Spend time learning about Albanian alcoholic beverages in cozy indoor settings, perfect for winter cultural exploration.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides perfect atmosphere for alcohol appreciation with indoor tastings and cultural learning.",
                "booking_tips": "Try Castello Wine Bar for wine education. Ask tavernas about raki varieties and traditional production methods."
            },
            {
                "name": "Coastal Storm Watching",
                "type": "Natural",
                "description": "Experience the dramatic winter Adriatic from covered viewpoints, watching storms and winter coastal conditions safely.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter storms can create dramatic coastal viewing opportunities from protected vantage points.",
                "booking_tips": "Dress very warmly and waterproof clothing essential. View from covered areas or indoor locations with sea views."
            }
        ]
    }
}