{
  "sites": [
    {
      "name": "Durres Amphitheatre",
      "type": "Ancient Roman Theatre",
      "description": "The largest Roman amphitheatre in the Balkans, built in the 2nd century AD. This well-preserved ancient site could accommodate up to 20,000 spectators and features underground tunnels and a Byzantine chapel.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Inexpensive",
      "seasonal_notes": "Visit early morning to avoid crowds and heat. Stunning views over the city and Adriatic Sea from the upper tiers.",
      "booking_tips": "Entry fee is minimal. Guided tours available in multiple languages. Photography allowed.",
      "ratings": {
        "cost_estimate": 300,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 41.3114,
      "longitude": 19.4469
    },
    {
      "name": "Archaeological Museum of Durres",
      "type": "Museum",
      "description": "Houses one of the most important archaeological collections in Albania, featuring artifacts from Illyrian, Greek, Roman, and Byzantine periods including beautiful mosaics and sculptures.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Inexpensive",
      "seasonal_notes": "Perfect for hot afternoons. Air-conditioned environment with excellent Roman and Illyrian artifacts.",
      "booking_tips": "Very affordable entry fee. Some exhibits have English descriptions. Allow time to see the impressive mosaic collection.",
      "ratings": {
        "cost_estimate": 200,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 41.3108,
      "longitude": 19.4581
    },
    {
      "name": "Durres Beach Promenade",
      "type": "Waterfront",
      "description": "A beautiful seaside promenade stretching along the Adriatic coast with cafes, restaurants, and stunning sunset views. Popular evening destination for locals and tourists.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Perfect for evening strolls and sunset watching. Very busy during summer months. Great for people watching.",
      "booking_tips": "No booking required. Numerous cafes and restaurants along the way. Best experienced during golden hour.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 41.3053,
      "longitude": 19.4736
    },
    {
      "name": "Venetian Tower",
      "type": "Historic Tower",
      "description": "A 15th-century Venetian watchtower, one of the few remaining structures from the Venetian period. Offers panoramic views of Durres and the surrounding coastline.",
      "indoor": false,
      "best_time": "Late Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Climb for excellent city and sea views. Particularly beautiful at sunset. Part of the old city fortifications.",
      "booking_tips": "Free to visit and climb. Be careful on the stairs. Great for photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 41.3125,
      "longitude": 19.4442
    },
    {
      "name": "Roman Baths",
      "type": "Ancient Roman Site",
      "description": "Well-preserved 2nd-century Roman baths complex showcasing the sophisticated engineering and lifestyle of ancient Dyrrhachium. Features heating systems and beautiful floor mosaics.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Inexpensive",
      "seasonal_notes": "Best visited in cooler parts of the day. Informative signs explain the Roman bathing process.",
      "booking_tips": "Combined ticket available with amphitheatre. Wear comfortable shoes for walking on ancient stones.",
      "ratings": {
        "cost_estimate": 200,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 41.3118,
      "longitude": 19.4475
    },
    {
      "name": "Durres City Walls",
      "type": "Ancient Fortification",
      "description": "Remnants of the ancient city walls built by Emperor Anastasius I in the 5th-6th centuries. The walls once protected the important port city of Dyrrhachium.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Scattered throughout the old city. Best preserved sections near the amphitheatre. Rich in historical significance.",
      "booking_tips": "Free to explore. Some sections integrated into modern buildings. Follow the archaeological trail markers.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 41.3119,
      "longitude": 19.4461
    },
    {
      "name": "Great Mosque of Durres",
      "type": "Mosque",
      "description": "The main mosque of Durres, rebuilt in the 1990s after communist-era destruction. Features traditional Ottoman architecture and serves as an active place of worship.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Dress modestly when visiting. Remove shoes before entering. Beautiful interior with traditional Islamic design.",
      "booking_tips": "Free to visit outside prayer times. Respectful behavior required. Photography restrictions may apply inside.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 41.3136,
      "longitude": 19.4458
    },
    {
      "name": "Durres Beach",
      "type": "Beach",
      "description": "The main sandy beach of Durres stretching for several kilometers along the Adriatic coast. Popular for swimming, sunbathing, and water sports during summer months.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Very crowded during summer. Early morning or late afternoon best for avoiding crowds. Numerous beach bars and restaurants.",
      "booking_tips": "Free access. Sunbed and umbrella rentals available. Many beachfront cafes and restaurants.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 2
      },
      "latitude": 41.2998,
      "longitude": 19.4892
    },
    {
      "name": "Royal Villa of Durres",
      "type": "Historic Villa",
      "description": "Former summer residence of King Zog I of Albania, built in the 1930s. Now houses a museum showcasing the royal period and offering insights into Albanian monarchy.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Inexpensive",
      "seasonal_notes": "Interesting insights into Albanian royal history. Beautiful architecture with period furnishings.",
      "booking_tips": "Small entry fee. Some rooms may be closed for restoration. Photography rules vary by room.",
      "ratings": {
        "cost_estimate": 300,
        "suggested_duration_hours": 1,
        "cultural_significance": 4
      },
      "latitude": 41.3089,
      "longitude": 19.4712
    },
    {
      "name": "Durres Port",
      "type": "Historic Port",
      "description": "One of the most important ports in the Adriatic, with over 2,000 years of continuous operation. The modern port handles ferries to Italy and cargo ships.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Active commercial port. Best viewed from the promenade. Ferries to Bari and Ancona depart regularly.",
      "booking_tips": "No special access required for viewing. Ferry terminal has cafes and services. Great for watching maritime activity.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 41.3197,
      "longitude": 19.4394
    },
    {
      "name": "Currila Beach",
      "type": "Beach",
      "description": "A quieter beach area south of Durres main beach, popular with locals. Less crowded alternative with cleaner water and more relaxed atmosphere.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Less developed than main beach. Better for those seeking tranquility. Some small local beach bars available.",
      "booking_tips": "Free access. Limited facilities compared to main beach. Good for a peaceful beach experience.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 2
      },
      "latitude": 41.2876,
      "longitude": 19.5123
    },
    {
      "name": "Fatih Mosque",
      "type": "Mosque",
      "description": "Historic Ottoman-era mosque dating to the 15th century, one of the oldest religious buildings in Durres. Features traditional Ottoman architectural elements.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Active mosque with beautiful interior. Represents Ottoman heritage in the city.",
      "booking_tips": "Respectful dress required. Remove shoes before entering. Best visited outside prayer times.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 41.3142,
      "longitude": 19.4463
    },
    {
      "name": "Aleksandër Moisiu Theatre",
      "type": "Theatre",
      "description": "The main theatre of Durres named after the famous Albanian actor. Hosts various cultural performances including drama, music, and dance.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Inexpensive",
      "seasonal_notes": "Check schedule for performances. Important cultural venue for the city.",
      "booking_tips": "Tickets available at box office. Performances usually in Albanian. Check seasonal programming.",
      "ratings": {
        "cost_estimate": 500,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 41.3156,
      "longitude": 19.4523
    },
    {
      "name": "Durres Central Market",
      "type": "Market",
      "description": "Traditional Albanian market offering fresh produce, local specialties, and handmade crafts. Great place to experience local culture and sample regional foods.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Inexpensive",
      "seasonal_notes": "Busiest in the morning. Great for local produce and Albanian specialties. Cash only for most vendors.",
      "booking_tips": "No booking required. Bring cash. Practice basic Albanian phrases for better interactions.",
      "ratings": {
        "cost_estimate": 1000,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 41.3167,
      "longitude": 19.4489
    },
    {
      "name": "Byzantine Wall Mosaics",
      "type": "Archaeological Site",
      "description": "Beautiful Byzantine-era mosaics discovered in various locations around Durres, showcasing the rich artistic heritage of the early Christian period.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Inexpensive",
      "seasonal_notes": "Protected indoor exhibits. Some of the finest Byzantine art in Albania.",
      "booking_tips": "Usually included with museum tickets. Photography may be restricted. Ask for guided explanations.",
      "ratings": {
        "cost_estimate": 200,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 41.3112,
      "longitude": 19.4471
    },
    {
      "name": "Cape of Rodon",
      "type": "Natural Site",
      "description": "Beautiful cape north of Durres featuring the ruins of Skanderbeg's castle and stunning coastal scenery. Popular day trip destination from Durres.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "About 30km from Durres. Spectacular coastal views and historical significance. Good for hiking.",
      "booking_tips": "Transportation needed from Durres. Bring water and sun protection. Some walking required.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 41.6339,
      "longitude": 19.4089
    },
    {
      "name": "Durres Railway Station",
      "type": "Historic Building",
      "description": "Historic railway station built during the communist era, representing important transportation infrastructure. Starting point for train journeys to Tirana.",
      "indoor": true,
      "best_time": "Any Time",
      "price_range": "Free",
      "seasonal_notes": "Functional railway station with historical significance. Trains to Tirana available.",
      "booking_tips": "Free to visit. Check train schedules if planning to travel. Basic facilities available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 2
      },
      "latitude": 41.3205,
      "longitude": 19.4378
    },
    {
      "name": "Iliria Archaeological Park",
      "type": "Archaeological Park",
      "description": "Open-air archaeological site showcasing Illyrian, Roman, and Byzantine remains scattered throughout the old city of Durres.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Self-guided exploration of ancient remains. Informational plaques explain historical context.",
      "booking_tips": "Free access. Follow marked archaeological trail. Wear comfortable walking shoes.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 41.3115,
      "longitude": 19.4465
    }
  ]
}