{
  "overview_paragraph": "Annecy is at its best in spring (April–June) and early fall (September–October), when café terraces hum along Place de la Paix, castle gardens bloom or turn gold, and walking weather is ideal around Lac d'Annecy. July brings long evenings and the Animation Film Festival—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days in the castle, patisserie stops, and twinkling holiday lights around the old town—while March begins to warm with the odd shower from the Alps.",
  "January": [
    "Château d'Annecy without the lines, steaming chocolat chaud in historic cafés, and misty lake walks between cozy bookshops.",
    "Winter light on the castle towers, snug bistros in the old town, and vintage hunts in covered passages."
  ],
  "February": [
    "Castle views at golden hour, Valentine's strolls around Lac d'Annecy, and jazz-lit nights in local wine bars.",
    "Shared macarons, candlelit bistros, and strolls past secret courtyards in the medieval quarter."
  ],
  "March": [
    "First blossoms in Parc de la Prairie, terrace tables returning to Place de la Paix, and old town bookshop wanders.",
    "Morning croissants, museum afternoons at Musée-Château d'Annecy, and blue-hour bridges welcoming spring back to Annecy."
  ],
  "April": [
    "Cherry trees in bloom around the castle, flaky croissants from local boulangeries, and bike rides from the old town around Lac d'Annecy.",
    "Spring light on Église Saint-Maurice, gallery-hopping in the covered passages, sunset cruise to a glittering Château d'Annecy."
  ],
  "May": [
    "Picnics in Parc de la Prairie, marchés brimming with Savoyard specialties, and twilight strolls around the lake promenade.",
    "Flowered castle gardens, open-air café moments on Place de la Paix, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, lake aperitifs at Port d'Annecy, and the city humming for Fête de la Musique.",
    "Sun-splashed castle grounds, lakeside picnics, and late sunsets that turn every bridge over the Thiou Canal into a viewpoint."
  ],
  "July": [
    "Animation Film Festival screenings by the lake, lazy afternoons in Parc de la Prairie, and moonlit Lac d'Annecy cruises.",
    "Summer markets, lakeside terraces with castle views, and gallery cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet boulevards, easy castle visits, and lake evenings with breezes off the water.",
    "Shaded castle gardens, courtyard cafés, and golden hours when the medieval city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits at Palais de l'Isle, lively terraces, and wine-tinted evenings in the Savoie region.",
    "Crisp mornings, flea-market finds, and gallery re-openings that make wandering the old town irresistible."
  ],
  "October": [
    "Autumn leaves in Parc de la Prairie, bistros aglow, and the harvest festival celebrations around the castle.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the Place de la Paix."
  ],
  "November": [
    "Beaujolais nouveau toasts, cozy brasseries, and castle afternoons while the city slows to a hush.",
    "Foggy lake mornings, medieval art indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Castle lights, Christmas markets at Place de la Paix, and skating beneath grand medieval façades.",
    "Vin chaud in hand, Église Saint-Maurice's bells, and winter sparkle from boulevard to covered passage."
  ]
}

