{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Protochronia)",
          "notes": "New Year's Day is a public holiday throughout Greece. Most attractions, shops, and restaurants in Heraklion operate with limited hours. Traditional Greek New Year's celebrations include the cutting of the Vasilopita cake with a hidden coin bringing luck to whoever finds it. The city is relatively quiet as residents recover from New Year's Eve celebrations, though the promenade along the Venetian Harbor may see locals taking traditional New Year's Day walks."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 2,
          "notes": "Early January in Heraklion features mild winter weather with average high temperatures around 15°C (59°F) and increased chances of rainfall. This is low season for tourism, so you'll find fewer crowds at major attractions like the Heraklion Archaeological Museum, Knossos Palace, and the Venetian Fortress. Winter sales begin in shops throughout the city, particularly along 25 August Street and the market areas. This is a good time to explore indoor cultural sites and enjoy the city's famous Cretan cuisine in cozy tavernas."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18],
          "score": 3,
          "notes": "Mid-January brings typical winter conditions to Heraklion. Unlike northern Greece, snowfall is extremely rare in the city. Indoor cultural attractions such as the Heraklion Archaeological Museum, Historical Museum of Crete, and Natural History Museum are excellent options during occasional rainy days. Winter specialties appear in local restaurants, including hearty soups and stews like fasolada (bean soup) and traditional Cretan meat dishes, perfect for the season."
        },
        {
          "days": [19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "Late January sees Heraklion with mild winter conditions, with temperatures rarely dropping below 8°C (46°F). Winter days can often be sunny and pleasant enough for exploring the city. When the weather permits, take advantage of clear days to visit the Venetian Walls and fortifications for panoramic views of the city and Cretan Sea. This is a perfect time to explore Heraklion's vibrant café culture, with many cozy establishments serving Greek coffee and traditional Cretan pastries."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 8,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "notes": "February continues with mild winter conditions but frequently features beautiful, clear days with comfortable temperatures. The first signs of spring can begin to appear toward the end of the month with almond trees blossoming in the countryside around Heraklion. Tourism remains low, making it an excellent time to enjoy the city's museums, galleries, and indoor attractions without crowds. February is a good month to explore Heraklion's café culture, with locals spending hours in the city's numerous coffee shops. Winter sales continue in many shops, offering good value for shoppers."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 9,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 4,
          "notes": "Early March marks the transition from winter to spring, with gradually warming temperatures and occasional rainfall. This shoulder season is ideal for exploring both archaeological sites like Knossos and cultural attractions with very manageable crowds. The countryside around Heraklion begins to show vibrant signs of spring with wildflowers appearing throughout the landscape."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Mid-March brings increasingly pleasant spring weather and longer days. The temperatures are perfect for exploring outdoor archaeological sites without the summer heat. This is an excellent time to visit Knossos Palace and other Minoan sites in the area, as well as for hiking in the nearby countryside where spring wildflowers are beginning to bloom in abundance."
        },
        {
          "days": [17, 18, 19, 20, 21, 22, 23, 24],
          "score": 4,
          "notes": "Mid-March brings more reliable spring weather with temperatures continuing to rise. Outdoor cafés and restaurants begin setting up their terraces along the harbor and in popular areas like Lions Square. This is an excellent time to explore the city's historic districts and enjoy the panoramic views from the Venetian walls without summer crowds or heat."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Greek Independence Day (Ikostí Pémpti Martíou)",
          "notes": "March 25th is a major national holiday celebrating Greek Independence Day. A military and student parade takes place in central Heraklion, particularly along the main thoroughfares. Museums and archaeological sites may have modified hours but typically remain open. Many restaurants offer special menus featuring traditional Greek foods, particularly bakaliaros (fried cod) and skordalia (garlic sauce), which are traditionally eaten on this day."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Easter Preparations",
          "notes": "Late March may include Easter preparations (if Orthodox Easter falls in March/early April). The weather becomes increasingly pleasant with spring temperatures averaging around 18°C (64°F). If Easter falls in late March/early April, expect increased activity in churches around Heraklion, particularly the Cathedral of St. Minas, with special services and preparations for Holy Week."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 10,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Holy Week & Easter (Megali Evdomada & Pascha)",
          "notes": "If Orthodox Easter falls in April, Heraklion observes Holy Week with solemn processions and religious ceremonies at the city's churches. Good Friday features evening processions of the Epitaphios (Christ's funeral bier) through neighborhoods across the city. Easter Sunday is celebrated with special services, particularly the midnight Resurrection service on Saturday night with candles and fireworks, followed by traditional feasts featuring roast lamb. April brings reliable spring weather with wildflowers blooming throughout the countryside and archaeological sites. This is an excellent time for walking tours of the city and visiting outdoor monuments like Knossos Palace, without the intense summer heat."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 12,
      "tourismLevel": 6
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Ergatiki Protomagia)",
          "notes": "May 1st is International Workers' Day and a public holiday in Greece. Traditional celebrations include collecting flowers and making wreaths to hang on doors. Many Heraklion residents also use this holiday for excursions to nearby countryside areas or beaches. There may be organized labor demonstrations in central Heraklion, particularly around Lions Square and Eleftherias Square."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "May brings ideal weather with warm, sunny days averaging 24°C (75°F) and minimal rainfall. Tourism increases but hasn't yet reached summer peak levels. This is considered one of the best months to visit Heraklion with perfect conditions for exploring archaeological sites like Knossos, Phaistos, and Malia. The beaches begin to warm up enough for swimming, and outdoor dining reaches its prime in neighborhoods around the Old Harbor and Lions Square. The countryside around Heraklion is spectacularly green and dotted with wildflowers before the summer heat sets in."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 15,
      "tourismLevel": 7
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 5,
          "notes": "Early June brings warm summer weather to Heraklion with temperatures typically around 27°C (81°F). This is an excellent time to visit the city before the peak heat and crowds of July and August. Cultural activities increase with outdoor performances beginning in various venues throughout the city. The beaches of Crete become increasingly popular, with water temperatures comfortable for swimming."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Heraklion Summer Arts Festival",
          "notes": "Late June marks the beginning of the Heraklion Summer Arts Festival, featuring music, dance, and theatrical performances at various venues throughout the city. Summer solstice (June 21) brings European Music Day celebrations with free concerts throughout the city's public spaces. Open-air cinemas begin operating throughout the city, showing both international and Greek films. The city's beaches are now fully operational with water sports and facilities available."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 18,
      "tourismLevel": 8
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6],
          "score": 4,
          "notes": "Early July brings high summer with temperatures reaching 29°C (84°F) and virtually no rainfall. Tourism increases as European summer holidays begin. Morning hours are best for visiting archaeological sites like Knossos before the midday heat. The city's beaches become busy with locals and tourists seeking relief from the heat."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Summer Cultural Festivals",
          "notes": "Throughout July, Heraklion hosts various cultural events and festivals including performances at the Nikos Kazantzakis Theater and other open-air venues. The waterfront becomes extremely lively in the evenings as people escape the daytime heat. Evening activities dominate, with outdoor cinemas, rooftop dining, and cultural performances starting after sunset. Day trips to nearby beaches like Ammoudara, Agia Pelagia, and Matala become popular for cooling off during hot days."
        }
      ],
      "weatherHighC": 29,
      "weatherLowC": 21,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early August brings Heraklion's hottest temperatures, often exceeding 30°C (86°F). This is the peak tourist season with maximum crowds at all major attractions and beaches. Early morning or evening visits to archaeological sites are recommended to avoid the midday heat. The sea is at its warmest temperature, making it perfect for swimming and water activities along Crete's coastline."
        },
        {
          "days": [15],
          "score": 4,
          "special": true,
          "event": "Dormition of the Virgin Mary (Koimisis tis Theotokou)",
          "notes": "August 15th is a major religious holiday celebrating the Dormition (Assumption) of the Virgin Mary. This is one of the most important feast days in the Greek Orthodox calendar. Special services are held at churches throughout Heraklion, particularly at the Cathedral of St. Minas and churches dedicated to the Virgin Mary. Many Cretans return to ancestral villages for this holiday, though tourist areas remain extremely busy."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "August Full Moon Events",
          "notes": "Around the August full moon, archaeological sites like Knossos often host special evening events with extended hours and cultural performances. Late August maintains high summer conditions with hot temperatures around 30°C (86°F). This is still peak tourist season with maximum crowds at all major attractions. Evening activities dominate city life, with open-air cinemas, cultural events, and dining typically starting after 8 PM when temperatures begin to cool."
        }
      ],
      "weatherHighC": 30,
      "weatherLowC": 22,
      "tourismLevel": 10
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 5,
          "notes": "Early September brings ideal conditions with warm temperatures around 27°C (81°F) but without the extreme heat or crowds of August. Tourism begins to decrease as European summer holidays end, making it an excellent time to visit with good weather and more manageable visitor numbers. The sea remains warm enough for comfortable swimming at Crete's beaches."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Heraklion Wine Festival",
          "notes": "Mid-September often features the Heraklion Wine Festival, celebrating Crete's renowned wine production. Local wineries showcase their products with tastings and special events throughout the city. The weather remains excellent for exploring both the city and countryside, with pleasant temperatures and minimal rainfall. This is one of the best times to visit Crete, with summer-like conditions but without the intense heat or crowds of peak season."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Late September continues to offer ideal visiting conditions in Heraklion. The temperatures remain pleasantly warm, typically around 25°C (77°F), perfect for exploring archaeological sites and the city's historical center. The sea remains warm enough for swimming, but beaches are significantly less crowded than during summer months. This period is widely considered one of the best times to visit Heraklion and Crete in general."
        }
      ],
      "weatherHighC": 27,
      "weatherLowC": 19,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "notes": "October brings pleasant autumn weather to Heraklion with temperatures around 23°C (73°F). Tourism continues to decrease, creating ideal conditions for exploring the city and archaeological sites without crowds. The sea remains warm enough for swimming during the first half of the month. This is an excellent month for hiking in the countryside around Heraklion, with comfortable temperatures and beautiful autumn landscapes."
        },
        {
          "days": [26, 27],
          "score": 5,
          "notes": "Late October continues with pleasant autumn weather and the possibility of occasional rainfall. This is still an excellent time to explore Heraklion's cultural attractions like the Archaeological Museum, which houses the world's finest collection of Minoan artifacts."
        },
        {
          "days": [28],
          "score": 5,
          "special": true,
          "event": "Oxi Day (Epéteios tou Óhi)",
          "notes": "October 28th is 'Oxi Day' ('No' Day), commemorating Greece's refusal to surrender to Axis powers in 1940. A military and student parade takes place in central Heraklion. Most museums and archaeological sites remain open, though some may have modified hours. Schools and businesses are closed for this national holiday, and patriotic celebrations take place throughout the city."
        },
        {
          "days": [29, 30, 31],
          "score": 5,
          "notes": "Late October continues with pleasant autumn weather and the possibility of occasional rainfall. Temperatures typically remain comfortable around 20°C (68°F). This is an excellent time for cultural experiences including museum visits and exploring the city's historical center without summer crowds."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 16,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 4,
          "notes": "Early November sees autumn conditions with temperatures around 20°C (68°F) and increased chances of rainfall. Tourism levels are low, making it an excellent time to explore the city's cultural attractions without crowds. The Archaeological Museum and Historical Museum of Crete are particularly rewarding to visit during this period."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Olive Harvesting Season",
          "notes": "Mid-to-late November marks the beginning of the olive harvesting season in Crete. This is a significant cultural and agricultural tradition on the island. The weather becomes cooler with temperatures around 18°C (64°F) and increased chances of rainfall. This is an excellent time for cultural experiences including museum visits, the vibrant café culture, and enjoying Cretan gastronomy featuring seasonal ingredients. Indoor attractions become particularly appealing, with the Archaeological Museum housing the world's most important collection of Minoan artifacts. Late November sees the beginning of Christmas preparations with decorations starting to appear throughout the city center."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 13,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "special": true,
          "event": "Christmas Celebrations",
          "notes": "Throughout December, Heraklion hosts Christmas markets and festivities in central areas, particularly at Lions Square and Eleftherias Square. The city center is beautifully decorated with Christmas lights and festive displays. Special cultural events, concerts, and performances take place at venues throughout the city. December brings mild winter weather with temperatures around 16°C (61°F) and increased rainfall, though clear, sunny winter days are also common."
        },
        {
          "days": [24, 25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Paramoni Christougennon & Christougenna)",
          "notes": "Christmas is celebrated throughout Heraklion with special services at churches, particularly at the Cathedral of St. Minas. Many restaurants offer special Christmas menus, though some may close for family celebrations on Christmas Day. Most major archaeological sites and museums remain open during the holiday period but may have reduced hours on Christmas Eve and Day. The Christmas season in Greece traditionally extends through January 6 (Epiphany), so celebrations continue past Christmas Day."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is festive in Heraklion, with holiday decorations, special events, and a generally celebratory atmosphere. Shopping areas remain busy with winter sales beginning at some stores. Major tourist attractions maintain normal winter hours, and the city's cultural life continues with special holiday performances and events."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Paramoni Protochronias)",
          "notes": "New Year's Eve celebrations center around Lions Square and the main city areas with midnight countdowns, music, and fireworks. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. A unique Greek New Year's tradition is the smashing of a pomegranate on the doorstep at midnight for good luck. The city maintains a festive atmosphere with families and friends gathering to welcome the New Year."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 10,
      "tourismLevel": 3
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the Palace of Knossos and other Minoan archaeological sites with ideal temperatures",
      "Visiting the Heraklion Archaeological Museum with its world-class Minoan collection",
      "Walking along the Venetian Harbor and historic city walls",
      "Heraklion Food Tours featuring seasonal spring ingredients and Cretan specialties",
      "Hiking in the countryside around Heraklion during wildflower season",
      "Day trips to nearby traditional villages like Archanes and Thrapsano",
      "Greek Easter celebrations and traditions (when applicable)",
      "Outdoor café culture in Lions Square and along the harbor",
      "Photography excursions capturing spring light on monuments and landscapes"
    ],
    "summer": [
      "Early morning visits to archaeological sites like Knossos before peak heat",
      "Cultural events at open-air venues throughout the city",
      "Evening dining along the Venetian Harbor with views of the fortress",
      "Day trips to nearby beaches like Ammoudara, Agia Pelagia, and Matala",
      "Open-air cinema experiences showing films under the stars",
      "Boat cruises along the northern coast of Crete",
      "Summer festival events with music and performances",
      "Evening walking tours of the old city when temperatures cool",
      "Water sports at the beaches around Heraklion"
    ],
    "autumn": [
      "Perfect weather for extended exploration of archaeological sites",
      "Wine tasting featuring new harvest Cretan wines",
      "Museum visits including the world-class Heraklion Archaeological Museum",
      "Hiking in the hills around Heraklion with panoramic coastal views",
      "Seasonal gastronomy featuring autumn ingredients at local tavernas",
      "Olive harvest experiences in nearby villages",
      "Photography walks capturing golden autumn light on monuments",
      "Day trips to less-visited archaeological sites like Phaistos and Gortyna",
      "Cultural performances at indoor venues as the weather cools"
    ],
    "winter": [
      "Heraklion Christmas Market and festive celebrations",
      "New Year's celebrations and traditions",
      "Winter shopping along 25 August Street and in the market areas",
      "Museum explorations during occasional rainy days",
      "Traditional winter cuisine featuring seasonal Cretan specialties",
      "Cozy café culture centered around Greek coffee and traditional pastries",
      "Winter views from the Venetian walls on clear days",
      "Indoor cultural performances at historic venues",
      "Greek Orthodox Christmas and Epiphany traditions"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or mild, occasionally wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}