{
    "sites": [
        {
            "name": "Palace of Knossos",
            "type": "Minoan Archaeological Site",
            "description": "The legendary Minoan Palace, epicenter of Europe's oldest civilization (dating back to 2000 BC). Linked to myths like the Labyrinth and the Minotaur. Features restored frescoes, multi-story buildings, advanced drainage systems, and a central court. Discovered and partially reconstructed by Sir Arthur Evans. A vast complex showcasing Minoan culture, art, and architecture.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. Very popular, especially in summer. Minimal shade, so best visited early morning or late afternoon to avoid heat and crowds. Spring/Autumn offer pleasant weather.",
            "booking_tips": "Buy tickets online in advance to skip lines. Consider a combined ticket with the Heraklion Archaeological Museum. Allow 2-3 hours. Guided tours or audio guides highly recommended for context. Located just south of Heraklion city.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 35.2982,
            "longitude": 25.1629
        },
        {
            "name": "Heraklion Archaeological Museum",
            "type": "Major Archaeological Museum",
            "description": "One of the most significant museums in Greece, housing the world's foremost collection of Minoan art and artifacts. Displays treasures from Knossos, Phaistos, Malia, and other sites across Crete, spanning from the Neolithic period to Roman times. Highlights include the Phaistos Disc, snake goddess figurines, exquisite pottery, jewelry, and frescoes like 'La Parisienne' and the 'Bull-Leaping Fresco'.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Climate-controlled. Open year-round, potential reduced hours in winter. Can be busy during peak season.",
            "booking_tips": "Allow 2-3 hours. Consider the combined ticket with Knossos. Audio guides available. Centrally located in Heraklion city. Essential visit for understanding Minoan civilization.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 35.3394,
            "longitude": 25.1358
        },
        {
            "name": "Koules Fortress (Rocca a Mare)",
            "type": "Venetian Fortress",
            "description": "Impressive Venetian fortress guarding the entrance to Heraklion's old harbour. Built in the early 16th century, it features thick stone walls, battlements, and storage rooms. The symbol of Heraklion, offering panoramic views of the city, harbour, and sea. Inside, occasional exhibitions are held, and reliefs of the Lion of St. Mark (symbol of Venice) adorn the walls.",
            "indoor": true,
            "best_time": "Late Afternoon/Sunset",
            "price_range": "Budget",
            "seasonal_notes": "Open year-round. Exposed location can be windy. Offers great sunset views over the Aegean Sea.",
            "booking_tips": "Purchase tickets at the entrance. Allow 1 hour. Easily accessible from the city center via the harbour mole. Combine with a walk along the Venetian walls.",
            "ratings": {
                "cost_estimate": 4,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 4
            },
            "latitude": 35.3440,
            "longitude": 25.1375
        },
        {
            "name": "Historical Museum of Crete",
            "type": "Historical/Cultural Museum",
            "description": "Presents a comprehensive overview of Cretan history from early Christian times (4th century AD) to the modern era. Exhibits cover Byzantine, Venetian, and Ottoman periods, the Cretan State, WWII (Battle of Crete), and Ethnography. Highlights include works by El Greco (born in Crete), Byzantine icons, ceramics, textiles, and recreated traditional Cretan interiors.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Budget",
            "seasonal_notes": "Climate-controlled. Open year-round with potential seasonal hour changes.",
            "booking_tips": "Allow 1.5-2 hours. Located near the seafront in Heraklion. Provides broader historical context beyond the Minoan era.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 35.3410,
            "longitude": 25.1315
        },
        {
            "name": "Morosini Fountain (Lions Square)",
            "type": "Historic Landmark/Square",
            "description": "An ornate Venetian fountain located in Eleftheriou Venizelou Square, universally known as Lions Square ('Plateia Leonton'). Built in 1628 by Francesco Morosini, it features four lions supporting the main basin and mythological reliefs. A central meeting point in Heraklion, surrounded by cafes and shops. Once supplied the city with fresh water.",
            "indoor": false,
            "best_time": "Anytime",
            "price_range": "Free",
            "seasonal_notes": "Bustling year-round. Popular spot for locals and tourists to relax and people-watch.",
            "booking_tips": "Free to visit. Cafes around the square offer refreshments. Often a starting point for exploring the city center.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 35.3391,
            "longitude": 25.1338
        },
        {
            "name": "Venetian Loggia",
            "type": "Historic Building",
            "description": "Considered one of the most elegant Venetian buildings in Crete. Built in the 17th century, it served as a meeting place for the Duke and nobles. Features graceful arches and Palladian architectural influences. Today, it houses the Heraklion Town Hall. Located near Lions Square.",
            "indoor": false,
            "best_time": "Anytime (Exterior viewing)",
            "price_range": "Free",
            "seasonal_notes": "Exterior accessible year-round. Interior access limited as it's a working administrative building.",
            "booking_tips": "Admire the architecture from the outside. Located on 25th August Street, Heraklion's main pedestrian thoroughfare leading from the port.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.25,
                "cultural_significance": 3
            },
            "latitude": 35.3399,
            "longitude": 25.1338
        },
        {
            "name": "Church of Agios Titos",
            "type": "Historic Church",
            "description": "An important religious site dedicated to Saint Titus, a disciple of Apostle Paul and the first Bishop of Crete. Originally built in the Byzantine era, it was converted into a mosque during Ottoman rule and rebuilt after a fire in 1856. The current structure blends Ottoman and Byzantine elements. Houses the venerated skull of Saint Titus.",
            "indoor": true,
            "best_time": "Morning/Evening",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. Respectful attire required. May have limited visiting hours during services.",
            "booking_tips": "No booking needed. Allow 30 minutes. Located on 25th August Street near the Loggia.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 35.3405,
            "longitude": 25.1339
        },
        {
            "name": "Natural History Museum of Crete",
            "type": "Science/Natural History Museum",
            "description": "Showcases the rich biodiversity and geological history of Crete and the wider Mediterranean region. Features impressive exhibits on local flora and fauna, including large dioramas of Cretan ecosystems, fossils (including the Deinotherium giganteum), and an earthquake simulator ('Seismic Table'). Engaging for both adults and children.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Budget",
            "seasonal_notes": "Climate-controlled. Open year-round.",
            "booking_tips": "Allow 1.5-2 hours. Located along the western waterfront of Heraklion. Good option for families.",
            "ratings": {
                "cost_estimate": 7.5,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 35.3406,
            "longitude": 25.1277
        },
        {
            "name": "Heraklion Old Town & Market Street (1866 Street)",
            "type": "Historic Area/Market",
            "description": "Explore the pedestrianized streets of Heraklion's old center. 1866 Street is the central market street, bustling with shops selling souvenirs, local produce, herbs, spices, cheese, and traditional crafts. Wander through surrounding alleys to discover hidden squares, Venetian and Ottoman architecture, cafes, and tavernas.",
            "indoor": false,
            "best_time": "Morning (Market)/Anytime (General)",
            "price_range": "Free",
            "seasonal_notes": "Market is busiest in the mornings. Shops generally open Mon-Sat. Pleasant for walking year-round, though can be crowded in summer.",
            "booking_tips": "Free to wander. Allow 1-2 hours for exploring and shopping. Wear comfortable shoes. Starts near Lions Square.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 35.3380,
            "longitude": 25.1345
        },
        {
            "name": "Venetian Walls & Nikos Kazantzakis Tomb",
            "type": "Historic Fortifications/Memorial",
            "description": "Massive defensive walls built by the Venetians surrounding the old city. Well-preserved and walkable in sections, offering great city views. The Martinengo Bastion, the highest point, holds the simple tomb of Nikos Kazantzakis, Crete's most famous author, bearing the epitaph: 'I hope for nothing. I fear nothing. I am free.'",
            "indoor": false,
            "best_time": "Late Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Accessible year-round. Best enjoyed in cooler weather or times of day. Some sections offer shade from trees.",
            "booking_tips": "Free to access and walk along designated paths. Wear comfortable shoes. Access points around the old city. The tomb itself is a quiet, contemplative spot.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 35.3341,
            "longitude": 25.1337
        },
        {
            "name": "Museum of Christian Art (St. Catherine of Sinai Church)",
            "type": "Religious Art Museum/Historic Church",
            "description": "Housed in the historic 16th-century Church of St. Catherine (Agia Aikaterini), this museum displays a significant collection of post-Byzantine Cretan art. Features icons, frescoes, wood carvings, manuscripts, and vestments primarily from the 15th to 19th centuries, highlighting the Cretan School of icon painting.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Budget",
            "seasonal_notes": "Climate-controlled indoor space. Open year-round, check for specific hours.",
            "booking_tips": "Tickets purchased on site. Allow 1 hour. Located near the Agios Minas Cathedral. Offers insight into Crete's rich religious artistic tradition.",
            "ratings": {
                "cost_estimate": 4,
                "suggested_duration_hours": 1.0,
                "cultural_significance": 4
            },
            "latitude": 35.3373,
            "longitude": 25.1325
        },
        {
            "name": "CretAquarium Thalassocosmos",
            "type": "Aquarium/Marine Research Center",
            "description": "One of Europe's largest and most modern aquariums, showcasing the diverse marine life of the Mediterranean Sea. Features over 60 tanks housing thousands of organisms, including sharks, rays, turtles, and colourful fish. Part of the Hellenic Centre for Marine Research.",
            "indoor": true,
            "best_time": "Anytime",
            "price_range": "Moderate",
            "seasonal_notes": "Indoor attraction, suitable for all weather. Can be busy during peak season and weekends.",
            "booking_tips": "Tickets can be bought online or on site. Allow 1.5-2 hours. Located in Gournes, about 15km east of Heraklion city center (requires transport - bus or car). Great for families.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 2.0,
                "cultural_significance": 2
            },
            "latitude": 35.3328,
            "longitude": 25.2830
        }
    ]
}