{
    "Spring": {
        "activities": [
            {
                "name": "Funchal Flower Festival (Festa da Flor)",
                "type": "Cultural Festival/Parade",
                "description": "Madeira's iconic celebration of spring, featuring elaborate floral carpets lining the streets, a vibrant flower parade with allegorical floats, folk group performances, workshops, and markets.",
                "indoor": false,
                "best_time": "Daytime (Parade/Carpets)/Evening (Performances)",
                "price_range": "Free (Street events)/Paid (Seated parade viewing)",
                "seasonal_notes": "Usually held in late April or early May over several days. The highlight is the main Flower Parade (Cortejo Alegórico da Flor) on Sunday.",
                "booking_tips": "Book flights and accommodation well in advance as this is a major event. Secure tickets for seated parade viewing early if desired, otherwise find a spot along the route."
            },
            {
                "name": "Levada Hiking",
                "type": "Hiking/Nature",
                "description": "Explore Madeira's unique irrigation channels (levadas) offering scenic walks through lush Laurissilva forests, past waterfalls, and providing stunning mountain or coastal views.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Self-guided)/Moderate (Guided tours)",
                "seasonal_notes": "Spring offers pleasant temperatures, abundant water in the levadas, and blooming wildflowers along the trails. Weather can still be changeable.",
                "booking_tips": "Choose trails appropriate for your fitness level (e.g., Balcões - easy, Caldeirão Verde - moderate/hard). Check weather conditions before setting out. Consider guided tours for transport and context."
            },
            {
                "name": "Garden Visits (Monte Palace / Botanical Garden)",
                "type": "Gardens/Nature",
                "description": "Visit Funchal's famous gardens, Monte Palace Tropical Garden or the Botanical Garden, showcasing exotic and endemic flora in spectacular hilltop settings.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Moderate (Entrance fees)",
                "seasonal_notes": "Spring is peak blooming season for many flowers like azaleas, camellias, and orchids, making the gardens exceptionally vibrant.",
                "booking_tips": "Allow several hours for each garden. Monte Palace is easily reached via cable car from Funchal. The Botanical Garden can be reached by bus or another cable car from Monte."
            },
            {
                "name": "Festa dos Limões (Lemon Festival) - Ilha",
                "type": "Local Festival/Gastronomy",
                "description": "Celebration in the parish of Ilha (Santana) dedicated to the lemon, featuring exhibitions, traditional food stalls using lemons, music, and cultural activities.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free entrance (Pay for food/purchases)",
                "seasonal_notes": "Typically held over a weekend in April, showcasing a key agricultural product of the region.",
                "booking_tips": "Requires travel from Funchal (approx. 1 hour drive). Check local schedules for specific dates and event timings. Opportunity to taste lemon-based Poncha and sweets."
            },
            {
                "name": "Canyoning Adventures",
                "type": "Adventure Sport/Nature",
                "description": "Descend Madeira's stunning river gorges by rappelling down waterfalls, jumping into crystal-clear pools, and navigating the natural water slides, led by experienced guides.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Expensive",
                "seasonal_notes": "Spring offers good water levels from winter rains and increasingly pleasant temperatures for water activities.",
                "booking_tips": "Book with certified adventure tour operators. Various levels available, from beginner to advanced. All equipment (wetsuit, helmet, harness) is provided."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Atlantic Festival (Festival do Atlântico)",
                "type": "Cultural Festival/Fireworks Competition",
                "description": "Month-long festival featuring classical music concerts and culminating in spectacular international pyro-musical firework shows held every Saturday night in Funchal harbour.",
                "indoor": false,
                "best_time": "Saturday Evenings (Fireworks - approx. 10:30 PM)",
                "price_range": "Free (Viewing)/Moderate (Concerts)",
                "seasonal_notes": "Takes place throughout June. The fireworks competition is a major highlight, attracting large crowds to the waterfront.",
                "booking_tips": "Find a viewing spot along the Avenida do Mar or from viewpoints above the city well in advance of the firework displays. Restaurants with harbour views get booked up early."
            },
            {
                "name": "Dolphin & Whale Watching",
                "type": "Boat Tour/Wildlife",
                "description": "Take a catamaran or speedboat trip from Funchal Marina into the Atlantic to spot various species of dolphins and whales that frequent Madeira's waters.",
                "indoor": false,
                "best_time": "Morning/Afternoon",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "Summer offers the calmest sea conditions and highest likelihood of sightings for species like Sperm Whales, Bryde's Whales, Bottlenose Dolphins, and Atlantic Spotted Dolphins.",
                "booking_tips": "Book tours a day or two in advance. Choose operators committed to responsible wildlife viewing. Bring sunscreen and a hat. Sightings are common but not guaranteed."
            },
            {
                "name": "Madeira Wine Rally (Rali Vinho da Madeira)",
                "type": "Motorsport/Event",
                "description": "Major international car rally event, part of European and Portuguese championships, featuring high-speed stages across Madeira's challenging mountain roads.",
                "indoor": false,
                "best_time": "Daytime (Race Stages)",
                "price_range": "Free (Viewing along stages)/Paid (Service Park access maybe)",
                "seasonal_notes": "Usually held in early August. Attracts large crowds of motorsport fans to various spectator points across the island.",
                "booking_tips": "Check the official rally schedule for stage locations and timings. Access to spectator zones requires navigating island roads, plan travel time. Be mindful of safety instructions."
            },
            {
                "name": "Swimming at Lido Complexes / Praia Formosa",
                "type": "Leisure/Beach",
                "description": "Enjoy swimming and sunbathing at Funchal's coastal bathing areas, including the saltwater pools of the Lido Complex or the volcanic sands/pebbles of Praia Formosa.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Praia Formosa)/Budget (Lido entry fee)",
                "seasonal_notes": "Summer offers the warmest sea temperatures and ideal weather for sunbathing and swimming.",
                "booking_tips": "Lido complexes offer facilities like changing rooms, sunbeds (extra cost), and cafes. Praia Formosa is a free public beach. Both can be busy in peak summer."
            },
            {
                "name": "Outdoor Concerts and Festivals",
                "type": "Music/Cultural Events",
                "description": "Various smaller festivals, outdoor concerts, and cultural events often take place in Funchal's parks (like Santa Catarina Park) and squares during the summer months.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies (Free to Moderate)",
                "seasonal_notes": "Long summer evenings are perfect for outdoor entertainment. Check local listings (e.g., Cultura Madeira website) for schedules.",
                "booking_tips": "Check local event guides upon arrival or online beforehand. Popular free events can get crowded."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Madeira Wine Festival (Festa do Vinho da Madeira)",
                "type": "Cultural Festival/Gastronomy",
                "description": "Celebrates Madeira's rich wine heritage with activities in Funchal (wine tasting, historical parades, folklore) and Estreito de Câmara de Lobos (live grape treading, harvest festivities).",
                "indoor": false, 
                "best_time": "Daytime/Evening",
                "price_range": "Free (Street events)/Moderate (Paid tastings/events)",
                "seasonal_notes": "Typically held late August into early September, coinciding with the grape harvest season.",
                "booking_tips": "Check the official program for specific event dates and locations. Participate in tastings along Avenida Arriaga in Funchal or consider a trip to Estreito for the live harvest events."
            },
            {
                "name": "Columbus Festival - Porto Santo",
                "type": "Historical Festival/Cultural",
                "description": "Historical reenactment festival on the neighboring island of Porto Santo, celebrating Christopher Columbus's time there, featuring 15th-century markets, parades, music, and a reenactment of his landing.",
                "indoor": false,
                "best_time": "Daytime/Evening",
                "price_range": "Free (Festival access)/Moderate (Ferry/Flight to Porto Santo)",
                "seasonal_notes": "Usually held over several days in mid-September. Requires travel to Porto Santo island.",
                "booking_tips": "Book ferry (Porto Santo Line) or flight tickets well in advance if planning to attend. Accommodation on Porto Santo also needs early booking."
            },
            {
                "name": "Hiking Levadas & Mountains",
                "type": "Hiking/Nature",
                "description": "Enjoy hiking with cooler temperatures and fewer crowds than summer. Explore popular routes like Pico do Arieiro to Pico Ruivo or quieter levada walks.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free (Self-guided)/Moderate (Guided tours)",
                "seasonal_notes": "Autumn offers pleasant hiking weather, beautiful colours in the landscape, and generally good visibility, though weather can become more unpredictable later in the season.",
                "booking_tips": "Check weather forecasts, especially for mountain hikes. Bring layers and waterproof gear. Daylight hours become shorter."
            },
            {
                "name": "Madeira Nature Festival",
                "type": "Outdoor Activities/Festival",
                "description": "Week-long festival promoting Madeira's natural beauty and outdoor activities, offering opportunities to try hiking, canyoning, mountain biking, surfing, and other adventures, often at reduced prices or with special programs.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Varies (Some free activities, others paid)",
                "seasonal_notes": "Typically held in October, encouraging exploration of the island's diverse landscapes and adventure sports potential.",
                "booking_tips": "Check the official festival program released beforehand for schedules and booking details for specific activities. Popular activities may require advance registration."
            },
            {
                "name": "Chestnut Roasting (Magusto)",
                "type": "Cultural/Gastronomy",
                "description": "Experience the traditional Magusto celebration around St. Martin's Day (Nov 11th) or find street vendors roasting and selling chestnuts in Funchal center.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Budget",
                "seasonal_notes": "Roasted chestnuts (castanhas assadas) appear on street corners from late October/November, marking the arrival of autumn/winter.",
                "booking_tips": "Look for chestnut vendors in central Funchal, especially along Avenida Arriaga or near the Mercado. Some villages (like Curral das Freiras) have specific Chestnut Festivals."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Funchal Christmas Lights & Decorations",
                "type": "Festive Atmosphere/Sightseeing",
                "description": "Experience one of Europe's most spectacular festive displays, with intricate light installations illuminating Funchal's streets, squares, and harbour from early December.",
                "indoor": false,
                "best_time": "Evening (After dark)",
                "price_range": "Free",
                "seasonal_notes": "Lights are typically switched on December 1st and remain until early January. The whole city center becomes a festive wonderland.",
                "booking_tips": "Wander through the city center (Avenida Arriaga, Cathedral area, Praça do Município) after sunset to fully appreciate the displays. It gets crowded closer to Christmas."
            },
            {
                "name": "New Year's Eve Fireworks Display",
                "type": "Celebration/Fireworks",
                "description": "Witness Funchal's world-renowned New Year's Eve fireworks display, officially recognized as one of the largest globally, launched from multiple points around the Funchal bay amphitheater.",
                "indoor": false,
                "best_time": "Midnight (Dec 31st)",
                "price_range": "Free (Public viewing)/Expensive (Hotels/Restaurants/Boat trips)",
                "seasonal_notes": "The main event of the winter season, attracting huge crowds. The atmosphere in the city is electric.",
                "booking_tips": "Book accommodation and flights extremely far in advance. Choose a viewing spot early (waterfront, viewpoints above the city). Many hotels offer packages. Boat trips offer unique views but book months ahead."
            },
            {
                "name": "Mercado dos Lavradores at Christmas",
                "type": "Market/Festive Atmosphere",
                "description": "Visit the main market during the festive season, especially on 'Market Night' (Noite do Mercado) on Dec 23rd, when it stays open late with crowds singing carols, drinking, and soaking up the unique atmosphere.",
                "indoor": true,
                "best_time": "Daytime (General festive)/Late Night (Dec 23rd)",
                "price_range": "Free entrance (Pay for purchases)",
                "seasonal_notes": "Market Night (Dec 23rd) is a massive, unique Funchal tradition, very crowded but incredibly atmospheric.",
                "booking_tips": "Visit during the day for festive shopping. If attending Market Night, be prepared for huge crowds and a party atmosphere."
            },
            {
                "name": "Madeira Wine Tasting",
                "type": "Culinary Experience/Indoor Activity",
                "description": "Visit one of Funchal's Madeira Wine Lodges (like Blandy's or Oliveiras) for a tour and tasting – a perfect cozy activity for a cooler or rainy winter day.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Wine lodges operate year-round and offer a warm escape while learning about the island's famous wine.",
                "booking_tips": "Check tour times and consider booking ahead, especially for premium tastings. Blandy's is centrally located and offers frequent tours in multiple languages."
            },
            {
                "name": "Carnival (Carnaval) Festivities",
                "type": "Festival/Parade/Cultural",
                "description": "Experience Madeira's vibrant Carnival celebrations (usually February), featuring colourful parades (main Allegoric Parade, fun Trapalhão parade), street parties, costumes, and samba music.",
                "indoor": false,
                "best_time": "Varies (Main parades usually Sat/Tues evenings)",
                "price_range": "Free (Street viewing)/Paid (Seated parade viewing)",
                "seasonal_notes": "Dates vary annually based on Easter (typically Feb/early Mar). Funchal hosts one of Portugal's most famous Carnival celebrations.",
                "booking_tips": "Book accommodation and flights well in advance if travelling for Carnival. Check the official program for parade routes and timings. Secure tickets for seated viewing early if preferred."
            }
        ]
    }
}