{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Dia de Ano Novo)",
          "notes": "New Year's Day is a public holiday throughout Portugal. Most attractions, shops, and restaurants in Funchal operate with limited hours. The city is recovering from its spectacular New Year's Eve fireworks display, considered one of the best in Europe. Most museums and attractions typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout Funchal, particularly on Rua de João Tavira and at La Vie Funchal shopping center. Christmas decorations gradually come down. The city's traditional cafés and poncha bars offer warm refuge from winter weather."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is 'shoulder season' with moderate tourist numbers and excellent hotel value. Mild winter weather with occasional rain. Daytime temperatures often reach 18°C (64°F), making Funchal one of Europe's warmest winter destinations. Winter sales continue throughout January in the main shopping districts. Funchal's museums and indoor cultural attractions provide respite from occasional wet weather. Perfect time to explore the historic Old Town without peak crowds. Monte Palace Tropical Garden and Madeira Botanical Garden remain lush even in winter."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 13,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Winter conditions continue but with frequently pleasant, sunny days. Tourism remains moderate, making it an excellent time to explore Funchal's museums and cultural attractions. The historic Old Town and Funchal Marina are particularly atmospheric during this quieter season. Cable car rides to Monte offer spectacular views on clear days. Whale watching tours operate with fewer passengers than in high season."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22],
          "score": 4,
          "special": true,
          "event": "Carnival (Carnaval)",
          "notes": "The days leading up to Carnival Tuesday feature extensive parades and festivities in Funchal. The Sé Cathedral area and Avenida Arriaga host colorful processions. The Saturday 'Cortejo Alegórico' (Allegorical Parade) is the highlight with elaborate floats and costumes. Children's fancy dress parades take place in downtown areas. Traditional sweets and street performances create a lively atmosphere throughout the city. Hotels and restaurants get busy during this period - advance booking recommended."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Late February brings early hints of spring to Funchal with flower species beginning to bloom in the city's gardens. Cultural events at the Teatro Municipal Baltazar Dias offer entertainment during the cooler season. With temperatures warming slightly, it's a good time to explore the levada walks in the areas surrounding Funchal."
        }
      ],
      "weatherHighC": 18,
      "weatherLowC": 13,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. Perfect time to explore both the city and begin venturing to the surrounding mountains. Cable car rides to Monte become more popular. The historic center and viewpoints around the city become more pleasant for exploration and photography. Flower species begin blooming throughout the city, previewing the upcoming Flower Festival."
        },
        {
          "days": [17, 18, 19],
          "score": 4,
          "special": true,
          "event": "Feast of St. Joseph (Dia de São José)",
          "notes": "The Feast of St. Joseph on March 19 is celebrated in Funchal's traditional neighborhoods. While not a national holiday, it's a cultural celebration with special bread and sweets available at local bakeries. Small religious processions may take place in older parts of the city."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Início da Primavera)",
          "notes": "Spring officially begins, bringing pleasant temperatures to Funchal. Perfect time for exploring the Old Town and taking the cable car to Monte. Easter markets appear in late March if Easter falls then. Garden visits become increasingly rewarding as spring flowers bloom. Levada walks in the areas surrounding Funchal become more popular."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 14,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Páscoa)",
          "notes": "Easter celebrations include religious processions and special services at Funchal Cathedral. The 'Cortejo da Veronica' procession on Good Friday is particularly notable. Special Easter displays appear in shop windows around the city. Spring weather is ideal for exploring both city and nature. An excellent time to visit with reliable weather and moderate crowds."
        },
        {
          "days": [25],
          "score": 5,
          "special": true,
          "event": "Freedom Day (Dia da Liberdade)",
          "notes": "April 25th is a national holiday commemorating the 1974 Carnation Revolution that ended the Estado Novo dictatorship. Celebrations and official ceremonies take place in municipal buildings, and some cultural venues offer free admission. Museums and cultural institutions often feature special exhibitions related to Portuguese democracy and freedom."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30],
          "score": 6,
          "special": true,
          "event": "Flower Festival (Festa da Flor)",
          "notes": "Late April typically sees the start of Funchal's famous Flower Festival. The 'Wall of Hope' ceremony features children placing flowers on a wall in the Praça do Município. Elaborate flower carpets appear throughout the city. The spectacular flower parade along Avenida Arriaga is the highlight, with thousands of participants in costumes. Flower exhibitions, performances, and special events take place throughout the city. One of the best times to visit Funchal, though accommodation prices increase and advance booking is essential."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 14,
      "tourismLevel": 6
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 6,
          "special": true,
          "event": "Labor Day (Dia do Trabalhador) & Flower Festival continuation",
          "notes": "May Day is a national holiday in Portugal. Many businesses are closed, but museums and cultural attractions remain open. Traditional labor celebrations may take place in major squares. The Flower Festival often continues into early May with various events throughout the city."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "May brings perfect weather with longer days and temperatures reaching 21°C (70°F). The beaches at Praia Formosa and Barreirinha begin to see more visitors but remain uncrowded. Tourism begins to increase but the city isn't yet at peak season crowds. Perfect time to explore the tropical gardens surrounding Funchal - Monte Palace Tropical Garden, Jardim Botânico, and Quinta do Palheiro Ferreiro. Levada walks in the areas surrounding Funchal offer ideal hiking conditions."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "Festival preparations",
          "notes": "Late May sees preparations for summer cultural events and festivals in Funchal. The city begins to transition to its summer schedule with extended opening hours at many attractions and restaurants. Temperature conditions are perfect for outdoor dining and evening strolls along the Funchal Marina."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 15,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
          "score": 5,
          "notes": "Early summer brings warm weather and extended daylight hours to Funchal. Tourism increases but the city remains less crowded than July and August. Perfect time for exploring the levada walks in the mountains around Funchal. The Atlantic Festival preparations begin throughout the city. Whale and dolphin watching tours operate regularly with excellent sighting conditions."
        },
        {
          "days": [13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 5,
          "special": true,
          "event": "Atlantic Festival (Festival do Atlântico)",
          "notes": "The Atlantic Festival combines a pyromusical competition (fireworks synchronized to music) on Saturday nights, classical music concerts, and various cultural performances. The fireworks displays take place in Funchal Bay and can be viewed from many points around the city. The festival typically runs from early to late June with events concentrated on weekend evenings."
        },
        {
          "days": [23, 24],
          "score": 5,
          "special": true,
          "event": "São João Festival (Festas de São João)",
          "notes": "The night of June 23-24 celebrates the Feast of St. John with traditional festivities throughout the city. Popular arraiais (street parties) feature food stalls, music, and dancing. Traditional grilled sardines and espetada (beef skewers) are served at restaurants throughout the city, and there may be smaller community bonfires and celebrations."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "notes": "Late June sees pleasant summer temperatures typically around 23°C (73°F). Perfect time for beach activities at Praia Formosa and Barreirinha Beach, as well as swimming at the Lido complex. Funchal's outdoor café culture is in full swing, with restaurants and bars along the marina and in the Old Town filled with visitors and locals alike. Day trips to nearby towns like Câmara de Lobos, Machico, and Santana are highly recommended."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 17,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "High summer with warm temperatures around 25°C (77°F) but rarely excessive heat thanks to Atlantic breezes. Tourism increases significantly as European summer holidays begin. The Lido and beach complexes become busy but never overcrowded like other European resorts. Cable car rides to Monte and the Botanical Gardens are popular activities. Jeep tours to the interior of the island and the mountains offer relief from the summer warmth. Boat trips for whale and dolphin watching operate at full schedule. Outdoor dining in the Marina and the historic center is at its most vibrant."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 18,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Assumption Day (Assunção de Nossa Senhora) & Monte Festival",
          "notes": "August 15th is a national holiday celebrating the Assumption of Mary, coinciding with the important Monte Festival. The Monte Festival is one of Madeira's most important religious celebrations, with a procession to the Nossa Senhora do Monte Church. Many locals make a pilgrimage to Monte, with some climbing the steep hill on their knees as a demonstration of faith. The festival features religious ceremonies, music, food stalls, and entertainment. The famous toboggan rides from Monte down to Funchal are particularly popular during this period."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Peak summer with warm temperatures, typically around 25°C (77°F) but rarely exceeding 30°C (86°F) thanks to Atlantic breezes. High tourism season with visitors from around the world. Funchal Cathedral, the Monte Palace Tropical Garden, and the cable car are particularly popular attractions. The Lido Complex and beaches become crowded, especially on weekends. Some Funchal locals leave the city for their own holidays in August, giving parts of the city a quieter feel despite high tourist numbers."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 19,
      "tourismLevel": 9
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Madeira Wine Festival (Festa do Vinho da Madeira)",
          "notes": "September hosts the Madeira Wine Festival, celebrating the island's wine-making tradition. The festival includes grape harvesting in Estreito de Câmara de Lobos, traditional grape stomping, folklore performances, and wine tastings throughout Funchal. Perfect weather continues with temperatures around 25°C (77°F) but with fewer tourists as European summer holidays end. An excellent time to visit with good weather but without the peak season crowds. The University of Madeira welcomes back students, bringing a renewed energy to the city. Whale watching trips and levada walks remain available in pleasant conditions. Riverside walks along the Funchal Marina and outdoor dining continue to be enjoyable in the mild weather."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 19,
      "tourismLevel": 7
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4],
          "score": 5,
          "special": true,
          "event": "Republic Day (Implantação da República)",
          "notes": "October 5th is a national holiday commemorating the overthrow of the monarchy and establishment of the Portuguese Republic in 1910. Official ceremonies take place at city hall and other governmental buildings. Many museums and cultural sites remain open but with holiday schedules."
        },
        {
          "days": [5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Autumn weather brings slightly cooler but still very pleasant temperatures to Funchal, typically around 23°C (73°F). Perfect time for visiting both indoor and outdoor attractions like the Old Town, Funchal Cathedral, and levada walks. The university areas show renewed activity with students returning. Good month for experiencing Funchal's diverse culinary scene and exploring the museums without crowds. Funchal's gardens remain lush and colorful throughout autumn."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "Halloween (Dia das Bruxas)",
          "notes": "While not a traditional Portuguese celebration, Halloween has gained popularity in recent years, especially among younger people. Some bars and clubs in downtown Funchal host Halloween-themed parties. Shopping centers and some restaurants may have Halloween decorations or special events."
        }
      ],
      "weatherHighC": 23,
      "weatherLowC": 17,
      "tourismLevel": 6
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "All Saints' Day (Dia de Todos os Santos)",
          "notes": "November 1st is a national holiday when Portuguese families traditionally visit cemeteries to honor deceased relatives. Some businesses may be closed, but many tourist attractions remain open. Traditional sweets associated with this time include Bolo Rei (King Cake), which begins appearing in bakeries."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Autumn weather with cooler temperatures but still pleasant daytime conditions around 21°C (70°F). November can see some rainfall with an average of 90mm of rain, but rainy days are interspersed with clear, sunny periods. Excellent time for museum visits and indoor cultural activities. Traditional restaurants with hearty Portuguese dishes offer cozy retreats from occasional wet weather. The Madeira Story Centre and other museums provide authentic indoor entertainment during this quieter tourism period."
        },
        {
          "days": [30],
          "score": 4,
          "special": true,
          "event": "Christmas Season Begins",
          "notes": "Funchal's Christmas celebrations begin in late November with the lighting of the city's Christmas lights. The main Christmas tree is usually placed in the Praça do Município. Christmas markets open in various locations featuring craft stalls, food vendors, and seasonal activities. Christmas shopping begins in earnest on Rua Fernão de Ornelas and in the city's shopping centers like La Vie Funchal."
        }
      ],
      "weatherHighC": 21,
      "weatherLowC": 16,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "special": true,
          "event": "Constitution Day & Immaculate Conception (Dia da Constituição & Imaculada Conceição)",
          "notes": "December 1st (Constitution Day) and December 8th (Immaculate Conception) are public holidays. The December 8th holiday traditionally marks the beginning of the Christmas season for many Portuguese families, when Christmas trees and Nativity scenes are set up in homes. Christmas markets and festivities are in full swing by this time."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Funchal Christmas Celebrations",
          "notes": "Throughout December, Funchal hosts its famed Christmas markets and festivities. The city center is beautifully decorated with elaborate Christmas lights that are a major attraction. The 'Market Night' (Noite do Mercado) on December 23 is famous throughout Portugal, as thousands visit the Farmers' Market for last-minute shopping in a carnival-like atmosphere that lasts until morning. Shopping streets and the La Vie Funchal mall are bustling with Christmas shoppers. The Teatro Municipal Baltazar Dias and other venues offer seasonal performances and Christmas concerts. The Funchal Cathedral features special Christmas services and decorations."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Véspera de Natal)",
          "notes": "Christmas Eve is the main celebration day for most Portuguese families. Most businesses close by early afternoon. The Christmas Markets end. Funchal Cathedral and other churches hold special Midnight Mass services. Restaurants that remain open often require advance reservations for special Christmas Eve dinners, which traditionally feature bacalhau (salt cod) and other fish dishes."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Day & St. Stephen's Day",
          "notes": "December 25 (Christmas Day) is a public holiday. Most businesses, restaurants, and attractions are closed or operate with limited hours. December 26 is not a public holiday in Portugal, unlike in some other European countries, so many businesses reopen. Traditional Christmas lunch often features roast turkey or espetada (beef skewers) with Portuguese stuffing."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year is typically busy with both Portuguese and international visitors. Major museums and attractions are open. Good time for winter sales shopping along Rua Fernão de Ornelas and at La Vie Funchal shopping center. Indoor cultural activities provide welcome entertainment during the cooler weather."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "New Year's Eve (Véspera de Ano Novo)",
          "notes": "Funchal hosts one of the most spectacular New Year's Eve celebrations in Europe, with a magnificent fireworks display that enters the Guinness Book of Records. The fireworks are launched from ships in the harbor and various points around the amphitheater of Funchal, creating a unique 360-degree show. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), and hotels host celebration events. The marina and viewpoints throughout the city provide spectacular vantage points for the fireworks display, with thousands gathering along the waterfront and on cruise ships in the harbor."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 15,
      "tourismLevel": 5
    }
  },
  "activityTypes": {
    "spring": [
      "Flower Festival (Festa da Flor) in April/May",
      "Cable Car rides to Monte",
      "Visits to Monte Palace Tropical Garden and Madeira Botanical Garden",
      "April 25th Freedom Day Celebrations",
      "Levada walks in the surrounding mountains",
      "Old Town Historical Tours",
      "Day Trips to Câmara de Lobos, Machico and Santana",
      "Whale and dolphin watching tours",
      "Outdoor café culture begins along Funchal Marina"
    ],
    "summer": [
      "Atlantic Festival with fireworks competition (June)",
      "Monte Festival (August 15th)",
      "Madeira Wine Festival (September)",
      "Beach days at Praia Formosa and Barreirinha",
      "Swimming at the Lido Complex",
      "Toboggan rides from Monte to Funchal",
      "Boat Trips around the coast",
      "Evening walks along the Funchal Marina",
      "Outdoor dining in historic center restaurants"
    ],
    "autumn": [
      "Madeira Wine Festival (early September)",
      "Cultural events at Teatro Municipal Baltazar Dias",
      "Wine tasting tours",
      "Museum visits including Madeira Story Centre",
      "Photography walks in the Old Town",
      "Dolphin and whale watching boat trips",
      "Day trips to Porto Moniz and Santana",
      "Culinary tours featuring Madeiran specialties",
      "Levada walks with perfect autumn temperatures"
    ],
    "winter": [
      "Funchal Christmas Lights (late November to early January)",
      "Market Night on December 23",
      "New Year's Eve Fireworks Display",
      "Winter Shopping on Rua Fernão de Ornelas and La Vie Funchal",
      "Indoor cultural attractions like the Madeira Film Experience",
      "Cozy café culture in historic establishments",
      "Sampling traditional Poncha (Madeira's traditional alcoholic drink)",
      "Cable car rides to Monte on clear winter days",
      "Carnival celebrations (February)"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or mild, occasionally wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}