{
    "Spring": {
        "activities": [
            {
                "name": "Amalfi Coast Hiking - Sentiero degli Dei",
                "type": "Outdoor Activity",
                "description": "Experience the famous 'Path of the Gods' hiking trail with perfect spring weather. Enjoy spectacular coastal views, wildflowers in bloom, and comfortable temperatures for this challenging but rewarding hike.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers ideal hiking conditions with wildflowers blooming and pleasant temperatures. Fewer crowds than summer make it perfect for peaceful exploration.",
                "booking_tips": "Start early to avoid afternoon heat. Bring water, snacks, and proper hiking shoes. Check trail conditions before departure."
            },
            {
                "name": "Spring Lemon Harvest Experience",
                "type": "Cultural Experience",
                "description": "Visit local lemon groves during the spring harvest season. Learn about the famous Amalfi lemons, participate in harvesting, and taste fresh limoncello made from the season's first fruits.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is the beginning of lemon season with the first harvests. Perfect weather for outdoor activities in the groves.",
                "booking_tips": "Book with local lemon producers in advance. Wear comfortable clothes and bring sun protection. Often includes limoncello tasting."
            },
            {
                "name": "Cathedral and Cloister Spring Visit",
                "type": "Cultural Tour",
                "description": "Explore Amalfi's magnificent cathedral and beautiful cloister in perfect spring weather. Enjoy the stunning Arab-Norman architecture and peaceful garden atmosphere.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers comfortable temperatures for exploring the historic center. Beautiful light for photography and fewer crowds than summer.",
                "booking_tips": "Visit early morning for best light and fewer crowds. Modest dress required. Combined tickets available for cathedral and cloister."
            },
            {
                "name": "Spring Market at Mercato di Amalfi",
                "type": "Market Experience",
                "description": "Experience the vibrant spring market with fresh seasonal produce, local specialties, and the authentic atmosphere of Amalfi's daily market.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings the most beautiful seasonal produce and fresh ingredients. Market is most lively on weekday mornings.",
                "booking_tips": "Arrive early for best selection. Bring a camera for the colorful displays. Try free samples from vendors."
            },
            {
                "name": "Coastal Photography at Sunset",
                "type": "Photography",
                "description": "Capture stunning spring landscapes along the Amalfi Coast with perfect lighting conditions. Photograph the dramatic cliffs, colorful houses, and Mediterranean Sea.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Spring light provides excellent photography conditions. Wildflowers bloom along the coastal paths and viewpoints.",
                "booking_tips": "Best light is 1-2 hours before sunset. Bring tripod for long exposures. Popular viewpoints can get crowded."
            },
            {
                "name": "Spring Beach Day at Spiaggia Grande",
                "type": "Beach Activity",
                "description": "Enjoy Amalfi's main beach before the summer crowds arrive. Perfect weather for sunbathing, swimming, and beachside dining with volcanic sand.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers pleasant temperatures and fewer crowds. Water may still be cool but beaches are peaceful and beautiful.",
                "booking_tips": "Beach facilities open in spring with better prices than peak season. Bring layers for changing temperatures."
            },
            {
                "name": "Traditional Amalfi Cooking Workshop",
                "type": "Culinary Experience",
                "description": "Learn to cook traditional Amalfi dishes using spring ingredients like fresh herbs, seasonal vegetables, and local olive oil.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring provides the best seasonal ingredients for authentic Amalfi cuisine. Perfect time to learn local culinary traditions.",
                "booking_tips": "Book in advance with local cooking schools. Often includes market visits and full meal preparation."
            },
            {
                "name": "Boat Trip to Capri",
                "type": "Nature Excursion",
                "description": "Take advantage of spring weather to visit the glamorous island of Capri with its stunning Blue Grotto, beautiful gardens, and Mediterranean charm.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers ideal conditions for island exploration. Fewer tourists and pleasant temperatures for sightseeing.",
                "booking_tips": "Book ferry tickets in advance. Bring water and comfortable shoes for exploring the island."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Amalfi Coast Boat Tour",
                "type": "Maritime Experience",
                "description": "Experience the stunning Amalfi Coast from the water with boat tours to hidden coves, grottos, and coastal villages. Perfect for swimming and coastal photography.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular coastal views and perfect swimming conditions. Peak season for boat tours.",
                "booking_tips": "Book boat tours well in advance during peak season. Consider private charters for more intimate experiences."
            },
            {
                "name": "Beach Club Experience at Spiaggia Grande",
                "type": "Luxury Beach Activity",
                "description": "Enjoy exclusive beach clubs with private beach access, water sports, gourmet dining, and stunning views of the dramatic coastline.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer is peak season for beach clubs. Perfect weather for swimming, sunbathing, and luxury beach experiences.",
                "booking_tips": "Reserve beach beds and dining well in advance. Dress codes may apply at upscale clubs."
            },
            {
                "name": "Sunset Sailing on the Mediterranean",
                "type": "Boat Experience",
                "description": "Charter a yacht or join a sailing excursion to experience the stunning Mediterranean sunset from the water, with views of the Amalfi Coast.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides the most spectacular sunsets and calm sea conditions. Perfect for romantic experiences.",
                "booking_tips": "Book private charters or group excursions in advance. Sunset tours are most popular."
            },
            {
                "name": "Evening Stroll in Centro Storico",
                "type": "Cultural Experience",
                "description": "Experience the magical evening atmosphere in Amalfi's historic center, with illuminated cathedral, charming streets, and Mediterranean backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer evenings are magical with warm temperatures and vibrant atmosphere. Perfect for people-watching and photography.",
                "booking_tips": "No booking required. Best atmosphere during sunset and early evening. Many restaurants stay open late."
            },
            {
                "name": "Water Sports at Marina Grande",
                "type": "Adventure Activity",
                "description": "Enjoy water sports including jet skiing, paddleboarding, and snorkeling at the main harbor with excellent facilities and clear waters.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers perfect water temperatures and calm conditions for water sports. Professional instructors available.",
                "booking_tips": "Book water sports activities in advance during peak season. Equipment rental available on-site."
            },
            {
                "name": "Campania Wine Tasting",
                "type": "Wine Experience",
                "description": "Visit local vineyards in the Campania wine region to taste local wines and learn about Amalfi Coast winemaking traditions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Summer offers insights into winemaking. Indoor tastings provide relief from afternoon heat.",
                "booking_tips": "Book vineyard tours in advance. Often includes transportation and food pairings. Designated driver required."
            },
            {
                "name": "Evening Aperitivo Culture",
                "type": "Social Experience",
                "description": "Experience authentic Italian social life with evening aperitifs at waterfront cafés, watching the sunset over the Mediterranean.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor socializing. Experience the relaxed Mediterranean lifestyle.",
                "booking_tips": "No booking needed for most cafés. Best spots along the waterfront. Try local limoncello and Italian wines."
            },
            {
                "name": "Ravello Festival Concerts",
                "type": "Cultural Festival",
                "description": "Experience the prestigious Ravello Festival with classical music concerts in stunning venues with panoramic views of the Amalfi Coast.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer brings the famous Ravello Festival with world-class performances in beautiful settings.",
                "booking_tips": "Book concert tickets months in advance. Consider package deals with transportation from Amalfi."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Autumn Hiking on Sentiero degli Dei",
                "type": "Outdoor Activity",
                "description": "Enjoy perfect hiking weather to explore the scenic coastal paths with stunning Mediterranean views and autumn colors.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Ideal hiking temperatures without summer heat. Crystal clear autumn air provides spectacular coastal views.",
                "booking_tips": "Start early to avoid afternoon heat. Bring camera and comfortable hiking shoes. Some trails require good fitness."
            },
            {
                "name": "Autumn Market at Mercato di Amalfi",
                "type": "Market Experience",
                "description": "Experience the autumn harvest at Amalfi's main market with seasonal produce, local specialties, and authentic Italian atmosphere.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings seasonal specialties like truffles, mushrooms, and autumn fruits. Market is less crowded than summer.",
                "booking_tips": "Visit early for best selection. Try seasonal specialties and local autumn products."
            },
            {
                "name": "Truffle Season Culinary Experience",
                "type": "Culinary Experience",
                "description": "Experience the start of truffle season in Campania, with special menus at local restaurants and truffle markets in nearby villages.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Truffle season begins in autumn. Many restaurants feature special truffle menus during this period.",
                "booking_tips": "Reserve at restaurants known for truffle dishes. Consider truffle hunting experiences in nearby areas."
            },
            {
                "name": "Wine Harvest in Campania",
                "type": "Agricultural Experience",
                "description": "Join local vineyards during harvest season to pick grapes and learn about traditional Campania winemaking.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "September to October is harvest season. Experience authentic agricultural traditions and seasonal rhythms.",
                "booking_tips": "Contact local vineyards directly. Often includes meals and wine tasting. Advance booking essential."
            },
            {
                "name": "Storm Watching at Coastal Viewpoints",
                "type": "Natural Phenomenon",
                "description": "Experience the dramatic autumn storms and wild seas from the safety of coastal viewpoints, watching powerful waves crash against the rocks.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings more dramatic weather and spectacular storm watching opportunities. Impressive wave action.",
                "booking_tips": "Check weather conditions for safety. Best during windy days. Dress warmly and bring rain protection."
            },
            {
                "name": "Traditional Craft Workshops",
                "type": "Cultural Workshop",
                "description": "Learn traditional Amalfi crafts like ceramics, paper making, or limoncello production from local artisans.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is perfect for learning indoor crafts. Many artisans offer workshops as tourist season winds down.",
                "booking_tips": "Book with local artisan associations. Often includes take-home pieces. Great for unique souvenirs."
            },
            {
                "name": "Mushroom Foraging in Local Forests",
                "type": "Nature Activity",
                "description": "Join guided foraging trips to discover edible mushrooms in local forests, learning about varieties and traditional uses.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Peak mushroom season in local forests. Important part of traditional Italian cuisine and culture.",
                "booking_tips": "Must join guided tours for safety. Often includes cooking session. Check weather for recent rain."
            },
            {
                "name": "Autumn Photography Tour",
                "type": "Photography",
                "description": "Capture the stunning autumn colors and dramatic light along the Amalfi Coast with guided photography tours.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn provides perfect lighting conditions and dramatic skies for coastal photography.",
                "booking_tips": "Book with local photography guides. Bring appropriate equipment for changing weather conditions."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Market in Piazza del Duomo",
                "type": "Holiday Market",
                "description": "Experience the charming Christmas market featuring local Italian crafts, seasonal treats, and holiday decorations in the heart of Amalfi.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Brings festive warmth to winter evenings. Features unique Italian holiday traditions and locally made gifts.",
                "booking_tips": "No booking required. Best atmosphere in evening when lights are on. Try local holiday specialties."
            },
            {
                "name": "Indoor Museum and Cultural Sites",
                "type": "Cultural Activity",
                "description": "Spend winter days exploring Amalfi's excellent museums including the Paper Museum and Arsenale della Repubblica during cooler weather.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect weather for indoor cultural exploration. Museums are less crowded and offer deeper exploration opportunities.",
                "booking_tips": "Consider museum passes for multiple visits. Many offer guided tours. Combine with café stops for warmth."
            },
            {
                "name": "Traditional Italian Winter Meals",
                "type": "Culinary Experience",
                "description": "Enjoy hearty winter meals featuring Italian specialties, truffles, and other traditional winter foods in cozy local restaurants.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Peak season for traditional winter foods. Many restaurants feature special winter menus with seasonal ingredients.",
                "booking_tips": "Reserve at traditional restaurants. Try pairing with local Campania wines and aged cheeses."
            },
            {
                "name": "Thermal Springs in Ischia",
                "type": "Wellness Activity",
                "description": "Warm up in natural thermal springs on the island of Ischia, a perfect winter retreat offering relaxation and therapeutic benefits.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Natural hot springs provide warmth during cooler months. Beautiful winter island scenery surrounding the springs.",
                "booking_tips": "Check ferry schedules in winter. Bring towels and warm clothes for changing. Book thermal spa treatments in advance."
            },
            {
                "name": "Storm Photography and Coastal Views",
                "type": "Photography",
                "description": "Capture dramatic winter storms and moody Mediterranean seascapes from coastal viewpoints and waterfront locations.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and stormy seas perfect for photography. Clear post-storm days offer incredible visibility.",
                "booking_tips": "Dress warmly and protect camera equipment. Best after storms when light is dramatic. Check wind conditions for safety."
            },
            {
                "name": "Cozy Wine Bar Evenings",
                "type": "Social Activity",
                "description": "Warm up in traditional wine bars with local Campania vintages, charcuterie platters, and the company of locals during long winter evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect season for indoor socializing. Wine bars offer warmth, local atmosphere, and seasonal food pairings.",
                "booking_tips": "No reservations usually needed. Learn basic Italian phrases for better interaction. Try different neighborhoods for variety."
            },
            {
                "name": "Winter Beach Walks",
                "type": "Nature Activity",
                "description": "Enjoy peaceful winter walks along the beaches with dramatic winter light, fewer crowds, and the therapeutic sound of winter waves.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter beaches offer peaceful solitude and dramatic natural beauty. Perfect for reflection and photography.",
                "booking_tips": "Dress warmly and wear appropriate footwear. Best during low tide for beach exploration."
            },
            {
                "name": "Italian Olive Oil Tasting",
                "type": "Culinary Experience",
                "description": "Visit local olive mills during the winter harvest season to taste fresh olive oil and learn about traditional production methods.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is olive harvest season in Italy. Experience the production of one of the region's most important products.",
                "booking_tips": "Book tours in advance with local olive mills. Often includes tastings and product purchases."
            }
        ]
    }
}