{
  "overview_paragraph": "Angers is at its best in spring (April–June) and early fall (September–October), when café terraces hum along Place du Ralliement, castle gardens bloom or turn gold, and walking weather is ideal along the Maine River. July brings long evenings and the Festival d'Anjou—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days in the castle, patisserie stops, and twinkling holiday lights around the historic center—while March begins to warm with the odd shower from the Atlantic.",
  "January": [
    "Château d'Angers without the lines, steaming chocolat chaud in historic cafés, and misty Maine River walks between cozy bookshops.",
    "Winter light on the castle towers, snug bistros in the historic quarter, and vintage hunts in covered passages."
  ],
  "February": [
    "Castle views at golden hour, Valentine's strolls along the Maine River, and jazz-lit nights in local wine bars.",
    "Shared macarons, candlelit bistros, and strolls past secret courtyards in the medieval quarter."
  ],
  "March": [
    "First blossoms in Jardin des Plantes, terrace tables returning to Place du Ralliement, and historic quarter bookshop wanders.",
    "Morning croissants, museum afternoons at Musée des Beaux-Arts, and blue-hour bridges welcoming spring back to Angers."
  ],
  "April": [
    "Cherry trees in bloom around the castle, flaky croissants from local boulangeries, and bike rides from the historic quarter to the Maine River.",
    "Spring light on Cathédrale Saint-Maurice, gallery-hopping in the covered passages, sunset cruise to a glittering Château d'Angers."
  ],
  "May": [
    "Picnics in Jardin des Plantes, marchés brimming with Anjou specialties, and twilight strolls along the Maine River promenade.",
    "Flowered castle gardens, open-air café moments on Place du Ralliement, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, river aperitifs on Quai des Carmes, and the city humming for Fête de la Musique.",
    "Sun-splashed castle grounds, riverfront picnics, and late sunsets that turn every bridge over the Maine into a viewpoint."
  ],
  "July": [
    "Festival d'Anjou performances in the castle, lazy afternoons in Jardin des Plantes, and moonlit Maine River cruises.",
    "Summer markets, rooftop terraces with castle views, and gallery cool-downs between sun-bright wanderings."
  ],
  "August": [
    "Quiet boulevards, easy castle visits, and Maine River evenings with breezes off the water.",
    "Shaded castle gardens, courtyard cafés, and golden hours when the medieval city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits at Musée Jean-Lurçat, lively terraces, and wine-tinted evenings in the Anjou region.",
    "Crisp mornings, flea-market finds, and gallery re-openings that make wandering the historic quarter irresistible."
  ],
  "October": [
    "Autumn leaves in Jardin des Plantes, bistros aglow, and the harvest festival celebrations around the castle.",
    "Cinnamon-spiced stalls, museum hideaways, and sunset tones warming the Place du Ralliement."
  ],
  "November": [
    "Beaujolais nouveau toasts, cozy brasseries, and castle afternoons while the city slows to a hush.",
    "Foggy Maine River mornings, medieval art indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Castle lights, Christmas markets at Place du Ralliement, and skating beneath grand medieval façades.",
    "Vin chaud in hand, Cathédrale Saint-Maurice's bells, and winter sparkle from boulevard to covered passage."
  ]
}

