{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Longest Days & Mild Weather",
                "details": "June offers the longest daylight hours (sunset after 9:30 PM) and often brings pleasant, mild weather (average highs 18-20°C), perfect for exploring Limerick city and its surroundings."
            },
            {
                "reason": "Start of Summer Atmosphere",
                "details": "Limerick embraces summer in June. Pubs with outdoor seating become popular, the city centre feels livelier, and parks like People's Park are well-used."
            },
            {
                "reason": "Ideal for Day Trips & Outdoor Exploration",
                "details": "With long days and better weather odds, June is great for visiting nearby attractions like Bunratty Castle, Lough Gur, or venturing further to the Cliffs of Moher or Ballyhoura Mountains."
            },
            {
                "reason": "River Shannon Activities",
                "details": "Enjoy activities on or along the River Shannon - consider kayaking, boat tours (check availability), walking the riverside paths, or exploring the University of Limerick campus."
            },
            {
                "reason": "Shoulder Season Benefits (Early June)",
                "details": "Early June, before school holidays begin, might offer slightly fewer crowds than July/August, particularly mid-week, while still enjoying good weather potential."
            },
            {
                "reason": "Potential Local Festivals & Events",
                "details": "Check local listings for community festivals, sporting events (GAA matches), Bloomsday events (June 16th), or food/music events that might occur in June."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Start of Peak Season & Increasing Crowds",
                "details": "Visitor numbers rise notably in June, especially around the Bank Holiday. Expect popular attractions and the city centre to be busier."
            },
            {
                "reason": "Rising Accommodation Prices & Booking Needed",
                "details": "Accommodation costs increase towards peak summer rates. Availability decreases, especially for the Bank Holiday weekend. Book well ahead."
            },
            {
                "reason": "Irish Weather Can Still Be Unpredictable",
                "details": "While often pleasant, June can still bring rain showers and cooler, windy days. Packing layers and a waterproof jacket is always wise."
            },
            {
                "reason": "June Bank Holiday Busyness",
                "details": "The first weekend in June (Bank Holiday) sees peak domestic travel, leading to busy roads, packed pubs/restaurants, and high demand across the board."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "19°C",
                    "low": "10°C"
                },
                "precipitation": "Moderate chance of showers, but often interspersed with sunny spells (average ~60-70mm for month). Very long daylight hours are a key feature.",
                "general_tips": "Pack layers: t-shirts, fleece/cardigan, reliable waterproof jacket. Comfortable walking shoes essential. Sunscreen/sunglasses needed. Umbrella can be useful."
            },
            "tourism_level": {
                "crowds": "Moderate to High, peaking strongly over the June Bank Holiday weekend. City centre, King John's Castle, and popular pubs get busy.",
                "pricing": "Shoulder to Peak season prices. Bank Holiday weekend rates are premium. Book accommodation far in advance, especially for this weekend.",
                "overall_atmosphere": "Lively start to summer. Significant buzz around the Bank Holiday. People enjoy outdoor spaces like parks and riverside areas."
            },
            "events_holidays": [
                {
                    "name": "June Bank Holiday",
                    "date": "First Monday in June",
                    "description": "Public holiday marking the unofficial start of summer. Expect significant crowds in Limerick and surrounding tourist spots.",
                    "notes": "Book accommodation, tours, and popular restaurants well ahead for this busy weekend."
                },
                 {
                    "name": "Milk Market",
                    "date": "Weekends (Fri, Sat, Sun - esp. Sat)",
                    "description": "Limerick's famous covered market continues its vibrant weekend operations with local food, crafts, and street food.",
                    "notes": "Great spot for brunch or picking up local goods."
                },
                {
                    "name": "Live Music Scene",
                    "date": "Throughout June",
                    "description": "Pubs like Dolan's Warehouse host regular live music, including traditional sessions and other genres, increasing frequency in summer.",
                    "notes": "Check venue schedules."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore King John's Castle",
                    "where": "Nicholas Street, Medieval Quarter",
                    "description": "Visit Limerick's iconic 13th-century castle and explore its interactive exhibits detailing the city's history.",
                    "practical_tips": "Book tickets online, especially for the Bank Holiday weekend. Allow 2-3 hours.",
                    "best_time": "Any open day (mornings potentially quieter)",
                    "estimated_cost": "Moderate (Entry Fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Bunratty Castle & Folk Park",
                    "where": "Bunratty, Co. Clare (Short drive/bus)",
                    "description": "Experience the medieval castle and explore the recreated 19th-century Irish village in the folk park.",
                    "practical_tips": "Book tickets online. Allow at least half a day. Easily accessible from Limerick.",
                    "best_time": "Any Day",
                    "estimated_cost": "Moderate/High (Transport + Entry Fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Cycle Along the River Shannon",
                    "where": "City Centre River Paths / University of Limerick Campus",
                    "description": "Make the most of the long evenings with a walk or cycle along the river, enjoying the views and green spaces.",
                    "practical_tips": "Paths are mostly flat. Bike rental options available. Explore the Living Bridge at UL.",
                    "best_time": "Daytime / Evening",
                    "estimated_cost": "Free (walking) / Budget (bike hire)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Enjoy a Pint Outdoors",
                    "where": "Pubs with outdoor seating (e.g., The Locke Bar, Curragower Bar)",
                    "description": "If the weather is good, grab a drink at a pub with outdoor seating, perhaps overlooking the river.",
                    "practical_tips": "Outdoor tables are popular and fill quickly on sunny days/evenings.",
                    "best_time": "Afternoon / Evening (good weather)",
                    "estimated_cost": "Budget/Moderate (cost of drinks)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "20°C",
                    "low": "11°C"
                },
                "precipitation": "Similar patterns continue - mix of sunshine and potential showers. Evenings remain very bright until late.",
                "general_tips": "Continue layering and always have a waterproof option. Utilize the long daylight hours for sightseeing."
            },
            "tourism_level": {
                "crowds": "High. Peak summer tourist season is now in full swing. Expect attractions and tours to be busy.",
                "pricing": "Peak summer prices are standard. Booking ahead for accommodation and popular tours is essential.",
                "overall_atmosphere": "Busy and lively summer atmosphere throughout the city. Longer days encourage more outdoor activity and evening socializing."
            },
            "events_holidays": [
                {
                    "name": "Bloomsday (Minor Observance)",
                    "date": "June 16",
                    "description": "Check local literary groups or bookshops for any small events marking Bloomsday, celebrating Joyce's Ulysses.",
                    "notes": "Not a major event in Limerick, unlike Dublin."
                },
                {
                    "name": "Potential Sporting Events (GAA/Rugby Training)",
                    "date": "Check local schedules",
                    "description": "GAA championship season continues. Pre-season training for Munster Rugby might commence.",
                    "notes": "Check Limerick GAA and Munster Rugby websites for updates."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Day Trip to Lough Gur",
                    "where": "Near Bruff, Co. Limerick (Requires Car/Taxi)",
                    "description": "Explore this important archaeological site with stone circles, megalithic tombs, and a visitor centre set around a picturesque lake.",
                    "practical_tips": "Requires transport (~30 min drive). Allow several hours. Great for history buffs and scenic walks.",
                    "best_time": "Daytime",
                    "estimated_cost": "Budget (transport) + Moderate (visitor centre entry)",
                    "weather_dependent": true 
                },
                {
                    "activity": "Visit the Hunt Museum",
                    "where": "Rutland Street",
                    "description": "Explore the diverse collection of art and antiquities in the historic Custom House, offering an indoor cultural experience.",
                    "practical_tips": "Check opening hours. Allow 2-3 hours. Good option if weather turns.",
                    "best_time": "Anytime",
                    "estimated_cost": "Moderate (Entry Fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore People's Park & Limerick City Gallery of Art",
                    "where": "Pery Square",
                    "description": "Enjoy a stroll through the Victorian People's Park and visit the adjacent City Gallery showcasing Irish art.",
                    "practical_tips": "Gallery entry is free. Park is a pleasant spot for a break. Located in the Georgian Quarter.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true 
                },
                {
                    "activity": "Late Evening Riverside Walk",
                    "where": "City centre river paths",
                    "description": "Take advantage of the very late sunset (after 9:30 PM) with a peaceful walk along the illuminated riverside.",
                    "practical_tips": "Paths are lit near the city centre. Enjoy the long twilight hours.",
                    "best_time": "Evening (around 8:30 PM onwards)",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}