{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Weather & Greening Landscapes",
                "details": "May often brings milder temperatures (average 15-17°C), increased sunshine, and long days to Limerick. Surrounding countryside and parks become lush and green."
            },
            {
                "reason": "Riverfest Limerick Festival (Usually Early May)",
                "details": "Limerick's biggest festival typically takes place over the May Bank Holiday weekend. Expect street performers, food stalls, music, river-based events (like jet-ski stunts), and fireworks."
            },
            {
                "reason": "Ideal for Exploring Nearby Nature & History",
                "details": "With better weather and long daylight, May is great for visiting Lough Gur, exploring the Ballyhoura Mountains (hiking/biking), or day trips to Bunratty Castle or even the coast."
            },
            {
                "reason": "Lively City Atmosphere",
                "details": "Limerick city buzzes, especially during Riverfest. Enjoy the growing energy in pubs, cafes with outdoor seating, and along the riverside."
            },
            {
                "reason": "Shoulder Season Advantages (Outside Riverfest)",
                "details": "Outside the Bank Holiday/Riverfest weekend, May offers relatively fewer crowds than peak summer, potentially better accommodation value, and pleasant exploring conditions."
            },
            {
                "reason": "Start of Summer Season Activities",
                "details": "More outdoor activities become available, such as guided kayak tours on the Shannon or increased access/events at visitor sites."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Changeable Irish Weather Persists",
                "details": "While improving, May weather can still be unpredictable with rain showers and wind possible. Packing layers and waterproofs is still recommended."
            },
            {
                "reason": "Riverfest/Bank Holiday Crowds & Prices",
                "details": "The May Bank Holiday weekend, especially if coinciding with Riverfest, sees huge crowds in the city centre, peak accommodation prices, and requires booking *far* in advance."
            },
            {
                "reason": "Pollen Season",
                "details": "Grass pollen season begins, potentially affecting hay fever sufferers."
            },
            {
                "reason": "Increasing Visitor Numbers",
                "details": "Tourist numbers rise noticeably towards summer. Don't expect empty attractions, especially on weekends, even outside the Bank Holiday."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "16°C",
                    "low": "7°C"
                },
                "precipitation": "Moderate chance of showers (average 70-80mm monthly), but often mixed with pleasant sunny spells. Days are long and bright.",
                "general_tips": "Pack layers: t-shirts, fleece/sweater, waterproof jacket. Comfortable walking shoes are vital. Sunscreen useful for sunny spells."
            },
            "tourism_level": {
                "crowds": "Extremely High during Riverfest/May Bank Holiday weekend. Moderate otherwise, increasing from April.",
                "pricing": "Peak rates during Riverfest/Bank Holiday. Shoulder season prices otherwise. Book accommodation very far ahead for the festival weekend.",
                "overall_atmosphere": "Very festive and energetic during Riverfest. Pleasant spring buzz otherwise. City comes alive, especially outdoors."
            },
            "events_holidays": [
                {
                    "name": "Riverfest Limerick",
                    "date": "Usually May Bank Holiday Weekend (First weekend in May - check exact dates)",
                    "description": "Limerick's largest annual festival featuring street food markets, music stages, street performers, river activities (jet skis, kayaking), the Great Limerick Run, and usually culminates in fireworks.",
                    "notes": "Massive crowds, book accommodation months ahead. Check official Riverfest website for full schedule. Many events are free."
                },
                {
                    "name": "May Bank Holiday",
                    "date": "First Monday in May",
                    "description": "Public holiday, coinciding with Riverfest makes it an exceptionally busy weekend in Limerick.",
                    "notes": "Plan travel and bookings very carefully."
                },
                {
                    "name": "Great Limerick Run (Part of Riverfest)",
                    "date": "Sunday of Riverfest Weekend",
                    "description": "Major running event (Marathon, Half Marathon, 6 Mile) attracting thousands of participants and spectators. Causes road closures.",
                    "notes": "Significant traffic disruption in and around the city on this day."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Immerse Yourself in Riverfest",
                    "where": "City Centre (Arthur's Quay, Howley's Quay, riverside, Potato Market)",
                    "description": "Enjoy the free entertainment, sample diverse street food, watch river stunts, listen to live music, and soak up the carnival atmosphere.",
                    "practical_tips": "Check the event schedule. Be prepared for large crowds. Bring cash for food stalls. Fireworks are usually Sunday night.",
                    "best_time": "Throughout Riverfest Weekend",
                    "estimated_cost": "Free (most entertainment) / Budget-Moderate (food/drink)",
                    "weather_dependent": "Varies (some events are weather permitting)"
                },
                {
                    "activity": "Explore King John's Castle",
                    "where": "Nicholas Street, Medieval Quarter",
                    "description": "Visit the iconic castle, perhaps slightly less crowded just before/after the main Riverfest peak.",
                    "practical_tips": "Book online if possible. Allow 2-3 hours.",
                    "best_time": "Weekday outside Riverfest, or early/late during festival",
                    "estimated_cost": "Moderate (Entry Fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit the Milk Market",
                    "where": "Cornmarket Row",
                    "description": "Experience the bustling weekend market, even livelier with the onset of summer produce and good weather.",
                    "practical_tips": "Saturday is the main day. Great place for food and local crafts.",
                    "best_time": "Weekend Morning/Afternoon",
                    "estimated_cost": "Free (browsing) / Budget-Moderate (purchases)",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk or Cycle the Riverside Paths",
                    "where": "City Centre & towards UL",
                    "description": "Enjoy the greening riverside landscape and increasing daylight on the accessible paths along the Shannon.",
                    "practical_tips": "Paths are well-maintained. Bike rental options available.",
                    "best_time": "Daytime / Long Evenings",
                    "estimated_cost": "Free (walking) / Budget (bike hire)",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C",
                    "low": "8°C"
                },
                "precipitation": "Mix of sunshine and showers likely, potentially becoming warmer and more settled. Evenings remain bright very late.",
                "general_tips": "Layers still advised, always include a waterproof. Sunscreen for bright spells. Comfortable shoes for walking."
            },
            "tourism_level": {
                "crowds": "Moderate, steadily increasing towards June levels. Attractions noticeably busier than early spring, especially weekends.",
                "pricing": "Shoulder season prices, potentially rising slightly. Booking ahead recommended.",
                "overall_atmosphere": "Pleasant late spring/early summer feel. City is lively but generally less crowded than Riverfest or peak summer. Good balance for exploring."
            },
            "events_holidays": [
                 {
                    "name": "Live Music Scene",
                    "date": "Throughout May",
                    "description": "Pubs and venues like Dolan's continue to offer regular live music as the season builds.",
                    "notes": "Check local listings."
                },
                 {
                    "name": "Local Community Events",
                    "date": "Check local listings",
                    "description": "Possibility of smaller local festivals, sporting events, or outdoor markets as summer approaches.",
                    "notes": "Check Limerick.ie or local media."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Day Trip to Lough Gur",
                    "where": "Near Bruff, Co. Limerick (Requires Car/Taxi)",
                    "description": "Explore this significant archaeological landscape with stone circles, ancient dwellings, and visitor centre, now lush with spring growth.",
                    "practical_tips": "Requires transport. Allow several hours to walk the sites and visit the centre. Wear good walking shoes.",
                    "best_time": "Daytime",
                    "estimated_cost": "Budget (transport) + Moderate (visitor centre entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Kayaking on the River Shannon",
                    "where": "Operators in Limerick City",
                    "description": "Join a guided kayak tour to see the city from the water as the weather becomes more suitable for water sports.",
                    "practical_tips": "Book tours in advance. Check weather suitability. Various operators available.",
                    "best_time": "Calm day, check operator times",
                    "estimated_cost": "Moderate/High",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Bunratty Castle & Folk Park",
                    "where": "Bunratty, Co. Clare",
                    "description": "Explore the castle and folk park, potentially less crowded than during the absolute peak season.",
                    "practical_tips": "Book online. Easily accessible by bus or car. Allow ample time.",
                    "best_time": "Any Day",
                    "estimated_cost": "Moderate/High (Transport + Entry Fee)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Explore People's Park & Georgian Quarter",
                    "where": "Pery Square area",
                    "description": "Enjoy the Victorian park coming into bloom and admire the surrounding Georgian architecture. Visit the City Gallery of Art.",
                    "practical_tips": "Pleasant area for a relaxed stroll. Gallery is free.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        }
    }
}