{
    "November": {
        "reasons_to_visit": [
            {
                "reason": "Historic Museums Without Crowds",
                "details": "November offers a unique opportunity to experience Antwerp's world-class museums and galleries with minimal crowds, allowing for contemplative appreciation of the Royal Museum of Fine Arts' collections, unhurried visits to the MAS Museum's maritime exhibits, and peaceful exploration of the Plantin-Moretus Museum without summer queues."
            },
            {
                "reason": "Authentic Antwerp Culture",
                "details": "With fewer tourists, November provides a more genuine experience of Antwerp's cultural life, from the historic Zuid district cafés to the vibrant Zurenborg neighborhood, allowing visitors to interact with locals and experience the authentic rhythms of the city's neighborhood life in this culturally rich Flemish metropolis."
            },
            {
                "reason": "Classical Music Season Highlights",
                "details": "November marks a highlight in Antwerp's renowned classical music calendar with performances by the Antwerp Symphony Orchestra, the Flemish Opera at the acoustically excellent opera house, special concerts in the Queen Elisabeth Hall, and the city's famous cathedral choir performing in the magnificent Cathedral of Our Lady."
            },
            {
                "reason": "Reduced Accommodation Rates",
                "details": "Hotel prices in November drop significantly from summer peaks, making Antwerp's luxury hotels near the Meir shopping street, boutique accommodations in the historic center, and stylish options in the Zuid district more accessible, with overall trip costs more affordable compared to the high season."
            },
            {
                "reason": "Christmas Market Preparations",
                "details": "Late November marks the opening of Antwerp's enchanting Christmas market, transforming the Grote Markt and surrounding areas with wooden stalls, festive decorations, and the opportunity to experience opening days before the December crowds arrive."
            },
            {
                "reason": "Scheldt River Atmosphere",
                "details": "The Scheldt River takes on a different, more contemplative character in November with morning mists, dramatic skies, and fewer tourists, allowing photographers and visitors to experience the river's moody autumn atmosphere and relationship with the city's blend of medieval and modern architecture from a more local perspective."
            },
            {
                "reason": "Belgian Cuisine and Comfort Food",
                "details": "November is ideal for experiencing Antwerp's rich Belgian cuisine with seasonal ingredients like game, mussels, and local produce featuring prominently in traditional dishes like stoofvlees (beef stew), waterzooi, and Flemish asparagus, while the city's cozy cafés and restaurants offer perfect warm retreats from cooler weather."
            },
            {
                "reason": "Opera and Theater Season",
                "details": "November falls during the height of Antwerp's prestigious opera and theater season, with world-class performances at the Flemish Opera, deSingel arts center, Bourla Theater, and various smaller venues throughout the city showcasing Antwerp's position as one of Belgium's cultural capitals."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Colder Temperatures",
                "details": "November brings significantly cooler weather to Antwerp with average highs of 9-11°C and lows sometimes approaching freezing, particularly at night and along the Scheldt River, requiring proper winter clothing and limiting the enjoyment of the city's otherwise pleasant outdoor spaces and riverfront areas."
            },
            {
                "reason": "Increased Rainfall",
                "details": "November sees increased precipitation compared to summer months, with frequent rainfall that can disrupt outdoor activities and create gray, overcast conditions that persist for several days at a time, typically recording 10-12 rainy days throughout the month."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "Daylight hours are significantly reduced, with sunset around 5:00 PM by mid-November, limiting the time available for outdoor sightseeing, photography of Antwerp's magnificent architecture and riverfront views, and exploration of the city's extensive parks and harbor areas."
            },
            {
                "reason": "Reduced Outdoor Culture",
                "details": "Antwerp's vibrant outdoor scene along the Grote Markt and riverfront promenades is largely suspended in November, with most outdoor cafés, terraces, and waterfront venues closed or operating with limited capacity using heaters, reducing one of the city's signature spring and summer experiences."
            },
            {
                "reason": "Antwerp Book Fair Crowds",
                "details": "If visiting during the Antwerp Book Fair (typically early November), be prepared for busier cultural venues and increased accommodation rates in central areas as literary enthusiasts and authors attend readings and events throughout the city's cultural centers."
            },
            {
                "reason": "Harbor Tour Limitations",
                "details": "The Antwerp harbor tours and river cruises operate on a significantly reduced schedule in November, with fewer departures, shorter routes, and occasional cancellations due to weather conditions, limiting one of Antwerp's popular activities and perspectives for seeing the city from its beautiful waterways."
            }
        ],
        "first_half": {
            "date_range": "November 1–15",
            "weather": {
                "average_temperature": {
                    "high": "11°C",
                    "low": "5°C"
                },
                "precipitation": "Moderate to frequent rainfall with an average of 5-6 rainy days during this period. Maritime climate brings occasional unpredictable weather changes, with precipitation that can vary from drizzle to heavier rain showers. Morning fog along the Scheldt River common.",
                "general_tips": "Pack layers including a warm waterproof coat, scarf, and gloves for colder days and evenings. Umbrella essential for exploring the city. Waterproof footwear recommended as streets and pavements can remain wet throughout the day."
            },
            "tourism_level": {
                "crowds": "Low tourist presence at major attractions with minimal waiting times at the Royal Museum of Fine Arts, MAS Museum, and Cathedral of Our Lady. Business travelers still present midweek, but tourist sites remain uncrowded.",
                "pricing": "Off-season rates for accommodations with significant discounts, especially weekends and for longer stays. Exception during major cultural events like book fairs which can briefly drive up prices across the city center.",
                "overall_atmosphere": "Relaxed and authentic, with Antwerp residents returning to their normal routines after the tourist season. University in full session, bringing intellectual and cultural energy to districts like the Zuid and student areas."
            },
            "events_holidays": [
                {
                    "name": "All Saints' Day (Allerheiligen)",
                    "date": "November 1",
                    "description": "Religious holiday observed throughout Belgium when families visit cemeteries to honor deceased relatives with flowers and candles, particularly notable at Antwerp's historic Schoonselhof Cemetery.",
                    "notes": "Public holiday in Belgium; most businesses, shops, and some attractions closed; Catholic and Protestant churches hold special services; Cathedral of Our Lady holds particularly significant observances; traditional foods available at some bakeries; provides insight into local cultural traditions."
                },
                {
                    "name": "Antwerp Book Fair",
                    "date": "Early November (varies annually)",
                    "description": "Belgium's largest book fair featuring Flemish and international authors with readings, discussions, and book presentations at venues throughout the city including Antwerp Expo, bookstores, and cultural centers.",
                    "notes": "One of Belgium's most important literary events; venues include Antwerp Expo and cultural centers throughout the city; fair passes and single event tickets available; brings international authors and literary professionals to city; some readings and discussions in English; program available online and at tourist information."
                },
                {
                    "name": "St. Martin's Day (Sint-Maarten)",
                    "date": "November 11",
                    "description": "Traditional children's festival where youngsters parade through neighborhoods carrying handmade lanterns, singing songs and commemorating the legend of St. Martin sharing his cloak with a beggar.",
                    "notes": "Family-oriented celebration; neighborhood parades typically early evening around 5-6PM; children carry homemade lanterns through Antwerp districts; traditional pastries available in bakeries; most visible in residential areas rather than tourist districts; schools and kindergartens organize small processions; warm and charming local tradition."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "MAS Museum Without Crowds",
                    "where": "Eilandje District",
                    "description": "Experience Antwerp's iconic Museum aan de Stroom with significantly reduced visitor numbers, allowing for peaceful appreciation of its striking architecture, comprehensive exhibits on Antwerp's history and maritime heritage, and panoramic views from the rooftop of the city, port, and river.",
                    "practical_tips": "Early morning visits offer the most tranquil experience; rooftop observation deck less crowded but dress warmly; museum fully heated but still bring layers; guided tours available in multiple languages but less frequent than in summer; free access to rooftop even without museum ticket.",
                    "best_time": "Early morning (9-10AM)",
                    "estimated_cost": "€12 for museum entry; rooftop free",
                    "weather_dependent": false
                },
                {
                    "activity": "Royal Museum of Fine Arts",
                    "where": "South District",
                    "description": "Explore one of Belgium's most important art collections featuring Flemish masterpieces from Rubens, Van Dyck, and others, with November's quieter atmosphere allowing unhurried appreciation of paintings in the magnificent museum complex.",
                    "practical_tips": "Weekday mornings particularly quiet; famous works include Flemish Masters and modern Belgian art; audio guides available in multiple languages; excellent heating throughout galleries; combine with FoMu Photography Museum nearby; café in museum provides warm respite.",
                    "best_time": "Weekday morning",
                    "estimated_cost": "€10 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Plantin-Moretus Museum",
                    "where": "Historic Center",
                    "description": "Discover one of the world's most extraordinary museums showcasing the oldest printing presses and a remarkably preserved Renaissance printing house, with significantly fewer visitors than during summer season.",
                    "practical_tips": "UNESCO World Heritage site; weekday mornings nearly empty compared to summer; excellent audio guide available in multiple languages; heating makes this comfortable regardless of weather; combine with Cathedral visit nearby; café on premises for warming refreshments.",
                    "best_time": "Morning, first entry slot",
                    "estimated_cost": "€8 general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Traditional Antwerp Café Culture",
                    "where": "Grote Markt Area",
                    "description": "Experience Antwerp's historic café tradition in elegant settings with November providing the perfect atmosphere for enjoying rich hot chocolate, coffee specialties, and Belgian pastries and cakes in ornate historic interiors.",
                    "practical_tips": "Café Grote Markt, Grand Café Horta, and De Foyer among most traditional options; each offers specialty cakes and pastries; afternoon tea and coffee a Belgian tradition between 3-5PM; historic interiors provide insight into city's elegant past; perfect respite during inclement weather; window seats offer views of Antwerp architecture while staying warm indoors.",
                    "best_time": "Afternoon (3-5PM)",
                    "estimated_cost": "€10-15 for coffee and cake",
                    "weather_dependent": false
                },
                {
                    "activity": "Diamond Museum",
                    "where": "Diamond District",
                    "description": "Visit Antwerp's fascinating diamond museum showcasing the city's 500-year history as the world's diamond capital, with November providing contemplative atmosphere for appreciating both the precious stones and the cultural significance of the diamond trade.",
                    "practical_tips": "Located near Central Station; never overcrowded in November; contemporary approach to diamond history focuses on trade, cutting, and cultural significance; viewing platforms offer unique perspectives; chronological exhibitions; multi-sensory experiences; excellent indoor activity during inclement weather.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€10 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Red Star Line Museum",
                    "where": "Eilandje District",
                    "description": "Experience Antwerp's moving migration museum housed in the historic buildings where millions of Europeans began their journey to America, featuring excellent exhibitions on migration, hope, and cultural exchange.",
                    "practical_tips": "Located in historic emigrant processing buildings; exhibitions tell personal stories of migration; interactive displays suitable for all ages; heated throughout; excellent indoor activity during inclement weather; combines well with MAS Museum nearby; café on premises with river views.",
                    "best_time": "Afternoon",
                    "estimated_cost": "€8 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Flemish Opera Evening Performance",
                    "where": "Opera Vlaanderen",
                    "description": "Attend an opera, ballet, or classical concert at Antwerp's beautiful opera house, experiencing one of Belgium's finest companies in a magnificent historic building that has been central to Flemish musical culture for decades.",
                    "practical_tips": "November performance calendar typically features major productions; tickets more readily available than in December or summer but advance booking still recommended; guided tours also available during daytime; dress code relatively formal but not strict black tie; architecture spectacular both inside and out; performances typically start at 7PM; arrive early to enjoy the ornate interior.",
                    "best_time": "Evening performances (typically 7PM)",
                    "estimated_cost": "€35-110 depending on performance and seating",
                    "weather_dependent": false
                },
                {
                    "activity": "Cathedral Choir Performance",
                    "where": "Cathedral of Our Lady",
                    "description": "Experience a choir performance in Antwerp's magnificent Gothic cathedral, continuing a musical tradition dating back centuries and offering an authentic cultural and spiritual experience beyond typical tourism.",
                    "practical_tips": "Services typically held Sunday mornings and special concert performances throughout November; arrival 30-45 minutes early for seating; offerings requested rather than fixed ticket price for regular services; concert schedule varies so verify performance dates; located in historic center; respectful attire appropriate; photography not permitted during services.",
                    "best_time": "Sunday morning (10AM) or scheduled concerts",
                    "estimated_cost": "Free for services (donations welcomed); €10-20 for special concerts",
                    "weather_dependent": false
                },
                {
                    "activity": "Zuid District Exploration",
                    "where": "South of city center",
                    "description": "Discover Antwerp's vibrant art district with its independent galleries, design shops, international restaurants, and local bars—a perfect area for experiencing contemporary Belgian culture away from tourist centers and historic sites.",
                    "practical_tips": "Trendy area with cultural diversity; numerous cafés provide warm retreats during exploration; less touristy than Grote Markt area; cinema programs in original languages; better food value than tourist areas; evening bar and restaurant scene authentically local; best explored on foot but tram connections available throughout.",
                    "best_time": "Afternoon into evening",
                    "estimated_cost": "Free for exploration; €10-15 for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Antwerp Central Station",
                    "where": "City Center",
                    "description": "Visit Antwerp's spectacular cathedral-like railway station featuring a striking stone facade and dramatic glass-domed interior, offering both architectural interest and a warm retreat during cooler November days.",
                    "practical_tips": "Regularly rated among world's most beautiful train stations; spectacular central hall; photography permitted in most areas; multiple levels showcase different architectural styles; easily accessible and centrally located; excellent rainy day activity; shopping gallery within station complex; diamond district just outside; guided architectural tours sometimes available.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "Free admission",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "November 16–30",
            "weather": {
                "average_temperature": {
                    "high": "8°C",
                    "low": "3°C"
                },
                "precipitation": "Continued possibility of rainfall with colder temperatures, morning fog along the Scheldt River, and increased chance of first frost later in the month, particularly in outlying areas.",
                "general_tips": "Winter clothing essential with waterproof outer layers. Evenings require warm coat, hat, scarf, and gloves, particularly in open areas like the Grote Markt and riverfront. Indoor options important for itinerary planning with shorter daylight hours."
            },
            "tourism_level": {
                "crowds": "Very quiet with minimal foreign tourists until the Christmas Market opens, then a significant increase in domestic and international visitors focused around market areas in late November.",
                "pricing": "Low season rates for accommodations until Christmas Market opening when prices increase substantially, particularly for properties near Grote Markt and historic center markets.",
                "overall_atmosphere": "Authentic and local with business life, cultural events, and everyday routines largely unaffected by tourism until late month, when the festive atmosphere of the Christmas Market transforms the historic center."
            },
            "events_holidays": [
                {
                    "name": "Antwerp Christmas Market Opening",
                    "date": "Late November (typically last weekend before December)",
                    "description": "The opening of Antwerp's enchanting Christmas market, transforming Grote Markt, Groenplaats, and Steenplein with beautifully decorated stalls, cultural performances, and traditional crafts creating a magical winter wonderland.",
                    "notes": "Opening dates vary annually but typically the last weekend of November; Grote Markt and surrounding squares feature beautifully decorated stalls; themed areas focused on different aspects of Christmas tradition; each area has unique character; less crowded on weekdays and during daytime; magical atmosphere after dark; weekend evenings most busy; extended shopping hours in city center stores."
                },
                {
                    "name": "Remembrance Sunday (Wapenstilstand)",
                    "date": "Mid-November (closest Sunday to November 11)",
                    "description": "Belgian national day of remembrance commemorating victims of war with solemn ceremonies at war memorials and cemeteries throughout Antwerp, marking the armistice that ended World War I.",
                    "notes": "Quiet, reflective observance rather than public holiday; ceremonies typically held at city memorials and other sites; museums and cultural venues operate normal hours; rarely impacts tourist activities but provides cultural insight; Antwerp's history makes this day particularly meaningful in local context."
                },
                {
                    "name": "Antwerp Advent Festival of Lights",
                    "date": "Late November (First Advent weekend)",
                    "description": "Special illuminations and light displays throughout the historic center with the Cathedral, the Grote Markt, and other monuments beautifully lit to celebrate the beginning of the Advent season.",
                    "notes": "Cathedral of Our Lady and other churches hold special Advent musical services; coincides with Christmas market opening weekend; illuminations best viewed after 4:30PM; photographic opportunities throughout historic center; special evening tours focused on illuminations sometimes available through tourist office; Antwerp's extensive Christmas decorations particularly noteworthy around the magnificent Cathedral and historic squares."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Antwerp Christmas Market Opening Days",
                    "where": "Grote Markt and surrounding areas",
                    "description": "Experience the magical atmosphere of Antwerp's Christmas market during its opening days, with traditional wooden stalls, handcrafts, food specialties, and festive environment before the peak December crowds arrive—creating a wonderful winter wonderland in the heart of the historic city.",
                    "practical_tips": "Grote Markt most famous and central; market spreads across multiple squares including Groenplaats and Steenplein; each section has signature food specialties; weekday afternoons less crowded than weekends; evening atmosphere most magical after 4PM when fully dark; Belgian hot chocolate and jenever (gin) specialties available in market-specific souvenir mugs; ice rink typically opens with market.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "Free entry; €15-25 for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "Meir Shopping Experience",
                    "where": "City Center",
                    "description": "Explore Antwerp's elegant shopping boulevard featuring high-quality local products, designer boutiques, Belgian chocolatiers, and specialty shops housed in beautifully restored buildings away from the Christmas market crowds.",
                    "practical_tips": "Meir connects Central Station area to Groenplaats; features luxury boutiques and international brands; Stadsfeestzaal shopping center offers high-end shopping in restored historic hall; numerous cafés provide perfect warm lunch stops between shopping; less crowded than Christmas markets for gift shopping; many shops showcase Belgian specialties including chocolate and fashion.",
                    "best_time": "Midday",
                    "estimated_cost": "Free for browsing; purchases extra",
                    "weather_dependent": false
                },
                {
                    "activity": "Middelheim Museum",
                    "where": "Southern outskirts of Antwerp",
                    "description": "Visit Antwerp's outdoor sculpture park with an extraordinary collection of modern and contemporary sculptures set in a peaceful park setting, offering a different experience in autumn with fallen leaves and dramatic skies creating unique perspectives.",
                    "practical_tips": "Accessible via tram from city center; extensive collection of outdoor sculpture plus indoor pavilions; winter light creates dramatic shadows on sculptures; park less crowded than summer; indoor areas provide warming retreats; café on premises; comfortable walking shoes and warm clothing recommended for grounds exploration.",
                    "best_time": "Morning to allow time for complete park exploration",
                    "estimated_cost": "Free admission",
                    "weather_dependent": true
                },
                {
                    "activity": "St. Andrew's Church and Brewery",
                    "where": "Historic Center",
                    "description": "Visit the beautiful historic St. Andrew's Church, then explore the former De Koninck brewery site next door which has been transformed into a cultural center while retaining its brewing heritage.",
                    "practical_tips": "Church features magnificent Baroque interior; brewery site combines history with contemporary uses; multiple small eateries nearby; less crowded than Cathedral area; good rainy day activity; combination of spiritual and cultural heritage; combines well with nearby Sint-Jansvliet square; photography permitted with respect to worshippers.",
                    "best_time": "Mid-morning on weekdays",
                    "estimated_cost": "Church free (donations welcome); brewery tour €12-15",
                    "weather_dependent": false
                },
                {
                    "activity": "Antwerp Symphony Orchestra Concert",
                    "where": "Queen Elisabeth Hall",
                    "description": "Attend a classical music performance by Antwerp's renowned Symphony Orchestra in their concert hall featuring excellent acoustics and a diverse program of orchestral works, chamber music, and international soloists as part of the active winter season.",
                    "practical_tips": "Located in modern Queen Elisabeth Hall with excellent acoustics; advance ticket purchase recommended for popular performances but often available last-minute in November; dress code relatively relaxed by European standards; central location easily accessible; numerous restaurants nearby for pre-concert dining; excellent heating throughout venue.",
                    "best_time": "Evening performances (typically 8:00PM)",
                    "estimated_cost": "€25-65 depending on performance and seating",
                    "weather_dependent": false
                },
                {
                    "activity": "Belgian Cuisine Experience",
                    "where": "Historic center and Zuid district restaurants",
                    "description": "Discover traditional Belgian cuisine featuring hearty winter dishes like carbonade flamande (beef stew), mussels, waterzooi (chicken stew), and regional specialties in historic restaurants away from tourist centers.",
                    "practical_tips": "De Bomma and Bourla offer historic atmosphere; 't Hofke and La Veranda provide authentic local experience; advance reservations less necessary than in high season except weekend evenings; ask for seasonal specials not on regular menu; local beer traditional accompaniment; restaurants fully heated but dress warmly for travel between venues.",
                    "best_time": "Lunch (12-2PM) or dinner (6-8PM)",
                    "estimated_cost": "€25-40 for full meal with drinks",
                    "weather_dependent": false
                },
                {
                    "activity": "Antwerp Zoo",
                    "where": "Adjacent to Central Station",
                    "description": "Visit one of Europe's oldest and most respected zoos, uniquely set within historic 19th-century architecture, offering both animal exhibits and beautiful historic buildings, with fewer visitors than during peak season.",
                    "practical_tips": "Accessible on foot from Central Station; spectacular historic architecture housing tropical areas; various climate-controlled houses showcase different environments; significantly fewer visitors in November; special winter animal activities; heated historic buildings include Art Deco and classical designs; allow at least 2-3 hours; café and restaurant facilities available.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "€29 adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Ghent",
                    "where": "Ghent (30 minutes from Antwerp)",
                    "description": "Visit the picturesque medieval city famous for its well-preserved old town, featuring the magnificent Gravensteen Castle, St. Bavo's Cathedral with the Ghent Altarpiece, beautiful canal system, and atmospheric streets—a perfect contrast to Antwerp's more maritime cityscape.",
                    "practical_tips": "Regular direct train connections from Antwerp Central Station; compact old town easily walkable; medieval atmosphere enhanced by November lighting; Ghent Altarpiece newly restored and displayed in state-of-the-art visitor center; several traditional Belgian restaurants in historic center; picturesque setting ideal for photography even in cloudy weather.",
                    "best_time": "Full day starting morning",
                    "estimated_cost": "€30-45 including transportation and entrance fees",
                    "weather_dependent": true
                },
                {
                    "activity": "Belgian Beer Tasting",
                    "where": "Historic Center or Zuid District",
                    "description": "Experience a guided tasting of Belgium's distinctive beers in a historic café, discovering trappist ales, lambics, and local specialties in the authentic atmosphere of a traditional beer nation that includes hundreds of unique varieties.",
                    "practical_tips": "Kulminator, Gollem, and De Grote Dorst offer exceptional beer selections; specialized beer cafés typically offer guided tastings; November brings seasonal winter beers; Belgian beer culture recognized by UNESCO; local varieties paired perfectly with cheese and traditional snacks; indoor activity perfect for cooler evenings; opportunity to learn about brewing traditions from experts; advance booking recommended for guided tastings.",
                    "best_time": "Evening (usually starting 6 or 7PM)",
                    "estimated_cost": "€25-35 for guided tasting session with snacks",
                    "weather_dependent": false
                },
                {
                    "activity": "Bourla Theater Performance",
                    "where": "Historic Center",
                    "description": "Attend a performance at the magnificent neo-classical Bourla Theater, one of Belgium's most beautiful historic theaters featuring an original 19th-century stage mechanism, hosting both classic and contemporary productions.",
                    "practical_tips": "Historic theater with exceptional architecture; November repertoire typically includes both classical and modern works; advance booking recommended but November offers better availability than December; dress code relatively formal; some performances with English subtitles; arrive early to enjoy beautiful theater interior; performances typically begin at 8:00PM; excellent indoor activity regardless of weather.",
                    "best_time": "Evening performances (typically 8:00PM)",
                    "estimated_cost": "€20-60 depending on performance and seating",
                    "weather_dependent": false
                }
            ]
        }
    }
}