{
  "overview_paragraph": "Paris is at its best in spring (April–June) and early fall (September–October), when café terraces hum, gardens bloom or turn gold, and walking weather is ideal. July brings long evenings and blockbuster events—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is quieter and cozy—think museum days, patisserie stops, and twinkling holiday lights—while March begins to warm with the odd shower.",
  "January": [
    "Louvre without the lines, steaming chocolat chaud, and misty Seine walks between cozy bookshops.",
    "Winter light on the Pyramid, snug bistros in Saint‑Germain, and vintage hunts in covered passages."
  ],
  "February": [
    "Montmartre at golden hour, Valentine’s views from Pont des Arts, and jazz‑lit nights in cellar clubs.",
    "Shared macarons, candlelit bistros, and strolls past secret courtyards in the Marais."
  ],
  "March": [
    "First blossoms in the Tuileries, terrace tables returning, and Left Bank bookshop wanders.",
    "Morning croissants, museum afternoons, and blue‑hour bridges welcoming spring back to Paris."
  ],
  "April": [
    "Cherry trees in bloom, flaky croissants, and bike rides from Le Marais to the Latin Quarter.",
    "Spring light on Notre‑Dame, gallery‑hopping in Le Marais, sunset cruise to a glittering Tour Eiffel."
  ],
  "May": [
    "Picnics on the Champ de Mars, marchés brimming with color, and twilight strolls along Île Saint‑Louis.",
    "Flowered boulevards, open‑air café moments, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, canal aperitifs on Saint‑Martin, and the city humming for Fête de la Musique.",
    "Sun‑splashed gardens, riverfront picnics, and late sunsets that turn every bridge into a viewpoint."
  ],
  "July": [
    "Bastille fireworks on the skyline, lazy afternoons in the Luxembourg, and moonlit Seine cruises.",
    "Summer markets, rooftop terraces, and gallery cool‑downs between sun‑bright wanderings."
  ],
  "August": [
    "Quiet boulevards, easy museum days, and Paris Plages evenings with breezes off the river.",
    "Shaded gardens, courtyard cafés, and golden hours when the city feels like it’s yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits, lively terraces, and vineyard‑tinted evenings in Montmartre.",
    "Crisp mornings, flea‑market finds, and gallery re‑openings that make wandering irresistible."
  ],
  "October": [
    "Autumn leaves in the Luxembourg, bistros aglow, and the Montmartre harvest festival up the hill.",
    "Cinnamon‑spiced stalls, museum hideaways, and sunset tones warming the Île de la Cité."
  ],
  "November": [
    "Beaujolais nouveau toasts, cozy brasseries, and Louvre afternoons while the city slows to a hush.",
    "Foggy Seine mornings, Impressionist color indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Champs‑Élysées lights, Christmas markets at the Tuileries, and skating beneath grand façades.",
    "Vin chaud in hand, Notre‑Dame’s bells, and winter sparkle from boulevard to boutique passage."
  ]
}

