{
    "June": {
        "reasons_to_visit": [
            {
                "reason": "Ideal Summer Weather (Mostly)",
                "details": "June offers reliably warm, sunny weather (average highs 28-30°C), great for exploring the city and waterfront before the peak heat and humidity of July/August. Evenings are lovely."
            },
            {
                "reason": "Longest Daylight Hours",
                "details": "Enjoy maximum daylight (sunset around 8:50 PM) for sightseeing, visiting nearby Halkidiki beaches, and enjoying long evenings along the Nea Paralia waterfront or in outdoor cafes."
            },
            {
                "reason": "Start of Summer Festivals",
                "details": "Catch the beginning of Thessaloniki's summer cultural season with events at Moni Lazariston, Dasous Theatre, and potentially the start of the Sani Festival in nearby Halkidiki."
            },
            {
                "reason": "Halkidiki Beach Season Begins",
                "details": "The sea is warm enough for comfortable swimming. June is a prime month for day trips or longer stays at the stunning beaches of the Halkidiki peninsula before peak crowds arrive."
            },
            {
                "reason": "Lively Atmosphere, Pre-Peak Crowds",
                "details": "Thessaloniki buzzes with summer energy. Waterfront cafes are full, nightlife is vibrant, but crowds, while growing, haven't hit July/August levels, especially mid-week."
            },
            {
                "reason": "Outdoor Living & Waterfront Focus",
                "details": "Perfect weather for enjoying the extensive Nea Paralia waterfront promenade, dining outdoors in Ladadika or Aristotelous Square, and visiting open-air cinemas."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Rising Heat & Humidity",
                "details": "Temperatures climb noticeably, especially later in June. Humidity starts becoming a factor, making midday feel quite hot. Sun protection is crucial."
            },
            {
                "reason": "Increasing Crowds & Prices",
                "details": "June is definitely high season. Expect significant crowds on weekends (especially heading to Halkidiki) and rising prices for accommodation and flights."
            },
            {
                "reason": "Booking Ahead Recommended",
                "details": "Popular hotels, desirable restaurants (especially waterfront/view spots), festival tickets, and Halkidiki accommodation should be booked in advance."
            },
            {
                "reason": "Potential for Early Heatwaves",
                "details": "While not as common as July/August, early summer heatwaves with temperatures exceeding 35°C can occur."
            },
            {
                "reason": "Summer Breezes, Not Strong Winds",
                "details": "While occasional sea breezes occur, the strong Meltemi wind impacting the Aegean islands is not a major factor in Thessaloniki itself. Humidity is more relevant."
            }
        ],
        "first_half": {
            "date_range": "June 1–15",
            "weather": {
                "average_temperature": {
                    "high": "28°C",
                    "low": "18°C"
                },
                "precipitation": "Very low chance of rain. Mostly sunny, warm, and pleasant. Humidity starts to build.",
                "general_tips": "Pack light summer clothes (cotton, linen), swimwear, sunscreen, hat, sunglasses. Comfortable sandals/walking shoes essential. A light layer might be needed for occasional cooler evenings."
            },
            "tourism_level": {
                "crowds": "High and increasing, especially on weekends and along the waterfront/routes to Halkidiki. Weekdays still relatively manageable.",
                "pricing": "High season prices apply. Book accommodation and flights well ahead.",
                "overall_atmosphere": "Vibrant early summer buzz. Great weather for mixing city exploration (mornings/evenings) with beach trips or waterfront relaxation."
            },
            "events_holidays": [
                {
                    "name": "Holy Spirit Monday (Agiou Pnevmatos)",
                    "date": "Varies (50 days after Orthodox Easter - often early/mid June)",
                    "description": "Public holiday creating a long weekend. Many Thessalonians head to Halkidiki, making roads busy but the city potentially slightly quieter.",
                    "notes": "Check date for the specific year. Expect closures (banks, offices, some shops). Major sites usually open."
                },
                {
                    "name": "Summer Festival Openings (Moni Lazariston, etc.)",
                    "date": "Often early June onwards",
                    "description": "Check schedules for the start of concert/theatre seasons at key venues like Moni Lazariston or Dasous Theatre.",
                    "notes": "Book tickets online well in advance."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore White Tower & Waterfront Promenade",
                    "where": "Nea Paralia (Waterfront)",
                    "description": "Visit the city icon (ideally early) and enjoy a long walk or cycle along the modern waterfront with its parks, sculptures ('Umbrellas'), and cafes.",
                    "practical_tips": "Waterfront is extensive and best enjoyed morning/evening. Rent bikes near the White Tower. Bring water/hat.",
                    "best_time": "Early Morning (8 AM - 10 AM)",
                    "estimated_cost": "Moderate (rental)",
                    "weather_dependent": true
                },
                {
                    "activity": "Stroll and Dine in Ladadika",
                    "where": "Historic district near the port",
                    "description": "Wander the colourful, atmospheric streets and enjoy dinner or drinks at one of the many tavernas, bars, or restaurants.",
                    "practical_tips": "Comes alive in the evening. Mostly pedestrianized. Can get busy.",
                    "best_time": "Late Afternoon / Evening",
                    "estimated_cost": "Moderate (for dining)",
                    "weather_dependent": false
                },
                {
                    "activity": "First Beach Trip to Halkidiki",
                    "where": "Kassandra or Sithonia peninsulas (car/bus needed)",
                    "description": "Take advantage of the pleasant sea temperatures and pre-peak crowds (especially weekdays) for a day at Halkidiki's famous beaches.",
                    "practical_tips": "Allow ample travel time (1hr+ each way). Go early. Weekdays are much better than weekends in June.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (transport + entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Archaeological Museum",
                    "where": "Near White Tower / HANTH square",
                    "description": "Explore the rich history of Macedonia and Thessaloniki. A good air-conditioned option if midday gets too warm.",
                    "practical_tips": "Allow 2-3 hours. Cafe has Parthenon views.",
                    "best_time": "Anytime, good for midday heat escape",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "June 16–30",
            "weather": {
                "average_temperature": {
                    "high": "30°C",
                    "low": "20°C"
                },
                "precipitation": "Extremely rare. Consistently hot and sunny. Heat becomes more noticeable.",
                "general_tips": "Prioritize hydration and sun protection. Plan outdoor sightseeing for early mornings or evenings. Utilize air conditioning."
            },
            "tourism_level": {
                "crowds": "High and very busy. Feels like peak season is fully underway.",
                "pricing": "High season prices continue.",
                "overall_atmosphere": "Full summer mode. Hot days, warm lively evenings. Focus shifts increasingly to nightlife, waterfront activities, and Halkidiki escapes."
            },
            "events_holidays": [
                {
                    "name": "Summer Festivals (Moni Lazariston, Dasous Theatre, Sani)",
                    "date": "Ongoing throughout June",
                    "description": "Major performances continue. Check detailed schedules for specific concerts, theatre, dance events.",
                    "notes": "Booking essential."
                },
                {
                    "name": "European Music Day (often around June 21st)",
                    "date": "Around June 21st",
                    "description": "Look for free musical events in Aristotelous Square, along the waterfront, or at other public spaces.",
                    "notes": "Check local listings closer to the date."
                },
                {
                    "name": "Open-Air Cinemas ('Therina Sinema') Operating",
                    "date": "Throughout June nights",
                    "description": "Enjoy films under the stars at Thessaloniki's open-air cinemas.",
                    "notes": "Find locations online; popular local summer activity."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend a Summer Festival Performance",
                    "where": "Moni Lazariston, Dasous Theatre, or other venues",
                    "description": "Experience live music or theatre on a warm summer evening in one of Thessaloniki's atmospheric outdoor venues.",
                    "practical_tips": "Book tickets well in advance. Check venue location and transport.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                },
                {
                    "activity": "Sunset Views from Ano Poli (Upper Town)",
                    "where": "Heptapyrgion fortress or Kastra walls",
                    "description": "Climb or take a bus/taxi up to the historic Upper Town for stunning panoramic views over the city and Thermaic Gulf as the sun sets.",
                    "practical_tips": "Less strenuous in the cooler late afternoon/evening. Combine with exploring Ano Poli's alleys.",
                    "best_time": "Late Afternoon / Sunset",
                    "estimated_cost": "Free (fortress entry may apply)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Nea Paralia Waterfront Parks",
                    "where": "East of the White Tower",
                    "description": "Walk, cycle, or relax in the series of themed gardens along the modern waterfront, enjoying the sea breeze and lively atmosphere.",
                    "practical_tips": "Extends for several kilometers. Popular for evening strolls ('volta'). Various cafes along the way.",
                    "best_time": "Anytime, offers midday shade",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Enjoy Drinks or Dinner with Sea Views",
                    "where": "Waterfront bars/restaurants, Aretsou (Kalamaria)",
                    "description": "Take advantage of the long, warm evenings to dine or have drinks overlooking the Thermaic Gulf.",
                    "practical_tips": "Waterfront spots near the center are convenient but busy. Kalamaria offers many seafood options with marina views.",
                    "best_time": "Evening / Night",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                }
            ]
        }
    }
}