{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Pleasant Spring Awakening",
                "details": "March brings milder temperatures (average highs 13-15°C) and more sunshine, ideal for exploring the waterfront, Ano Poli, and archaeological sites comfortably before summer heat arrives."
            },
            {
                "reason": "Greening Cityscape & Waterfront",
                "details": "See Thessaloniki's parks and the expansive Nea Paralia waterfront start to green. Wildflowers may appear in Ano Poli or surrounding hills like Seih Sou forest."
            },
            {
                "reason": "Fewer Crowds & Shoulder Season Value",
                "details": "Enjoy major attractions like the White Tower, Rotunda, and museums with significantly fewer crowds than peak season. Accommodation prices are generally moderate (outside potential Carnival/Easter/Independence Day)."
            },
            {
                "reason": "Greek Independence Day (March 25th)",
                "details": "Witness patriotic celebrations, including a large military and student parade along the Thessaloniki waterfront (Megalou Alexandrou Ave), offering a unique cultural experience."
            },
            {
                "reason": "Carnival ('Apokries') & Clean Monday Potential",
                "details": "Depending on the Orthodox calendar, the vibrant Carnival season often culminates in early March, ending with Clean Monday ('Kathara Deftera') festivities like kite flying (e.g., near waterfront, parks) and Lenten picnics."
            },
            {
                "reason": "Ideal Walking & Waterfront Weather",
                "details": "The comfortable temperatures are perfect for long walks along the Nea Paralia waterfront, exploring Ano Poli's alleys, or taking day trips (weather permitting)."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Variable Spring Weather ('Martis Gdartis')",
                "details": "March weather in Thessaloniki is unpredictable. Expect potential for rain, chilly winds (including the 'Vardaris'), and cool spells alongside sunny days. Pack layers."
            },
            {
                "reason": "Cool Evenings & Sea Breeze",
                "details": "Evenings remain cool (average lows 5-7°C), often feeling chillier near the water. A warm jacket is necessary."
            },
            {
                "reason": "Carnival/Clean Monday Crowds & Closures (if applicable)",
                "details": "If Carnival's final days or Clean Monday fall in March, expect crowds for events, potential transport disruptions, and closures on Clean Monday (public holiday)."
            },
            {
                "reason": "March 25th Holiday Closures",
                "details": "Independence Day (March 25th) is a major public holiday. Expect widespread closures (shops, museums, sites). The parade causes significant road closures along the waterfront/central avenues."
            },
            {
                "reason": "Pollen Season Begins",
                "details": "Spring blooms mean rising pollen counts, potentially affecting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "13°C",
                    "low": "5°C"
                },
                "precipitation": "Moderate chance of rain persists, but sunny intervals increase. Can be quite windy ('Vardaris'). Dampness possible.",
                "general_tips": "Pack layers: t-shirts, long sleeves, sweaters, a waterproof and wind-resistant jacket. Comfortable walking shoes essential. Umbrella useful."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. Starts picking up slightly from winter lows. Very busy if peak Carnival/Clean Monday falls here.",
                "pricing": "Good shoulder season value, unless coinciding with Carnival peak.",
                "overall_atmosphere": "Transition from winter calm to spring vibrancy. Can be lively and festive if Carnival culminates early March."
            },
            "events_holidays": [
                {
                    "name": "Carnival ('Apokries') Peak & Clean Monday ('Kathara Deftera')",
                    "date": "Varies (often early March - check dates)",
                    "description": "If occurring, expect peak Carnival festivities (check local events) leading up to Clean Monday, celebrated with kite flying (waterfront areas, parks like Nea Paralia) and Lenten picnics.",
                    "notes": "Clean Monday is a public holiday - expect closures. Waterfront areas popular for kite flying."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Clean Monday Kite Flying (if applicable)",
                    "where": "Nea Paralia waterfront, parks, open areas",
                    "description": "Join locals (if Clean Monday falls here) flying kites and enjoying Lenten foods outdoors. The waterfront is a popular spot.",
                    "practical_tips": "Waterfront can get busy. Dress warmly. Bring/buy a kite. Enjoy the festive atmosphere.",
                    "best_time": "Daytime on Clean Monday",
                    "estimated_cost": "Low (food/kite extra)",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore the White Tower & Waterfront",
                    "where": "Nea Paralia (Waterfront)",
                    "description": "Visit Thessaloniki's icon and enjoy a walk along the waterfront as spring begins, with fewer crowds than later seasons.",
                    "practical_tips": "Check White Tower hours. Dress in layers for changeable weather. Good for a sunny afternoon.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Museum of Byzantine Culture",
                    "where": "Near Archaeological Museum",
                    "description": "Explore the rich Byzantine heritage of Thessaloniki in this excellent museum. A perfect indoor activity for a rainy or cool day.",
                    "practical_tips": "Check opening hours. Can be combined with exploring the archaeological sites.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Wander through Ano Poli (Upper Town)",
                    "where": "Historic neighborhood north of city center",
                    "description": "Explore the charming old quarter with its traditional houses, Byzantine walls, and city views, enjoying the quieter shoulder season atmosphere.",
                    "practical_tips": "Wear comfortable shoes for steep streets. Find a traditional taverna for lunch. Can be cool/windy.",
                    "best_time": "Sunny afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "15°C",
                    "low": "7°C"
                },
                "precipitation": "Rain becomes less likely, sunny days more dominant. Feels distinctly spring-like, though cool spells are still possible.",
                "general_tips": "Continue layering. Sunscreen becomes more important on sunny days. Comfortable walking shoes remain key."
            },
            "tourism_level": {
                "crowds": "Moderate and steadily increasing towards April. Can be very busy around March 25th due to parade/holiday.",
                "pricing": "Shoulder season rates, but watch for potential increases around Independence Day weekend.",
                "overall_atmosphere": "Pleasant spring atmosphere. Mix of local life and increasing tourism. Patriotic feel around March 25th."
            },
            "events_holidays": [
                 {
                    "name": "Greek Independence Day (National Holiday)",
                    "date": "March 25",
                    "description": "Commemorates the 1821 revolution. Thessaloniki hosts large military and student parades along Megalou Alexandrou Avenue (waterfront).",
                    "notes": "Major public holiday. Widespread closures (sites, museums, shops). Significant road closures along parade route. Very patriotic atmosphere."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Watch the Independence Day Parade",
                    "where": "Megalou Alexandrou Avenue (waterfront)",
                    "description": "Experience the patriotic celebrations with military and student parades against the backdrop of the Thermaic Gulf on March 25th.",
                    "practical_tips": "Arrive extremely early for a viewing spot. Expect huge crowds and road closures. Dress warmly, check route.",
                    "best_time": "Morning of March 25th",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore Ano Poli & Heptapyrgion Fortress",
                    "where": "Upper Town (Ano Poli)",
                    "description": "Take advantage of pleasant spring weather to explore the historic Upper Town and visit the Heptapyrgion fortress for panoramic views.",
                    "practical_tips": "Wear comfortable shoes. Check fortress opening hours. Offers great city and sea vistas.",
                    "best_time": "Afternoon / Sunset on a clear day",
                    "estimated_cost": "Free (to walk) / Low (funicular)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit the Roman Forum (Ancient Agora)",
                    "where": "Above Aristotelous Square",
                    "description": "Explore the center of Roman Thessaloniki, including the Odeon and cryptoporticus, enjoying comfortable spring walking temperatures.",
                    "practical_tips": "Allow 1-1.5 hours. Site is outdoors, check weather.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (or included in combo ticket)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Visit the Archaeological Museum of Thessaloniki",
                    "where": "Near White Tower / HANTH square",
                    "description": "Explore major findings from Thessaloniki and Macedonia. Excellent indoor option if weather is poor.",
                    "practical_tips": "Check opening hours. Closed on March 25th. Allow 2-3 hours.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                 }
            ]
        }
    }
}