{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Spring Weather",
                "details": "May offers arguably Thessaloniki's best weather: reliably sunny, pleasantly warm (average highs 23-25°C), ideal for exploring the waterfront, Ano Poli, and enjoying outdoor cafes without excessive heat."
            },
            {
                "reason": "City in Bloom & Vibrant Waterfront",
                "details": "Experience Thessaloniki adorned with spring flowers. The Nea Paralia waterfront park is lush and vibrant, perfect for walks and cycling. Jacarandas also bloom in some areas."
            },
            {
                "reason": "Ideal for Sightseeing Before Peak Crowds",
                "details": "While busier than early spring, crowds at the White Tower, museums, and Ano Poli are more manageable than July/August. Great time for exploration."
            },
            {
                "reason": "Beach Season Begins (Halkidiki)",
                "details": "Sea temperatures warm up, making swimming pleasant, especially by late May. Perfect for early season day trips to Halkidiki beaches before the summer rush."
            },
            {
                "reason": "Outdoor Festivals & Events Start",
                "details": "May often sees the start of summer events, potentially including Thessaloniki Street Food Festival, outdoor concerts, and the opening of open-air cinemas."
            },
            {
                "reason": "Great for Day Trips",
                "details": "Pleasant weather is ideal for day trips to archaeological sites like Vergina or Pella, Mount Olympus foothills (Litochoro), or exploring the Halkidiki coastline."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Increasing Crowds & Prices",
                "details": "May marks the transition to high season. Expect noticeable crowds, especially on weekends, and rising prices for flights and accommodation."
            },
            {
                "reason": "May Day Holiday & Potential Disruptions",
                "details": "May 1st (May Day/Labor Day) is a major public holiday. Expect widespread closures and potentially large demonstrations or transport strikes impacting travel."
            },
            {
                "reason": "Booking Ahead Recommended",
                "details": "It's wise to book popular hotels, sought-after tours (especially Halkidiki day trips), and ferry tickets (if heading to Sporades) in advance."
            },
            {
                "reason": "Sun Can Be Strong",
                "details": "Even if temperatures aren't extreme, the Mediterranean sun is strong. Sunscreen, hats, and sunglasses are necessary."
            },
            {
                "reason": "Pollen Counts High",
                "details": "Late spring blooms mean pollen levels can be high, affecting allergy sufferers."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "13°C"
                },
                "precipitation": "Low chance of rain, mostly sunny and pleasantly warm. Evenings are comfortable.",
                "general_tips": "Pack light layers: t-shirts, light trousers/skirts, maybe a light jacket or cardigan for evenings. Comfortable walking shoes/sandals essential. Sunscreen, hat, sunglasses needed."
            },
            "tourism_level": {
                "crowds": "Moderate to High, particularly busy around May 1st and on weekends heading to Halkidiki.",
                "pricing": "Shoulder/High season prices. Book ahead, especially around May 1st.",
                "overall_atmosphere": "Vibrant late spring feel. Great weather for extensive exploration. Potential disruptions around May 1st."
            },
            "events_holidays": [
                {
                    "name": "May Day / Labor Day (Protomagia)",
                    "date": "May 1",
                    "description": "Major public holiday. Flower wreaths ('stefania') tradition. Often sees demonstrations in the city center. Potential transport strikes.",
                    "notes": "Widespread closures (sites, museums, shops). Check transport status. Many locals head to Halkidiki or villages."
                },
                {
                    "name": "Thessaloniki Street Food Festival (Potential Start)",
                    "date": "Often weekends in May (check dates)",
                    "description": "Popular festival featuring diverse food stalls, drinks, and music, usually held at the TIF Helexpo grounds or another large venue.",
                    "notes": "Check official dates and location annually. Entry fee usually applies."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore the White Tower & Waterfront",
                    "where": "Nea Paralia (Waterfront)",
                    "description": "Visit the city symbol and enjoy the vibrant atmosphere along the extensive waterfront park in ideal spring weather. Go early for fewer crowds.",
                    "practical_tips": "Rent a bike or take a long walk. Enjoy cafes overlooking the sea. Bring water and sun protection.",
                    "best_time": "Early Morning (8 AM - 10 AM)",
                    "estimated_cost": "Moderate (rental, food extra)",
                    "weather_dependent": true
                },
                {
                    "activity": "Wander through Ano Poli (Upper Town)",
                    "where": "Historic neighborhood north of city center",
                    "description": "Explore the charming old quarter with its traditional houses, Byzantine walls, Heptapyrgion fortress, and stunning city/sea views.",
                    "practical_tips": "Wear comfortable shoes for steep streets. Find traditional tavernas. Best light in late afternoon.",
                    "best_time": "Late Afternoon / Evening",
                    "estimated_cost": "Low (food extra)",
                    "weather_dependent": false
                },
                {
                    "activity": "Enjoy the Waterfront Parks (Nea Paralia)",
                    "where": "East of the White Tower",
                    "description": "Walk, cycle, or relax in the series of themed gardens (Garden of Sculptures, Garden of Roses, etc.) along the modern waterfront.",
                    "practical_tips": "Great for people-watching and enjoying the sea breeze. Popular evening stroll ('volta').",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Stroll and Dine in Ladadika",
                    "where": "Historic district near the port",
                    "description": "Explore the colourful, restored district with its lively tavernas, bars, and restaurants, perfect for an evening out.",
                    "practical_tips": "Gets busy in the evenings. Mostly pedestrianized.",
                    "best_time": "Evening / Night",
                    "estimated_cost": "Low (food extra)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "25°C",
                    "low": "15°C"
                },
                "precipitation": "Very low chance of rain. Consistently sunny and warm, feeling like early summer.",
                "general_tips": "Pack light summer clothing. Sunscreen, hat, sunglasses essential. Stay hydrated. Comfortable sandals recommended."
            },
            "tourism_level": {
                "crowds": "High and busy. Feels like summer season is beginning in earnest.",
                "pricing": "High season prices generally apply.",
                "overall_atmosphere": "Beautiful early summer conditions. Lively evenings, ideal for outdoor dining, rooftop bars, and exploring."
            },
            "events_holidays": [
                 {
                    "name": "Thessaloniki International Book Fair",
                    "date": "Usually mid/late May (check dates)",
                    "description": "Major literary event held at the TIF Helexpo grounds, attracting publishers, authors, and readers from Greece and abroad.",
                    "notes": "Check official dates. Mostly Greek language, but international participation."
                 },
                 {
                    "name": "Open-Air Cinemas ('Therina Sinema') Open",
                    "date": "Most open by late May",
                    "description": "Enjoy movies under the stars – a classic Thessaloniki summer experience begins.",
                    "notes": "Check local listings for locations and film schedules."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Attend Thessaloniki Book Fair (if applicable)",
                    "where": "TIF Helexpo grounds",
                    "description": "Browse books, attend literary events, and soak up the atmosphere at this major cultural fair.",
                    "practical_tips": "Check the program online. Entry fee may apply.",
                    "best_time": "Evenings during the festival",
                    "estimated_cost": "Free (usually)",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Halkidiki Beaches",
                    "where": "Kassandra or Sithonia peninsulas",
                    "description": "Take advantage of warm sea temperatures and sunny weather for a classic Halkidiki beach day before the peak summer crowds arrive.",
                    "practical_tips": "Rent a car or take KTEL bus. Go early, especially on weekends. Weekdays offer more tranquility.",
                    "best_time": "Full Day",
                    "estimated_cost": "Moderate (rental, food extra)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Sunset Views from Ano Poli (Upper Town)",
                    "where": "Heptapyrgion fortress or Kastra walls",
                    "description": "Walk or take transport up for stunning panoramic views over Thessaloniki and the Thermaic Gulf as the sun sets.",
                    "practical_tips": "Wear comfortable shoes. Combine with exploring the old town. Cafes available for drinks with a view.",
                    "best_time": "Late Afternoon / Sunset",
                    "estimated_cost": "Free (to walk) / Low (funicular)",
                    "weather_dependent": true
                 },
                 {
                    "activity": "Enjoy Outdoor Cafes & Bars",
                    "where": "Aristotelous Square, Waterfront, Ladadika, Valaoritou district",
                    "description": "Experience Thessaloniki's famous cafe culture and nightlife spill outdoors in the pleasant May evenings.",
                    "practical_tips": "Waterfront spots offer sea views. Ladadika and Valaoritou are known for lively bars and restaurants.",
                    "best_time": "Evening / Night",
                    "estimated_cost": "Low (food extra)",
                    "weather_dependent": false
                 }
            ]
        }
    }
}