{
  "sites": [
    {
      "name": "Place de Jaude",
      "type": "Historic Square",
      "description": "The main square of Clermont-Ferrand, featuring the iconic statue of Vercingetorix and surrounded by important landmarks including the Notre-Dame-du-Port basilica, the Michelin headquarters, and the modern Jaude shopping center. This is the heart of the city and a perfect starting point for exploring Clermont-Ferrand.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round, but spring and autumn offer pleasant temperatures for walking. Summer can be warm, winter can be cold with occasional snow.",
      "booking_tips": "No booking required. Best visited early morning to avoid crowds and enjoy the peaceful atmosphere.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Notre-Dame-du-Port",
      "type": "Basilica",
      "description": "A magnificent Romanesque basilica, a UNESCO World Heritage site, showcasing the city's medieval heritage with its stunning architecture and religious significance. The church's design and construction techniques represent the pinnacle of Romanesque architecture in the Auvergne region.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Respectful dress required. Beautiful stained glass windows create stunning light effects.",
      "booking_tips": "No booking required. Guided tours available. Allow time to admire the intricate stone carvings.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Cathedral of Clermont-Ferrand",
      "type": "Cathedral",
      "description": "A stunning Gothic cathedral built entirely of black volcanic stone (pierre de Volvic), giving it a distinctive dark appearance. The cathedral features impressive stained glass windows and is one of the most recognizable landmarks in the city.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. The dark stone creates a dramatic atmosphere in any weather. Beautiful light effects through stained glass.",
      "booking_tips": "No booking required. Guided tours available. Don't miss the view from the tower (additional fee).",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Michelin Adventure Museum",
      "type": "Museum",
      "description": "A unique museum showcasing the history and innovation of the Michelin tire company, which was founded in Clermont-Ferrand. Features interactive exhibits on tire technology, company history, and the city's industrial heritage.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Perfect for rainy days or any weather. Air-conditioned and comfortable year-round.",
      "booking_tips": "Free entry. Book online in advance during peak season. Guided tours available. Allow 2-3 hours for the full experience.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 5
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Puy de Dôme",
      "type": "Volcanic Peak",
      "description": "The iconic volcanic peak overlooking Clermont-Ferrand, part of the Chaîne des Puys volcanic chain. Accessible by train (Panoramique des Dômes) or hiking trails, offering spectacular views of the city and surrounding volcanic landscape.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Best visited in spring and autumn for pleasant weather. Summer offers clear views, winter can be cold but beautiful with snow.",
      "booking_tips": "Train tickets available at the base station. Hiking trails require proper footwear. Consider staying for sunset views.",
      "ratings": {
        "cost_estimate": 12,
        "suggested_duration_hours": 4,
        "cultural_significance": 5
      },
      "latitude": 45.7726,
      "longitude": 2.9644
    },
    {
      "name": "Historic Center (Vieille Ville)",
      "type": "Historic District",
      "description": "The medieval heart of Clermont-Ferrand featuring narrow cobblestone streets, hidden courtyards, and distinctive black volcanic stone architecture. The area is particularly atmospheric in the evening when the volcanic stone takes on a mysterious quality.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Year-round attraction. Spring and autumn offer pleasant walking weather. Summer evenings are magical.",
      "booking_tips": "No booking required. Wear comfortable shoes for cobblestone streets. Guided walking tours available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Place du Marché Saint-Pierre",
      "type": "Market Square",
      "description": "A vibrant traditional market square where locals shop for fresh produce, cheese, and regional specialties. The surrounding area has been revitalized with trendy cafes, restaurants, and bars, making it a popular spot for both shopping and socializing.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Market is busiest in the morning. Evening is best for dining and nightlife. Year-round activity.",
      "booking_tips": "No booking required. Best explored on foot. Try local Auvergnat specialties at the surrounding restaurants.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Jaude District",
      "type": "District",
      "description": "A modern, vibrant district centered around Place de Jaude, featuring fashionable boutiques, hip cafes, restaurants, and cultural venues. The heart of Clermont-Ferrand's contemporary social scene and shopping district.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Moderate",
      "seasonal_notes": "Most lively in the afternoon and weekends. Summer offers outdoor dining, winter has cozy indoor venues.",
      "booking_tips": "No booking required for most venues. Popular restaurants may require reservations on weekends.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 3,
        "cultural_significance": 4
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Tour du Suquet",
      "type": "Historic Tower",
      "description": "A medieval tower that once formed part of the city's fortifications. While mostly in ruins, it's an important historical site and offers insight into Clermont-Ferrand's medieval past. The surrounding area has been developed with restaurants and cafes.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer pleasant temperatures for exploring the ruins.",
      "booking_tips": "No booking required. Combine with a meal at one of the nearby restaurants. Limited historical information on site.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Jardin Lecoq",
      "type": "Park",
      "description": "A beautiful urban park featuring walking trails, flower gardens, playgrounds, and sports facilities. Popular with locals for recreation and relaxation. Offers a peaceful escape from the city center with views of the surrounding volcanoes.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Beautiful in all seasons. Spring brings blooming flowers, summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Popular spot for picnics and outdoor activities.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Clock Tower (Tour de l'Horloge)",
      "type": "Historic Tower",
      "description": "A historic clock tower located in the old town, dating from the medieval period. One of Clermont-Ferrand's oldest landmarks, it offers views over the surrounding historic district and is a symbol of the city's medieval heritage.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Visible year-round. Best photographed in morning light. Located in a busy pedestrian area.",
      "booking_tips": "No booking required. Can be viewed from outside. Combine with a visit to nearby attractions.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Musée d'Art Roger-Quilliot",
      "type": "Art Museum",
      "description": "A modern art museum showcasing contemporary French and international art, housed in a beautiful building with interesting architecture. Features rotating exhibitions, permanent collections, and cultural events.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Air-conditioned for comfortable visits in any weather. Check website for current exhibitions.",
      "booking_tips": "Free entry to permanent collection. Special exhibitions may require tickets. Guided tours available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2,
        "cultural_significance": 4
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Hôtel de Ville",
      "type": "Historic Building",
      "description": "The city hall of Clermont-Ferrand, housed in a beautiful historic building with distinctive architecture. While not open to the public, the building is worth seeing for its architectural interest and the surrounding plaza is a popular gathering spot.",
      "indoor": false,
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "No booking required to view from outside. Consider attending public events held in the plaza.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Parc Montjuzet",
      "type": "Park",
      "description": "A scenic park located on a hill offering panoramic views of Clermont-Ferrand and the surrounding volcanic landscape. Features walking trails, viewpoints, and is popular with families and nature lovers. Perfect for photography and relaxation.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited in good weather. Spring and autumn offer the most pleasant conditions. Summer can be warm.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Opéra-Théâtre de Clermont-Ferrand",
      "type": "Theatre",
      "description": "A prestigious cultural venue hosting opera, theatre, and classical music performances. The building itself is architecturally significant and represents Clermont-Ferrand's commitment to high culture. Check the schedule for performances during your visit.",
      "indoor": true,
      "best_time": "Evening",
      "price_range": "Moderate",
      "seasonal_notes": "Performance season runs year-round. Book tickets in advance for popular performances.",
      "booking_tips": "Book tickets online or at the box office. Dress appropriately for performances. Guided tours of the building available.",
      "ratings": {
        "cost_estimate": 25,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Maison de l'Architecture",
      "type": "Cultural Center",
      "description": "A cultural center dedicated to architecture and urban planning, housed in a modern building with interesting design. Features exhibitions on contemporary architecture, urban development, and the city's built heritage.",
      "indoor": true,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Open year-round. Air-conditioned for comfortable visits in any weather. Check website for current exhibitions.",
      "booking_tips": "Free entry. Guided tours available. Perfect for architecture enthusiasts.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Marché Saint-Pierre",
      "type": "Market",
      "description": "A traditional covered market where locals shop for daily necessities, regional specialties, and fresh produce. Offers authentic local experience and opportunities to see traditional Auvergnat products and foods.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Busiest in the morning. Year-round activity. Covered market provides shelter from weather.",
      "booking_tips": "No booking required. Respectful photography. Try local Auvergnat foods and interact with vendors.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Université Clermont Auvergne",
      "type": "Educational Institution",
      "description": "A prestigious university with a beautiful campus featuring interesting architecture and green spaces. The campus is a center of student life and the surrounding area has many student-friendly cafes and bookstores.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Campus is most lively during the academic year. Summer is quieter but still worth visiting.",
      "booking_tips": "No booking required. Respect that this is an active educational institution. Campus tours may be available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Bibliothèque du Patrimoine",
      "type": "Library",
      "description": "A heritage library housed in a beautiful historic building with interesting architecture. While primarily a research facility, the building is worth seeing and the surrounding area is pleasant for walking.",
      "indoor": false,
      "best_time": "Afternoon",
      "price_range": "Free",
      "seasonal_notes": "Best viewed in good weather. The building looks impressive at night when illuminated.",
      "booking_tips": "View from outside unless you have research needs. The surrounding area is good for photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    },
    {
      "name": "Jardin botanique de la Charme",
      "type": "Botanical Garden",
      "description": "A peaceful botanical garden featuring native Auvergnat plants and trees. Offers walking paths, benches for relaxation, and educational displays about local flora. A perfect escape from the city's hustle and bustle.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Most beautiful in spring when flowers are blooming. Summer offers shade, autumn has colorful foliage.",
      "booking_tips": "No booking required. Bring water and comfortable walking shoes. Perfect for nature photography.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 3
      },
      "latitude": 45.7772,
      "longitude": 3.0870
    }
  ]
}