{
    "November": {
        "reasons_to_visit": [
            {
                "reason": "Historic Museums Without Crowds",
                "details": "November offers a unique opportunity to experience Aarhus's world-class museums and galleries with minimal crowds, allowing for contemplative appreciation of ARoS Art Museum's collections, unhurried visits to Moesgaard Museum's archaeological exhibits, and peaceful exploration of Den Gamle By (The Old Town) without summer queues."
            },
            {
                "reason": "Authentic Aarhus Culture",
                "details": "With fewer tourists, November provides a more genuine experience of Aarhus's cultural life, from the historic Latin Quarter cafés to the vibrant university area, allowing visitors to interact with locals and experience the authentic rhythms of the city's neighborhood life in this culturally rich Danish metropolis."
            },
            {
                "reason": "Classical Music Season Highlights",
                "details": "November marks a highlight in Aarhus's cultural calendar with performances by the Aarhus Symphony Orchestra, special concerts at Musikhuset Aarhus (Concert Hall), chamber music in historic venues, and the city's choirs performing in the magnificent Aarhus Cathedral and other churches throughout the city."
            },
            {
                "reason": "Reduced Accommodation Rates",
                "details": "Hotel prices in November drop significantly from summer peaks, making Aarhus's luxury hotels near the harbor, boutique accommodations in the Latin Quarter, and stylish options in the university district more accessible, with overall trip costs more affordable compared to the high season."
            },
            {
                "reason": "Christmas Market Preparations",
                "details": "Late November marks the opening of Aarhus's enchanting Christmas markets, transforming Skt. Clemens Torv and surrounding areas with wooden stalls, festive decorations, and the opportunity to experience opening days before the December crowds arrive at one of Denmark's most charming Christmas celebrations."
            },
            {
                "reason": "Harbor Atmosphere",
                "details": "Aarhus Harbor takes on a different, more contemplative character in November with morning mists, dramatic skies, and fewer tourists, allowing photographers and visitors to experience the bay's moody autumn atmosphere and relationship with the city's blend of medieval and modern architecture from a more local perspective."
            },
            {
                "reason": "Danish Cuisine and Comfort Food",
                "details": "November is ideal for experiencing Aarhus's rich Danish cuisine with seasonal ingredients featuring prominently in traditional dishes like flæskesteg (roast pork), frikadeller (meatballs), and hearty stews, while the city's cozy cafés and restaurants offer perfect warm retreats from cooler weather, embodying the Danish concept of 'hygge'."
            },
            {
                "reason": "Theater and Performance Season",
                "details": "November falls during the height of Aarhus's prestigious theater and performance season, with high-quality productions at Aarhus Theater, Musikhuset Aarhus, Godsbanen cultural center, and various smaller venues throughout the city showcasing Aarhus's position as one of Denmark's cultural capitals."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Colder Temperatures",
                "details": "November brings significantly cooler weather to Aarhus with average highs of 5-7°C and lows sometimes approaching freezing, particularly at night and along the harbor front, requiring proper winter clothing and limiting the enjoyment of the city's otherwise pleasant outdoor spaces and waterfront areas."
            },
            {
                "reason": "Increased Rainfall",
                "details": "November sees increased precipitation compared to summer months, with frequent rainfall that can disrupt outdoor activities and create gray, overcast conditions that persist for several days at a time, typically recording 15-18 rainy days throughout the month."
            },
            {
                "reason": "Limited Daylight Hours",
                "details": "Daylight hours are significantly reduced, with sunset around 4:00 PM by mid-November, limiting the time available for outdoor sightseeing, photography of Aarhus's architecture and harbor views, and exploration of the city's parks and coastal areas."
            },
            {
                "reason": "Reduced Outdoor Culture",
                "details": "Aarhus's vibrant outdoor scene along the canal at Åboulevarden and harbor promenades is largely suspended in November, with most outdoor cafés, terraces, and waterfront venues closed or operating with limited capacity using heaters, reducing one of the city's signature spring and summer experiences."
            },
            {
                "reason": "Aarhus Festival Week Crowds",
                "details": "If visiting during specific cultural events like documentary festivals or theater weeks (various dates in November), be prepared for busier cultural venues and increased accommodation rates in central areas as enthusiasts and participants attend performances and events throughout the city's cultural centers."
            },
            {
                "reason": "Harbor Tour Limitations",
                "details": "The Aarhus harbor tours and bay cruises operate on a significantly reduced schedule in November, with fewer departures, shorter routes, and occasional cancellations due to weather conditions, limiting one of Aarhus's popular activities and perspectives for seeing the city from its beautiful waterways."
            }
        ],
        "first_half": {
            "date_range": "November 1–15",
            "weather": {
                "average_temperature": {
                    "high": "7°C",
                    "low": "2°C"
                },
                "precipitation": "Moderate to frequent rainfall with an average of 8-9 rainy days during this period. Coastal location brings occasional unpredictable weather changes, with precipitation that can vary from drizzle to heavier rain showers. Morning fog along the harbor common.",
                "general_tips": "Pack layers including a warm waterproof coat, scarf, and gloves for colder days and evenings. Umbrella essential for exploring the city. Waterproof footwear recommended as streets and pavements can remain wet throughout the day."
            },
            "tourism_level": {
                "crowds": "Low tourist presence at major attractions with minimal waiting times at ARoS Art Museum, Moesgaard Museum, and Aarhus Cathedral. Business travelers still present midweek, but tourist sites remain uncrowded.",
                "pricing": "Off-season rates for accommodations with significant discounts, especially weekends and for longer stays. Exception during major cultural events which can briefly drive up prices across the city center.",
                "overall_atmosphere": "Relaxed and authentic, with Aarhus residents returning to their normal routines after the tourist season. University in full session, bringing intellectual and cultural energy to the Latin Quarter and student areas."
            },
            "events_holidays": [
                {
                    "name": "All Saints' Day (Alle Helgens Dag)",
                    "date": "First Sunday in November",
                    "description": "Memorial day observed throughout Denmark when families visit cemeteries to honor deceased relatives with flowers and candles, particularly notable at Aarhus's historic Nordre Cemetery and church graveyards.",
                    "notes": "Not a public holiday in Denmark but a day of remembrance; most businesses and attractions open as usual; churches hold special services; Aarhus Cathedral holds particularly significant observances; candles often placed on graves creating a moving atmosphere in cemeteries after dark; provides insight into local cultural traditions."
                },
                {
                    "name": "Aarhus Documentary Film Festival",
                    "date": "Early November (varies annually)",
                    "description": "Important cultural event featuring Danish and international documentaries with screenings, discussions, and filmmaker presentations at venues throughout the city including Øst for Paradis cinema, Godsbanen cultural center, and university facilities.",
                    "notes": "Growing international reputation; venues include independent cinemas and cultural centers throughout the city; festival passes and single screening tickets available; brings international filmmakers and industry professionals to city; most films screened with English subtitles; program available online and at tourist information."
                },
                {
                    "name": "Mortens Aften (St. Martin's Eve)",
                    "date": "November 10",
                    "description": "Traditional Danish celebration centered around eating roast duck or goose before the former fasting period of Advent, a cultural event celebrated by locals in homes and restaurants throughout the city.",
                    "notes": "Many restaurants offer special Mortens Aften menus featuring duck, making reservations essential; traditional meal includes duck or goose with potatoes, red cabbage, and gravy; primarily a family celebration but visitors can experience it in restaurants; provides authentic insight into Danish traditions; not a public holiday but widely observed."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "ARoS Art Museum Without Crowds",
                    "where": "City Center",
                    "description": "Experience Aarhus's impressive art museum with significantly reduced visitor numbers, allowing for peaceful appreciation of its collections, contemporary exhibitions, and the famous circular Rainbow Panorama on the roof offering 360-degree views of the city.",
                    "practical_tips": "Early morning visits offer the most tranquil experience; weekdays particularly quiet; building fully heated but still bring layers; guided tours available in English but less frequent than in summer; rooftop Rainbow Panorama offers magical views even in gray weather; excellent café on premises.",
                    "best_time": "Early morning (10-11AM)",
                    "estimated_cost": "140 DKK for museum entry",
                    "weather_dependent": false
                },
                {
                    "activity": "Moesgaard Museum",
                    "where": "Southern Aarhus",
                    "description": "Explore one of Denmark's most impressive archaeological museums featuring the remarkably preserved Grauballe Man and other prehistoric treasures, with November's quieter atmosphere allowing unhurried appreciation of exhibits in the architecturally stunning building.",
                    "practical_tips": "Weekday mornings particularly quiet; modern building with excellent exhibitions on Danish prehistory; audio guides available in multiple languages; excellent heating throughout galleries; stunning architecture built into hillside; café provides warm respite; views from grass roof if weather permits.",
                    "best_time": "Weekday morning",
                    "estimated_cost": "140 DKK general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Den Gamle By (The Old Town)",
                    "where": "City Center",
                    "description": "Discover Denmark's renowned open-air museum featuring relocated historic buildings from different eras, with significantly fewer visitors than during summer season and early Christmas decorations beginning to appear in the historical settings.",
                    "practical_tips": "Open-air museum with indoor components; weekday mornings nearly empty compared to summer; historic houses fully heated; excellent guided tours available in English; museum cafés serve traditional Danish treats; perfect combination of indoor and outdoor experiences; preparations for Christmas exhibitions begin in November.",
                    "best_time": "Morning, first entry slot",
                    "estimated_cost": "120 DKK general admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Traditional Danish Café Culture",
                    "where": "Latin Quarter",
                    "description": "Experience Aarhus's historic café tradition in cozy settings with November providing the perfect atmosphere for enjoying Danish pastries, coffee specialties, and the cultural concept of 'hygge' (coziness) in charming historic interiors.",
                    "practical_tips": "Café Gaya, La Cabra, and Great Coffee among most traditional options; each offers specialty cakes and pastries; afternoon coffee and cake a Danish tradition; historic interiors provide warm atmosphere during cold weather; perfect respite during inclement weather; window seats offer views of Aarhus architecture while staying warm indoors.",
                    "best_time": "Afternoon (2-4PM)",
                    "estimated_cost": "80-120 DKK for coffee and cake",
                    "weather_dependent": false
                },
                {
                    "activity": "Viking Museum (Vikingemuseet)",
                    "where": "Historic Center",
                    "description": "Visit Aarhus's archaeological museum showcasing the original Viking-age foundations beneath the city, with November providing contemplative atmosphere for appreciating Denmark's Norse heritage and the archaeological discoveries that have shaped our understanding of early Aarhus.",
                    "practical_tips": "Located in the city center beneath a bank; never overcrowded in November; small but fascinating museum showing original Viking remains in basement; excellent introduction to city history; combines well with visit to Aarhus Cathedral nearby; excellent indoor activity during inclement weather.",
                    "best_time": "Afternoon",
                    "estimated_cost": "30 DKK adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "DOKK1 Cultural Center",
                    "where": "Waterfront",
                    "description": "Experience Aarhus's stunning modern library and cultural center featuring sweeping architectural design, panoramic harbor views, and a comfortable indoor space perfect for relaxation during November's cooler days.",
                    "practical_tips": "Located on the waterfront; striking contemporary architecture; free entry; photography permitted in most areas; heated throughout; excellent indoor activity during inclement weather; combines well with harbor front walk if weather permits; café on premises; numerous comfortable reading and relaxation areas; free WiFi throughout.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Aarhus Theater Evening Performance",
                    "where": "Aarhus Theater",
                    "description": "Attend a theater performance, ballet, or concert at Aarhus's beautiful historic theater, experiencing one of Denmark's finest companies in a magnificent Art Nouveau building that has been central to Danish cultural life for over a century.",
                    "practical_tips": "November performance calendar typically features major productions; tickets more readily available than in December but advance booking still recommended; guided tours also available during daytime; dress code relatively relaxed but smart casual appropriate; architecture spectacular both inside and out; performances typically start at 7:30PM; arrive early to enjoy the ornate interior.",
                    "best_time": "Evening performances (typically 7:30PM)",
                    "estimated_cost": "200-500 DKK depending on performance and seating",
                    "weather_dependent": false
                },
                {
                    "activity": "Cathedral Choir Performance",
                    "where": "Aarhus Cathedral",
                    "description": "Experience a choir performance in Aarhus's magnificent medieval cathedral, continuing a musical tradition dating back centuries and offering an authentic cultural and spiritual experience beyond typical tourism.",
                    "practical_tips": "Services typically held Sunday mornings and special concert performances throughout November; arrival 30 minutes early for seating; free entry for regular services; concert schedule varies so verify performance dates; located in city center; respectful attire appropriate; photography not permitted during services.",
                    "best_time": "Sunday morning (10AM) or scheduled concerts",
                    "estimated_cost": "Free for services (donations welcomed); 100-200 DKK for special concerts",
                    "weather_dependent": false
                },
                {
                    "activity": "Latin Quarter Exploration",
                    "where": "City Center",
                    "description": "Discover Aarhus's vibrant historic district with its independent galleries, design shops, international restaurants, and local bars—a perfect area for experiencing contemporary Danish culture away from tourist centers in an area of preserved historic buildings.",
                    "practical_tips": "Authentic area with cultural diversity; numerous cafés provide warm retreats during exploration; less touristy atmosphere in November; better food value than summer season; evening bar and restaurant scene authentically local; best explored on foot; streets like Mejlgade and Graven particularly atmospheric.",
                    "best_time": "Afternoon into evening",
                    "estimated_cost": "Free for exploration; 50-100 DKK for café stops",
                    "weather_dependent": true
                },
                {
                    "activity": "Aarhus University Campus",
                    "where": "North of City Center",
                    "description": "Visit Aarhus's architecturally significant university campus featuring striking modernist yellow brick buildings, beautiful park surroundings, and several museums including the Natural History Museum and Steno Museum of Science History.",
                    "practical_tips": "Open campus with notable architecture; beautiful park setting; museums on campus have modest entry fees; university cafés open to public; excellent rainy day activity combining indoor and outdoor elements; student life creates vibrant atmosphere; many buildings open to visitors; architectural tours sometimes available.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "Free for campus exploration; 60-80 DKK for museums",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "November 16–30",
            "weather": {
                "average_temperature": {
                    "high": "5°C",
                    "low": "1°C"
                },
                "precipitation": "Continued possibility of rainfall with colder temperatures, morning fog along the harbor, and increased chance of first frost or light snow later in the month, particularly in outlying areas.",
                "general_tips": "Winter clothing essential with waterproof outer layers. Evenings require warm coat, hat, scarf, and gloves, particularly in open areas like waterfront and main squares. Indoor options important for itinerary planning with significantly shorter daylight hours."
            },
            "tourism_level": {
                "crowds": "Very quiet with minimal foreign tourists until the Christmas markets open, then a significant increase in domestic and international visitors focused around market areas in late November.",
                "pricing": "Low season rates for accommodations until Christmas market opening when prices increase, particularly for properties near central squares and market areas.",
                "overall_atmosphere": "Authentic and local with business life, cultural events, and everyday routines largely unaffected by tourism until late month, when the festive atmosphere of the Christmas markets transforms the city center."
            },
            "events_holidays": [
                {
                    "name": "Aarhus Christmas Market Opening",
                    "date": "Late November (typically last weekend before December)",
                    "description": "The opening of Aarhus's enchanting Christmas markets, transforming the old town, Skt. Clemens Torv, and surrounding areas with beautifully decorated wooden stalls, cultural performances, and traditional crafts creating a magical winter wonderland.",
                    "notes": "Opening dates vary annually but typically the last weekend of November; multiple market locations throughout city including Skt. Clemens Torv and Den Gamle By; illuminations throughout city center; less crowded on weekdays and during daytime; magical atmosphere after dark; weekend evenings most busy; extended shopping hours in city center stores."
                },
                {
                    "name": "First Sunday of Advent",
                    "date": "Late November (last Sunday before December)",
                    "description": "The beginning of the Advent season with special church services, lighting of the first candle on Advent wreaths, and special events throughout the city marking the start of the Christmas season.",
                    "notes": "Aarhus Cathedral and other churches hold special Advent musical services; coincides with Christmas market opening weekend; special evening concerts are common; tradition involves lighting first candle on Advent wreath; Danish tradition of 'kalenderlys' (calendar candles) begins; Aarhus's extensive Christmas decorations particularly noteworthy around the Cathedral and Latin Quarter."
                },
                {
                    "name": "Christmas Illuminations",
                    "date": "Late November",
                    "description": "Special illuminations and light displays throughout the city with the Cathedral, main shopping streets, and other monuments beautifully lit to celebrate the beginning of the holiday season.",
                    "notes": "Strøget (pedestrian shopping street) features extensive light decorations; illuminations best viewed after 3:30PM when fully dark; photographic opportunities throughout city center; special evening tours focused on illuminations sometimes available through tourist office; creates enchanting atmosphere for evening exploration."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Aarhus Christmas Market Opening Days",
                    "where": "Skt. Clemens Torv and surrounding areas",
                    "description": "Experience the magical atmosphere of Aarhus's Christmas markets during their opening days, with traditional wooden stalls, handcrafts, food specialties, and festive environment before the peak December crowds arrive—creating one of Denmark's most charming winter wonderlands in the heart of the city.",
                    "practical_tips": "Markets in several locations including Skt. Clemens Torv and Den Gamle By; each section has signature food specialties; weekday afternoons less crowded than weekends; evening atmosphere most magical after 3:30PM when fully dark; Danish gløgg (mulled wine) and æbleskiver (traditional pancake balls) must-try specialties; bundle up warmly as markets are outdoors.",
                    "best_time": "Late afternoon into evening",
                    "estimated_cost": "Free entry; 100-150 DKK for food and drinks",
                    "weather_dependent": true
                },
                {
                    "activity": "Danish Design Shopping",
                    "where": "City Center",
                    "description": "Explore Aarhus's charming design shops featuring high-quality Danish products, boutiques, and specialty stores housed in beautifully restored buildings away from the Christmas market crowds.",
                    "practical_tips": "Streets like Guldsmedgade and Mejlgade feature unique boutiques and local brands; numerous cafés provide perfect warm lunch stops between shopping; less crowded than Christmas markets for gift shopping; many shops showcase Danish design specialties including ceramics, textiles, and lighting.",
                    "best_time": "Midday",
                    "estimated_cost": "Free for browsing; purchases extra",
                    "weather_dependent": false
                },
                {
                    "activity": "Marselisborg Forest Winter Walk",
                    "where": "Southern Aarhus",
                    "description": "Visit Aarhus's beautiful forest area with an extensive network of walking paths set in a peaceful setting south of the city, offering a different experience in late autumn with fallen leaves and dramatic skies creating unique perspectives of the coastline.",
                    "practical_tips": "Accessible via public transport from city center; extensive network of pathways; deer park with free-roaming deer; winter light creates dramatic views; less crowded than summer; comfortable walking shoes and warm clothing essential; best during morning hours when light is good and before potential afternoon showers.",
                    "best_time": "Morning to allow time for complete exploration",
                    "estimated_cost": "Free admission",
                    "weather_dependent": true
                },
                {
                    "activity": "Vor Frue Kirke (Church of Our Lady)",
                    "where": "City Center",
                    "description": "Visit this beautiful historic church with its remarkable Romanesque crypt, Gothic choir, and modern nave, then explore the charming surrounding area with historic buildings and cultural sites.",
                    "practical_tips": "Church features fascinating combination of architectural styles; ancient crypt dates to 11th century; surrounding area has preserved historic character; multiple small eateries nearby; less crowded than Cathedral area; good rainy day activity; combination of spiritual and cultural heritage; photography permitted with respect to worshippers.",
                    "best_time": "Mid-morning on weekdays",
                    "estimated_cost": "Free (donations welcome)",
                    "weather_dependent": false
                },
                {
                    "activity": "Aarhus Symphony Orchestra Concert",
                    "where": "Musikhuset Aarhus (Concert Hall)",
                    "description": "Attend a classical music performance by Aarhus's Symphony Orchestra in their concert hall featuring excellent acoustics and a diverse program of orchestral works, chamber music, and international soloists as part of the active winter season.",
                    "practical_tips": "Located in modern performance venue with excellent acoustics; advance ticket purchase recommended for popular performances but often available last-minute in November; dress code relatively relaxed by European standards; central location easily accessible; numerous restaurants nearby for pre-concert dining; excellent heating throughout venue.",
                    "best_time": "Evening performances (typically 7:30PM)",
                    "estimated_cost": "200-450 DKK depending on performance and seating",
                    "weather_dependent": false
                },
                {
                    "activity": "Danish Cuisine Experience",
                    "where": "City center restaurants",
                    "description": "Discover traditional Danish cuisine featuring hearty winter dishes like flæskesteg (roast pork), frikadeller (meatballs), seasonal game dishes, and regional specialties in historic restaurants away from tourist centers.",
                    "practical_tips": "Restaurant Domestic and Gastromé for high-end Nordic cuisine; Teater Bodega and Rådhus Cafeen for traditional Danish food; advance reservations less necessary than in high season except weekend evenings; ask for seasonal specials not on regular menu; local Aarhus craft beer traditional accompaniment; restaurants fully heated but dress warmly for travel between venues.",
                    "best_time": "Lunch (12-2PM) or dinner (6-8PM)",
                    "estimated_cost": "250-350 DKK for full meal with drinks",
                    "weather_dependent": false
                },
                {
                    "activity": "Natural History Museum",
                    "where": "University Park",
                    "description": "Visit Aarhus's fascinating natural history museum, offering extensive zoological and geological collections housed in a historic university building, with fewer visitors than during peak season.",
                    "practical_tips": "Located in University Park; accessible on foot from city center; features large dinosaur collection and Danish wildlife exhibits; planetarium on site; significantly fewer visitors in November; special educational activities; housed in historic university buildings; allow at least 2-3 hours; café facilities available.",
                    "best_time": "Morning or afternoon",
                    "estimated_cost": "80 DKK adult admission",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Ebeltoft",
                    "where": "Djursland Peninsula (East of Aarhus)",
                    "description": "Visit the picturesque Danish town famous for its well-preserved old town, featuring half-timbered houses, cobblestone streets, the Frigate Jylland maritime museum, and atmospheric harbor setting—a perfect contrast to Aarhus's more urban cityscape.",
                    "practical_tips": "Regular bus connections from Aarhus bus station (approximately 1 hour); compact old town easily walkable; medieval atmosphere enhanced by November lighting; glass museum worth visiting; several traditional Danish restaurants in historic center; picturesque setting ideal for photography even in cloudy weather.",
                    "best_time": "Full day starting morning",
                    "estimated_cost": "200-350 DKK including transportation and entrance fees",
                    "weather_dependent": true
                },
                {
                    "activity": "Danish Beer Tasting",
                    "where": "City Center",
                    "description": "Experience a guided tasting of Denmark's distinctive craft beers in a cozy bar setting, discovering local Aarhus brews, Danish classics, and seasonal specialties in the authentic atmosphere of a thriving craft beer nation.",
                    "practical_tips": "Fermentoren, Mikkeller Bar, and Aarhus Brewing Company offer exceptional beer selections; specialized beer bars typically offer guided tastings; November brings seasonal winter beers; local varieties paired perfectly with Danish cheese and traditional snacks; indoor activity perfect for cooler evenings; opportunity to learn about brewing traditions from experts; advance booking recommended for guided tastings.",
                    "best_time": "Evening (usually starting 6 or 7PM)",
                    "estimated_cost": "200-300 DKK for guided tasting session with snacks",
                    "weather_dependent": false
                },
                {
                    "activity": "Aarhus Theater Performance",
                    "where": "City Center",
                    "description": "Attend a performance at the impressive Aarhus Theater, one of Denmark's most important performing arts venues, hosting both classic and contemporary productions in a stunning Art Nouveau building.",
                    "practical_tips": "Beautiful historic theater with ornate interior; November repertoire typically includes both classical and modern works; advance booking recommended but November offers better availability than December; dress code relatively relaxed; some performances with English subtitles; arrive early to enjoy impressive theater architecture; performances typically begin at 7:30PM; excellent indoor activity regardless of weather.",
                    "best_time": "Evening performances (typically 7:30PM)",
                    "estimated_cost": "150-450 DKK depending on performance and seating",
                    "weather_dependent": false
                }
            ]
        }
    }
}