{
    "Spring": {
        "activities": [
            {
                "name": "Walking the Upper Town",
                "type": "Historical Walk",
                "description": "Explore the charming medieval streets of Gornji Grad (Upper Town), including St. Mark's Church, Lotrščak Tower, and the Stone Gate.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring provides pleasant temperatures and blooming flowers, making it ideal for exploring Zagreb's historic heart.",
                "booking_tips": "Start early to avoid crowds and visit St. Mark's Church when it's open for services."
            },
            {
                "name": "Funicular Ride",
                "type": "Sightseeing",
                "description": "Take the historic funicular connecting Upper and Lower Town, offering scenic views and a unique transportation experience.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers comfortable weather for enjoying the outdoor funicular ride with beautiful city views.",
                "booking_tips": "Purchase tickets at the station and consider riding during sunset for the most dramatic views."
            },
            {
                "name": "Visit to Maksimir Park",
                "type": "Nature Reserve",
                "description": "Explore Zagreb's largest and oldest public park, featuring beautiful gardens, lakes, walking paths, and the Zagreb Zoo.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is perfect for park visits with blooming flowers, mild weather, and active wildlife.",
                "booking_tips": "Visit early morning for peaceful walks and bring bread to feed the ducks at the lakes."
            },
            {
                "name": "Dolac Market Shopping",
                "type": "Market",
                "description": "Experience Zagreb's famous open-air market known as 'Zagreb's stomach' with fresh produce, flowers, and local products.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets are bustling with fresh seasonal produce, flowers, and local specialties.",
                "booking_tips": "Visit early for the best selection and bring cash for local vendors."
            },
            {
                "name": "Cathedral Visit",
                "type": "Historical Site",
                "description": "Visit Zagreb Cathedral, the tallest building in Croatia, with its magnificent Gothic architecture and religious significance.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers a peaceful atmosphere for visiting religious sites with comfortable temperatures.",
                "booking_tips": "Dress appropriately for religious sites and check mass times for a spiritual experience."
            },
            {
                "name": "Croatian National Theatre",
                "type": "Cultural Event",
                "description": "Attend performances at the magnificent Croatian National Theatre, featuring opera, ballet, and drama in a stunning historic venue.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring cultural season offers diverse performances in the beautiful Austro-Hungarian theater.",
                "booking_tips": "Book tickets well in advance, especially for popular performances and weekend shows."
            },
            {
                "name": "Wine Tasting Experience",
                "type": "Food & Drink",
                "description": "Sample Croatian wines including Plavac Mali, Graševina, and Teran at wine bars throughout the city center.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Spring is ideal for wine tasting as the weather is pleasant for both indoor and outdoor venues.",
                "booking_tips": "Visit Vinodol for an extensive selection of Croatian wines and knowledgeable staff."
            },
            {
                "name": "Photography Tour",
                "type": "Cultural Tour",
                "description": "Capture the beauty of Zagreb's architecture, parks, and historic sites with professional photography guidance.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Expensive",
                "seasonal_notes": "Spring light is perfect for photography with golden hour providing ideal conditions.",
                "booking_tips": "Book a professional photographer for the best results and access to exclusive locations."
            },
            {
                "name": "Zagreb Zoo Visit",
                "type": "Family Activity",
                "description": "Explore the Zagreb Zoo located within Maksimir Park, featuring diverse animal species and educational programs.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring is perfect for zoo visits with active animals and pleasant walking conditions.",
                "booking_tips": "Visit on weekdays for fewer crowds and bring snacks for a family picnic in the park."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Jarun Lake Recreation",
                "type": "Outdoor Activity",
                "description": "Enjoy water sports, swimming, and cycling around Jarun Lake, Zagreb's popular recreational area with beaches and sports facilities.",
                "indoor": false,
                "best_time": "Morning to afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer offers perfect conditions for water activities with warm temperatures and long daylight hours.",
                "booking_tips": "Arrive early to secure parking and bring your own sports equipment for the best experience."
            },
            {
                "name": "Zagreb Summer Evenings",
                "type": "Cultural Festival",
                "description": "Experience Zagreb's summer cultural program featuring outdoor concerts, theater performances, and cultural events throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Varies",
                "seasonal_notes": "Summer evenings are perfect for outdoor cultural events with warm temperatures and beautiful settings.",
                "booking_tips": "Check the city's cultural calendar and book tickets in advance for popular events."
            },
            {
                "name": "Cycling Around Zagreb",
                "type": "Outdoor Activity",
                "description": "Rent a bike and explore Zagreb's extensive cycling paths, including routes around Jarun Lake and through city parks.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer provides ideal conditions for cycling with warm weather and scenic routes.",
                "booking_tips": "Use Nextbike or other bike-sharing services for convenient access to bicycles throughout the city."
            },
            {
                "name": "Outdoor Dining in Donji Grad",
                "type": "Dining",
                "description": "Enjoy alfresco dining at restaurants throughout Lower Town, particularly around Ban Jelačić Square and Zrinjevac Park.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor dining with warm temperatures and pleasant atmosphere.",
                "booking_tips": "Reserve tables in advance, especially for popular restaurants and weekend dining."
            },
            {
                "name": "Maksimir Park Summer Activities",
                "type": "Park",
                "description": "Enjoy summer activities in Maksimir Park including picnics, walking, and visiting the zoo with extended summer hours.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer provides long daylight hours perfect for park activities and family outings.",
                "booking_tips": "Bring a picnic blanket and arrive early to secure a good spot, especially on weekends."
            },
            {
                "name": "Rooftop Bar at Esplanade Hotel",
                "type": "Bar",
                "description": "Sip cocktails while enjoying panoramic views of Zagreb from the rooftop bar of the historic Esplanade Hotel.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings are perfect for rooftop bars with warm temperatures and beautiful city views.",
                "booking_tips": "Arrive early to secure a good spot and dress appropriately for the upscale atmosphere."
            },
            {
                "name": "Open-Air Cinema at Jarun",
                "type": "Cinema",
                "description": "Watch films under the stars at Jarun Lake's open-air cinema, featuring classic and contemporary movies.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings are perfect for outdoor cinema with warm temperatures and late sunsets.",
                "booking_tips": "Bring a blanket or cushion and arrive early to secure a good viewing spot."
            },
            {
                "name": "Traditional Croatian Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Croatian dishes using fresh local ingredients and authentic recipes.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Summer provides abundant fresh ingredients for learning traditional Croatian cuisine.",
                "booking_tips": "Book classes in advance, especially for popular instructors, and check if market visits are included."
            },
            {
                "name": "Night Swimming at Jarun",
                "type": "Beach",
                "description": "Experience the magic of swimming under the stars at Jarun Lake with the illuminated city as a backdrop.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Summer nights offer warm water temperatures perfect for night swimming.",
                "booking_tips": "Check beach access hours and safety considerations before night swimming."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Historical Walking Tour",
                "type": "Cultural Tour",
                "description": "Explore Zagreb's rich history with guided tours of the Upper and Lower Town, focusing on medieval and Austro-Hungarian periods.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn provides comfortable temperatures for walking tours with beautiful fall colors.",
                "booking_tips": "Book tours in advance and choose knowledgeable guides for deeper historical insights."
            },
            {
                "name": "Wine Tasting at Vinodol",
                "type": "Food & Drink",
                "description": "Sample Croatian wines including Plavac Mali, Graševina, and Teran at the renowned Vinodol restaurant.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, making it ideal for wine tasting with fresh vintages available.",
                "booking_tips": "Reserve a table in advance and ask for wine pairing recommendations with local cheeses."
            },
            {
                "name": "Visit to Croatian National Museum",
                "type": "Museum",
                "description": "Explore the Croatian National Museum with its impressive collections of art, archaeology, and natural history.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler days are perfect for indoor museum visits with fewer tourists.",
                "booking_tips": "Purchase tickets online to avoid queues and consider a guided tour for historical context."
            },
            {
                "name": "Photography Workshop",
                "type": "Workshop",
                "description": "Join a photography workshop to capture Zagreb's autumn beauty with professional guidance and tips.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn light is perfect for photography with golden hour providing ideal conditions.",
                "booking_tips": "Book workshops in advance and bring your own camera equipment."
            },
            {
                "name": "Maksimir Park Autumn Views",
                "type": "Sightseeing",
                "description": "Take a stroll through Maksimir Park to enjoy the beautiful autumn colors and peaceful atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers beautiful fall colors and comfortable temperatures for enjoying the park.",
                "booking_tips": "Visit during golden hour for the most dramatic lighting and photography opportunities."
            },
            {
                "name": "Local Market Shopping",
                "type": "Market",
                "description": "Explore local markets for autumn produce, including fresh fruits, vegetables, and seasonal Croatian specialties.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Autumn markets are filled with seasonal produce and local harvest specialties.",
                "booking_tips": "Visit early for the best selection and bring cash for local vendors."
            },
            {
                "name": "Traditional Croatian Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Croatian dishes using seasonal ingredients and authentic recipes.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides abundant ingredients for learning traditional Croatian cuisine.",
                "booking_tips": "Book classes in advance and check if market visits are included in the experience."
            },
            {
                "name": "Park Walks in Mild Weather",
                "type": "Outdoor Activity",
                "description": "Enjoy peaceful walks through Zagreb's parks with comfortable autumn temperatures and beautiful fall foliage.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn provides ideal conditions for park walks with mild weather and beautiful light.",
                "booking_tips": "Bring comfortable walking shoes and a camera for beautiful autumn photography."
            },
            {
                "name": "Visit to Zagreb Cathedral",
                "type": "Historical Site",
                "description": "Explore the beautiful Zagreb Cathedral with its impressive Gothic architecture and religious significance.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers a peaceful atmosphere for visiting religious sites with fewer tourists.",
                "booking_tips": "Check opening hours and dress appropriately for religious sites."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Peaceful Upper Town Exploration",
                "type": "Walking Tour",
                "description": "Explore the Upper Town during winter when crowds are minimal, allowing for intimate discovery of historic sites.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter offers the most peaceful experience of the Upper Town with minimal tourist crowds.",
                "booking_tips": "Dress warmly and wear comfortable walking shoes for exploring the cobblestone streets."
            },
            {
                "name": "Café Culture in Donji Grad",
                "type": "Café",
                "description": "Experience authentic Croatian café culture in historic cafés throughout Lower Town, enjoying local coffee and pastries.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter is perfect for indoor café culture, providing warmth and authentic local experience.",
                "booking_tips": "Visit Café Central for traditional Croatian coffee and beautiful terrace views."
            },
            {
                "name": "Funicular Winter Views",
                "type": "Sightseeing",
                "description": "Take the funicular for spectacular winter views of Zagreb and the surrounding snow-covered landscape.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter provides clear visibility and dramatic lighting for photography from the Upper Town.",
                "booking_tips": "Check weather conditions before visiting and dress warmly for the outdoor ride."
            },
            {
                "name": "Local Market Shopping",
                "type": "Market",
                "description": "Explore local markets for winter produce, fresh seafood, and traditional Croatian products with fewer crowds.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Winter markets offer authentic local experience with seasonal products and local vendors.",
                "booking_tips": "Visit early for the best selection and bring cash for local vendors."
            },
            {
                "name": "Traditional Croatian Dining",
                "type": "Dining",
                "description": "Enjoy traditional Croatian cuisine at local restaurants, featuring hearty winter dishes and local specialties.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is ideal for enjoying hearty Croatian dishes and local comfort food.",
                "booking_tips": "Try traditional dishes like štrukli (cheese-filled pastry) and black risotto at local restaurants."
            },
            {
                "name": "Photography in Winter Light",
                "type": "Photography",
                "description": "Capture Zagreb's beauty in winter light with dramatic skies and minimal crowds for unique photography opportunities.",
                "indoor": false,
                "best_time": "Golden hour",
                "price_range": "Free",
                "seasonal_notes": "Winter provides dramatic lighting and atmospheric conditions perfect for photography.",
                "booking_tips": "Bring warm clothing and arrive early for the best light conditions."
            },
            {
                "name": "Indoor Cultural Activities",
                "type": "Cultural Event",
                "description": "Participate in indoor cultural activities including museum visits, art exhibitions, and historical presentations.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter is perfect for indoor cultural activities, providing warmth and educational experiences.",
                "booking_tips": "Check museum schedules and book tickets online to avoid queues."
            },
            {
                "name": "Historical Museum Visits",
                "type": "Museum",
                "description": "Explore Zagreb's museums including the Croatian National Museum and Museum of Broken Relationships with minimal crowds.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers peaceful museum visits with fewer tourists and comfortable indoor temperatures.",
                "booking_tips": "Purchase museum passes for multiple visits and check opening hours in advance."
            },
            {
                "name": "Traditional Dining at Local Restaurants",
                "type": "Dining",
                "description": "Enjoy traditional Croatian cuisine at local restaurants featuring hearty winter dishes and warm hospitality.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter provides the perfect atmosphere for enjoying hearty Croatian comfort food.",
                "booking_tips": "Try local specialties like peka (slow-cooked meat) and traditional štrukli at family-run restaurants."
            }
        ]
    }
}