{
    "sites": [
        {
            "name": "Ban Jelačić Square",
            "type": "Historic Square",
            "description": "The central square of Zagreb, named after Ban Josip Jelačić, features a prominent equestrian statue and serves as the main gathering place for locals and visitors. This pedestrian-only square is surrounded by historic buildings, shops, and cafes, making it the perfect starting point for exploring the city. The square hosts various events, markets, and celebrations throughout the year.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Summer brings outdoor cafes and street performers. Winter features Christmas markets and festive decorations. Spring and fall offer pleasant weather for leisurely strolls.",
            "booking_tips": "No booking required. Visit early morning or evening to avoid crowds. The square is pedestrian-only and perfect for people-watching.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 45.8131,
            "longitude": 15.9775
        },
        {
            "name": "Zagreb Cathedral",
            "type": "Cathedral",
            "description": "The tallest building in Croatia, this neo-Gothic cathedral dominates Zagreb's skyline with its twin spires reaching 108 meters. Originally built in the 13th century, it has been rebuilt several times after earthquakes and fires. The cathedral features beautiful stained glass windows, ornate altars, and the tomb of Cardinal Aloysius Stepinac.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round for worship and visitors. Summer brings many tourists. Winter offers a more peaceful experience. The cathedral is particularly atmospheric during religious services.",
            "booking_tips": "Dress respectfully as this is an active place of worship. Photography is permitted but flash is not allowed. Allow 30-45 minutes for a visit.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.75,
                "cultural_significance": 5
            },
            "latitude": 45.8147,
            "longitude": 15.9785
        },
        {
            "name": "Upper Town (Gornji Grad)",
            "type": "Historic District",
            "description": "Zagreb's medieval heart, perched on a hill above the city, features cobblestone streets, historic buildings, and the iconic St. Mark's Church with its colorful tiled roof. This pedestrian-only area includes the Croatian Parliament, Government buildings, and numerous museums. The area offers spectacular views of the city below.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Summer brings many tourists and cultural events. Spring and fall offer pleasant weather and fewer crowds. Winter provides a peaceful experience with snow-covered rooftops.",
            "booking_tips": "No booking required. Wear comfortable walking shoes for the cobblestone streets. The area is pedestrian-only and perfect for photography.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "St. Mark's Church",
            "type": "Church",
            "description": "This 13th-century church is famous for its colorful tiled roof featuring the coats of arms of Croatia, Dalmatia, Slavonia, and Zagreb. The Romanesque church houses beautiful Gothic sculptures and frescoes. The church is located in St. Mark's Square, the political center of Croatia.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round for worship and visitors. Summer brings many tourists. Winter offers a more peaceful experience. The church is particularly atmospheric during religious services.",
            "booking_tips": "Dress respectfully as this is an active place of worship. Photography is permitted but flash is not allowed. Allow 30 minutes for a visit.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 5
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "Lotrščak Tower",
            "type": "Historic Tower",
            "description": "This 13th-century tower offers the best panoramic views of Zagreb from its observation deck. The tower is famous for the daily firing of the Grič cannon at noon, a tradition dating back to 1877. The tower houses a small museum and provides visitors with insight into Zagreb's medieval history.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Summer brings many visitors and can be hot. Spring and fall offer pleasant weather and fewer crowds. Winter provides a peaceful experience with dramatic views.",
            "booking_tips": "Purchase tickets online to avoid queues. The tower is accessible by stairs only. Allow 1 hour for a comprehensive visit. Don't miss the noon cannon firing.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "Zagreb Funicular",
            "type": "Historic Transport",
            "description": "The shortest funicular in the world, connecting Lower Town to Upper Town since 1890. This 66-meter ride takes just 55 seconds but offers a unique perspective of the city. The funicular is a symbol of Zagreb and provides easy access to the historic Upper Town.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Low",
            "seasonal_notes": "Operates year-round with regular service. Summer brings more tourists. Winter provides a cozy experience. The funicular is particularly atmospheric during sunset.",
            "booking_tips": "Purchase tickets at the station. The funicular runs every 10 minutes. Combine with a visit to Lotrščak Tower for the best experience.",
            "ratings": {
                "cost_estimate": 2,
                "suggested_duration_hours": 0.25,
                "cultural_significance": 4
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "Museum of Broken Relationships",
            "type": "Museum",
            "description": "A unique museum dedicated to failed love relationships, featuring personal objects donated by people from around the world. Each object comes with a story explaining its significance. The museum has gained international recognition and has inspired similar museums worldwide.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with climate-controlled galleries. Summer brings higher visitor numbers. Winter offers a quieter experience. The museum is a good option for rainy days.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 1-1.5 hours for a visit. The museum is relatively small but emotionally powerful.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "Croatian National Theatre",
            "type": "Theatre",
            "description": "A magnificent neo-baroque building housing Croatia's premier theatre company. The theatre hosts opera, ballet, and drama performances in a stunning architectural setting. The building's facade features sculptures and ornate decorations.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Expensive",
            "seasonal_notes": "Performances run year-round. Summer brings international festivals. Winter offers a cozy cultural experience. The theatre is particularly atmospheric during performances.",
            "booking_tips": "Book tickets well in advance, especially for popular performances. Dress appropriately for evening performances. Guided tours are available.",
            "ratings": {
                "cost_estimate": 50,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 45.8097,
            "longitude": 15.9689
        },
        {
            "name": "Mirogoj Cemetery",
            "type": "Cemetery",
            "description": "One of the most beautiful cemeteries in Europe, featuring arcades, domes, and pavilions designed by Hermann Bollé. The cemetery is the final resting place of many famous Croatians and offers a peaceful, park-like atmosphere with stunning architecture.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Beautiful year-round but especially atmospheric in autumn with falling leaves. Spring brings blooming flowers. Winter provides a peaceful experience with snow-covered paths.",
            "booking_tips": "No booking required. Wear comfortable walking shoes. The cemetery is accessible by bus from the city center. Allow 1-2 hours for exploration.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 45.8333,
            "longitude": 15.9833
        },
        {
            "name": "Dolac Market",
            "type": "Market",
            "description": "Zagreb's main open-air market, known as 'Zagreb's stomach,' features colorful stalls selling fresh produce, flowers, and local specialties. The market is housed in distinctive red umbrellas and is a favorite spot for locals and visitors alike.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Summer brings the most variety of fresh produce. Winter offers seasonal specialties. Spring and fall provide pleasant weather for browsing. The market is busiest in the morning.",
            "booking_tips": "No booking required. Visit early morning for the best selection. Bring cash for purchases. The market is perfect for sampling local foods.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8131,
            "longitude": 15.9775
        },
        {
            "name": "Zagreb City Museum",
            "type": "Museum",
            "description": "Housed in the former Convent of St. Clare, this museum tells the story of Zagreb from prehistoric times to the present. The museum features archaeological finds, historical artifacts, and interactive exhibits that bring the city's history to life.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with climate-controlled galleries. Summer brings higher visitor numbers. Winter offers a quieter experience. The museum is a good option for rainy days.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 1-1.5 hours for a visit. The museum is relatively small but informative.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "Tkalčićeva Street",
            "type": "Historic Street",
            "description": "A charming pedestrian street in the heart of Zagreb, lined with colorful buildings, cafes, restaurants, and boutique shops. The street is particularly lively in the evening when locals gather for drinks and socializing. The area has a bohemian atmosphere and is popular with young people.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Summer brings outdoor dining and street performers. Winter provides a cozy atmosphere with indoor cafes. Spring and fall offer pleasant weather for leisurely strolls.",
            "booking_tips": "No booking required. Visit early evening for the most lively atmosphere. The street is pedestrian-only and perfect for people-watching.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8167,
            "longitude": 15.9739
        },
        {
            "name": "Art Pavilion Zagreb",
            "type": "Art Gallery",
            "description": "A beautiful Art Nouveau building housing temporary art exhibitions. The pavilion is one of the oldest exhibition spaces in Southeast Europe and features works by both Croatian and international artists. The building itself is a work of art with its distinctive yellow facade.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with rotating exhibitions. Summer brings international shows. Winter offers a cozy cultural experience. The pavilion is particularly atmospheric during special events.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 1 hour for a visit. Check the website for current exhibitions.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8097,
            "longitude": 15.9689
        },
        {
            "name": "Jarun Lake",
            "type": "Recreation Area",
            "description": "A popular recreational area featuring a large artificial lake surrounded by parks, walking paths, and sports facilities. The area is popular for swimming, rowing, cycling, and picnicking. Jarun is known as 'Zagreb's Sea' and offers a peaceful escape from the city.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Summer is the most popular time for swimming and water sports. Spring and fall offer pleasant weather for walking and cycling. Winter provides a peaceful atmosphere for nature walks.",
            "booking_tips": "No booking required. Bring your own towels and beach gear. The area is accessible by tram from the city center. Arrive early to secure a good spot during peak season.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 3
            },
            "latitude": 45.7833,
            "longitude": 15.9333
        },
        {
            "name": "Medvednica Mountain",
            "type": "Nature Reserve",
            "description": "A mountain range north of Zagreb offering hiking trails, skiing in winter, and spectacular views of the city. The mountain is home to the medieval Medvedgrad fortress and the Sljeme peak, which can be reached by cable car or hiking. The area is popular for outdoor activities year-round.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Summer offers hiking and mountain biking. Winter provides skiing and snowboarding opportunities. Spring and fall offer pleasant weather for outdoor activities. The mountain is accessible year-round.",
            "booking_tips": "No booking required for hiking. Cable car tickets can be purchased on-site. Wear appropriate footwear for mountain activities. The mountain is accessible by bus from Zagreb.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 4,
                "cultural_significance": 4
            },
            "latitude": 45.9167,
            "longitude": 15.9500
        },
        {
            "name": "Zagreb Zoo",
            "type": "Zoo",
            "description": "Located in Maksimir Park, Zagreb Zoo is home to over 2,000 animals representing 275 species. The zoo focuses on conservation and education, featuring both native Croatian wildlife and exotic animals. The zoo is particularly popular with families and offers educational programs.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Summer brings many visitors and can be hot. Spring and fall offer pleasant weather and fewer crowds. Winter provides a peaceful experience with some animals more active in cooler weather.",
            "booking_tips": "Purchase tickets online to avoid queues during peak season. Allow 2-3 hours for a comprehensive visit. The zoo is accessible by tram from the city center.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 3
            },
            "latitude": 45.8167,
            "longitude": 16.0167
        },
        {
            "name": "Maksimir Park",
            "type": "Park",
            "description": "Zagreb's oldest public park, designed in the English landscape style, features walking paths, lakes, and diverse flora. The park is home to Zagreb Zoo and offers a peaceful escape from the city. The park is particularly beautiful in spring when flowers bloom and in autumn with colorful foliage.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Spring brings blooming flowers and new growth. Summer offers shade and cool breezes. Autumn provides colorful foliage. Winter offers a peaceful atmosphere with snow-covered paths.",
            "booking_tips": "No booking required. Bring a picnic and enjoy the tranquility. The park is accessible by tram from the city center. Allow 2-3 hours for exploration.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 45.8167,
            "longitude": 16.0167
        },
        {
            "name": "Zagreb 360° Observation Deck",
            "type": "Observation Deck",
            "description": "Located on the 16th floor of the Zagreb Eye building, this observation deck offers 360-degree panoramic views of the entire city. The deck features interactive displays and information about Zagreb's landmarks. The experience is particularly magical at sunset when the city lights begin to glow.",
            "indoor": true,
            "best_time": "Sunset",
            "price_range": "Moderate",
            "seasonal_notes": "Clear days provide the best views. Summer brings longer daylight hours. Winter offers earlier sunsets. The deck is particularly atmospheric during golden hour.",
            "booking_tips": "Purchase tickets online to avoid queues. Visit during sunset for the most dramatic views. Allow 1 hour for the experience. The deck is accessible by elevator.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 45.8131,
            "longitude": 15.9775
        },
        {
            "name": "Zagreb Christmas Market",
            "type": "Cultural Event",
            "description": "One of the most beautiful Christmas markets in Europe, featuring wooden stalls selling traditional crafts, food, and drinks. The market is centered around Ban Jelačić Square and includes ice skating, live music, and festive decorations. The market has been named one of the best in Europe multiple times.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Held annually from late November to early January. The market is most magical in the evening when lights are illuminated. Winter weather adds to the festive atmosphere.",
            "booking_tips": "No booking required. Visit in the evening for the most magical atmosphere. Try traditional Croatian Christmas foods and drinks. The market is free to enter.",
            "ratings": {
                "cost_estimate": 20,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 45.8131,
            "longitude": 15.9775
        },
        {
            "name": "Zagreb Food Tour",
            "type": "Guided Tour",
            "description": "A guided tour that introduces visitors to traditional Croatian cuisine and local specialties. The tour includes visits to markets, restaurants, and food shops, with tastings of local dishes, wines, and spirits. Guides provide insight into Croatian food culture and traditions.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Available year-round but most popular during peak tourist season. Summer tours can be hot. Spring and fall offer pleasant weather for walking. Winter provides a cozy experience with warm food tastings.",
            "booking_tips": "Book online in advance, especially during peak season. Tours typically last 3-4 hours. Come hungry as the tour includes multiple tastings. Tours are available in multiple languages.",
            "ratings": {
                "cost_estimate": 45,
                "suggested_duration_hours": 3.5,
                "cultural_significance": 4
            },
            "latitude": 45.8131,
            "longitude": 15.9775
        },
        {
            "name": "Zagreb Walking Tour",
            "type": "Guided Tour",
            "description": "A comprehensive walking tour that covers Zagreb's main attractions, including Upper Town, Lower Town, and hidden gems. Guides provide historical context and local insights, making the city's rich history come alive. The tour includes both famous landmarks and lesser-known spots.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Available year-round but most popular during peak tourist season. Summer tours can be hot. Spring and fall offer pleasant weather for walking. Winter provides a more intimate experience with smaller groups.",
            "booking_tips": "Book online in advance, especially during peak season. Tours typically last 2-3 hours. Wear comfortable walking shoes. Tours are available in multiple languages.",
            "ratings": {
                "cost_estimate": 25,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 45.8131,
            "longitude": 15.9775
        }
    ]
}