{
    "April": {
        "reasons_to_visit": [
            {
                "reason": "Spring Awakening & Garden Blooms",
                "details": "Witness Uppsala emerge from winter as the Botanical Garden and Linnaean Garden begin to show spring colors. Enjoy the increasing daylight along the Fyris River."
            },
            {
                "reason": "Valborg (Walpurgis Night) Epicenter",
                "details": "Experience Sweden's most famous Valborg celebration (April 30th) in its heartland, with student traditions like the Raft Race, Herring Lunch, Hat Waving at Carolina Rediviva, and bonfires."
            },
            {
                "reason": "Ideal for Historic Exploration",
                "details": "Explore the historic Fjärdingen district (Cathedral, Castle, Gustavianum) and Gamla Uppsala comfortably before the peak summer crowds arrive."
            },
            {
                "reason": "Outdoor Cafes & Riverside Strolls",
                "details": "Enjoy the reopening of outdoor seating at cafes along the Fyris River and in the city center as the weather allows."
            },
            {
                "reason": "Shoulder Season Advantages",
                "details": "Visit key attractions like Uppsala Cathedral, Gustavianum, and Gamla Uppsala Museum with potentially fewer crowds (outside Valborg week and Easter)."
            },
            {
                "reason": "Easy Access & Day Trips",
                "details": "Uppsala's excellent train connections make comfortable spring day trips to Stockholm easy, or explore nearby nature reserves as they awaken."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Unpredictable Spring Weather",
                "details": "April weather in Uppsala is highly variable. Expect a mix of sun, clouds, rain, and cool winds. Snow showers are not impossible early in the month."
            },
            {
                "reason": "Cool Temperatures",
                "details": "Average temperatures are still cool, ranging from lows around 1-2°C to highs around 10-11°C. Mornings and evenings can feel quite chilly."
            },
            {
                "reason": "Valborg Crowds & Prices (Late April)",
                "details": "The last week of April, leading up to Valborg, sees a massive influx of visitors, leading to crowded conditions and significantly higher accommodation prices."
            },
            {
                "reason": "Easter Holiday Impact (if applicable)",
                "details": "If Easter occurs in April, be aware of potential closures or reduced hours for shops and some services on public holidays."
            },
            {
                "reason": "Pollen Season Starts",
                "details": "Spring blooms mean the beginning of pollen season (especially birch), which could affect allergy sufferers."
            },
            {
                "reason": "Fyris River Still Cold",
                "details": "While scenic for walks, the Fyris River is too cold for swimming or extensive boating activities, although the Raft Race on Valborg is a spectacle."
            }
        ],
        "first_half": {
            "date_range": "April 1–15",
            "weather": {
                "average_temperature": {
                    "high": "10°C",
                    "low": "1°C"
                },
                "precipitation": "Variable; potential for rain, sleet, or even brief snow showers early on. Mix of cloudy and sunny days. Wind can be noticeable.",
                "general_tips": "Layering is crucial: thermal base, fleece/sweater, wind/waterproof jacket, hat, scarf, gloves. Waterproof footwear advised."
            },
            "tourism_level": {
                "crowds": "Low to Moderate. Generally quiet, but can increase if Easter falls during this time.",
                "pricing": "Likely mid-range for accommodation, potentially lower than peak summer but higher around Easter.",
                "overall_atmosphere": "City feels like it's slowly awakening. Parks are greening up. Good time for indoor museum visits and uncrowded exploration of historic sites."
            },
            "events_holidays": [
                {
                    "name": "Easter Weekend (Påsk)",
                    "date": "Varies (can fall in early/mid-April)",
                    "description": "Public holidays on Good Friday, Easter Sunday, and Easter Monday. Primarily a family-focused holiday.",
                    "notes": "Check opening times for attractions, shops (especially Systembolaget). Public transport runs, often on Sunday schedule."
                },
                {
                    "name": "Outdoor Cafe Season Starts",
                    "date": "From April 1st (weather permitting)",
                    "description": "Cafes begin setting up outdoor seating ('uteserveringar'), especially along the river and main squares, though usage depends heavily on the weather.",
                    "notes": "Enjoy a fika outdoors on sunny days; blankets often available."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Fjärdingen District",
                    "where": "Centrum/Fjärdingen",
                    "description": "Wander the historic heart of Uppsala: visit the magnificent Uppsala Cathedral, see Uppsala Castle, explore the area around Gustavianum and Carolina Rediviva.",
                    "practical_tips": "Wear comfortable shoes for cobblestones. Check opening hours for cathedral/museums.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Free (walking), entry fees for castle/museums.",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit the Linnaean Garden",
                    "where": "Centrum/Fjärdingen",
                    "description": "See Carl Linnaeus's restored 18th-century botanical garden as it begins its spring bloom. Visit the adjacent Linnaeus Museum.",
                    "practical_tips": "Garden may have limited access/bloom early in April. Check opening times.",
                    "best_time": "Daytime, sunny spells.",
                    "estimated_cost": "Moderate (entry fee).",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk Along the Fyris River",
                    "where": "Centrum",
                    "description": "Enjoy a refreshing walk along the riverbanks, crossing bridges like Dombron, and observing the city awaken.",
                    "practical_tips": "Can be windy. Stop at a riverside cafe if the weather is good.",
                    "best_time": "Daytime.",
                    "estimated_cost": "Free.",
                    "weather_dependent": true
                },
                {
                    "activity": "Discover Gustavianum (University Museum)",
                    "where": "Fjärdingen",
                    "description": "Explore Uppsala University's oldest preserved building, housing collections on Nordic antiquities, the Viking Age, Egypt, plus the anatomical theatre.",
                    "practical_tips": "Allocate a couple of hours. Located opposite the Cathedral.",
                    "best_time": "Anytime during opening hours.",
                    "estimated_cost": "Moderate (entry fee).",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "April 16–30",
            "weather": {
                "average_temperature": {
                    "high": "11°C",
                    "low": "2°C"
                },
                "precipitation": "Still variable, perhaps slightly higher chance of milder, sunnier days, but rain and wind remain possible. Noticeably longer daylight hours.",
                "general_tips": "Layers still essential. Be prepared for crowds and potentially book accommodation/trains in advance if visiting for Valborg."
            },
            "tourism_level": {
                "crowds": "Moderate, rapidly increasing to High/Very High in the days leading up to April 30th (Valborg).",
                "pricing": "Accommodation prices likely surge significantly for Valborg week.",
                "overall_atmosphere": "Growing sense of excitement, especially among students preparing for Valborg. Parks become more vibrant. City feels lively."
            },
            "events_holidays": [
                {
                    "name": "Valborg Week Activities",
                    "date": "Last week of April, culminating April 30th",
                    "description": "Various student-led events, parties (often within Nations), and preparations leading up to the main day.",
                    "notes": "Many events require Nation membership or tickets. Check schedules from Uppsala University or student nations."
                },
                {
                    "name": "Walpurgis Night (Valborgsmässoafton / Valborg)",
                    "date": "April 30th (All day/evening)",
                    "description": "Major celebration: Raft Race on Fyris River (Forsränningen), Herring Lunch picnics, Hat Waving ceremony at Carolina Rediviva, evening bonfires, choir singing, and massive public gatherings.",
                    "notes": "Extremely crowded, especially around key event locations. Book accommodation far in advance. Public transport crowded. Dress warmly."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Witness Valborg Festivities",
                    "where": "Various locations: Fyris River, Carolina Hill, City Parks, Gamla Uppsala",
                    "description": "Immerse yourself in the unique Uppsala Valborg traditions. Watch the homemade rafts navigate the Fyris, join the crowds for the hat waving, see the bonfires.",
                    "practical_tips": "Plan your day, expect huge crowds, dress warmly, be aware of pickpockets. Alcohol consumption is high.",
                    "best_time": "All day April 30th.",
                    "estimated_cost": "Mostly free to observe, costs for food/drink/parties.",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore the Botanical Garden",
                    "where": "Kåbo (near Castle)",
                    "description": "Visit Uppsala University's larger botanical garden, showcasing diverse plant collections from around the world, including the Tropical Greenhouse and the Baroque Garden.",
                    "practical_tips": "Allow ample time. Check opening hours for greenhouses.",
                    "best_time": "Daytime, good weather enhances enjoyment.",
                    "estimated_cost": "Generally free entry to grounds, fee for Tropical Greenhouse.",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Gamla Uppsala (Old Uppsala)",
                    "where": "North of city center (bus ride)",
                    "description": "Explore Sweden's ancient political and religious center. See the impressive Royal Mounds (burial mounds), the old church, and visit the Gamla Uppsala Museum.",
                    "practical_tips": "Take bus #2 from city center. Allow half a day. Museum has entry fee.",
                    "best_time": "Daytime, preferably dry weather.",
                    "estimated_cost": "Low-Moderate (bus fare + optional museum entry).",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Stockholm",
                    "where": "Stockholm (short train ride)",
                    "description": "Take advantage of Uppsala's proximity for a day trip to the capital. Explore Gamla Stan, visit the Vasa Museum, or see the Royal Palace.",
                    "practical_tips": "Frequent trains from Uppsala C (approx. 40 mins). Plan your Stockholm itinerary in advance.",
                    "best_time": "Full day.",
                    "estimated_cost": "Moderate-High (train fare + Stockholm costs).",
                    "weather_dependent": false
                }
            ]
        }
    }
}