{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Walpurgis Night (Valborg)",
                "details": "Experience Sweden's most famous Valborg celebration (April 30th/May 1st) in Uppsala, renowned for its unique student traditions like river rafting, cap-donning ceremonies, concerts, and bonfires."
            },
            {
                "reason": "Pleasant Spring Weather & Long Days",
                "details": "May typically offers milder temperatures (average highs 15-17°C/59-63°F), increasing sunshine, and very long daylight hours, ideal for exploring the city and its surroundings."
            },
            {
                "reason": "City in Bloom",
                "details": "See Uppsala's parks like Stadsträdgården and the Botanical Garden (Botaniska trädgården) burst into color with spring flowers and blossoming trees. The banks of the Fyrisån river become lush and scenic."
            },
            {
                "reason": "Academic Atmosphere & Events",
                "details": "The presence of Uppsala University lends a youthful energy. May often features student events and concerts leading up to the end of the academic year."
            },
            {
                "reason": "Historical Sightseeing in Good Weather",
                "details": "Comfortable weather for visiting Uppsala Cathedral (Domkyrkan), Uppsala Castle (Slottet), Gustavianum museum, and the historic quarters without peak summer heat or crowds (outside of Valborg)."
            },
            {
                "reason": "Outdoor Activities",
                "details": "Ideal conditions for walking or cycling along the Fyrisån river, exploring nearby nature reserves (e.g., Lunsen), or potentially taking early boat trips on Lake Mälaren."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Extreme Valborg Crowds & Disruption",
                "details": "Walporgis (Apr 30/May 1) attracts immense crowds, predominantly students. Expect major disruptions, potential rowdiness, peak prices, fully booked accommodation, and closures on May 1st. It's a unique but intense experience."
            },
            {
                "reason": "Variable Spring Weather",
                "details": "Despite improving trends, May can still bring cool, rainy, or windy days. Packing layers, including rain gear, is essential."
            },
            {
                "reason": "Pollen Season",
                "details": "Significant tree pollen (especially birch) is common in May and can be challenging for allergy sufferers."
            },
            {
                "reason": "Ascension Day Holiday (Potential)",
                "details": "Ascension Day (Kristi Himmelsfärdsdag), a public holiday, often falls in May (check dates). It creates a long weekend, leading to closures and increased domestic travel."
            },
            {
                "reason": "Student-Focused Atmosphere (Valborg)",
                "details": "During Valborg, the city's atmosphere is heavily dominated by student celebrations, which might not appeal to all visitors seeking a quiet trip."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C (59°F)",
                    "low": "5°C (41°F)"
                },
                "precipitation": "Sunshine increases, but expect cool nights/mornings. Moderate chance of rain showers and potentially windy conditions. Daylight hours are very long.",
                "general_tips": "Pack layers: t-shirts, sweaters, a medium jacket (waterproof recommended), comfortable walking shoes. Sunglasses useful. Allergy medication if needed."
            },
            "tourism_level": {
                "crowds": "Extremely high for Valborg (Apr 30/May 1), booking essential months in advance. Moderates significantly after May 1st but increases steadily.",
                "pricing": "Peak prices for Valborg weekend. Transitions to shoulder/high season rates afterwards.",
                "overall_atmosphere": "Intense, chaotic, and festive during Valborg. Calms down significantly afterwards into a pleasant spring vibe."
            },
            "events_holidays": [
                {
                    "name": "Walpurgis Night (Valborgsmässoafton)",
                    "date": "April 30 (Main events)",
                    "description": "Uppsala's biggest event: Rafting on Fyrisån, herring lunch picnics, 'Mösspåtagning' (student cap-donning) at Carolina Rediviva, choir singing at Gunillaklockan (Castle), evening bonfires.",
                    "notes": "Massive crowds, city center access restricted. Plan accommodation and travel far ahead. Expect significant alcohol consumption."
                },
                {
                    "name": "May Day / Labor Day (Första maj)",
                    "date": "May 1",
                    "description": "Public holiday. Much quieter than April 30th. Some remaining student activities, potential political marches.",
                    "notes": "Widespread closures (most shops, Systembolaget, banks). Many services limited. Check museum/attraction opening status."
                }
            ],
            "unique_experiences": [
                 {
                    "activity": "Witness Valborg Traditions",
                    "where": "City Center, Fyrisån River, Carolina Hill, Castle Hill",
                    "description": "Observe the unique student traditions of Uppsala's Valborg, like the chaotic river rafting or the formal cap-donning ceremony. (Primarily April 30th)",
                    "practical_tips": "Be prepared for extreme crowds and limited movement. Find viewing spots early. Less intense spots exist outside the absolute center.",
                    "best_time": "April 30th Daytime/Evening",
                    "estimated_cost": "Free (viewing)",
                    "weather_dependent": true
                },
                {
                    "activity": "Visit Uppsala Cathedral (Domkyrkan)",
                    "where": "Domkyrkoplan",
                    "description": "Explore Scandinavia's largest Gothic cathedral, the burial place of Swedish monarchs and notable figures like Carl Linnaeus. Quieter after the Valborg rush.",
                    "practical_tips": "Check opening times, especially around May 1st. Dress respectfully. Free entry.",
                    "best_time": "Daytime (after May 1st for fewer crowds)",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Walk Along the Fyrisån River",
                    "where": "Central Uppsala Riverbanks",
                    "description": "Enjoy a pleasant walk along the river that runs through the city center as spring foliage emerges.",
                    "practical_tips": "Paths are flat and accessible. Many cafes and viewpoints along the way.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Explore Stadsträdgården",
                    "where": "South of City Center",
                    "description": "Wander through Uppsala's main city park, enjoying the spring flowers, greenhouse (potentially), and open spaces.",
                    "practical_tips": "Good spot for a picnic on a nice day.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C (63°F)",
                    "low": "7°C (45°F)"
                },
                "precipitation": "Often the most pleasant part of spring. Generally sunnier and warmer, though rain showers remain possible. Very long daylight.",
                "general_tips": "Lighter layers are key, but keep a sweater or light jacket for evenings or cooler days. Sunscreen recommended for sunny spells."
            },
            "tourism_level": {
                "crowds": "High season approaching. Noticeably busier than early May (post-Valborg), particularly on weekends and if Ascension Day falls here.",
                "pricing": "High season pricing generally applies.",
                "overall_atmosphere": "Lovely late spring period. Ideal for sightseeing, exploring gardens, and enjoying the longer days before the main summer influx."
            },
            "events_holidays": [
                 {
                    "name": "Ascension Day (Kristi Himmelsfärdsdag)",
                    "date": "Varies (Thursday, 40 days after Easter - often May)",
                    "description": "Public holiday in Sweden. Creates a long weekend for many.",
                    "notes": "Check the date for the specific year. Expect closures (shops, banks). Increased travel within Sweden."
                 },
                 {
                    "name": "Potential University End-of-Term Events",
                    "date": "Late May",
                    "description": "Check Uppsala University schedules for public concerts, defenses, or other events as the semester winds down.",
                    "notes": "Varies year to year."
                 }
            ],
            "unique_experiences": [
                 {
                    "activity": "Visit Uppsala Castle (Uppsala Slott)",
                    "where": "Castle Hill",
                    "description": "Explore the grounds of the historic pink castle. Visit the Uppsala Art Museum (Konstmuseum) housed within.",
                    "practical_tips": "Check opening hours for the museum. The castle grounds offer great views over the city.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (grounds) / Moderate (museum entry)",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore the Botanical Garden (Botaniska Trädgården)",
                    "where": "Near the Castle",
                    "description": "Wander through the extensive university botanical garden, featuring Linnaeus's Orangery, tropical greenhouses, and diverse plant collections in bloom.",
                    "practical_tips": "Allow ample time. Check opening hours for greenhouses. Free entry to outdoor gardens.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (gardens) / Low (greenhouse entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Gamla Uppsala (Old Uppsala)",
                    "where": "North of Uppsala (Bus or Bike)",
                    "description": "Visit the historically significant site with large Iron Age burial mounds, a museum (Gamla Uppsala Museum), and a medieval church.",
                    "practical_tips": "Easily accessible by local bus (e.g., number 2) or a pleasant bike ride. The museum provides context for the mounds.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport) / Moderate (museum entry)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Gustavianum Museum",
                    "where": "Near the Cathedral",
                    "description": "Explore Uppsala University's oldest preserved building, famous for its unique Anatomical Theatre, plus collections related to science history, Egyptology, and classical antiquities.",
                    "practical_tips": "Check opening hours. Contains several distinct exhibitions.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate",
                    "weather_dependent": false
                 }
            ]
        }
    }
}