{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Nyttårsdag)",
          "notes": "New Year's Day is a public holiday in Norway. Most attractions and shops in Tromsø operate with limited hours. The polar night continues, with no direct sunlight, though there is twilight for a few hours mid-day. Temperatures average around -5°C (23°F) and snow covers the city and surrounding landscape."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 3,
          "notes": "Mid-January marks the end of the polar night period when the sun stays below the horizon. Despite the darkness, this is a peak tourist season for those seeking the northern lights and winter adventures. Whale watching tours operate to see orcas and humpback whales feeding in nearby waters (typically until late January). Days are characterized by a bluish twilight for a few hours, creating a mystical atmosphere. Temperatures hover between -7°C and -2°C (19°F to 28°F)."
        },
        {
          "days": [21],
          "score": 3,
          "special": true,
          "event": "Return of the Sun (Soldagen)",
          "notes": "This day marks the first appearance of the sun after the polar night in Tromsø. Locals celebrate with 'sun buns' (solboller) and hot chocolate at various viewpoints throughout the city. It's a joyous celebration as the sun peeks above the horizon for the first time in two months."
        },
        {
          "days": [22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "special": true,
          "event": "Tromsø International Film Festival (TIFF)",
          "notes": "Late January brings the renowned Tromsø International Film Festival (TIFF), one of the largest film events in Scandinavia. The festival showcases films from around the world with screenings at various venues across the city. The combination of long, dark nights and increasing daylight hours provides excellent northern lights viewing opportunities as winter activities like dog sledding, reindeer sledding, and snowmobiling operate in full swing."
        }
      ],
      "weatherHighC": -2,
      "weatherLowC": -7,
      "tourismLevel": 8
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 3,
          "special": true,
          "event": "Northern Lights Festival (Nordlysfestivalen)",
          "notes": "The Northern Lights Festival is a major music event featuring classical, jazz, and contemporary performances at venues throughout Tromsø. The festival celebrates the return of light after the polar night and coincides with peak northern lights season."
        },
        {
          "days": [6],
          "score": 3,
          "special": true,
          "event": "Sami National Day (Samefolkets dag)",
          "notes": "February 6th celebrates Sami National Day, commemorating the first Sami congress in 1917. Events include traditional joik performances, exhibitions, and cultural demonstrations of Sami heritage. The Sami are the indigenous people of Northern Scandinavia, and their culture is an important part of Tromsø's identity."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "February brings increasing daylight with sunrise around 8-9am and sunset around 3-4pm by month's end. This is considered one of the best months for winter activities in Tromsø with reliable snow conditions and improving light. The northern lights remain highly visible on clear nights. Temperatures typically range from -5°C to -1°C (23°F to 30°F), though can drop much lower. Popular activities include dog sledding, reindeer sledding, snowshoeing, and northern lights chasing. Ice fishing becomes popular as the daylight hours increase."
        }
      ],
      "weatherHighC": -1,
      "weatherLowC": -5,
      "tourismLevel": 9
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "March is many locals' favorite winter month in Tromsø. Daylight increases dramatically with sunrise around 6:00 AM and sunset around 6:00 PM by month's end. Temperatures remain cold and often stable, ranging from -4°C to 0°C (25°F to 32°F), contributing to good chances of clear skies for northern lights viewing. Snow conditions are typically excellent, making it ideal for skiing and other winter activities. The surrounding mountains are popular for ski touring as longer daylight allows for extended outdoor adventures. The northern lights remain visible and often spectacular, with some research suggesting increased aurora activity during spring equinox periods."
        }
      ],
      "weatherHighC": 0,
      "weatherLowC": -4,
      "tourismLevel": 8
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
          "score": 3,
          "notes": "Early April marks the end of the northern lights season in Tromsø, as nights become too bright for optimal viewing by mid-April. Daylight increases rapidly with about 15-18 hours of light by mid-month. Snow begins melting in the city but remains plentiful in the mountains for skiing. Temperatures typically range from 0°C to 5°C (32°F to 41°F) but can vary considerably. Tourism decreases, making it a good time to visit with fewer crowds."
        },
        {
          "days": [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 2,
          "notes": "Late April is considered a transitional period in Tromsø and often the least favorable time to visit. The northern lights have faded for the season, but there's still too much snow in the mountains for hiking. The snow becomes wet and slushy, making outdoor activities challenging. Most winter activities wind down while summer activities have not yet begun. Days continue to lengthen rapidly as the midnight sun period approaches."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "Labor Day (Arbeidernes dag)",
          "notes": "May 1st is Labor Day in Norway, marked by parades and political gatherings in Tromsø's city center. It coincides with spring truly taking hold in the region, though snow can still be present in the mountains."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early May brings significant changes to Tromsø as spring finally takes hold. The snow rapidly disappears from the city and lowland areas, though remains in the mountains. Temperatures generally range from 3°C to 10°C (37°F to 50°F). Daylight increases dramatically, with the sun setting very late by mid-month."
        },
        {
          "days": [17],
          "score": 5,
          "special": true,
          "event": "Constitution Day (Syttende mai)",
          "notes": "May 17th is Norway's National Day, celebrating the signing of the Constitution in 1814. This is a major celebration in Tromsø with parades featuring people in traditional bunads (folk costumes), marching bands, and festivities throughout the city. Children's parades are a central feature, and the atmosphere is festive with ice cream, games, and national pride on display."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Midnight Sun Begins",
          "notes": "Around May 18-20, the midnight sun period officially begins in Tromsø and lasts until late July. During this time, the sun doesn't set below the horizon, creating 24 hours of daylight. Late May sees the landscape turning green as spring flowers bloom, and temperatures continue to rise. A shoulder season for tourism, May offers good value and fewer crowds than summer months while still providing unique Arctic experiences."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 3,
      "tourismLevel": 5
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 4,
          "notes": "June brings the full midnight sun experience to Tromsø with 24-hour daylight. The summer solstice (around June 21) marks the longest day of the year, though in Tromsø the sun doesn't set at all during this period. Despite it being summer, temperatures can be variable, typically ranging from 7°C to 15°C (45°F to 59°F). Outdoor activities dominate, with hiking, kayaking, and midnight sun experiences being particularly popular. The endless daylight allows for activities at any hour, though visitors sometimes struggle with sleep without proper blackout curtains."
        },
        {
          "days": [24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Midnight Sun Marathon",
          "notes": "Late June typically features the Midnight Sun Marathon, a unique race held in the evening under the midnight sun. Runners from around the world participate in this iconic event that takes advantage of Tromsø's 24-hour daylight. Tourism begins to increase as the summer holiday season starts. Outdoor activities like hiking in the surrounding mountains, boat trips in the fjords, and fishing are at their peak."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 7,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17],
          "score": 5,
          "notes": "Early July continues the midnight sun period in Tromsø, offering 24-hour daylight for outdoor activities. This is typically the warmest time of year with temperatures averaging between 10°C and 17°C (50°F to 63°F), though can occasionally reach 20°C (68°F) or higher. July is peak tourist season as European summer holidays begin. Popular activities include hiking, kayaking, boat trips to explore the fjords, and beaches like Telegrafbukta for swimming brave souls."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25],
          "score": 5,
          "special": true,
          "event": "Bukta Festival",
          "notes": "The Bukta Open Air Festival is a popular rock music event held in Telegrafbukta, a beachside park. The festival takes advantage of the midnight sun, with performances continuing under the endless daylight. Tourism peaks during this period with visitors from around the world."
        },
        {
          "days": [26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "The midnight sun period begins to wind down in late July, with the sun starting to set very briefly by month's end. The weather remains pleasant for outdoor activities, though rainfall can occur. Popular activities include fishing, hiking, and exploring the surrounding islands and fjords."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9],
          "score": 4,
          "special": true,
          "event": "Tromsø Jazz Festival",
          "notes": "Early August features the Tromsø Jazz Festival, bringing international and Norwegian jazz performers to venues throughout the city. The midnight sun is gone, but nights remain very light with just a few hours of dusk rather than darkness. This is an excellent time for picking berries and mushrooms in the forests and mountains around Tromsø, a popular activity among locals."
        },
        {
          "days": [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
          "score": 4,
          "special": true,
          "event": "Rakettnatt Festival",
          "notes": "Mid-August brings the Rakettnatt Music Festival, a popular outdoor event featuring Norwegian and international artists. The weather remains pleasant with temperatures typically ranging from 9°C to 16°C (48°F to 61°F), though rainfall becomes more common than in July."
        },
        {
          "days": [20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Late August sees true darkness returning to Tromsø for the first time since spring. By month's end, it's possible to see the northern lights on clear nights, marking the very beginning of aurora season. Tourism remains strong but begins to transition from summer activities to autumn experiences. The landscape begins to show autumn colors, particularly in the mountain areas. Days are still quite long, allowing for extensive outdoor activities."
        }
      ],
      "weatherHighC": 16,
      "weatherLowC": 9,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "notes": "Early September brings the full onset of autumn to Tromsø. Temperatures cool noticeably, typically ranging from 5°C to 11°C (41°F to 52°F). The landscape transforms with vibrant autumn colors in the forests and mountains. Daylight hours decrease steadily but remain sufficient for daytime activities."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "SMAK Food Festival",
          "notes": "SMAK, a Northern Norwegian food festival, typically takes place in September, showcasing local cuisine and traditional cooking methods. This is also an excellent time for northern lights viewing, as nights become properly dark again while temperatures remain relatively mild compared to winter. The northern lights season officially begins, with tours operating on clear nights. Hiking remains popular as autumn colors peak and temperatures are comfortable for outdoor activities."
        }
      ],
      "weatherHighC": 11,
      "weatherLowC": 5,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "October brings dramatic changes to Tromsø as winter approaches. The landscape transitions from autumn colors to winter preparation, with the ground beginning to freeze by month's end. Temperatures typically range from 0°C to 6°C (32°F to 43°F) but can drop below freezing, especially at night. Daylight hours decrease rapidly, with about 6-8 hours of proper daylight by late October. Spectacular sunsets are common, with colors ranging from pink to orange and blue. The northern lights become increasingly visible on clear nights, with aurora tourism beginning to ramp up. This is a transitional month; summer activities have ended while winter activities haven't yet begun, though snow may appear on mountain peaks. Tourism is moderate, making it a good time to experience Tromsø with fewer crowds while still having good opportunities for northern lights."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": 0,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 3,
          "special": true,
          "event": "Tromsø Arctic Pride",
          "notes": "Mid-November brings the Tromsø Arctic Pride festival, celebrating LGBTQ+ communities in the Arctic. This is a transitional period as winter takes hold, with temperatures dropping and daylight hours rapidly decreasing. The northern lights are highly visible on clear nights. The first whales typically arrive in the waters near Tromsø, marking the beginning of the whale watching season that lasts until late January. Whale watching tours operate from the city, focusing on orcas and humpback whales that feed in the herring-rich waters."
        },
        {
          "days": [21, 22, 23, 24, 25, 26],
          "score": 3,
          "notes": "Late November sees Tromsø entering the dark period of the year. Due to the mountains surrounding the city, direct sunlight disappears around November 21, about a week before the official polar night begins. Temperatures typically range from -4°C to 0°C (25°F to 32°F). Christmas decorations and lights begin to appear throughout the city, creating a cozy atmosphere despite the darkness."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "special": true,
          "event": "Polar Night Begins",
          "notes": "The official polar night period begins around November 27 and lasts until January 15. During this time, the sun doesn't rise above the horizon, though there is a period of twilight or 'blue light' for a few hours mid-day. This creates a magical atmosphere unique to the Arctic region. Northern lights viewing is at its prime, with dark skies throughout most of the day. Tourism begins to increase significantly as winter activities commence and the Christmas season approaches."
        }
      ],
      "weatherHighC": 0,
      "weatherLowC": -4,
      "tourismLevel": 6
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 4,
          "notes": "Early December is firmly in the polar night period, with no direct sunlight. Despite this, the city is far from dark, with Christmas lights, decorations, and the soft blue twilight of mid-day creating a magical atmosphere. Temperatures typically range from -5°C to -1°C (23°F to 30°F), though can be milder due to the Gulf Stream influence. This is peak season for winter tourism, with northern lights tours, dog sledding, reindeer sledding, and other winter activities in full operation. Whale watching reaches its peak in December, as orcas and humpback whales feed in the nearby fjords."
        },
        {
          "days": [21, 22, 23],
          "score": 4,
          "special": true,
          "event": "Winter Solstice",
          "notes": "The winter solstice marks the shortest day of the year, though in Tromsø this means the shortest period of twilight during the polar night. Christmas markets operate throughout the city, and the atmosphere is festive despite the darkness. The Tromsø Ice Domes typically open around December 20, offering a unique ice hotel experience outside the city."
        },
        {
          "days": [24, 25, 26],
          "score": 4,
          "special": true,
          "event": "Christmas (Jul)",
          "notes": "Christmas is a major holiday in Norway, with Christmas Eve (December 24) being the main celebration day when families gather for traditional meals. Many restaurants and attractions have limited hours or close entirely during these days. Popular Christmas foods include ribbe (pork ribs), pinnekjøtt (lamb ribs), and lutefisk (lye-treated codfish). Despite the holiday closures, this remains a busy time for tourism as visitors seek northern lights and winter experiences."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 4,
          "notes": "The period between Christmas and New Year remains busy with tourists enjoying winter activities. The polar night creates ideal conditions for northern lights viewing on clear nights. Winter activities like dog sledding, reindeer sledding, and snowmobiling are in full swing, though availability can be limited due to high demand."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Nyttårsaften)",
          "notes": "New Year's Eve celebrations in Tromsø typically center around fireworks displays that light up the dark polar sky at midnight. Restaurants offer special New Year's menus (requiring advance reservation), and the atmosphere is festive throughout the city. This is one of the busiest periods for tourism, with accommodation prices at their peak and availability limited."
        }
      ],
      "weatherHighC": -1,
      "weatherLowC": -5,
      "tourismLevel": 9
    }
  },
  "activityTypes": {
    "spring": [
      "Watching the return of the sun after the polar night in late January",
      "Experiencing the transition from winter to spring as snow melts and days lengthen",
      "Northern lights viewing (until early/mid-April)",
      "Winter activities like dog sledding and reindeer sledding while snow conditions remain good",
      "Ski touring in the mountains surrounding Tromsø",
      "Celebrating Constitution Day (May 17) with parades and festivities",
      "Witnessing the start of the midnight sun period in late May",
      "Boat trips in the fjords as waters become more navigable",
      "Hiking in lower elevations as snow recedes"
    ],
    "summer": [
      "Experiencing the midnight sun with 24-hour daylight (mid-May to late July)",
      "Hiking in the mountains surrounding Tromsø",
      "Swimming at beaches like Telegrafbukta (for the brave)",
      "Midnight sun activities like night-time mountain hikes",
      "Kayaking and paddleboarding in the fjords",
      "Fishing trips in the surrounding waters",
      "Attending summer festivals like Bukta, Tromsø Jazz Festival, and Rakettnatt",
      "Boat tours to explore the coastal islands and fjords",
      "Berry and mushroom picking (late summer)"
    ],
    "autumn": [
      "Witnessing the return of the northern lights (from late August)",
      "Hiking among autumn colors in the surrounding forests and mountains",
      "Berry and mushroom foraging in the wilderness",
      "Fjord cruises with autumn scenery",
      "Experiencing the gradual transition to darker days",
      "Northern lights photography tours",
      "Attending the SMAK food festival and sampling local cuisine",
      "Whale watching as the first orcas and humpbacks arrive (late autumn)",
      "Enjoying spectacular sunsets as daylight hours decrease"
    ],
    "winter": [
      "Northern lights hunting (prime season)",
      "Dog sledding through snowy landscapes",
      "Reindeer sledding and learning about Sami culture",
      "Whale watching for orcas and humpback whales (November to January)",
      "Experiencing the polar night when the sun doesn't rise (late November to mid-January)",
      "Snowshoeing in the surrounding mountains",
      "Snowmobiling across Arctic terrain",
      "Attending the Tromsø International Film Festival (January)",
      "Visiting the Tromsø Ice Domes (from December 20)",
      "Cross-country skiing on maintained trails",
      "Celebrating the return of the sun after polar night (late January)"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, challenging weather, limited activities",
    "1": "Poor: Unfavorable conditions, extreme weather, very limited activities or accessibility"
  }
}