{
    "Spring": {
        "activities": [
            {
                "name": "King's Day (Koningsdag)",
                "type": "National Holiday/Festival",
                "description": "Join the nationwide celebration! Delft fills with orange outfits, street parties, flea markets ('vrijmarkt'), and music, especially around the Markt and Beestenmarkt.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free (activities/market browsing)",
                "seasonal_notes": "Celebrated annually on April 27th (or 26th if 27th is a Sunday). Expect crowds and a festive atmosphere.",
                "booking_tips": "No booking needed for street events. Wear orange! Public transport may run on a modified schedule."
            },
            {
                "name": "Canal Boat Tours Season Opening",
                "type": "Sightseeing/Activity",
                "description": "Enjoy a relaxing boat tour through Delft's historic canals as the season reopens, offering unique views of the city's architecture.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Boat tours typically resume in March or April. Check operator websites for exact dates and schedules.",
                "booking_tips": "Book online or at the departure points. Weekends can be busy, especially with good weather."
            },
            {
                "name": "Keukenhof Gardens Day Trip",
                "type": "Day Trip/Nature",
                "description": "Visit the world-famous Keukenhof Gardens (near Lisse) to see millions of tulips and spring flowers in bloom. Easily accessible from Delft.",
                "indoor": false,
                "best_time": "Morning (to avoid crowds)",
                "price_range": "Moderate to High (incl. transport & entry)",
                "seasonal_notes": "Open mid-March to mid-May. Peak bloom varies but is often mid-April.",
                "booking_tips": "Book transport (e.g., bus from Leiden/Schiphol) and entry tickets well in advance, especially during peak season and holidays."
            },
            {
                "name": "Terrace Season Opening",
                "type": "Food & Drink/Social",
                "description": "Experience the Dutch 'terrasjes' culture as cafes and bars open their outdoor seating areas. Enjoy drinks and snacks by the canals or on squares like Beestenmarkt.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Varies (Budget to Moderate)",
                "seasonal_notes": "Terraces open as weather permits, usually becoming consistently popular from April onwards.",
                "booking_tips": "Popular spots fill up quickly on sunny days. No reservations usually needed for casual drinks."
            },
            {
                "name": "Delft Flower Market",
                "type": "Market",
                "description": "Browse vibrant spring flowers, plants, and bulbs at the weekly markets (especially Saturday market on Brabantse Turfmarkt/Burgwal).",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free entry (purchases vary)",
                "seasonal_notes": "Spring brings the best selection of tulips and other seasonal flowers.",
                "booking_tips": "Arrive early for the best choice. Bring cash, although some vendors accept cards."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Oude Delft Antiques & Curiosities Market",
                "type": "Market",
                "description": "Stroll along the canals (Hippolytusbuurt area) browsing antiques, books, art, and collectibles at this charming summer market.",
                "indoor": false,
                "best_time": "Saturday Morning/Afternoon",
                "price_range": "Free entry (purchases vary)",
                "seasonal_notes": "Runs weekly on Saturdays from April to October. Very picturesque setting.",
                "booking_tips": "Popular event, can get crowded. Good for unique finds and atmosphere."
            },
            {
                "name": "Delft Chamber Music Festival",
                "type": "Music Festival",
                "description": "Enjoy high-quality classical chamber music performances in beautiful historic venues like the Van der Mandelezaal (Prinsenhof).",
                "indoor": true,
                "best_time": "Evenings (check schedule)",
                "price_range": "Moderate to High (per concert)",
                "seasonal_notes": "Usually held late July / early August. Features international artists.",
                "booking_tips": "Book tickets well in advance via the festival website, popular concerts sell out."
            },
            {
                "name": "Outdoor Dining & Drinks (Terraces)",
                "type": "Food & Drink/Social",
                "description": "Peak season for enjoying Delft's many canal-side and square terraces (Markt, Beestenmarkt). Relax with drinks or a meal outdoors.",
                "indoor": false,
                "best_time": "Afternoon/Evening",
                "price_range": "Varies",
                "seasonal_notes": "Long summer evenings make terrace hopping popular. Beestenmarkt is particularly lively.",
                "booking_tips": "Reservations recommended for dinner, especially on popular terraces."
            },
            {
                "name": "Day Trip to Scheveningen Beach",
                "type": "Day Trip/Recreation",
                "description": "Take the tram (Line 1) directly from Delft to The Hague's famous beach resort, Scheveningen, for sunbathing, swimming, beach bars, and the pier.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Budget (transport) to Moderate (activities/food)",
                "seasonal_notes": "Best on warm, sunny days. Can be very busy during heatwaves.",
                "booking_tips": "Buy a day ticket for the tram. Allow ample travel time on peak days."
            },
            {
                "name": "Explore Delftse Hout",
                "type": "Recreation/Nature",
                "description": "Visit the large recreational park just outside the city center for walking, cycling, swimming (in the lake), and picnicking.",
                "indoor": false,
                "best_time": "Daytime",
                "price_range": "Free",
                "seasonal_notes": "Popular local spot for outdoor activities in summer.",
                "booking_tips": "Easily reachable by bike. Check water quality notices before swimming."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Cultural Season Opening",
                "type": "Arts/Culture",
                "description": "Theatres (e.g., Theater de Veste) and music venues launch their new season programs with diverse performances.",
                "indoor": true,
                "best_time": "Evenings (check schedules)",
                "price_range": "Moderate to High",
                "seasonal_notes": "September marks the start of the main cultural season.",
                "booking_tips": "Check venue websites for programs and book tickets in advance for popular shows."
            },
            {
                "name": "Bokbier Season",
                "type": "Food & Drink",
                "description": "Sample seasonal 'Herfstbok' (autumn bock beer) in Delft's traditional pubs and specialty beer bars like De Klomp or Locus Publicus.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Bokbier becomes widely available from late September/October. Many bars have special Bokbier events.",
                "booking_tips": "Ask bartenders for recommendations. Some bars offer tasting flights."
            },
            {
                "name": "Cozy Pub Visits ('Bruin Cafés')",
                "type": "Social/Food & Drink",
                "description": "Enjoy the warm, traditional atmosphere of Delft's 'brown cafes' (historic pubs) on cooler autumn evenings.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget to Moderate",
                "seasonal_notes": "Perfect time to experience the cozy 'gezelligheid' of Dutch pubs.",
                "booking_tips": "Generally no reservations needed for drinks. Try local snacks ('borrelhapjes')."
            },
            {
                "name": "Museum Visits",
                "type": "Culture/History",
                "description": "Explore Delft's museums like the Prinsenhof, Vermeer Centrum, or Royal Delft factory on cooler or rainy autumn days.",
                "indoor": true,
                "best_time": "Daytime",
                "price_range": "Moderate",
                "seasonal_notes": "Museums are often less crowded than in peak summer season.",
                "booking_tips": "Check opening hours. Online booking can sometimes offer discounts or skip lines."
            },
            {
                "name": "TU Delft Campus Exploration",
                "type": "Architecture/Education",
                "description": "Explore the university campus with its striking modern architecture as the academic year gets underway.",
                "indoor": false,
                "best_time": "Weekdays (Daytime)",
                "price_range": "Free (to explore grounds)",
                "seasonal_notes": "Campus is active with students and researchers. Autumn foliage adds color.",
                "booking_tips": "Take a walk or cycle around. Check for any public lectures or events."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Lichtjesavond (Light Evening)",
                "type": "Festival/Community Event",
                "description": "Delft's beloved winter event where thousands of lights illuminate the city center, Christmas trees are lit, and there's music, market stalls, and festive cheer.",
                "indoor": false,
                "best_time": "One Evening in mid-December (check date)",
                "price_range": "Free",
                "seasonal_notes": "A major highlight of Delft's winter calendar. Expect very large crowds.",
                "booking_tips": "Arrive early. Use public transport as city center access is restricted. Dress warmly."
            },
            {
                "name": "Sinterklaas Arrival (Intocht)",
                "type": "Traditional/Family Event",
                "description": "Experience the Dutch tradition as Sinterklaas (St. Nicholas) arrives in Delft by boat, followed by a parade through the city.",
                "indoor": false,
                "best_time": "One Saturday Morning in mid-November",
                "price_range": "Free",
                "seasonal_notes": "A festive event, especially for children, marking the start of the Sinterklaas season leading up to Dec 5th.",
                "booking_tips": "Check the official route and timings. Arrive early for a good viewing spot along the canals or parade route."
            },
            {
                "name": "Christmas Markets & Shopping",
                "type": "Market/Shopping",
                "description": "Browse festive stalls selling gifts, food, and glühwein (mulled wine) at smaller Christmas markets and enjoy holiday shopping in the decorated city center.",
                "indoor": false,
                "best_time": "Weekends/Evenings in December",
                "price_range": "Free entry (purchases vary)",
                "seasonal_notes": "Markets often pop up on specific weekends. Shops have extended hours leading up to Christmas.",
                "booking_tips": "Check local listings for specific market dates and locations."
            },
            {
                "name": "Ice Skating (Potential)",
                "type": "Recreation",
                "description": "Sometimes a temporary ice skating rink is set up, often on the Markt square or near the station, during the winter months.",
                "indoor": false,
                "best_time": "Daytime/Evening",
                "price_range": "Budget to Moderate (incl. skate rental)",
                "seasonal_notes": "Availability varies year to year; check local announcements closer to winter.",
                "booking_tips": "If available, skate rental is usually offered onsite."
            },
            {
                "name": "Oliebollen & Winter Treats",
                "type": "Food & Drink",
                "description": "Sample traditional Dutch winter treats like 'oliebollen' (doughnuts) and 'appelflappen' (apple fritters) from street stalls, especially around New Year.",
                "indoor": false,
                "best_time": "December/January",
                "price_range": "Budget",
                "seasonal_notes": "Oliebollen stalls ('oliebollenkramen') appear throughout the city in late autumn/winter.",
                "booking_tips": "Look for stalls near shopping areas or markets. Best enjoyed warm!"
            }
        ]
    }
} 