{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "New Year's Day (Lá Cinn Bliana)",
          "notes": "New Year's Day is a public holiday throughout Ireland. Most attractions, shops, and restaurants in Limerick city are closed or operate with limited hours. The city is quiet as residents recover from New Year's Eve celebrations. St. Mary's Cathedral and most museums typically reopen on January 2nd."
        },
        {
          "days": [2, 3, 4, 5, 6],
          "score": 3,
          "notes": "Post-holiday atmosphere with winter sales beginning in shops throughout Limerick, particularly on O'Connell Street, William Street, and in shopping centers like the Crescent Shopping Centre. Christmas decorations gradually come down. The city's cozy traditional pubs offer warm refuge from winter weather."
        },
        {
          "days": [7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 3,
          "notes": "January is the off-season with few tourists and excellent hotel value. Cool winter weather with potential for rain and Atlantic winds. Limited daylight hours. Winter sales continue throughout January in the main shopping district. The Hunt Museum and University of Limerick campus offer excellent indoor experiences during this quiet season. Traditional music sessions in pubs provide warm respite from winter conditions."
        }
      ],
      "weatherHighC": 8,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 3,
          "special": true,
          "event": "Limerick Literary Festival (in honor of Kate O'Brien)",
          "notes": "The Limerick Literary Festival, honoring novelist Kate O'Brien, takes place in early February with readings, discussions, and workshops featuring renowned writers. Events are held in venues across the city including the Belltable Arts Centre and The Hunt Museum."
        },
        {
          "days": [11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
          "score": 3,
          "special": true,
          "event": "Mid-Term Break",
          "notes": "Irish school mid-term break typically falls in February. Family-friendly activities are available at Limerick's museums and cultural institutions. The Hunt Museum and King John's Castle often feature special exhibitions and activities for children."
        },
        {
          "days": [23, 24, 25, 26, 27, 28, 29],
          "score": 4,
          "notes": "Late February begins to show early signs of spring in Limerick. Planning for St. Patrick's Day events begins around the city. Cultural venues like the Lime Tree Theatre and the Belltable offer winter programming. Traditional music sessions in Dolan's and other venues provide authentic evening entertainment."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 3,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16],
          "score": 4,
          "notes": "Early spring brings gradually warming temperatures and longer days. The city begins to prepare for St. Patrick's Day celebrations. University of Limerick's campus becomes particularly attractive as spring blooms appear. The cultural calendar becomes more active with various events across the city."
        },
        {
          "days": [17],
          "score": 5,
          "special": true,
          "event": "St. Patrick's Day (Lá Fhéile Pádraig)",
          "notes": "Limerick's St. Patrick's Festival features a large parade through the city center with thousands of participants. The day is a national holiday with businesses closed, but pubs, restaurants, and entertainment venues are bustling. The parade route typically runs through O'Connell Street and the city center, with various performances, music, and cultural events surrounding the festival. Limerick is known for a family-friendly St. Patrick's Day celebration with strong marching band participation."
        },
        {
          "days": [18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Spring begins (Tús an Earraigh)",
          "notes": "Spring officially begins, bringing early blooms to People's Park and the grounds of the University of Limerick. Perfect time for exploring the Medieval Quarter and Georgian district as café life begins to move outdoors on warmer days. Easter markets appear if Easter falls in late March."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 4,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 5,
          "special": true,
          "event": "Easter (Cáisc)",
          "notes": "Easter celebrations typically fall in April, with Good Friday, Easter Sunday, and Easter Monday as public holidays. Special Easter markets and events operate in Limerick in the week before Easter. Spring blooms peak throughout the city's parks and along the River Shannon walkways. Outdoor cafés on Thomas Street and Catherine Street become increasingly popular."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Mid-to-late April brings reliable spring weather to Limerick. Perfect time for exploring the city's Medieval Quarter, Georgian district, and green spaces like People's Park. The Hunt Museum and Limerick City Gallery of Art offer excellent cultural experiences. River Shannon cruises begin to operate more regularly as weather improves. The Milk Market becomes especially vibrant on Saturdays with seasonal local produce."
        }
      ],
      "weatherHighC": 12,
      "weatherLowC": 5,
      "tourismLevel": 5
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 4,
          "special": true,
          "event": "May Day/Labour Day (Lá Bealtaine)",
          "notes": "May Day is marked with some events in Limerick city. Many businesses are closed for the public holiday, but museums and cultural attractions remain open. Traditional celebrations of Bealtaine (the Celtic festival marking the beginning of summer) may take place at heritage sites in County Limerick."
        },
        {
          "days": [2, 3, 4, 5],
          "score": 5,
          "special": true,
          "event": "May Bank Holiday Weekend & Riverfest",
          "notes": "The first Monday in May is a bank holiday in Ireland. This long weekend features Limerick's Riverfest, the city's biggest festival celebrating the Shannon River with boat races, water sports, markets, and fireworks. Activities center around Arthur's Quay Park, Clancy Strand, and the city center."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "notes": "May brings perfect spring weather with longer days (approximately 16 hours of daylight). The outdoor café scene in the Georgian Quarter is in full swing. The riverside walks along Clancy Strand and O'Callaghan Strand become popular evening spots. Tourism begins to increase but the city isn't yet at peak season crowds. The Great Limerick Run typically takes place in May, bringing athletic participants from across Ireland and beyond."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 7,
      "tourismLevel": 6
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3],
          "score": 5,
          "special": true,
          "event": "June Bank Holiday Weekend",
          "notes": "The first Monday in June is a bank holiday in Ireland. Various festivals and events take place in Limerick and the surrounding region during this weekend. The Limerick Food Festival often coincides with this weekend, celebrating local producers and culinary traditions."
        },
        {
          "days": [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Early summer brings warm weather and extended daylight hours to Limerick. Tourism increases but the city remains less crowded than July and August. Perfect time for exploring both the city and daytrips to the Burren, Bunratty Castle, and Adare village. The summer solstice brings the longest days of the year with approximately 17 hours of daylight. Riverside activities along the Shannon increase, with kayaking and boat tours becoming regular offerings."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "High summer with warmer temperatures and long daylight hours. Irish school holidays are in full swing, increasing family tourism. Excellent time for visits to Lough Gur, Adare Manor, and Ballyhoura Mountain Biking Trails. Clare Glens Waterfall Walk becomes particularly pleasant in the summer weather. The city's outdoor dining scene is at its most vibrant in the Georgian Quarter and along Thomas Street. Munster Rugby's pre-season training begins to generate interest among local sports fans."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5],
          "score": 4,
          "special": true,
          "event": "August Bank Holiday Weekend",
          "notes": "The first Monday in August is a bank holiday in Ireland. This long weekend often features festivals and events in Limerick city and throughout the county. The Limerick Pride Festival typically takes place in early August with a parade through the city center and various cultural events."
        },
        {
          "days": [6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "High summer with typically warm, pleasant weather continues. Peak tourism season with visitors from Ireland and abroad. King John's Castle and the Hunt Museum are particularly popular attractions. The Limerick Milk Market is bustling with locally sourced summer produce every Saturday. Tourism begins to decrease slightly toward the end of the month as Irish schools prepare to return. Visitors can enjoy boat trips on the River Shannon, kayaking experiences, and walks along the Three Bridges route."
        }
      ],
      "weatherHighC": 19,
      "weatherLowC": 12,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "notes": "Perfect late summer weather for outdoor activities and exploring the city without the peak season crowds. Tourism begins to decrease as Irish schools are back in session, making it an excellent time to visit with good weather but fewer crowds. University of Limerick and Mary Immaculate College welcome back students, bringing a renewed energy to the city. Riverside walks along the Shannon remain popular in the mild weather."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Limerick Culture Night & Limerick Jazz Festival",
          "notes": "September brings Culture Night to Limerick (a nationwide celebration of arts and culture with free events across the city). The Limerick Jazz Festival takes place in late September, featuring international and Irish jazz musicians performing in venues throughout the city. The rugby season begins, with Munster Rugby home games at Thomond Park creating a vibrant atmosphere on match days."
        }
      ],
      "weatherHighC": 17,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
          "score": 4,
          "special": true,
          "event": "Richard Harris International Film Festival & Pigtown Food Series",
          "notes": "The Richard Harris International Film Festival celebrates the Limerick-born actor with screenings, workshops, and events across the city. The Pigtown Food Series continues throughout October, celebrating Limerick's culinary heritage with special menus, food tours, and events. Autumn weather brings cooler temperatures to Limerick, but remains pleasant for city exploration. Perfect time for visiting indoor attractions like the Hunt Museum, St. Mary's Cathedral, and the Limerick City Gallery of Art. The University of Limerick campus displays beautiful autumn colors. Good month for experiencing Limerick's cozy pub culture with traditional music sessions at Dolan's and other venues."
        },
        {
          "days": [26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "October Bank Holiday Weekend",
          "notes": "The October bank holiday weekend (last weekend of October) often features special events throughout Limerick. The surrounding countryside is particularly beautiful with autumn colors. The Limerick Halloween Carnival typically takes place around this time, with family-friendly events throughout the city."
        },
        {
          "days": [31],
          "score": 5,
          "special": true,
          "event": "Halloween (Oíche Shamhna)",
          "notes": "Halloween is celebrated with the Samhain parade and festivities in Limerick city center. Family-friendly Halloween events take place in People's Park and other locations throughout the city. The ancient Celtic festival of Samhain is marked with traditional activities and contemporary celebrations."
        }
      ],
      "weatherHighC": 13,
      "weatherLowC": 8,
      "tourismLevel": 5
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
          "score": 3,
          "notes": "Full autumn with cooler, often rainy weather and Shannon River mists possible. Excellent time for museum visits and indoor cultural activities. The Limerick Milk Market becomes particularly appealing with seasonal produce on weekends. Traditional pubs with open fires offer cozy retreats from the weather. Dolan's and Nancy Blake's host some of the best traditional music sessions during this quieter tourism period. Munster Rugby matches at Thomond Park provide exciting sporting events. The city begins early preparations for the Christmas season."
        },
        {
          "days": [25, 26, 27, 28, 29, 30],
          "score": 4,
          "special": true,
          "event": "Christmas Season Begins",
          "notes": "Limerick's Christmas celebrations begin in late November with the lighting of the city's Christmas lights. The Limerick Christmas Market opens in Bedford Row and Thomas Street, featuring craft stalls, food vendors, and seasonal activities. Christmas shopping begins in earnest on O'Connell Street, Cruises Street, and in the city's shopping centers like the Crescent Shopping Centre and Arthur's Quay."
        }
      ],
      "weatherHighC": 10,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23],
          "score": 5,
          "special": true,
          "event": "Limerick Christmas Market",
          "notes": "The Limerick Christmas Market runs from late November until December 23rd. Bedford Row and Thomas Street host festive market stalls, Santa's Grotto, and seasonal activities. The city center is beautifully decorated with Christmas lights. O'Connell Street and Cruises Street are bustling with Christmas shoppers. Traditional music sessions take on a festive character in the city's historic pubs. The Lime Tree Theatre and University Concert Hall offer seasonal performances and Christmas concerts."
        },
        {
          "days": [24],
          "score": 3,
          "special": true,
          "event": "Christmas Eve (Oíche Nollag)",
          "notes": "Christmas Eve is an important celebration day for most Irish families. Most businesses close by early afternoon. The Christmas Market ends. St. Mary's Cathedral and other churches hold special services. Restaurants that remain open often require advance reservations for special Christmas Eve dinners."
        },
        {
          "days": [25, 26],
          "score": 3,
          "special": true,
          "event": "Christmas Day & St. Stephen's Day",
          "notes": "December 25 (Christmas Day) and December 26 (St. Stephen's Day) are both public holidays. Most businesses, restaurants, and attractions are closed or operate with limited hours. The traditional Christmas Day walk along the Three Bridges route is popular with locals despite the winter weather."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year is typically quiet but with a festive atmosphere. Major museums and some attractions reopen. Good time for winter sales shopping along O'Connell Street and in the Crescent Shopping Centre. Traditional music sessions continue in Dolan's and other music venues."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Oíche Chinn Bliana)",
          "notes": "New Year's Eve celebrations center around Limerick city center with midnight countdown events at King John's Castle or Arthur's Quay Park. Many restaurants offer special fixed-price New Year's Eve menus (advance reservation essential), and hotels host celebration events. Pubs and clubs throughout the Georgian Quarter offer special New Year's parties. The historic Medieval Quarter provides a spectacular backdrop for festivities."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 4,
      "tourismLevel": 6
    }
  },
  "activityTypes": {
    "spring": [
      "Limerick St. Patrick's Festival Parade (March)",
      "Limerick Literary Festival (February)",
      "Riverfest celebrations (May Bank Holiday)",
      "University of Limerick Campus Gardens Spring Blooms (March through May)",
      "St. Mary's Cathedral Tours",
      "Lough Gur Heritage Centre seasonal events",
      "King John's Castle historical tours",
      "Outdoor café culture begins in the Georgian Quarter"
    ],
    "summer": [
      "Limerick International Food Festival (July)",
      "Limerick Pride Festival (August)",
      "Kayaking on the River Shannon",
      "The Great Limerick Run (May/June)",
      "Adare Manor and Village exploration",
      "Clare Glens Waterfall Walks",
      "Day trips to Bunratty Castle and Folk Park",
      "Evening walks along the Three Bridges route"
    ],
    "autumn": [
      "Richard Harris International Film Festival (October)",
      "Limerick Jazz Festival (September)",
      "Pigtown Food Series (September-October)",
      "Autumn Colors at University of Limerick Campus",
      "Limerick Culture Night (September)",
      "Traditional Music Sessions at Dolan's Pub",
      "Ballyhoura Mountain Biking in autumn colors",
      "Munster Rugby matches at Thomond Park"
    ],
    "winter": [
      "Limerick Christmas Market (late November to December 23)",
      "Christmas lights throughout the Georgian Quarter",
      "New Year's Eve Celebration in King John's Castle",
      "Winter Shopping on O'Connell Street",
      "The Milk Market Winter Food Experience",
      "Three Bridges Christmas Day Walk",
      "Cozy pub culture in traditional Limerick establishments",
      "Lime Tree Theatre winter performances"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism (or cool, wet winter days)",
    "2": "Below Average: Less ideal conditions, possibly unpleasant weather or very low/high tourism (business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, overcrowded or very limited activities"
  }
}