{
    "Spring": {
        "activities": [
            {
                "name": "Limerick St. Patrick's Festival",
                "type": "Festival",
                "description": "Experience Ireland's national celebration with Limerick's vibrant parade, street performances, music events, and family activities throughout the city center, known for its strong community participation and marching bands.",
                "indoor": false,
                "best_time": "March 17th and surrounding days",
                "price_range": "Free",
                "seasonal_notes": "One of Ireland's most important cultural celebrations, with Limerick hosting a particularly family-friendly and inclusive festival that brings the entire city together.",
                "booking_tips": "No booking required for the parade, but arrive early for good viewing spots along O'Connell Street and around the reviewing stand. Check the festival program for any ticketed events."
            },
            {
                "name": "Limerick Literary Festival (In Honor of Kate O'Brien)",
                "type": "Literary Festival",
                "description": "Immerse yourself in this distinguished literary event celebrating Limerick-born novelist Kate O'Brien, featuring readings, discussions, and workshops with acclaimed Irish and international writers in venues throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held annually in February/early spring, this festival honors Limerick's rich literary heritage and brings leading literary figures to historic venues across the city.",
                "booking_tips": "Purchase tickets online in advance for popular author events. Festival passes available for dedicated literature enthusiasts. The Limerick City Library often serves as a festival hub."
            },
            {
                "name": "Lough Gur Heritage Centre",
                "type": "Heritage Site/Archaeological Area",
                "description": "Explore one of Ireland's most important archaeological sites centered around a picturesque lake, featuring stone circles, megalithic tombs, and evidence of continuous human settlement spanning over 6,000 years of Irish history.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings vibrant greenery to this ancient landscape, with wildflowers emerging around the lake and surrounding archaeological sites. Easter often features special heritage events.",
                "booking_tips": "Located approximately 20km from Limerick city. No advance booking required but check website for special spring events that may need reservation. The visitor center provides context for the numerous prehistoric sites."
            },
            {
                "name": "Ballyhoura Mountain Biking Trails",
                "type": "Outdoor Adventure",
                "description": "Experience Ireland's largest network of mountain biking trails in the Ballyhoura Mountains, featuring over 90km of trails through stunning forests and mountainsides with routes suitable for all experience levels.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (bike rental extra)",
                "seasonal_notes": "Spring offers excellent riding conditions with firm trails after winter, emerging foliage, and comfortable temperatures for active outdoor pursuits.",
                "booking_tips": "No booking required for trail access, but bike rentals should be reserved in advance from Trailriders Mountain Bike Centre. Located approximately 40km from Limerick city near Ardpatrick."
            },
            {
                "name": "Limerick Riverfest",
                "type": "City Festival",
                "description": "Celebrate Limerick's connection to the River Shannon with this May Bank Holiday weekend festival featuring boat races, water sports demonstrations, riverside markets, street performances, and fireworks displays.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free (some activities extra)",
                "seasonal_notes": "Held in early May, this festival marks the beginning of Limerick's summer season with activities along the Shannon riverfront and throughout the city center.",
                "booking_tips": "No booking required for general festival access. Some water activities and special events may require advance registration. The Great Limerick Run often coincides with this festival weekend."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "King John's Castle Experience",
                "type": "Historical Attraction",
                "description": "Explore this impressive 13th-century castle on the banks of the Shannon with interactive exhibitions bringing medieval Limerick to life, including costumed characters, archaeological displays, and panoramic views from the towers.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the best conditions for exploring both the indoor exhibitions and outdoor castle grounds, with special historical reenactments often scheduled during peak tourist season.",
                "booking_tips": "Book tickets online to avoid queues during peak summer months. Allow at least 2 hours for the full experience. Audio guides available in multiple languages."
            },
            {
                "name": "Limerick International Food Festival",
                "type": "Food Festival",
                "description": "Discover Limerick's diverse culinary culture at this festival celebrating international and Irish cuisine, with food stalls, cooking demonstrations, tastings, and cultural performances throughout the city center.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free entry (food purchases extra)",
                "seasonal_notes": "Held in summer, this vibrant festival brings together Limerick's multicultural communities through food, highlighting the city's growing reputation as a culinary destination.",
                "booking_tips": "No booking required for general access. Special chef demonstrations may require advance registration. The Milk Market area often serves as the festival's focal point."
            },
            {
                "name": "Adare Manor and Village",
                "type": "Historic Estate/Village",
                "description": "Visit one of Ireland's most picturesque villages centered around the magnificent Adare Manor, featuring thatched cottages, medieval churches, heritage center, and beautiful riverside walks through manicured grounds.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (manor tours extra)",
                "seasonal_notes": "Summer brings Adare's gardens and thatched cottages to their most photogenic state, with pleasant temperatures for exploring the village and surrounding parkland.",
                "booking_tips": "Located 15km from Limerick city. The manor house requires advance booking for tours or dining. The village itself can be explored freely. Arrive early to avoid coach tour crowds."
            },
            {
                "name": "Limerick Civic Trust Walking Tours",
                "type": "Guided Historical Tour",
                "description": "Discover Limerick's rich history with expert-guided walking tours covering the medieval quarter, Georgian neighborhood, and significant landmarks, providing insights into the city's 1000+ years of development.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer offers the most comfortable conditions for walking tours, with extended daylight hours and generally pleasant weather for exploring the city's outdoor landmarks.",
                "booking_tips": "Book online or through the Limerick Tourist Office. Tours typically last 2 hours and depart from the Hunt Museum. Private group tours can be arranged for specific historical interests."
            },
            {
                "name": "Kayaking on the River Shannon",
                "type": "Water Activity",
                "description": "Experience Limerick from a unique perspective by kayaking on the River Shannon, with guided tours passing historic landmarks including King John's Castle, Thomond Bridge, and the Treaty Stone.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer provides ideal conditions for water activities on the Shannon, with warm temperatures and generally calmer water conditions, particularly in the morning hours.",
                "booking_tips": "Book in advance with Nevsail Watersports or Limerick Adventures. No experience necessary for guided tours. Suitable for adults and children over 12. All equipment provided."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Richard Harris International Film Festival",
                "type": "Film Festival",
                "description": "Celebrate the legacy of Limerick-born actor Richard Harris at this international film festival featuring new films, retrospectives, acting workshops, and industry events across multiple venues in the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Held in late October, this growing festival brings filmmakers and cinema enthusiasts to Limerick during the autumn season, with a focus on Irish film and international connections.",
                "booking_tips": "Book tickets online in advance for screenings and events. Festival passes available for dedicated film enthusiasts. The Belltable and Lime Tree Theatre serve as primary festival venues."
            },
            {
                "name": "Limerick Jazz Festival",
                "type": "Music Festival",
                "description": "Experience world-class jazz performances in intimate venues throughout Limerick city, featuring international stars alongside Irish jazz talent and educational workshops in a variety of musical styles.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Held in September, this festival brings vibrant jazz performances to Limerick's historic venues and creates a sophisticated cultural atmosphere during the early autumn season.",
                "booking_tips": "Book tickets in advance for headline acts as venues have limited capacity. Festival packages available. The Dolan's Warehouse and Belltable Arts Centre are key performance spaces."
            },
            {
                "name": "Ballyhoura Country Autumn Experience",
                "type": "Nature/Rural Tourism",
                "description": "Explore the stunning autumn landscapes of the Ballyhoura region with walking trails, foraging experiences, and rural heritage sites showcasing the golden colors of the mountain forests and countryside.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free (guided activities extra)",
                "seasonal_notes": "Autumn brings spectacular colors to the Ballyhoura forests and mountains, with pleasant hiking temperatures and seasonal wild foods like blackberries and mushrooms available for foraging.",
                "booking_tips": "Self-guided walking trails are freely accessible. Book guided foraging or heritage experiences through the Ballyhoura Rural Development office. Located approximately 35km from Limerick city."
            },
            {
                "name": "Clare Glens Waterfall Walk",
                "type": "Nature Trail",
                "description": "Discover this hidden gem on the Limerick-Tipperary border featuring a spectacular river gorge with cascading waterfalls, ancient woodland, and stunning autumn foliage along a circular walking route.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings vibrant colors to this woodland gorge, with increased water flow in the falls after seasonal rains and fewer visitors than summer months.",
                "booking_tips": "No booking required. Located near Murroe, approximately 20km from Limerick city. The 2km looped walk includes some steep and potentially slippery sections, so appropriate footwear is essential."
            },
            {
                "name": "Pigtown Food Series",
                "type": "Food Festival",
                "description": "Celebrate Limerick's food culture and pigmeat traditions at this annual culinary festival featuring special restaurant menus, food tours, cooking demonstrations, and producer events throughout the city.",
                "indoor": true,
                "best_time": "Varies by event",
                "price_range": "Varies",
                "seasonal_notes": "Running through September and October, this festival highlights Limerick's historic connection to bacon production and showcases contemporary local food producers and chefs.",
                "booking_tips": "Book specific events online through the Pigtown Limerick website. Restaurant special menus may require reservation. The Milk Market hosts many of the festival's showcase events on weekends."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Limerick Christmas Market",
                "type": "Festival/Market",
                "description": "Experience the magic of Limerick at Christmas with festive markets in Bedford Row and Thomas Street featuring craft stalls, food vendors, carol singers, and Santa's grotto, all illuminated by seasonal light displays.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free entry (purchases extra)",
                "seasonal_notes": "Running from late November through December, this market transforms Limerick's city center into a festive wonderland with a distinctly local Irish Christmas atmosphere.",
                "booking_tips": "No booking required for general access. Santa visits may require advance booking. Weekends are busiest, with Thursday and Friday evenings offering a more relaxed experience with full atmosphere."
            },
            {
                "name": "Traditional Music Sessions at Dolan's Pub",
                "type": "Music/Cultural",
                "description": "Warm up with authentic Irish traditional music sessions at this legendary Limerick music venue, where local musicians gather to play in an intimate, convivial atmosphere that defines Irish winter culture.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free (cost of drinks)",
                "seasonal_notes": "Winter is ideal for experiencing the cozy atmosphere of traditional Irish sessions, with Dolan's Pub hosting regular music nights that attract both established musicians and emerging talent.",
                "booking_tips": "No booking required for regular sessions. Arrive early (around 9pm) to get seating close to musicians. Check Dolan's website for ticketed performances in their larger warehouse venue."
            },
            {
                "name": "Hunt Museum Winter Exhibitions",
                "type": "Museum/Cultural",
                "description": "Explore one of Ireland's greatest private collections of art and antiquities housed in Limerick's former Custom House, featuring medieval, renaissance and modern pieces alongside special winter exhibitions.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter brings special exhibitions and events to this fascinating museum, offering a cultural haven during the cold months with an excellent café overlooking the River Shannon.",
                "booking_tips": "No booking required for general admission. Guided tours available at scheduled times with online booking recommended. Located in a beautiful Georgian building on Rutland Street."
            },
            {
                "name": "Munster Rugby Match at Thomond Park",
                "type": "Sporting Event",
                "description": "Experience the legendary atmosphere of Thomond Park Stadium during a Munster Rugby match, where passionate local supporters create one of the most respected sporting environments in European rugby.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate to Expensive",
                "seasonal_notes": "Winter comprises the height of the rugby season, with European Champions Cup matches creating particularly electric atmospheres during December and January fixtures.",
                "booking_tips": "Book tickets well in advance through the Munster Rugby website, especially for European fixtures and matches against Irish rivals. The stadium is approximately 1.5km from the city center."
            },
            {
                "name": "Lime Tree Theatre Winter Program",
                "type": "Performing Arts",
                "description": "Enjoy high-quality theater, music, and comedy at Limerick's premier performance venue on the Mary Immaculate College campus, with a winter program featuring both local productions and touring shows.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter season typically includes festive productions, classical music concerts, and family entertainment perfect for the darker months in Limerick's most comfortable theater space.",
                "booking_tips": "Book tickets online through the Lime Tree Theatre website. The 510-seat theater provides excellent viewing from all areas. Located on the Mary Immaculate College campus, approximately 1km from the city center."
            }
        ]
    }
}