{
    "Spring": {
        "activities": [
            {
                "name": "Geneva International Motor Show (GIMS)",
                "type": "Exhibition/Trade Show",
                "description": "Historically one of the world's leading motor shows held at Palexpo. Features premieres of new cars, concept vehicles, and automotive technology. (Note: Event frequency and format have varied in recent years, check official GIMS website for current status).",
                "indoor": true,
                "best_time": "Usually early March (Check specific dates if event is confirmed)",
                "price_range": "Moderate-High (Tickets)",
                "seasonal_notes": "Major international event attracting large crowds if held. Check if the event is scheduled for the specific year.",
                "booking_tips": "If running, book tickets online in advance. Easily accessible via public transport to Palexpo (near airport)."
            },
            {
                "name": "Fête de la Tulipe (Tulip Festival) - Morges",
                "type": "Nature/Festival",
                "description": "While not in Geneva itself, the nearby town of Morges (accessible by train) hosts a stunning Tulip Festival in the Parc de l'Indépendance along Lake Geneva, featuring thousands of blooming tulips.",
                "indoor": false,
                "best_time": "April - Early May (Daytime)",
                "price_range": "Free (Park entry)/Budget (Train ticket)",
                "seasonal_notes": "A beautiful display of spring colors. Peak bloom varies depending on weather. Morges is a short train ride along the lake.",
                "booking_tips": "Check train schedules to Morges. Visit on a sunny weekday for fewer crowds. Combine with a walk along the Morges lakeside."
            },
            {
                "name": "Geneva Marathon",
                "type": "Sporting Event",
                "description": "Participate or spectate in the Geneva Marathon (Harmony Geneva Marathon for Unicef), which includes various race distances (marathon, half, 10k, etc.) through the city and lakeside.",
                "indoor": false,
                "best_time": "Early May (Specific date, morning)",
                "price_range": "Free (Spectating)/High (Participation fee)",
                "seasonal_notes": "Causes road closures in parts of the city. Lively atmosphere along the route.",
                "booking_tips": "Check the official marathon website for route, timings, and registration. Find a spot along the Left or Right Bank quays to cheer."
            },
            {
                "name": "Explore Botanical Gardens (Jardin Botanique)",
                "type": "Nature/Leisure",
                "description": "Visit Geneva's extensive Botanical Gardens as spring flowers and plants come into bloom. Explore the greenhouses, themed gardens, and enjoy the peaceful atmosphere near the lake.",
                "indoor": false,
                "best_time": "Daytime (April-May)",
                "price_range": "Free",
                "seasonal_notes": "A great place to see diverse plant life awakening after winter. Includes a small animal park section.",
                "booking_tips": "Easily accessible by bus. Allow ample time to wander through the different sections."
            },
            {
                "name": "Opening of Lakeside Terraces & Buvettes",
                "type": "Leisure/Social",
                "description": "Enjoy the warmer weather as cafes and 'buvettes' (small lakeside kiosks/cafes) open their terraces along Lake Geneva and the Rhône. Relax with a coffee or drink and enjoy the views.",
                "indoor": false,
                "best_time": "Daytime (Sunny days, from March/April onwards)",
                "price_range": "Free (Strolling)/Budget-Moderate (Cafe/Buvette)",
                "seasonal_notes": "Marks the beginning of the outdoor season. Popular spots include Place du Bourg-de-Four, Quai des Bergues, Eaux-Vives.",
                "booking_tips": "Find a spot with a view and enjoy the spring sunshine. Popular places fill up quickly."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Swimming in Lake Geneva",
                "type": "Leisure/Recreation",
                "description": "Cool off and relax at popular swimming spots like the iconic Bains des Pâquis (with diving boards, restaurant, sauna), Genève Plage (larger complex with pool, beach, slides), or various free access points and smaller beaches along the quays (e.g., Baby Plage).",
                "indoor": false,
                "best_time": "Daytime (June-August, warm sunny days)",
                "price_range": "Free (Some spots)/Budget (Bains des Pâquis entry)/Moderate (Genève Plage entry)",
                "seasonal_notes": "A quintessential Geneva summer activity. Water is clean and refreshing. Bains des Pâquis is a social hub.",
                "booking_tips": "Check opening hours and entry fees for paid locations. Arrive early on hot weekends. Be mindful of boat traffic outside designated swim zones."
            },
            {
                "name": "Fête de la Musique",
                "type": "Music Festival/Cultural Event",
                "description": "A city-wide celebration of music around the summer solstice. Features hundreds of free concerts of all genres (classical, rock, jazz, world music, electronic) on numerous outdoor stages and indoor venues across Geneva.",
                "indoor": false,
                "best_time": "Weekend around June 21st (check exact dates)",
                "price_range": "Free",
                "seasonal_notes": "Vibrant atmosphere throughout the city, especially in the Old Town, parks, and along the quays. Very popular.",
                "booking_tips": "Check the official program online for schedules and locations. Wander between stages to sample different music. Plan your route as it gets crowded."
            },
            {
                "name": "Bol d'Or Mirabaud Sailing Race",
                "type": "Sporting Event",
                "description": "Witness Europe's most important inland lake regatta. Hundreds of sailing boats race from Geneva to Le Bouveret and back. Watch the spectacular start from the lakeside.",
                "indoor": false,
                "best_time": "Mid-June (Specific weekend, start usually Saturday morning)",
                "price_range": "Free (Spectating from shore)",
                "seasonal_notes": "Impressive sight to see so many sails on the lake. Viewing is best from the Jetée des Pâquis, Jardin Anglais, or other lakeside vantage points.",
                "booking_tips": "Find a good viewing spot early for the start. Check the race website for timing and best vantage points."
            },
            {
                "name": "Musiques en été (Music in Summer)",
                "type": "Music Festival/Concerts",
                "description": "A series of concerts, many free, held throughout the summer, often featuring diverse musical styles (classical, jazz, world music) in beautiful outdoor settings like Parc La Grange (Ella Fitzgerald Stage).",
                "indoor": false,
                "best_time": "Evenings (July-August, check schedule)",
                "price_range": "Free (Many concerts)/Moderate (Some ticketed events)",
                "seasonal_notes": "Relaxed atmosphere, perfect for enjoying music on warm summer evenings.",
                "booking_tips": "Check the official 'Musiques en été' program for artists, locations, and timings. Arrive early for popular free concerts in parks to secure a good spot."
            },
            {
                "name": "Fêtes de Genève (Geneva Festival)",
                "type": "Festival/Fireworks",
                "description": "Geneva's major summer festival along the lakefront. Features food stalls, music stages, funfair rides, and culminates in a grand fireworks display over the lake, often set to music.",
                "indoor": false,
                "best_time": "Mid-August (check specific dates, fireworks usually on a Saturday night)",
                "price_range": "Free (Street access)/Moderate (Food/Rides)",
                "seasonal_notes": "Attracts very large crowds, especially for the fireworks. Lakeside areas are packed.",
                "booking_tips": "Check the festival schedule. Find a fireworks viewing spot (Jardin Anglais, Quai Gustave-Ador, Bains des Pâquis area) very early. Be prepared for crowds and plan transport."
            },
            {
                "name": "Open-Air Cinema (CinéTransat)",
                "type": "Entertainment/Cinema",
                "description": "Enjoy free movie screenings under the stars at the Perle du Lac park, often with themed evenings, short films before the main feature, and a relaxed atmosphere where people bring picnics.",
                "indoor": false,
                "best_time": "Evenings (July-August, check schedule)",
                "price_range": "Free",
                "seasonal_notes": "Bring a blanket or chair. Screenings start after sunset. Food and drinks often available for purchase.",
                "booking_tips": "Check the CinéTransat program online. Arrive early to get a good spot, especially for popular films. Dress in layers."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "La Bâtie-Festival de Genève",
                "type": "Performing Arts Festival",
                "description": "A multidisciplinary contemporary arts festival featuring music, theatre, dance, and performances in various venues across Geneva and surrounding areas.",
                "indoor": true,
                "best_time": "Late August - Mid-September (Check exact dates)",
                "price_range": "Moderate-High (Per performance ticket)",
                "seasonal_notes": "Kicks off the autumn cultural season with cutting-edge performances.",
                "booking_tips": "Check the festival program online and book tickets for desired events in advance as venues vary in size."
            },
            {
                "name": "Explore Carouge Boutiques & Market",
                "type": "Shopping/Leisure",
                "description": "Wander through the charming streets of Carouge, browsing its unique artisan boutiques, designer shops, and enjoying the atmosphere of the Place du Marché, especially during the Wednesday/Saturday market.",
                "indoor": false,
                "best_time": "Daytime (Market days Wed/Sat)",
                "price_range": "Free (Browsing)/Moderate-High (Purchases)",
                "seasonal_notes": "Pleasant atmosphere as the weather cools slightly. Good time to find unique gifts.",
                "booking_tips": "Take tram 12 or 18. Allow time to stroll and explore the side streets. Enjoy a coffee at a terrace cafe on Place du Marché."
            },
            {
                "name": "Geneva Wine Region ('Caves Ouvertes')",
                "type": "Food & Drink/Excursion",
                "description": "Explore the Geneva countryside vineyards (Mandement region). Some wineries might hold 'Caves Ouvertes' (Open Cellar) events allowing tastings, or arrange visits independently to sample local wines like Chasselas.",
                "indoor": false,
                "best_time": "September-October (Check specific 'Caves Ouvertes' dates if applicable)",
                "price_range": "Budget-Moderate (Transport/Tasting fees)",
                "seasonal_notes": "Harvest season offers scenic vineyard views. Requires transport (bus, car, bike) outside the city center.",
                "booking_tips": "Check the Geneva Tourism website or local wine associations for 'Caves Ouvertes' dates or recommended wineries to visit. Book tastings in advance if required."
            },
            {
                "name": "Autumn Colors in Parks",
                "type": "Nature/Walking",
                "description": "Enjoy the fall foliage in Geneva's beautiful parks like Parc des Bastions (near Old Town), Parc La Grange, Parc des Eaux-Vives, or take a walk along the Rhône.",
                "indoor": false,
                "best_time": "Daytime (October-November)",
                "price_range": "Free",
                "seasonal_notes": "Crisp air and colorful leaves make for pleasant walks.",
                "booking_tips": "Combine a walk in Parc des Bastions with seeing the Reformation Wall. Parc La Grange offers lake views alongside the foliage."
            },
            {
                "name": "Visit Art & History Museums",
                "type": "Cultural/Historical",
                "description": "Explore Geneva's rich cultural offerings indoors. Visit the Musée d'Art et d'Histoire (Art and History Museum), Musée Rath for temporary exhibitions, or delve into watchmaking history at the Patek Philippe Museum.",
                "indoor": true,
                "best_time": "Anytime (check opening hours)",
                "price_range": "Free (Some permanent collections)/Moderate (Temporary exhibitions/Specific museums)",
                "seasonal_notes": "Ideal activity for cooler or wetter autumn days.",
                "booking_tips": "Check museum websites for current exhibitions and opening hours (many closed Mondays). Consider the Geneva Pass for potential discounts."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "L'Escalade Celebration",
                "type": "Cultural Festival/Tradition",
                "description": "Geneva's most important local festival, commemorating the defeat of Savoyard invaders in 1602. Features historical processions in costume (especially weekend closest to Dec 11/12), cannon fire, mulled wine, vegetable soup, and the tradition of smashing chocolate 'marmites' (cauldrons).",
                "indoor": false,
                "best_time": "Weekend closest to December 11/12 (Check exact dates)",
                "price_range": "Free (Street events)/Budget (Chocolate marmite/Soup)",
                "seasonal_notes": "Unique and deeply rooted Geneva tradition, especially vibrant in the Old Town. Expect crowds during processions.",
                "booking_tips": "Check the 'Compagnie de 1602' website for procession routes and times. Buy a chocolate marmite from a local chocolatier to participate in the smashing tradition."
            },
            {
                "name": "Christmas Markets (Marchés de Noël)",
                "type": "Shopping/Cultural/Festive",
                "description": "Enjoy the festive atmosphere at Geneva's Christmas markets. Key locations include the 'Noël au Jardin' market in the Jardin Anglais (with Ferris wheel, fondue chalet), and the charming market in Carouge.",
                "indoor": false,
                "best_time": "Late November - December 24th (Check specific dates/hours)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases/Food/Drinks)",
                "seasonal_notes": "Creates a festive buzz with lights, decorations, gifts, food stalls (vin chaud, crepes, raclette), and chalets.",
                "booking_tips": "Visit different markets for varied experiences. Dress warmly, especially for evenings. Jardin Anglais market is large and central, Carouge offers a more bohemian feel."
            },
            {
                "name": "Coupe de Noël (Christmas Cup)",
                "type": "Sporting Event/Tradition",
                "description": "Watch (or brave participants swim in) the traditional, chilly open-water swim race in Lake Geneva, held in December near the Jardin Anglais. Many swimmers wear festive costumes.",
                "indoor": false,
                "best_time": "Mid-December (Specific date, usually a Sunday morning)",
                "price_range": "Free (Spectating)",
                "seasonal_notes": "A quirky and popular spectator event, showcasing local hardiness and humor.",
                "booking_tips": "Find a spot along the quay in the Jardin Anglais to watch. Dress very warmly!"
            },
            {
                "name": "Ice Skating (Patinoires)",
                "type": "Sport/Recreation",
                "description": "Enjoy outdoor ice skating at seasonal rinks, often set up in locations like Parc des Bastions (near Old Town) or in Carouge.",
                "indoor": false,
                "best_time": "Daytime/Evening (Check opening hours, typically Nov/Dec - Feb)",
                "price_range": "Budget-Moderate (Entry + skate rental)",
                "seasonal_notes": "Fun festive activity for all ages. Check if rinks are open for the season.",
                "booking_tips": "Check opening times and locations for specific seasonal rinks. Wear warm gloves and clothing."
            },
            {
                "name": "Fondue Season",
                "type": "Food/Cultural Experience",
                "description": "Warm up with Switzerland's national dish. Enjoy cheese fondue (especially Moitié-Moitié) at traditional restaurants in the Old Town, Carouge, or the popular, casual Buvette des Bains des Pâquis.",
                "indoor": true,
                "best_time": "Evening (October-March)",
                "price_range": "Moderate-High",
                "seasonal_notes": "The quintessential Swiss winter meal experience.",
                "booking_tips": "Book tables at desired restaurants, especially popular spots like Café du Soleil or Les Armures, well in advance. Bains des Pâquis does not take reservations - expect queues."
            }
        ]
    }
}