{
  "months": {
    "january": {
      "name": "January",
      "ranges": [
        {
          "days": [1],
          "score": 2,
          "special": true,
          "event": "New Year's Day (Jour de l'An)",
          "notes": "New Year's Day is a public holiday throughout Switzerland. Most attractions and shops in Geneva operate with limited hours. The city is relatively quiet as residents recover from New Year's Eve celebrations. Cold temperatures averaging around 0°C (32°F) and short daylight hours characterize this period. Geneva often experiences snowfall and fog during January, though it's less common than in other parts of Switzerland due to the moderating effect of Lake Geneva."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 2,
          "notes": "January is typically cold in Geneva with temperatures between -1°C and 4°C (30°F to 39°F). This is the height of the low season for tourism, making it an excellent time to explore museums and cultural attractions without crowds. The International Balloon Festival in nearby Château-d'Oex (typically late January) attracts many day-trippers from Geneva, with colorful hot air balloons filling the skies over the Alps. Winter activities in the region include skiing in nearby French and Swiss Alps, ice skating at Patinoire des Bastions, and warming up in Geneva's excellent cafés and chocolate shops. The United Nations and international organizations continue to operate, making this a good time for those interested in visiting these institutions."
        }
      ],
      "weatherHighC": 4,
      "weatherLowC": -1,
      "tourismLevel": 2
    },
    "february": {
      "name": "February",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13],
          "score": 3,
          "notes": "February continues with winter conditions but sometimes features slightly milder days than January. Tourism remains low, making it an excellent time to enjoy indoor cultural attractions like the Museum of Art and History and the International Red Cross and Red Crescent Museum without crowds. Valentine's Day is celebrated with special menus at many of Geneva's fine restaurants. Alpine skiing remains excellent in nearby resorts, easily accessible as day trips from the city."
        },
        {
          "days": [14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
          "score": 3,
          "special": true,
          "event": "Antigel Festival",
          "notes": "The second half of February hosts the Antigel Festival, a unique multi-disciplinary event that transforms unusual spaces across Geneva into venues for music, dance, theater, and performance art. The festival takes place in locations like swimming pools, factories, and other non-traditional venues, bringing cultural life to diverse neighborhoods throughout the Geneva canton. This is one of the most innovative events in Geneva's cultural calendar and attracts both locals and visitors with its eclectic programming."
        }
      ],
      "weatherHighC": 6,
      "weatherLowC": -1,
      "tourismLevel": 3
    },
    "march": {
      "name": "March",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Geneva International Motor Show",
          "notes": "The first half of March typically features the prestigious Geneva International Motor Show (though it may be canceled in some years), one of the world's premier automotive exhibitions. Held at the Palexpo near the airport, the show attracts thousands of industry professionals, journalists, and car enthusiasts from around the world. During this period, hotels may be fully booked and prices higher than usual. Spring begins to emerge in Geneva with temperatures gradually rising and daylight hours increasing noticeably."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Watches & Wonders Geneva",
          "notes": "The latter half of March sees preparations for the prestigious Watches & Wonders Geneva (formerly SIHH), a major trade show for the luxury watch industry that typically begins in late March or early April. Spring flowers begin to bloom around Lake Geneva, and outdoor activities become more pleasant. The weather remains unpredictable, but warm days become increasingly common. Easter celebrations may occur in late March (date varies yearly), bringing special church services and festive markets."
        }
      ],
      "weatherHighC": 11,
      "weatherLowC": 2,
      "tourismLevel": 4
    },
    "april": {
      "name": "April",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7],
          "score": 4,
          "special": true,
          "event": "Watches & Wonders Geneva",
          "notes": "Early April is typically when Watches & Wonders Geneva (formerly SIHH) takes place, showcasing the newest creations from the world's premier watchmakers. This prestigious event attracts industry professionals, luxury retailers, and watch enthusiasts. Geneva buzzes with related events and exhibitions throughout the city during this period. Spring is now in full swing with trees and gardens blossoming throughout the city."
        },
        {
          "days": [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "notes": "Mid to late April brings increasingly pleasant weather with temperatures reaching the mid-teens Celsius. This is an excellent time to explore Geneva's parks as they burst into spring bloom. The Botanical Garden is particularly beautiful with its collection of spring flowers. Boat services on Lake Geneva increase in frequency as the weather improves. This shoulder season offers good value and fewer crowds than the summer months while still providing comfortable conditions for sightseeing. The lakefront becomes increasingly lively with locals and visitors enjoying the spring sunshine."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 5,
      "tourismLevel": 4
    },
    "may": {
      "name": "May",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Labor Day (Fête du Travail)",
          "notes": "May 1st is Labor Day and a public holiday in Geneva. Political demonstrations and parades take place in the city center. Many locals use this day to begin enjoying outdoor activities in earnest, gathering in parks and along the lakefront. Some businesses may be closed, but tourist attractions typically remain open."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 5,
          "special": true,
          "event": "Ascension Day & Geneva Marathon",
          "notes": "May brings reliably good weather to Geneva with average temperatures between 10°C and 20°C (50-68°F). The city's parks and lakeside areas become lively with outdoor activities. The Geneva Marathon typically takes place in early May, bringing thousands of runners to the city. Ascension Day (40 days after Easter) is a public holiday in Switzerland with special events. This is the beginning of the tourist season, but before the summer peak, making it an excellent time to visit with good weather and manageable crowds. Lake activities begin in earnest, with boat tours and water sports becoming popular options for visitors."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 10,
      "tourismLevel": 5
    },
    "june": {
      "name": "June",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
          "score": 5,
          "special": true,
          "event": "Pentecost & Geneva Triathlon",
          "notes": "Early to mid-June brings the beginning of summer weather to Geneva. Pentecost (Whit Monday) is a public holiday falling 50 days after Easter. The Geneva Triathlon takes place around Lake Geneva, attracting athletes from around the world. Outdoor dining becomes extremely popular along the lake and in the Old Town. Swimming in Lake Geneva becomes pleasant as water temperatures rise."
        },
        {
          "days": [21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Fête de la Musique",
          "notes": "The highlight of late June is the Fête de la Musique, Geneva's largest music festival, coinciding with the summer solstice. This free event transforms the entire city into a giant concert venue with hundreds of performances across all genres taking place in streets, parks, and plazas. Long daylight hours (up to 16 hours) and pleasant temperatures create a perfect atmosphere for this vibrant celebration. Summer tourism begins to increase significantly. Public beaches along Lake Geneva become very popular for swimming and sunbathing."
        }
      ],
      "weatherHighC": 24,
      "weatherLowC": 13,
      "tourismLevel": 7
    },
    "july": {
      "name": "July",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Lake Geneva Festival & Montreux Jazz Festival",
          "notes": "July is one of the warmest months in Geneva with temperatures averaging 25°C (77°F) but sometimes reaching 30°C (86°F) or higher. This is peak tourist season with visitors from around the world. The Lake Geneva Festival (Fêtes de Genève) begins in late July, transforming the waterfront with food stalls, concerts, and amusements. Many locals take their summer holidays in July, sometimes giving the city a slightly less authentic feel. The nearby Montreux Jazz Festival (early to mid-July) attracts many day-trippers from Geneva. Water activities are at their peak popularity, with public beaches like Bains des Pâquis filled with swimmers. Outdoor cinema events take place throughout the city. Preparations for Swiss National Day celebrations become visible toward the end of the month."
        }
      ],
      "weatherHighC": 26,
      "weatherLowC": 14,
      "tourismLevel": 9
    },
    "august": {
      "name": "August",
      "ranges": [
        {
          "days": [1],
          "score": 5,
          "special": true,
          "event": "Swiss National Day (Fête Nationale Suisse)",
          "notes": "August 1st is Swiss National Day, celebrating the founding of the Swiss Confederation in 1291. Geneva hosts numerous events including fireworks over the lake, traditional performances, and official ceremonies. Festivities take place in the Parc des Bastions and throughout the city. Most businesses close for the holiday, but tourist attractions remain open. This is one of the most festive days in the Swiss calendar."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "Lake Geneva Festival (Fêtes de Genève)",
          "notes": "The first half of August continues with the Lake Geneva Festival, the city's largest public event. The festival features concerts, a funfair, international food stalls, and culminates in a spectacular fireworks display over the lake (typically on the second Saturday of August). This massive event attracts up to a million visitors throughout its run. The weather remains warm and ideal for outdoor activities and swimming in the lake."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "notes": "Late August brings slightly cooler temperatures but still excellent conditions for exploring the city and enjoying outdoor activities. Tourism begins to decrease slightly from the July/early August peak, creating a good balance of lively atmosphere without extreme crowds. This is considered one of the best times to visit Geneva, with good weather and slightly fewer tourists than at peak times. Families with children begin to return home for the school year, making accommodations somewhat easier to find."
        }
      ],
      "weatherHighC": 25,
      "weatherLowC": 14,
      "tourismLevel": 8
    },
    "september": {
      "name": "September",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 5,
          "special": true,
          "event": "Grape Harvest & European Heritage Days",
          "notes": "September brings autumn to Geneva with pleasant temperatures around 20°C (68°F) and beautiful fall colors beginning to appear in parks and surrounding vineyards. This is grape harvest season in the region, with many wineries offering special events and tastings. Tourism decreases as European summer holidays end, making this an excellent time to visit with good weather and fewer crowds. The European Heritage Days (usually mid-September) provide access to many historical buildings and monuments not normally open to the public. Lake activities remain popular, with water temperatures still comfortable for swimming early in the month. This is widely considered one of the best months to visit Geneva with its golden light, comfortable temperatures, and authentic atmosphere as locals return to their routines after summer holidays."
        }
      ],
      "weatherHighC": 20,
      "weatherLowC": 10,
      "tourismLevel": 6
    },
    "october": {
      "name": "October",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31],
          "score": 4,
          "special": true,
          "event": "Autumn Cultural Season & Halloween",
          "notes": "October brings autumn colors to their peak in Geneva, with parks like Parc La Grange and the surroundings of Mont Salève showing stunning foliage. Temperatures cool significantly with averages around 6-15°C (43-59°F). Geneva's cultural season begins in earnest with theaters, concert halls, and opera presenting their new programs. Halloween celebrations grow increasingly popular in Geneva, with events both for children and adults throughout the city. Tourism continues to decrease, creating good opportunities for value accommodation and uncrowded attractions. Foggy mornings become more common, sometimes creating atmospheric views with the fog hanging over Lake Geneva. This is a good time for museum visits, with the Museum of Art and History and CERN particularly popular."
        }
      ],
      "weatherHighC": 15,
      "weatherLowC": 6,
      "tourismLevel": 4
    },
    "november": {
      "name": "November",
      "ranges": [
        {
          "days": [1],
          "score": 3,
          "special": true,
          "event": "All Saints' Day (La Toussaint)",
          "notes": "All Saints' Day on November 1st is observed in many parts of Switzerland. Churches hold special services, and some people visit cemeteries to honor deceased family members. While not a public holiday in Geneva, the day has cultural significance especially in Catholic communities."
        },
        {
          "days": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
          "score": 3,
          "special": true,
          "event": "Christmas Markets & Illuminations",
          "notes": "November brings increasingly cold conditions to Geneva, with temperatures around 2-9°C (36-48°F) and daylight hours significantly reduced. This is low season for tourism, though the city maintains a vibrant local atmosphere with cultural events and cozy indoor activities. Traditional winter foods appear on restaurant menus, with fondue and raclette being particularly popular. Toward the end of November, Christmas markets begin to open, including the one at Parc des Bastions. The spectacular Christmas illuminations are usually switched on in late November, creating a magical atmosphere in the city center. Geneva's international organizations host various conferences and events, sometimes bringing specific groups of visitors to the city."
        }
      ],
      "weatherHighC": 9,
      "weatherLowC": 2,
      "tourismLevel": 3
    },
    "december": {
      "name": "December",
      "ranges": [
        {
          "days": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
          "score": 3,
          "special": true,
          "event": "L'Escalade Festival Preparations",
          "notes": "Early December brings winter conditions with temperatures around 0-5°C (32-41°F) and very short daylight hours. Christmas markets continue throughout the city, offering traditional crafts, decorations, and seasonal foods like raclette, fondue, and vin chaud (mulled wine). Preparations begin for Geneva's most important cultural celebration, L'Escalade, commemorating the city's successful defense against a surprise attack in 1602."
        },
        {
          "days": [11, 12, 13, 14, 15],
          "score": 4,
          "special": true,
          "event": "L'Escalade Festival",
          "notes": "The weekend closest to December 11-12 hosts the L'Escalade Festival, Geneva's most significant cultural celebration. The festival commemorates the city's successful defense against a surprise attack by the troops of the Duke of Savoy in 1602. Events include a large historical parade with participants in period costumes, demonstrations of historical weapons and crafts, music performances, and traditional food. The chocolate cauldron (marmite) filled with marzipan vegetables is the festival's symbol, commemorating the legend of Mère Royaume who reportedly dumped a cauldron of hot soup on attackers. The festival culminates with a torchlight procession through the Old Town."
        },
        {
          "days": [16, 17, 18, 19, 20, 21, 22, 23],
          "score": 3,
          "notes": "Mid-December sees Geneva at its most festive, with decorations, lights, and special events throughout the city. Shopping areas are beautifully decorated and buzzing with activity. The Christmas markets reach their peak popularity. Cultural events like Christmas concerts take place in many of Geneva's churches and concert venues. Fog and snow are possible, sometimes creating beautiful winter scenery, especially on nearby Mont Salève."
        },
        {
          "days": [24, 25, 26],
          "score": 2,
          "special": true,
          "event": "Christmas Eve & Christmas Day (Réveillon de Noël & Noël)",
          "notes": "Christmas is celebrated both on Christmas Eve (December 24) and Christmas Day (December 25) in Switzerland. Christmas Eve typically features family gatherings and traditional meals, while Christmas Day is a public holiday with continued celebrations. Many restaurants and attractions close early on Christmas Eve and may remain closed on Christmas Day. Public transportation runs on limited schedules. Despite this, winter tourism begins to increase as international visitors arrive for holiday celebrations and winter sports in nearby Alpine resorts."
        },
        {
          "days": [27, 28, 29, 30],
          "score": 3,
          "notes": "The period between Christmas and New Year sees Geneva quiet but festive. Winter activities like ice skating and visits to museums are popular among tourists. Many restaurants and shops reopen after brief Christmas closures. This can be a good time to find post-Christmas shopping deals. Hotels may be busy with visitors using Geneva as a base for skiing in nearby resorts."
        },
        {
          "days": [31],
          "score": 4,
          "special": true,
          "event": "New Year's Eve (Réveillon de la Saint-Sylvestre)",
          "notes": "New Year's Eve celebrations center around Lake Geneva, with fireworks displays and revelry throughout the city. Many restaurants offer special New Year's Eve menus (advance reservation essential), while hotels and cultural venues host celebration events. Parties and events take place around the lake, culminating in midnight celebrations. This attracts large crowds of locals and tourists alike, bringing a festive atmosphere to end the year."
        }
      ],
      "weatherHighC": 5,
      "weatherLowC": 0,
      "tourismLevel": 3
    }
  },
  "activityTypes": {
    "spring": [
      "Exploring the Botanical Garden's spring flower displays",
      "Taking a cruise on Lake Geneva (Lac Léman)",
      "Visiting the International Red Cross and Red Crescent Museum",
      "Attending the Geneva International Motor Show (March)",
      "Exploring watchmaking heritage during Watches & Wonders (April)",
      "Hiking on Mont Salève for panoramic views of Geneva",
      "Cycling along Lake Geneva's promenades",
      "Outdoor 'café culture' as terraces reopen for the season",
      "Day trips to nearby French and Swiss towns"
    ],
    "summer": [
      "Swimming at public beaches (Bains des Pâquis, Baby Plage, etc.)",
      "Hiking in nearby Jura mountains or Alps",
      "Attending the Lake Geneva Festival (Fêtes de Genève) in August",
      "Swiss National Day celebrations (August 1)",
      "Fête de la Musique (June)",
      "Water sports on Lake Geneva (paddleboarding, sailing, water skiing)",
      "Dining at outdoor restaurants and lakefront terraces",
      "Evening boat cruises during sunset",
      "Exploring the Old Town's historical attractions"
    ],
    "autumn": [
      "Exploring autumn colors in parks and vineyards",
      "Wine tasting in nearby Lavaux and Geneva vineyards",
      "Museum visits to Art and History Museum, CERN, and UN Headquarters",
      "Culinary experiences featuring seasonal local produce",
      "Attending premieres of Geneva's cultural season",
      "Shopping in boutiques along the Rue du Rhône",
      "Walking around the Old Town with fewer tourists",
      "Visiting European Heritage Days sites (September)",
      "Day trips to surrounding countryside with beautiful fall foliage"
    ],
    "winter": [
      "Christmas markets at Parc des Bastions and throughout the city",
      "L'Escalade Festival in early December",
      "Ice skating at seasonal rinks",
      "New Year's Eve celebrations around Lake Geneva",
      "Warming up in historic cafés with hot chocolate and pastries",
      "Shopping during winter sales (typically January)",
      "Museum explorations including smaller specialized museums",
      "Day trips to nearby ski resorts in the French and Swiss Alps",
      "Relaxing in thermal spas in the region"
    ]
  },
  "scoreDescription": {
    "5": "Excellent: Perfect conditions, special events, ideal weather, moderate crowds",
    "4": "Good: Very favorable conditions, pleasant weather, manageable crowds",
    "3": "Average: Standard conditions, typical weather, moderate to low tourism",
    "2": "Below Average: Less ideal conditions, cold or wet weather, very low tourism (some business closures)",
    "1": "Poor: Unfavorable conditions, extreme weather, limited activities or accessibility"
  }
}