{
  "sites": [
    {
      "name": "Jet d'Eau",
      "type": "Landmark",
      "description": "Geneva's iconic water fountain shooting 140 meters high in Lake Geneva. Originally a pressure release valve for a hydraulic plant, it's now a major symbol of the city.",
      "indoor": false,
      "best_time": "Daytime/Evening (check operating hours, sometimes lit at night)",
      "price_range": "Free",
      "seasonal_notes": "Operates year-round but hours vary seasonally and it may shut down in high winds or freezing temperatures. Check SIG website for schedule and special illuminations.",
      "booking_tips": "Visible from many points around the lake. A pier allows walking close (may get wet!). No booking needed.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 5
      },
      "latitude": 46.2068,
      "longitude": 6.1568
    },
    {
      "name": "Lake Geneva (Lac Léman)",
      "type": "Nature",
      "description": "Western Europe's largest Alpine lake, offering stunning mountain views, boat cruises (CGN), swimming areas (Bains des Pâquis), lakeside promenades, and water sports.",
      "indoor": false,
      "best_time": "Anytime (Summer for swimming/boating)",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round. Boat services operate with varying schedules. Swimming best in summer. Lakeside walks enjoyable anytime.",
      "booking_tips": "Public boat trips (CGN) have various routes and prices. Mouettes Genevoises offer quick water taxi services (covered by public transport ticket). Free to walk along the shores.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 46.2070,
      "longitude": 6.1530
    },
    {
      "name": "Old Town (Vieille Ville) & St. Pierre Cathedral",
      "type": "Historic District",
      "description": "Switzerland's largest historic city center, featuring cobblestone streets, hidden passages, Place du Bourg-de-Four (oldest square), antique shops, cafes, and dominated by St. Pierre Cathedral, the adopted home church of John Calvin. Climb the towers for panoramic views.",
      "indoor": false,
      "best_time": "Daytime/Evening",
      "price_range": "Free/Budget",
      "seasonal_notes": "Charming year-round. Cathedral has opening hours. Tower climb has a fee.",
      "booking_tips": "Best explored on foot. Free to wander. Small fee to climb Cathedral towers. Guided tours available.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 5
      },
      "latitude": 46.2011,
      "longitude": 6.1483
    },
    {
      "name": "Jardin Anglais & Flower Clock (L'horloge fleurie)",
      "type": "Park/Landmark",
      "description": "A beautiful lakeside park known for the famous Flower Clock, a symbol of Geneva's watchmaking tradition created in 1955. The clock face is made of thousands of flowers and plants, changing seasonally.",
      "indoor": false,
      "best_time": "Daytime (Spring/Summer for best blooms)",
      "price_range": "Free",
      "seasonal_notes": "Park open year-round. Clock is most vibrant during flowering seasons. Great views of the Jet d'Eau.",
      "booking_tips": "Free access. Located on the left bank near the lake.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 46.2052,
      "longitude": 6.1522
    },
    {
      "name": "Palais des Nations",
      "type": "Government Building",
      "description": "The European headquarters of the United Nations, housed in a vast complex built between 1929 and 1936. A symbol of international diplomacy and peace.",
      "indoor": true,
      "best_time": "Weekdays (Tour hours)",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round for guided tours, check website for times and availability. Security checks required.",
      "booking_tips": "Guided tours are mandatory to see inside. Book tours in advance online. Allow time for security screening.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 46.2267,
      "longitude": 6.1408
    },
    {
      "name": "Broken Chair",
      "type": "Monument",
      "description": "A monumental sculpture by Daniel Berset located opposite the Palais des Nations. Symbolizes opposition to landmines and cluster bombs, and acts as a reminder to diplomats and visitors.",
      "indoor": false,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round.",
      "booking_tips": "Located on Place des Nations, easily combined with a visit to the Palais des Nations. Free to view.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.25,
        "cultural_significance": 4
      },
      "latitude": 46.2232,
      "longitude": 6.1395
    },
    {
      "name": "International Red Cross and Red Crescent Museum",
      "type": "Museum",
      "description": "Dedicated to the history and work of Henry Dunant and the International Red Cross and Red Crescent Movement. Features powerful exhibits on humanitarian action.",
      "indoor": true,
      "best_time": "Anytime (Museum hours)",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round (check hours, often closed Mondays).",
      "booking_tips": "Located near the Palais des Nations. Tickets can be bought on site or online. Allow 1.5-2 hours.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 46.2253,
      "longitude": 6.1381
    },
    {
      "name": "Carouge",
      "type": "Historic District",
      "description": "A charming district often compared to an Italian village, known for its Sardinian architecture, bohemian atmosphere, artisan boutiques, shaded squares, cafes, and lively market.",
      "indoor": false,
      "best_time": "Daytime/Evening",
      "price_range": "Free",
      "seasonal_notes": "Vibrant year-round. Market days (Wed/Sat) are particularly lively.",
      "booking_tips": "Easily accessible by tram from central Geneva. Free to explore. Great for shopping, dining, and soaking up the atmosphere.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 46.1896,
      "longitude": 6.1422
    },
    {
      "name": "CERN (European Organization for Nuclear Research)",
      "type": "Science Center",
      "description": "One of the world's largest centers for scientific research, focused on particle physics. Offers free permanent exhibitions ('Universe of Particles' in the Globe, 'Microcosm') and guided tours (limited availability).",
      "indoor": true,
      "best_time": "Exhibition hours / Tour times",
      "price_range": "Free",
      "seasonal_notes": "Exhibitions open year-round (check hours). Guided tours are free but must be booked far in advance.",
      "booking_tips": "Located outside Geneva on the Swiss-French border (accessible by tram). Exhibitions are free and don't require booking. Guided tours are highly sought after and need booking months ahead via CERN website.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 46.2339,
      "longitude": 6.0556
    },
    {
      "name": "Mont Salève",
      "type": "Nature",
      "description": "Often called 'Geneva's Balcony' (though technically in France), offering stunning panoramic views of Geneva, Lake Geneva, the Alps, and Mont Blanc. Accessible by cable car.",
      "indoor": false,
      "best_time": "Daytime (Clear weather)",
      "price_range": "Budget/Moderate",
      "seasonal_notes": "Cable car operates year-round (may close for maintenance). Views depend heavily on weather. Popular for hiking, paragliding, and mountain biking.",
      "booking_tips": "Take bus No. 8 from Geneva to Veyrier-Douane (border), then walk to the cable car station (Téléphérique du Salève). Cable car tickets can be bought on site. Consider a return ticket.",
      "ratings": {
        "cost_estimate": 15,
        "suggested_duration_hours": 3.0,
        "cultural_significance": 3
      },
      "latitude": 46.1568,
      "longitude": 6.1781
    },
    {
      "name": "Musée d'Art et d'Histoire (Art and History Museum)",
      "type": "Museum",
      "description": "Geneva's largest art museum, housing collections spanning fine arts (painting, sculpture), applied arts (furniture, silverware), and archaeology from prehistory to the modern era.",
      "indoor": true,
      "best_time": "Anytime (Museum hours)",
      "price_range": "Free/Budget",
      "seasonal_notes": "Permanent collections are free. Temporary exhibitions usually have an entrance fee. Check hours (often closed Mondays).",
      "booking_tips": "Located near the Old Town. Allow 2-3 hours. Check website for current temporary exhibitions.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.5,
        "cultural_significance": 4
      },
      "latitude": 46.2000,
      "longitude": 6.1510
    },
    {
      "name": "Bains des Pâquis",
      "type": "Recreation",
      "description": "Popular public baths on a pier jutting into Lake Geneva. Offers swimming, sunbathing, sauna, hammam, massages, and a restaurant/buvette with great views and affordable food (famous for fondue in winter).",
      "indoor": false,
      "best_time": "Summer (Swimming/Sunbathing), Winter (Sauna/Fondue)",
      "price_range": "Budget",
      "seasonal_notes": "Open year-round. Small entrance fee in summer (May-Sep). Sauna operates mostly in cooler months. Very popular, can get crowded.",
      "booking_tips": "No booking needed for entry/swimming. Massages/sauna might need booking. Located on the right bank.",
      "ratings": {
        "cost_estimate": 2,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 46.2101,
      "longitude": 6.1542
    },
    {
      "name": "Reformation Wall",
      "type": "Monument",
      "description": "Located in Parc des Bastions, this monument commemorates key figures of the Protestant Reformation, including John Calvin, William Farel, Theodore Beza, and John Knox. Geneva's motto 'Post Tenebras Lux' (Light After Darkness) is engraved.",
      "indoor": false,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Accessible year-round within the park.",
      "booking_tips": "Located within Parc des Bastions, near Place de Neuve and the Old Town. Free to view.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 0.5,
        "cultural_significance": 4
      },
      "latitude": 46.1996,
      "longitude": 6.1454
    },
    {
      "name": "Patek Philippe Museum",
      "type": "Museum",
      "description": "Showcases the history of watchmaking from the 16th century to the present, with a focus on Genevan and Swiss horology, including an extensive collection of Patek Philippe timepieces.",
      "indoor": true,
      "best_time": "Museum hours",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round (check hours, often closed Sundays/Mondays).",
      "booking_tips": "Located in the Plainpalais district. Tickets bought on site. Allow 1.5-2 hours. Photography often restricted.",
      "ratings": {
        "cost_estimate": 10,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 46.1987,
      "longitude": 6.1406
    },
    {
      "name": "Conservatory and Botanical Garden (Jardin Botanique)",
      "type": "Garden",
      "description": "A living museum featuring over 12,000 plant species from around the world, greenhouses (tropical, temperate), themed gardens (medicinal, horticultural), an arboretum, and one of the world's largest herbaria.",
      "indoor": true,
      "best_time": "Daytime",
      "price_range": "Free",
      "seasonal_notes": "Open daily year-round, hours vary slightly by season. Greenhouses offer respite on colder/rainy days. Gardens most vibrant spring/summer.",
      "booking_tips": "Free admission. Located near the international organizations district. Check official website for specific opening hours.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 46.2258,
      "longitude": 6.1480
    },
    {
      "name": "Musée Ariana (Swiss Museum of Ceramics and Glass)",
      "type": "Museum",
      "description": "Housed in a stunning Neo-Baroque palace, this museum showcases 12 centuries of ceramic and glass art from Switzerland, Europe, and the East, with over 27,000 objects.",
      "indoor": true,
      "best_time": "Museum hours (Tue-Sun)",
      "price_range": "Free/Budget",
      "seasonal_notes": "Open Tue-Sun. Permanent collection free. Temporary exhibitions have a fee (free for all on first Sunday of the month).",
      "booking_tips": "Located near Palais des Nations. No booking needed usually, check website for temporary exhibition details.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 4
      },
      "latitude": 46.2244,
      "longitude": 6.1388
    },
    {
      "name": "Natural History Museum of Geneva (Muséum d'histoire naturelle)",
      "type": "Museum",
      "description": "Switzerland's largest natural history museum, featuring extensive displays of regional and worldwide fauna, minerals, geology, and the history of human evolution. Home to Janus, the two-headed tortoise.",
      "indoor": true,
      "best_time": "Museum hours (Tue-Sun)",
      "price_range": "Free/Budget",
      "seasonal_notes": "NOTE: Closed for major renovation starting Jan 2024, reopening planned for 2026. Normally open Tue-Sun. Permanent exhibition free, temporary may have fees.",
      "booking_tips": "Located in the Eaux-Vives district. Check official website for reopening status and temporary exhibition details once available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 3
      },
      "latitude": 46.1990,
      "longitude": 6.1583
    },
    {
      "name": "Ethnography Museum of Geneva (MEG)",
      "type": "Museum",
      "description": "Award-winning museum housed in a striking modern building, dedicated to celebrating human cultural diversity across all continents. Features permanent and temporary exhibitions with immersive scenography.",
      "indoor": true,
      "best_time": "Museum hours (Tue-Sun)",
      "price_range": "Free/Budget",
      "seasonal_notes": "Open Tue-Sun. Permanent collection free. Temporary exhibitions have a fee (free for all on first Sunday of the month).",
      "booking_tips": "Located in the Plainpalais district. Check website for current exhibitions.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 2.0,
        "cultural_significance": 4
      },
      "latitude": 46.1997,
      "longitude": 6.1388
    },
    {
      "name": "Parc des Bastions",
      "type": "Park",
      "description": "A large, historic park in the city center below the Old Town. Features the Reformation Wall, giant outdoor chess boards, playgrounds, a restaurant in a former glasshouse, and hosts popular events.",
      "indoor": false,
      "best_time": "Anytime",
      "price_range": "Free",
      "seasonal_notes": "Open 24/7 year-round. Hosts events like Fête de la Musique and Course de l'Escalade start.",
      "booking_tips": "Free access. Located adjacent to Place de Neuve. Great for relaxation, walks, and people-watching (especially the chess players).",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.0,
        "cultural_significance": 3
      },
      "latitude": 46.1998,
      "longitude": 6.1447
    }
  ]
}