{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Perfect Weather",
                "details": "May offers ideal conditions in Toulouse with warm temperatures averaging 19-23°C, abundant sunshine, and comfortable evenings, creating perfect conditions for exploring the Pink City before the intense summer heat arrives."
            },
            {
                "reason": "Gardens in Full Bloom",
                "details": "May sees Toulouse's numerous gardens at their most beautiful, with the Jardin des Plantes, Jardin Royal, Japanese Garden, and Grand Rond showcasing spectacular floral displays and lush landscapes."
            },
            {
                "reason": "European Museum Night",
                "details": "Mid-May brings the annual Night of Museums (Nuit des Musées), when Toulouse's exceptional museums like Les Abattoirs and the Natural History Museum open their doors late with special events, performances, and free admission."
            },
            {
                "reason": "Outdoor Café Culture",
                "details": "May marks the true flourishing of Toulouse's outdoor café scene, with restaurant terraces along Place du Capitole, Place Saint-Georges, and the Garonne riverbanks filled with locals and visitors enjoying the pleasant evenings."
            },
            {
                "reason": "Canal du Midi at Its Best",
                "details": "The UNESCO World Heritage Canal du Midi is at its most beautiful in May, with towering plane trees in full leaf, wildflowers along the banks, and perfect conditions for boat trips, cycling, or walking along this 17th-century waterway."
            },
            {
                "reason": "Open-Air Markets in Full Swing",
                "details": "Toulouse's famous markets, especially Victor Hugo Market and the Sunday morning Saint-Aubin Market, reach their spring peak with seasonal produce, flowers, and artisanal products from across Occitanie."
            },
            {
                "reason": "Pre-Peak Season Value",
                "details": "May offers excellent value with pleasant weather but without the summer tourist crowds and peak prices of July and August, allowing visitors to enjoy major attractions like the Basilica of Saint-Sernin and Capitole without long queues."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Public Holiday Closures",
                "details": "May has several French public holidays (May 1, 8, and Ascension), when many businesses close and public transportation runs on reduced schedules, requiring careful planning for tourists."
            },
            {
                "reason": "Increasing Tourism",
                "details": "While not as crowded as summer, tourism begins to increase significantly in May, especially on weekends and holidays, with more visitors at major attractions and in the historic center."
            },
            {
                "reason": "Occasional Thunderstorms",
                "details": "Despite generally pleasant conditions, late May can bring sudden, sometimes intense thunderstorms to the Toulouse region, particularly in late afternoons, requiring flexible planning for outdoor activities."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "21°C",
                    "low": "10°C"
                },
                "precipitation": "Early May typically brings mostly sunny days with occasional brief showers. Weather becomes increasingly stable and warm as the month progresses, with longer periods of sunshine.",
                "general_tips": "Pack primarily light clothing with a light jacket for evenings. Sun protection becomes essential as UV levels increase. A small umbrella may be useful for occasional showers."
            },
            "tourism_level": {
                "crowds": "Moderate tourist levels with a noticeable increase from April, particularly around holidays and weekends. Major attractions see steady visitor numbers.",
                "pricing": "Accommodation prices begin to rise as spring tourism picks up, though still below summer peak rates. Weekend stays command premium prices, especially around the May holidays.",
                "overall_atmosphere": "The city feels increasingly vibrant with locals spending more time outdoors, restaurant terraces filling up, and cultural events bringing energy to public spaces like Place du Capitole."
            },
            "events_holidays": [
                {
                    "name": "Labor Day (May 1)",
                    "date": "May 1",
                    "description": "National holiday when most businesses, shops, and some attractions are closed. Traditional day for lily-of-the-valley sales and workers' demonstrations in city center.",
                    "notes": "Public transportation runs on a holiday schedule. Major tourist attractions may remain open but with reduced hours. Many restaurants close, especially outside tourist areas."
                },
                {
                    "name": "Victory in Europe Day (May 8)",
                    "date": "May 8",
                    "description": "Public holiday commemorating the end of WWII in Europe with ceremonies at the Monument à la Gloire de la Résistance and other memorials throughout the city.",
                    "notes": "Government offices and many businesses close, though tourist sites generally remain open. The day may include military parades and commemorative events in Place du Capitole."
                },
                {
                    "name": "Festival Rio Loco (Early Events)",
                    "date": "Mid-May",
                    "description": "Early events and buildup to Toulouse's major world music festival, with performances and cultural activities beginning to appear in venues around the city.",
                    "notes": "The main festival typically occurs in June, but pre-festival events often start in May. Check the official website for the current program."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Pink City Walking Tour",
                    "where": "Historic City Center",
                    "description": "Explore the terracotta buildings that give Toulouse its nickname 'La Ville Rose' (The Pink City), wandering through medieval streets, Renaissance mansions, and charming squares particularly beautiful in spring sunshine.",
                    "practical_tips": "The Tourist Office offers guided tours, but self-guided walks are easy with maps available at the tourist office in Square Charles de Gaulle. Morning light brings out the warm pink hues of the buildings.",
                    "best_time": "Morning or late afternoon",
                    "estimated_cost": "Free (self-guided) or Moderate (guided tours)",
                    "weather_dependent": true
                },
                {
                    "activity": "Garonne River Banks Experience",
                    "where": "Between Pont Neuf and Pont Saint-Pierre",
                    "description": "Enjoy the landscaped banks of the Garonne River, which come alive in May with locals and visitors strolling, picnicking, and relaxing with views of Toulouse's historic buildings and bridges.",
                    "practical_tips": "The western bank (La Daurade) is particularly popular for sunset views of the river and eastern bank buildings. Bring a picnic from Victor Hugo Market for an authentic local experience.",
                    "best_time": "Late afternoon and early evening",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Capitole Square and Town Hall",
                    "where": "Place du Capitole",
                    "description": "Visit the grand neoclassical Capitole building, Toulouse's city hall with its ornate 18th-century façade, and explore the lavishly decorated State Rooms with murals depicting city history.",
                    "practical_tips": "The State Rooms are free to visit but check opening times as they close for official functions. The square itself is vibrant with cafés, especially beautiful in May when outdoor seating expands.",
                    "best_time": "Morning for interior visit, evening for square atmosphere",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Victor Hugo Market Experience",
                    "where": "Place Victor Hugo",
                    "description": "Immerse yourself in Toulouse's premier covered food market, particularly vibrant in May with seasonal spring produce, flowers, and regional specialties from across Southwest France.",
                    "practical_tips": "Open Tuesday to Sunday mornings until 1:30 PM (closed Mondays). For an authentic local experience, dine at one of the small restaurants on the first floor that cook with ingredients from the market below.",
                    "best_time": "Morning (closes at 1:30 PM)",
                    "estimated_cost": "Free (unless dining or shopping)",
                    "weather_dependent": false
                },
                {
                    "activity": "Japanese Garden Visit",
                    "where": "Jardin Compans Caffarelli",
                    "description": "Discover a serene piece of Japan in the heart of Toulouse at this authentic Japanese garden featuring traditional elements like a tea pavilion, zen garden, red bridge, and koi pond, particularly beautiful in May.",
                    "practical_tips": "The garden is free to enter and offers a peaceful retreat from the city bustle. Early morning visits provide the most tranquil experience before other visitors arrive.",
                    "best_time": "Morning",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Basilica of Saint-Sernin Visit",
                    "where": "Place Saint-Sernin",
                    "description": "Explore the largest remaining Romanesque church in Europe, a UNESCO World Heritage Site dating from the 11th century and an important stop on the Santiago de Compostela pilgrimage route.",
                    "practical_tips": "Visit in the morning to avoid crowds and to see the sunlight streaming through the stained glass. The crypt tours require a small additional fee but are worth it for history enthusiasts.",
                    "best_time": "Morning",
                    "estimated_cost": "Free (main basilica), Low (crypt tours)",
                    "weather_dependent": false
                },
                {
                    "activity": "Canal du Midi Boat Trip",
                    "where": "Canal du Midi, departing from Port Saint Sauveur",
                    "description": "Cruise along the UNESCO-listed Canal du Midi on a guided boat tour, experiencing this 17th-century engineering marvel from the water while enjoying views of Toulouse and the countryside.",
                    "practical_tips": "Several companies offer cruises ranging from 1-2 hours to full-day excursions. Reservations recommended in May as this activity becomes increasingly popular. Afternoon trips offer the best light for photography.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Occitan Cuisine Dinner",
                    "where": "Traditional restaurants in central Toulouse",
                    "description": "Experience authentic Southwest French cuisine at a traditional restaurant, sampling seasonal spring specialties alongside classics like cassoulet, duck confit, and Toulouse sausage.",
                    "practical_tips": "Try established restaurants like Le Colombier or Au Gascon for traditional dishes. May brings spring ingredients like asparagus and strawberries to seasonal menus. Reservations recommended, especially for weekend evenings.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "23°C",
                    "low": "12°C"
                },
                "precipitation": "Late May typically brings more consistent warm, sunny weather, though afternoon thunderstorms become more common as the month progresses, especially in the Pyrenean foothills south of the city.",
                "general_tips": "Summer clothing is suitable for warm days, with perhaps a light layer for evenings. Sunscreen is essential. Be prepared for occasional afternoon thunderstorms with appropriate gear."
            },
            "tourism_level": {
                "crowds": "Tourism increases noticeably as the month progresses, with weekends becoming quite busy in the historic center and at major attractions like Cité de l'Espace.",
                "pricing": "Accommodation prices rise as high season approaches, particularly around Ascension holiday and weekends. Advance booking becomes increasingly important.",
                "overall_atmosphere": "The city becomes increasingly lively with outdoor events, street performers, and café culture in full swing. Parks, riverbanks, and public spaces fill with locals and visitors enjoying the warm weather."
            },
            "events_holidays": [
                {
                    "name": "European Museum Night",
                    "date": "Mid-May (usually third Saturday)",
                    "description": "Annual event when museums and cultural institutions stay open late with special events, performances, and free admission, particularly impressive in Toulouse with its diverse museums.",
                    "notes": "Very popular among locals and visitors alike. Les Abattoirs, Natural History Museum, and Musée Saint-Raymond typically offer special programming and installations."
                },
                {
                    "name": "Ascension Day",
                    "date": "Variable (May or early June)",
                    "description": "Public holiday that often creates a long weekend when many French people travel, potentially increasing domestic tourism in Toulouse.",
                    "notes": "Many locals take the Friday off to create a four-day weekend, affecting business hours and increasing tourism activity in the city and region."
                },
                {
                    "name": "Pint of Science Festival",
                    "date": "Mid-May",
                    "description": "International science festival with events in pubs and bars across Toulouse, where researchers present their work in accessible formats to the general public.",
                    "notes": "Reflects Toulouse's status as a major scientific and research hub. Events are held in multiple venues across the city, primarily in French but occasionally in English."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Museum Night Experience",
                    "where": "Various museums in Toulouse",
                    "description": "Take part in the European Museum Night, exploring Toulouse's diverse museums after hours with special events, performances, and illuminations in a festive atmosphere.",
                    "practical_tips": "Plan your route in advance as museums across the city participate. Les Abattoirs contemporary art museum and the Natural History Museum typically offer particularly engaging programs.",
                    "best_time": "Evening",
                    "estimated_cost": "Free",
                    "weather_dependent": false
                },
                {
                    "activity": "Cité de l'Espace (Space City)",
                    "where": "Avenue Jean Gonord",
                    "description": "Visit Europe's premier space science center showcasing actual spacecraft, including a full-scale Ariane 5 rocket, Mir space station replica, and interactive exhibits highlighting Toulouse's important aerospace industry.",
                    "practical_tips": "Allow a full day to experience everything. Purchase tickets online to avoid queues, which become longer in late May. The outdoor exhibits are particularly enjoyable in good weather.",
                    "best_time": "Full day",
                    "estimated_cost": "High",
                    "weather_dependent": false
                },
                {
                    "activity": "Day Trip to Albi",
                    "where": "Albi (approximately 80km northeast of Toulouse)",
                    "description": "Take a day excursion to the UNESCO World Heritage city of Albi, birthplace of Toulouse-Lautrec, featuring an imposing fortress-like cathedral, the Toulouse-Lautrec Museum, and picturesque medieval center.",
                    "practical_tips": "Direct trains run regularly from Toulouse Matabiau station (approximately 1 hour). May offers perfect weather for exploring this red-brick city that complements Toulouse's own terracotta architecture.",
                    "best_time": "Full day",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                },
                {
                    "activity": "Canal du Midi Cycling",
                    "where": "Canal du Midi towpath",
                    "description": "Cycle along the historic Canal du Midi towpath, enjoying the shade of plane trees in full leaf and views of boats navigating the 17th-century waterway, a perfect May activity.",
                    "practical_tips": "Rent bikes from numerous stations in the city center. The flat towpath makes for easy cycling. The route toward Ramonville or Castanet-Tolosan offers pleasant scenery within easy reach of the city.",
                    "best_time": "Morning or late afternoon",
                    "estimated_cost": "Low (bike rental)",
                    "weather_dependent": true
                },
                {
                    "activity": "Saint-Aubin Sunday Market",
                    "where": "Place Saint-Aubin",
                    "description": "Experience Toulouse's most atmospheric open-air market, a Sunday institution combining fresh produce, crafts, antiques, and street food in a festive environment with occasional live music.",
                    "practical_tips": "The market runs Sunday mornings until approximately 2pm. The area around the church becomes very lively, with locals shopping, socializing, and enjoying drinks at surrounding cafés.",
                    "best_time": "Sunday morning",
                    "estimated_cost": "Free (excluding purchases)",
                    "weather_dependent": true
                },
                {
                    "activity": "Jardin des Plantes Exploration",
                    "where": "31 Allées Jules Guesde",
                    "description": "Wander through Toulouse's oldest public garden dating from 1794, at its most beautiful in May with abundant flowers, century-old trees, and the adjacent Grand Rond garden with its impressive fountains.",
                    "practical_tips": "The gardens connect to the Natural History Museum, making for a good combined visit. The botanical gardens section features labeled plant collections. Perfect for a relaxing afternoon stroll.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                },
                {
                    "activity": "Aeroscopia Aviation Museum",
                    "where": "Allée André Turcat, Blagnac",
                    "description": "Explore Toulouse's aerospace heritage at this modern museum featuring historic aircraft including Concorde, A300B and military planes, highlighting the city's role as the center of European aviation.",
                    "practical_tips": "Located near the Airbus facility in Blagnac. Can be combined with Airbus Factory Tour (requires advance booking, often months ahead). Take tram T1 from city center to reach the museum.",
                    "best_time": "Morning (if combining with Airbus tour)",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": false
                },
                {
                    "activity": "Evening in Place Saint-Georges",
                    "where": "Place Saint-Georges and surrounding streets",
                    "description": "Experience Toulouse's evening atmosphere at this lively square surrounded by restaurants and bars with outdoor terraces, particularly vibrant during May's pleasant evenings.",
                    "practical_tips": "Arrive around 7-8pm to secure outdoor seating at popular establishments. The area offers numerous options from casual tapas bars to upscale dining. A favorite spot for locals for the after-work aperitif tradition.",
                    "best_time": "Evening",
                    "estimated_cost": "Moderate",
                    "weather_dependent": true
                }
            ]
        }
    }
}