{
  "overview_paragraph": "Toulouse is at its best in spring (April–June) and early fall (September–October), when café terraces buzz around Place du Capitole and the historic center, the pink brick architecture glows with seasonal light, and touring weather is ideal. July brings long evenings and vibrant festivals—including the famous Toulouse Music Festival—but also peak crowds and higher prices; in August some boutiques and smaller restaurants close. Winter (November–February) is mild and cozy—think holiday markets around Place du Capitole, local Occitan restaurant stops, and twinkling lights around the ancient terracotta buildings—while March begins to warm with the odd Occitan shower and blooming trees around the historic squares.",
  "January": [
    "Pink brick architecture without the crowds, steaming hot chocolate, and misty walks between cozy local shops around the historic center.",
    "Winter light on the terracotta façades, snug Occitan restaurants in the old town, and vintage hunts in the covered markets."
  ],
  "February": [
    "Historic center at golden hour, romantic views from the basilica towers, and traditional Occitan music nights in local venues.",
    "Shared local Occitan specialties, candlelit restaurants, and strolls past secret squares in the Old Town."
  ],
  "March": [
    "First wildflowers in the Jardin des Plantes, terrace tables returning around Place du Capitole, and southern heritage bookshop wanders.",
    "Morning croissants, museum afternoons at the Musée des Augustins, and blue-hour walks welcoming spring back to Toulouse."
  ],
  "April": [
    "Spring blooms throughout the Jardin des Plantes, flaky Occitan pastries, and walks from Place du Capitole to the historic center.",
    "Spring light on the pink brick buildings, gallery-hopping in the Musée Saint-Raymond, sunset views over the ancient terracotta rooftops."
  ],
  "May": [
    "Picnics in the Jardin des Plantes, markets brimming with Occitan color, and twilight strolls around Place du Capitole.",
    "Flowered promenades around the main square, open-air café moments along the Capitole, and museum nights that stretch into starry walks."
  ],
  "June": [
    "Long golden evenings, Occitan wine aperitifs, and the city humming for the Toulouse Music Festival.",
    "Sun-splashed walking trails around the historic center, garden picnics, and late sunsets that turn every terracotta viewpoint into a postcard."
  ],
  "July": [
    "Bastille fireworks over the Canal du Midi, lazy afternoons exploring the Toulouse Music Festival, and moonlit medieval architecture walks.",
    "Summer markets, outdoor terraces, and museum cool-downs between sun-bright wanderings around the ancient sites."
  ],
  "August": [
    "Quiet Jardin des Plantes trails, easy museum days at the Musée des Augustins, and peaceful evenings with Occitan breezes through the historic squares.",
    "Shaded botanical gardens, courtyard cafés, and golden hours when the city feels like it's yours."
  ],
  "September": [
    "La rentrée buzz returns—fresh exhibits at the Musée Saint-Raymond, lively terraces, and Occitan wine-tinted evenings in Place du Capitole.",
    "Crisp mornings, market finds, and gallery re-openings that make wandering through the historic center irresistible."
  ],
  "October": [
    "Autumn colors throughout the Occitan countryside, restaurants aglow, and the local harvest festival in the historic squares.",
    "Cinnamon-spiced stalls, museum hideaways at the Musée des Augustins, and sunset tones warming the terracotta architecture views."
  ],
  "November": [
    "Local Occitan wine toasts, cozy Occitan restaurants, and Musée des Augustins afternoons while the city slows to a hush.",
    "Foggy Occitan mornings, Occitan cuisine indoors, and snug cafés for long, lingering chats."
  ],
  "December": [
    "Capitole lights, holiday markets, and strolling beneath grand terracotta façades.",
    "Vin chaud in hand, basilica bells at Saint-Sernin, and winter sparkle from city center to the historic quarter."
  ]
}

