{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing at Petřín Hill",
                "type": "Park",
                "description": "Experience the stunning cherry blossoms in full bloom at Petřín Hill and the adjacent parks. The hill offers beautiful springtime displays and panoramic views of Prague Castle.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring is the perfect time to enjoy the cherry blossoms, which typically bloom from late March to mid-April.",
                "booking_tips": "Take the funicular up Petřín Hill and bring a camera to capture the blossoms with Prague Castle in the background."
            },
            {
                "name": "Visit to the National Gallery",
                "type": "Museum",
                "description": "Discover Czech and international art at the National Gallery's various locations, including the stunning Veletržní Palace and the historic St. Agnes Convent.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring rains can be unpredictable, making indoor museum visits an ideal activity.",
                "booking_tips": "Purchase tickets online in advance and consider visiting multiple gallery locations with a combined ticket."
            },
            {
                "name": "Night of Museums (Noc muzeí)",
                "type": "Cultural Event",
                "description": "Participate in the Night of Museums in May, where many Prague museums open their doors for free or reduced prices, offering special activities and exhibitions.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "This annual event celebrates Czech culture and history, making it a must-do spring activity.",
                "booking_tips": "Check the participating museums and plan your route in advance, as popular venues can get crowded."
            },
            {
                "name": "Picnic at Kampa Island",
                "type": "Park",
                "description": "Enjoy a leisurely picnic on Kampa Island, a peaceful oasis in the heart of Prague with beautiful views of Charles Bridge and the castle.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "The island comes alive in spring with blooming flowers and pleasant weather.",
                "booking_tips": "Pick up fresh chlebíčky (open sandwiches) and Czech beer from local shops to enhance your picnic experience."
            },
            {
                "name": "Rooftop Bar at Terasa U Prince",
                "type": "Bar",
                "description": "Sip cocktails while enjoying stunning views of Old Town Square and the Astronomical Clock at this popular rooftop bar.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Spring evenings are mild and perfect for enjoying outdoor terraces with views.",
                "booking_tips": "Make reservations in advance, especially for sunset hours and weekends."
            },
            {
                "name": "Easter Markets at Old Town Square",
                "type": "Festival",
                "description": "Visit the traditional Easter markets featuring Czech crafts, painted eggs, traditional foods like mazanec, and live folk performances from March to April.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "This spring festival celebrates Czech Easter traditions with authentic crafts and foods.",
                "booking_tips": "Visit during weekdays for fewer crowds and try traditional Czech Easter specialties."
            },
            {
                "name": "Explore Prague Castle Gardens",
                "type": "Walking Tour",
                "description": "Stroll through the Royal Gardens and South Gardens of Prague Castle, featuring Renaissance landscaping and spring blooms.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring weather is ideal for garden walks, with blooming tulips and comfortable temperatures.",
                "booking_tips": "Gardens open in April - check opening times and combine with castle visit for best value."
            },
            {
                "name": "Vltava River Cruise",
                "type": "Boat Tour",
                "description": "Enjoy a leisurely cruise along the Vltava River, passing under famous bridges and seeing Prague's landmarks from the water.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Springtime offers pleasant weather for river cruises, with clear views of the city's architecture.",
                "booking_tips": "Book tickets in advance for weekend cruises and choose boats with outdoor decks for best views."
            },
            {
                "name": "Springtime Farmers Markets",
                "type": "Market",
                "description": "Explore local farmers markets like Náměstí Jiřího z Poděbrad, offering fresh spring produce, artisanal goods, and Czech specialties.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring markets feature seasonal vegetables, fresh herbs, and early Czech fruits.",
                "booking_tips": "Visit Saturday mornings for the best selection and bring reusable bags."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Letná Beer Garden",
                "type": "Outdoor Dining",
                "description": "Enjoy Czech beer and traditional pub food at the largest beer garden in Prague, with stunning views over the Vltava River and Old Town.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Summer evenings are perfect for beer garden enjoyment with long daylight hours and warm temperatures.",
                "booking_tips": "Arrive early to secure a table with the best views, especially on weekends."
            },
            {
                "name": "Prague Spring International Music Festival",
                "type": "Festival",
                "description": "Attend world-class classical concerts and performances at venues throughout Prague during this prestigious festival from May to June.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Early summer brings this internationally renowned classical music festival to Prague.",
                "booking_tips": "Book tickets well in advance for popular concerts and venues like the Municipal House."
            },
            {
                "name": "Open-Air Cinema at Křižík Fountain",
                "type": "Cinema",
                "description": "Watch Czech and international films under the stars at various outdoor cinema locations, including the spectacular fountain shows.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Summer evenings are perfect for outdoor cinema, with warm temperatures and late sunsets.",
                "booking_tips": "Bring a blanket and arrive early to secure good viewing spots for popular films."
            },
            {
                "name": "Karlštejn Castle Day Trip",
                "type": "Historical Site",
                "description": "Take a day trip to the Gothic Karlštejn Castle, built by Emperor Charles IV, just 30 minutes from Prague by train.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers the best weather for castle visits and hiking in the surrounding countryside.",
                "booking_tips": "Book guided tours in advance and combine with hiking trails around the castle."
            },
            {
                "name": "United Islands of Prague Festival",
                "type": "Music Festival",
                "description": "Enjoy this free multi-genre music festival held on Kampa Island and other locations, featuring local and international artists.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This summer festival takes advantage of warm weather for outdoor performances on islands and parks.",
                "booking_tips": "Check the lineup in advance and arrive early for popular acts to secure good spots."
            },
            {
                "name": "Cycling Along the Vltava",
                "type": "Outdoor Activity",
                "description": "Rent a bike and cycle along the Vltava River paths, enjoying scenic views and stopping at riverside cafés and beer gardens.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Summer climate is ideal for cycling, with long daylight hours and warm temperatures.",
                "booking_tips": "Use bike rental services or Prague's bike-sharing system and follow marked cycling routes."
            },
            {
                "name": "Rooftop Dining at Bellevue",
                "type": "Dining",
                "description": "Dine at Bellevue Restaurant's terrace, offering fine Czech cuisine with spectacular views of Prague Castle and Charles Bridge.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings provide perfect conditions for rooftop dining with comfortable temperatures and stunning sunsets.",
                "booking_tips": "Reserve terrace tables well in advance, especially for sunset dining hours."
            },
            {
                "name": "Visit to Kutná Hora",
                "type": "Historical Site",
                "description": "Take a day trip to UNESCO World Heritage site Kutná Hora, featuring the famous Bone Church and Gothic St. Barbara's Cathedral.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Summer offers ideal weather for day trips and exploring historic towns outside Prague.",
                "booking_tips": "Take the train from Prague and book guided tours for deeper historical insights."
            },
            {
                "name": "Vltava Swimming and Beaches",
                "type": "Outdoor Activity",
                "description": "Cool off at Štvanice Island or other designated swimming areas along the Vltava River during hot summer days.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Summer heat makes river swimming a refreshing activity for locals and visitors.",
                "booking_tips": "Check water quality reports and swim only in designated safe areas."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Explore Vyšehrad Cemetery",
                "type": "Historical Site",
                "description": "Visit the final resting place of famous Czech composers and writers like Dvořák and Čapek, beautiful in autumn colors.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn foliage makes this cemetery particularly beautiful and atmospheric.",
                "booking_tips": "Visit in the afternoon for best lighting and combine with exploring Vyšehrad fortress."
            },
            {
                "name": "Prague Design Week",
                "type": "Cultural Event",
                "description": "Experience contemporary Czech design at venues throughout Prague during this annual October festival showcasing local talent.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "Autumn brings this celebration of Czech creativity and design innovation.",
                "booking_tips": "Check the program online and plan your route to visit multiple design studios and galleries."
            },
            {
                "name": "Wine Harvest Festival in Prague Vineyards",
                "type": "Food & Drink",
                "description": "Participate in wine harvest celebrations at Prague's vineyards in Troja and other districts, with wine tasting and traditional music.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn harvest season offers authentic wine experiences in Prague's own vineyards.",
                "booking_tips": "Book vineyard tours in advance and dress appropriately for outdoor harvest activities."
            },
            {
                "name": "Visit to Convent of St. Agnes",
                "type": "Museum",
                "description": "Explore medieval Czech art at this beautifully preserved Gothic convent, part of the National Gallery collection.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's cooler days are perfect for indoor cultural activities and art appreciation.",
                "booking_tips": "Purchase tickets online and consider combining with other National Gallery locations."
            },
            {
                "name": "Autumn Walk in Wenceslas Square",
                "type": "Urban Walk",
                "description": "Stroll down Prague's main boulevard, lined with shops, cafés, and historic buildings, beautiful in autumn atmosphere.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn provides perfect walking weather with comfortable temperatures and fewer tourists.",
                "booking_tips": "Start at the National Museum and walk down to the Old Town for the full experience."
            },
            {
                "name": "Visit to Prague Jewish Museum",
                "type": "Museum",
                "description": "Explore Europe's most extensive collection of Jewish artifacts at synagogues and the Old Jewish Cemetery.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn's shorter days make museums ideal for cultural and educational experiences.",
                "booking_tips": "Buy combination tickets for all synagogues and cemetery, and allow several hours for the visit."
            },
            {
                "name": "St. Martin's Day Wine Celebrations",
                "type": "Festival",
                "description": "Celebrate St. Martin's Day (November 11) with traditional goose dinners and young wine tastings at restaurants throughout Prague.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "This autumn tradition marks the release of young wines and seasonal goose dishes.",
                "booking_tips": "Make restaurant reservations well in advance for St. Martin's Day celebrations."
            },
            {
                "name": "Explore Vinohrady District",
                "type": "Neighborhood Walk",
                "description": "Wander through Prague's most elegant residential district, admiring Art Nouveau architecture and local cafés.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Autumn colors enhance the beauty of this tree-lined residential area.",
                "booking_tips": "Start at Náměstí Míru and explore the side streets for hidden architectural gems."
            },
            {
                "name": "Traditional Czech Cooking Class",
                "type": "Workshop",
                "description": "Learn to cook traditional Czech autumn dishes like goulash, svíčková, and seasonal specialties with local chefs.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn's harvest provides perfect ingredients for learning traditional Czech cooking.",
                "booking_tips": "Book classes in advance and look for sessions that include market visits."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Ice Skating at Ovocný trh",
                "type": "Sport",
                "description": "Enjoy ice skating on the outdoor rink set up near Wenceslas Square, a popular winter activity for families and couples.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Winter transforms Prague with ice rinks and festive atmosphere throughout the city.",
                "booking_tips": "Skate rentals are available on-site, but bring warm clothes and arrive early on weekends."
            },
            {
                "name": "Christmas Markets at Old Town Square",
                "type": "Market",
                "description": "Experience magical Christmas markets with traditional Czech crafts, mulled wine (svařák), trdelník, and festive decorations.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter markets are a quintessential Prague experience, running from late November through January.",
                "booking_tips": "Visit in the evening for the best atmosphere with Christmas lights and fewer daytime crowds."
            },
            {
                "name": "Concert at St. Vitus Cathedral",
                "type": "Concert",
                "description": "Experience classical music concerts in the stunning Gothic setting of St. Vitus Cathedral within Prague Castle.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter evenings provide perfect atmosphere for classical concerts in historic venues.",
                "booking_tips": "Book tickets well in advance as Christmas and New Year concerts sell out quickly."
            },
            {
                "name": "Visit to Prague Castle in Winter",
                "type": "Historical Site",
                "description": "Explore Prague Castle complex with fewer crowds, including St. Vitus Cathedral, Royal Palace, and beautiful winter views.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Winter offers fewer crowds and a magical atmosphere with possible snow on the castle grounds.",
                "booking_tips": "Buy tickets online to skip lines and dress warmly for outdoor areas of the complex."
            },
            {
                "name": "Hot Wine at Christmas Markets",
                "type": "Food & Drink",
                "description": "Warm up with traditional Czech mulled wine (svařák) and hot mead at Christmas markets throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "Winter is the perfect season for enjoying warm beverages at festive markets.",
                "booking_tips": "Try different market locations for varying atmospheres - Old Town Square, Wenceslas Square, and Náměstí Míru."
            },
            {
                "name": "Visit to Lobkowicz Palace",
                "type": "Museum",
                "description": "Explore the private Lobkowicz collection within Prague Castle, featuring art, musical instruments, and historical artifacts.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter's cold makes indoor palace visits ideal for cultural enrichment and warmth.",
                "booking_tips": "Purchase tickets online and consider the audio guide featuring Prince Lobkowicz personally."
            },
            {
                "name": "New Year's Eve Fireworks",
                "type": "Festival",
                "description": "Celebrate New Year's Eve with spectacular fireworks over the Vltava River and festivities throughout the city center.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Winter celebrations offer magical atmosphere with illuminated historic buildings and festive crowds.",
                "booking_tips": "Arrive early to secure good viewing spots near the river or major squares, and dress very warmly."
            },
            {
                "name": "Traditional Czech Pub Experience",
                "type": "Dining",
                "description": "Warm up in traditional Czech pubs like U Fleků or U Zlatého tygra with hearty winter dishes and Czech beer.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "Winter evenings are perfect for cozy pub experiences with traditional Czech comfort food.",
                "booking_tips": "Try historic pubs for authentic atmosphere and order traditional winter dishes like goulash or svíčková."
            },
            {
                "name": "Spa Day at Beer Spa",
                "type": "Wellness",
                "description": "Relax in warm beer baths at one of Prague's unique beer spas, combining wellness with Czech beer culture.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Expensive",
                "seasonal_notes": "Winter is ideal for warm spa treatments, offering relief from cold weather.",
                "booking_tips": "Book treatments in advance and combine with traditional Czech massage for full relaxation."
            }
        ]
    }
}