{
    "sites": [
        {
            "name": "Prague Castle",
            "type": "Castle",
            "description": "The largest ancient castle in the world according to Guinness Book of Records, Prague Castle is a vast complex of palaces, churches, courtyards and gardens. Home to St. Vitus Cathedral, Old Royal Palace, and the stunning St. George's Basilica, it has been the seat of Czech rulers for over 1000 years.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Best visited early morning to avoid crowds. Summer offers longer hours and special exhibitions. Winter provides a magical snow-covered atmosphere.",
            "booking_tips": "Book tickets online to skip queues. Choose the appropriate circuit based on time available. Audio guides highly recommended.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 4,
                "cultural_significance": 5
            },
            "latitude": 50.0909,
            "longitude": 14.4009
        },
        {
            "name": "Charles Bridge",
            "type": "Bridge",
            "description": "Prague's most iconic landmark, this 14th-century stone bridge connects Old Town and Lesser Town across the Vltava River. Lined with 30 baroque statues and bustling with street artists, musicians, and vendors, it offers stunning views of the castle and city.",
            "indoor": false,
            "best_time": "Sunrise or Sunset",
            "price_range": "Free",
            "seasonal_notes": "Magical at sunrise with fewer crowds. Evening offers beautiful lighting. Winter can be slippery but atmospheric with snow.",
            "booking_tips": "Visit early morning or late evening to avoid crowds. Perfect for photography and street performances.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 50.0865,
            "longitude": 14.4114
        },
        {
            "name": "Old Town Square",
            "type": "Square",
            "description": "The heart of Prague's historic center, featuring the famous Astronomical Clock, Gothic Týn Church, Baroque St. Nicholas Church, and colorful baroque buildings. This UNESCO World Heritage site has been Prague's principal public square since the 10th century.",
            "indoor": false,
            "best_time": "Any time",
            "price_range": "Free",
            "seasonal_notes": "Christmas markets create magical atmosphere in winter. Summer brings outdoor cafes and street performances. Astronomical Clock shows draw crowds hourly.",
            "booking_tips": "Free to visit. Visit at the top of each hour for the Astronomical Clock show. Early morning offers fewer crowds for photos.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 50.0875,
            "longitude": 14.4213
        },
        {
            "name": "Astronomical Clock (Orloj)",
            "type": "Historical Monument",
            "description": "The world's third-oldest astronomical clock and the oldest one still operating, dating from 1410. Every hour on the hour, crowds gather to watch the procession of the Twelve Apostles and the striking of the time.",
            "indoor": false,
            "best_time": "Hourly shows",
            "price_range": "Free",
            "seasonal_notes": "Hourly shows year-round. Tower access available for panoramic city views. Winter shows are less crowded.",
            "booking_tips": "Arrive 10-15 minutes before the hour for the show. Tower climb requires separate ticket and offers great city views.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 5
            },
            "latitude": 50.0870,
            "longitude": 14.4207
        },
        {
            "name": "St. Vitus Cathedral",
            "type": "Cathedral",
            "description": "A magnificent Gothic cathedral within Prague Castle complex, featuring stunning stained glass windows, royal tombs, and the crown jewels. This architectural masterpiece took nearly 600 years to complete and is the spiritual heart of the Czech Republic.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Included in Castle ticket",
            "seasonal_notes": "Beautiful year-round. Summer offers longer visiting hours. Stained glass is most spectacular when sunlight streams through.",
            "booking_tips": "Included in Prague Castle tickets. Visit early morning for better photo opportunities and fewer crowds.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 5
            },
            "latitude": 50.0909,
            "longitude": 14.4009
        },
        {
            "name": "Jewish Quarter (Josefov)",
            "type": "Historical District",
            "description": "One of Europe's most significant Jewish historical sites, featuring synagogues, the Jewish cemetery, and the Jewish Museum. The area preserves nearly 1000 years of Jewish history and culture in Prague.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Guided tours provide deeper historical context. Closed on Saturdays and Jewish holidays.",
            "booking_tips": "Book tickets online for the Jewish Museum circuit. Allow 2-3 hours for complete visit. Guided tours highly recommended.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 50.0897,
            "longitude": 14.4188
        },
        {
            "name": "Wenceslas Square",
            "type": "Square",
            "description": "Prague's main commercial district and cultural center, this broad boulevard is lined with shops, restaurants, hotels, and historic buildings. Site of many important historical events including the Velvet Revolution demonstrations.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Vibrant nightlife in summer. Christmas markets in winter. Beautiful illumination in the evening.",
            "booking_tips": "Free to visit. Great for shopping and dining. Evening offers the best atmosphere.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 50.0813,
            "longitude": 14.4269
        },
        {
            "name": "Petřín Hill and Tower",
            "type": "Park",
            "description": "A large hill offering panoramic views of Prague, featuring the Petřín Lookout Tower (Prague's mini Eiffel Tower), beautiful gardens, and peaceful walking paths. Perfect for escaping the city crowds.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free (tower has fee)",
            "seasonal_notes": "Spring brings blooming flowers. Autumn offers colorful foliage. Tower offers 360-degree city views.",
            "booking_tips": "Take the funicular railway up or enjoy the scenic walk. Tower climb requires separate ticket.",
            "ratings": {
                "cost_estimate": 3,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 50.0836,
            "longitude": 14.3977
        },
        {
            "name": "Dancing House",
            "type": "Architecture",
            "description": "A striking example of deconstructivist architecture designed by Vlado Milunić and Frank Gehry. This modern building contrasts beautifully with Prague's historic architecture and houses a hotel, restaurant, and gallery.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Free (restaurant/gallery has fees)",
            "seasonal_notes": "Year-round attraction. Rooftop bar offers great city views. Best photographed from the riverside.",
            "booking_tips": "Free to admire from outside. Restaurant and gallery visits require payment. Rooftop bar reservations recommended.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 50.0754,
            "longitude": 14.4142
        },
        {
            "name": "Lennon Wall",
            "type": "Street Art",
            "description": "A colorful graffiti wall filled with John Lennon-inspired messages of peace, love, and freedom. Since the 1980s, it has been a symbol of hope and rebellion, constantly changing as visitors add their own messages.",
            "indoor": false,
            "best_time": "Any time",
            "price_range": "Free",
            "seasonal_notes": "Year-round attraction. Always evolving with new artwork. Popular photo spot for visitors.",
            "booking_tips": "Free to visit. Bring your own marker to add a message. Located near Charles Bridge in Lesser Town.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 50.0857,
            "longitude": 14.4059
        },
        {
            "name": "Prague National Theatre",
            "type": "Theatre",
            "description": "A stunning neo-Renaissance building that serves as the primary opera and ballet venue in Prague. Known for its beautiful interior, rich cultural programming, and significant role in Czech national identity.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate to Expensive",
            "seasonal_notes": "Year-round performances. Summer brings special festivals. Winter season offers classic repertoire.",
            "booking_tips": "Book tickets well in advance for popular performances. Guided tours available during the day.",
            "ratings": {
                "cost_estimate": 25,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 50.0811,
            "longitude": 14.4137
        },
        {
            "name": "Kampa Island",
            "type": "Island Park",
            "description": "A peaceful island park in the Vltava River, featuring beautiful gardens, art installations, and charming views of the city. Often called 'Prague's Venice' due to its canal and waterside atmosphere.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Beautiful in all seasons. Spring and summer offer lush greenery. Autumn provides colorful foliage.",
            "booking_tips": "Free to visit. Perfect for picnics and leisurely walks. Access via Charles Bridge or Kampa Museum.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 50.0838,
            "longitude": 14.4095
        },
        {
            "name": "Vltava River Cruise",
            "type": "Activity",
            "description": "Scenic boat cruises along the Vltava River offering unique perspectives of Prague's historic landmarks including Prague Castle, Charles Bridge, and the National Theatre from the water.",
            "indoor": false,
            "best_time": "Sunset",
            "price_range": "Moderate",
            "seasonal_notes": "Available year-round, but especially magical at sunset when monuments are illuminated. Summer offers longer evening cruises.",
            "booking_tips": "Book online for discounts. Evening cruises with dinner available. Choose boats with outdoor decks for best views.",
            "ratings": {
                "cost_estimate": 18,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 50.0755,
            "longitude": 14.4378
        },
        {
            "name": "Prague Zoo",
            "type": "Zoo",
            "description": "One of the world's top-rated zoos, featuring over 4,200 animals in naturalistic habitats. Famous for successful breeding programs and beautiful location in Troja valley with great views of Prague.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Best visited in spring and summer when animals are most active. Some indoor exhibits available year-round.",
            "booking_tips": "Purchase tickets online to avoid queues. Allow 3-4 hours for complete visit. Take bus or train to Troja.",
            "ratings": {
                "cost_estimate": 10,
                "suggested_duration_hours": 4,
                "cultural_significance": 3
            },
            "latitude": 50.1163,
            "longitude": 14.4147
        },
        {
            "name": "Vyšehrad Castle",
            "type": "Castle",
            "description": "A historic castle complex on a hill overlooking the Vltava River, featuring beautiful gardens, the Vyšehrad Cemetery where many famous Czechs are buried, and stunning views of Prague.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free (some buildings have fees)",
            "seasonal_notes": "Beautiful in all seasons. Spring brings blooming flowers in the gardens. Sunset offers magical views.",
            "booking_tips": "Free to explore the grounds. Some exhibitions require tickets. Less crowded than Prague Castle.",
            "ratings": {
                "cost_estimate": 3,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 50.0644,
            "longitude": 14.4179
        },
        {
            "name": "Municipal House",
            "type": "Concert Hall",
            "description": "A stunning Art Nouveau building housing Prague's premier concert hall, featuring elaborate decorations, beautiful restaurants, and regular classical music performances. An architectural gem from the early 20th century.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round concerts and events. Guided tours available during the day. New Year's concerts are particularly special.",
            "booking_tips": "Book concert tickets in advance. Guided tours show the magnificent interiors. Café and restaurant open daily.",
            "ratings": {
                "cost_estimate": 20,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 4
            },
            "latitude": 50.0873,
            "longitude": 14.4280
        },
        {
            "name": "St. Nicholas Church (Lesser Town)",
            "type": "Church",
            "description": "A magnificent Baroque church with an impressive dome and bell tower, featuring beautiful frescoes and organ concerts. One of Prague's most important Baroque buildings with stunning interior decorations.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Beautiful year-round. Regular organ concerts enhance the experience. Tower climb offers great views.",
            "booking_tips": "Small entry fee for church. Tower climb requires separate ticket. Check for concert schedule.",
            "ratings": {
                "cost_estimate": 5,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 50.0881,
            "longitude": 14.4033
        },
        {
            "name": "Prague Beer Garden (Letná)",
            "type": "Beer Garden",
            "description": "Prague's largest beer garden located in Letná Park, offering traditional Czech beers, pub food, and panoramic views of the city. A perfect place to experience Czech beer culture.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Moderate",
            "seasonal_notes": "Open primarily in warmer months (April-October). Sunset hours offer the best atmosphere and views.",
            "booking_tips": "No reservations needed. Bring cash as cards may not be accepted. Combine with a walk in Letná Park.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 50.0980,
            "longitude": 14.4146
        },
        {
            "name": "Prague Metronome",
            "type": "Monument",
            "description": "A giant metronome standing where Stalin's monument once was, this modern art installation has become an unexpected symbol of Prague. Located in Letná Park with excellent city views.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Year-round attraction. Excellent spot for panoramic photography. Popular with skateboarders and locals.",
            "booking_tips": "Free to visit. Accessible by walking through Letná Park. Great viewpoint for Prague Castle and Old Town.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 3
            },
            "latitude": 50.0977,
            "longitude": 14.4135
        },
        {
            "name": "Franz Kafka Museum",
            "type": "Museum",
            "description": "Dedicated to Prague's most famous literary son, this museum explores Kafka's life and work through interactive exhibits, manuscripts, and multimedia presentations in a atmospheric setting.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Year-round attraction. Dark and atmospheric interior provides escape from weather. Literary exhibitions change periodically.",
            "booking_tips": "Purchase tickets online or at venue. Audio guides available. Located near Charles Bridge in Lesser Town.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 50.0847,
            "longitude": 14.4067
        }
    ]
}