{
    "Spring": {
        "activities": [
            {
                "name": "Cherry Blossom Viewing in Rose Garden",
                "type": "Nature/Social",
                "description": "Enjoy the arrival of spring with blooming cherry trees, magnolias and early roses in Bern's beautiful Rose Garden (Rosengarten). This elevated park offers not only stunning flowers but spectacular panoramic views of the Old Town nestled in the Aare river bend.",
                "indoor": false,
                "best_time": "Late March - May (daytime)",
                "price_range": "Free",
                "seasonal_notes": "Blooming periods vary by weather conditions. The Rose Garden is one of Bern's most popular photography spots, especially with Old Town views.",
                "booking_tips": "No booking required. Visit on weekdays or early mornings for fewer crowds. The terrace restaurant in the Rose Garden is popular - consider reservations for lunch or coffee with a view."
            },
            {
                "name": "Bear Park (BärenPark) Spring Activity",
                "type": "Nature/Wildlife",
                "description": "Visit Bern's famous bears as they become more active after winter. The BärenPark is a modern facility along the banks of the Aare River where Bern's heraldic animals live in a naturalistic environment. Spring is especially interesting as the bears emerge from their winter dormancy and explore their terraced enclosure.",
                "indoor": false,
                "best_time": "Daytime (March-May)",
                "price_range": "Free",
                "seasonal_notes": "Bears are generally more active in spring than winter. The park ranger feeding times (check schedule) provide the best opportunity to see the bears active.",
                "booking_tips": "No booking needed. Combine with a walk across the Nydeggbrücke and a visit to the lower Old Town (Matte district). Information boards explain the bears' history in Bern."
            },
            {
                "name": "Bern Minster Tower Climb",
                "type": "Sightseeing/Cultural",
                "description": "Climb the 344 steps of Switzerland's tallest cathedral tower for exceptional spring views of the Old Town, Aare River, and on clear days, the snow-capped Alps in the distance. Spring offers excellent visibility as the air clarifies after winter.",
                "indoor": false,
                "best_time": "Daytime (clear days)",
                "price_range": "Budget (small fee)",
                "seasonal_notes": "Spring offers good lighting for photography, often with dramatic cloud formations and sometimes snow still visible on distant Alps.",
                "booking_tips": "No advance booking required. Pay the small fee at the tower entrance. Check opening hours as they can vary seasonally."
            },
            {
                "name": "Aare River Path Walks",
                "type": "Nature/Leisure",
                "description": "Explore the scenic walking paths along the Aare River as nature awakens. Follow paths on both sides of the turquoise river, enjoying views of the Old Town from below, watching early kayakers, and seeing the first flowers blooming along the riverbanks.",
                "indoor": false,
                "best_time": "Daytime (sunny days)",
                "price_range": "Free",
                "seasonal_notes": "Paths can sometimes be muddy in early spring. The river runs high with snowmelt, creating spectacular currents and colors.",
                "booking_tips": "No booking needed. Start at the Bear Park and follow paths in either direction. The Altenberg side offers good views of the Old Town."
            },
            {
                "name": "Bern Easter Market & Traditions",
                "type": "Cultural/Market",
                "description": "Experience Bern's Easter traditions, including the Easter market offering handmade decorations, regional specialties, and springtime crafts. Various churches in the Old Town hold special Easter services with music performances.",
                "indoor": false,
                "best_time": "Week before Easter",
                "price_range": "Free (browsing)/Budget (purchases)",
                "seasonal_notes": "Typically held on Münsterplatz (Cathedral Square) or Bundesplatz (Parliament Square). Weather can vary dramatically in spring.",
                "booking_tips": "No booking needed for markets. For Easter church services, especially concerts, arrive early to get seats."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Swimming in the Aare River",
                "type": "Recreation/Local Experience",
                "description": "Join locals in the quintessential Bern summer activity - swimming in the clean, fast-flowing Aare River. The most popular route involves entering at Marzili or Eichholz, floating downstream with the current, and exiting at designated spots with steps and railings. The turquoise Alpine water offers a refreshing escape on hot days.",
                "indoor": false,
                "best_time": "Sunny days (June-August, when water temperature is bearable)",
                "price_range": "Free",
                "seasonal_notes": "A beloved local tradition. Water temperature typically reaches comfortable levels by late June. Marzilibad gets very busy on hot weekend days.",
                "booking_tips": "No booking required. IMPORTANT: Only swim if you're a confident swimmer and follow local safety guidelines (entry/exit points, flow patterns). Observe locals first if you're new to river swimming. Store belongings in lockers at Marzilibad."
            },
            {
                "name": "Gurten Festival",
                "type": "Music Festival",
                "description": "Attend Bern's biggest open-air music festival held on Gurten, the city's local mountain. Features multiple stages with international and Swiss artists, food stalls, and spectacular views over Bern and towards the Alps. The festival combines a wide range of music genres in a beautiful natural setting.",
                "indoor": false,
                "best_time": "Mid-July (4 days, check exact dates)",
                "price_range": "High (day passes or festival passes)",
                "seasonal_notes": "Major event drawing tens of thousands of visitors. The weather can vary from very hot to sudden thunderstorms.",
                "booking_tips": "Buy tickets well in advance as they often sell out. Special festival transport runs from the city center. Consider day tickets if not attending the full festival. Camping options are available."
            },
            {
                "name": "Bern Buskers Festival",
                "type": "Street Performance/Music",
                "description": "Experience the lively Buskers Bern festival, where the Old Town streets and squares transform into performance spaces for street musicians, acrobats, dancers, and artists from around the world. The medieval backdrop of the UNESCO-listed Old Town creates a magical atmosphere for these performances.",
                "indoor": false,
                "best_time": "Mid-August (evenings)",
                "price_range": "Budget (voluntary contributions)",
                "seasonal_notes": "Performers are stationed throughout the Old Town. Warm summer evenings make for pleasant strolls between performance spots.",
                "booking_tips": "No advance booking. Buy a festival button to support the performers. Plan to wander through various Old Town locations to catch different acts. Evening performances create the best atmosphere."
            },
            {
                "name": "Federal Palace (Parliament) Tours",
                "type": "Cultural/Educational",
                "description": "Take advantage of extended summer visiting hours to tour Switzerland's Parliament building (Bundeshaus). The impressive domed hall and chambers showcase Swiss democracy and feature rich symbolism in their design and artwork. When Parliament is not in session (summer break), more areas are accessible.",
                "indoor": true,
                "best_time": "Daytime (check session schedule)",
                "price_range": "Free",
                "seasonal_notes": "Parliament typically has a summer break when more comprehensive tours are possible. The building offers a cool retreat on hot days.",
                "booking_tips": "Tours are free but reservation is required. Book online through the parliament website. Bring ID for entry. Summer is ideal as Parliament is often in recess, allowing better access."
            },
            {
                "name": "Outdoor Dining & Rose Garden Sunset",
                "type": "Leisure/Dining",
                "description": "Enjoy Bern's extensive outdoor dining scene and end the day with sunset views from the Rose Garden. Many restaurants offer scenic terraces, particularly those overlooking the Aare River like Altes Tramdepot or Schwellenmätteli. The Rose Garden provides spectacular evening light over the Old Town.",
                "indoor": false,
                "best_time": "Evening (dinner and sunset)",
                "price_range": "Moderate-High (dining)",
                "seasonal_notes": "Restaurant terraces are often busy on summer evenings - reservations recommended. The Rose Garden is a popular evening gathering spot.",
                "booking_tips": "Reserve tables at popular riverside restaurants. For the Rose Garden sunset, arrive 30-60 minutes before actual sunset to secure a good viewing spot on the terrace."
            },
            {
                "name": "Gurten Mountain Activities",
                "type": "Nature/Recreation",
                "description": "Take the funicular up Bern's local mountain, Gurten (858m), for panoramic views, hiking trails, a miniature railway, playgrounds, and restaurants. In summer, the mountaintop becomes a recreational paradise with locals and visitors enjoying picnics, games, or simply the spectacular 360° views of Bern, the surrounding countryside, and the Alps.",
                "indoor": false,
                "best_time": "Daytime (clear weather)",
                "price_range": "Budget (funicular ticket)",
                "seasonal_notes": "Popular weekend destination for locals. Can get busy but the extensive grounds provide space for everyone.",
                "booking_tips": "No need to book the funicular in advance. Consider a morning visit for clearer views of the Alps. Bring a picnic or use the self-service restaurant. The tobogganing run and miniature railway are fun for families."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "Onion Market (Zibelemärit)",
                "type": "Traditional Market/Festival",
                "description": "Experience Bern's famous Onion Market, a traditional folk festival dating back to the 1850s. Held on the fourth Monday of November, farmers from surrounding regions bring over 50 tons of onions and garlic, artistically braided and decorated. Features include confetti battles starting at 5am, onion tarts (Zibelechueche), handicrafts, mulled wine, and a festive carnival atmosphere throughout the Old Town.",
                "indoor": false,
                "best_time": "Fourth Monday in November (very early morning for authentic experience)",
                "price_range": "Free (entry)/Budget (purchases/food)",
                "seasonal_notes": "Major traditional event unique to Bern. Over 200 stalls. Early morning festivities include good-natured confetti battles and mulled wine.",
                "booking_tips": "No booking needed but accommodations in Bern book up far in advance for this date. For the true experience, join locals for the 5am start. Try the traditional onion tart and acquire an artistic onion braid as a souvenir."
            },
            {
                "name": "Autumn Colors in Bern's Forests",
                "type": "Nature/Walking",
                "description": "Explore the spectacular autumn foliage in the forests surrounding Bern. Areas like the Bremgartenwald, Gurten mountain paths, or Bantiger offer beautiful woodland walks with golden and red foliage. The Old Town's tree-lined river banks also display beautiful fall colors reflecting in the Aare River.",
                "indoor": false,
                "best_time": "October-early November (daytime)",
                "price_range": "Free",
                "seasonal_notes": "Peak foliage typically occurs in October. Early autumn generally offers clear days with good visibility.",
                "booking_tips": "No booking needed. Use public transport to reach starting points like Gurten funicular or forest edge bus stops. The tourist office offers maps of walking routes."
            },
            {
                "name": "Rendez-vous Bundesplatz Light Show",
                "type": "Light & Sound Performance",
                "description": "Witness the spectacular light and sound show projected onto the facade of the Federal Palace (Parliament Building). Each year features a different thematic show with stunning visuals, music, and narration, transforming the imposing building into a canvas for artistic storytelling.",
                "indoor": false,
                "best_time": "Evenings (October-November, check schedule for exact dates)",
                "price_range": "Free",
                "seasonal_notes": "Shows typically run multiple times each evening for several weeks. Popular event that draws large crowds.",
                "booking_tips": "No booking required. Shows last around 30 minutes and run multiple times per evening. Arrive early for central viewing positions on Bundesplatz. Check the official website for show times."
            },
            {
                "name": "Museum Visits & Special Exhibitions",
                "type": "Cultural/Educational",
                "description": "As weather cools, explore Bern's excellent museums and their special autumn exhibitions. Key venues include the Historical Museum & Einstein Museum, Zentrum Paul Klee (designed by Renzo Piano), Museum of Fine Arts, and the Museum of Communication. Many host special exhibitions in the cultural-rich autumn season.",
                "indoor": true,
                "best_time": "Daytime (check individual museum hours)",
                "price_range": "Moderate",
                "seasonal_notes": "Perfect activity for cooler or rainy autumn days. Special exhibitions often open in autumn cultural season.",
                "booking_tips": "Check museum websites for special exhibitions and potential advance ticket requirements. Note that many museums close on Mondays. Consider the Bern Card for multiple museum entries."
            },
            {
                "name": "Game Season Culinary Experience",
                "type": "Gastronomy/Cultural",
                "description": "Savor traditional Swiss autumn cuisine during game season (Jagdsaison). Numerous Bernese restaurants offer special menus featuring venison, wild boar, and other game meats prepared in traditional Swiss styles, often accompanied by spätzli, chestnuts, red cabbage, and seasonal vegetables.",
                "indoor": true,
                "best_time": "Dinner (October-November)",
                "price_range": "Moderate-High",
                "seasonal_notes": "Game season is a significant culinary tradition in Swiss autumn. Traditional restaurants often feature special game menus for limited periods.",
                "booking_tips": "Reserve tables in advance, especially at renowned traditional restaurants like Kornhauskeller or restaurants in the Old Town. Ask for the seasonal game menu (Wildmenü)."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Bern Christmas Markets",
                "type": "Seasonal Market/Festive",
                "description": "Explore Bern's atmospheric Christmas markets set against the UNESCO-listed Old Town backdrop. The main markets are on Münsterplatz (Cathedral Square) and Waisenhausplatz, featuring handicrafts, seasonal decorations, food, and gifts. Smaller markets and special installations appear throughout the cobblestone streets and arcades of the Old Town.",
                "indoor": false,
                "best_time": "Late November to December 24 (check exact dates)",
                "price_range": "Free (Entry)/Budget-Moderate (Purchases/Food/Drinks)",
                "seasonal_notes": "The medieval setting with decorative lights creates a uniquely magical atmosphere. The covered arcades (Lauben) offer some weather protection while shopping.",
                "booking_tips": "No booking required. Evening visits offer the most atmospheric experience with lights. Try traditional treats like raclette, chestnuts (Marroni), and mulled wine (Glühwein)."
            },
            {
                "name": "Rendez-vous Bundesplatz Winter Edition",
                "type": "Light Show/Winter Event",
                "description": "Experience the winter edition of the Parliament Building light show and the adjacent ice skating rink on Bundesplatz. The grand Federal Palace becomes the backdrop for winter-themed light projections, while the square transforms into a public skating venue.",
                "indoor": false,
                "best_time": "Evening (November-December, check schedule)",
                "price_range": "Free (viewing)/Budget (ice skating)",
                "seasonal_notes": "Combines cultural entertainment with winter recreation. The Parliament Square setting is particularly impressive when illuminated.",
                "booking_tips": "No booking needed for viewing the light show. Ice skate rental available on-site; bring gloves for skating. Check the official website for show times."
            },
            {
                "name": "Gurten Winter Activities",
                "type": "Winter Recreation",
                "description": "Enjoy winter activities on Bern's local mountain, Gurten. When there's sufficient snow, the mountain offers sledding runs, winter walking trails, and beautiful snowy vistas of the city and Alps. Even without snow, the clear winter air provides exceptional views.",
                "indoor": false,
                "best_time": "Daytime (snow conditions permitting)",
                "price_range": "Budget (funicular ticket)",
                "seasonal_notes": "Snow conditions can vary greatly. The mountain restaurant offers warming winter specialties.",
                "booking_tips": "Check snow conditions and sled rental availability online before visiting. Take the funicular from Wabern (connected to Bern by tram). Dress very warmly as it's exposed and colder than in the city."
            },
            {
                "name": "Swiss Alpine Museum Special Exhibitions",
                "type": "Cultural/Educational",
                "description": "Visit the Swiss Alpine Museum (Alpines Museum der Schweiz) for its winter exhibitions focusing on mountain culture, Alpine environments, and winter sports history. The museum offers insights into Switzerland's special relationship with its mountains, particularly relevant during winter months.",
                "indoor": true,
                "best_time": "Daytime (check opening hours)",
                "price_range": "Budget",
                "seasonal_notes": "Perfect indoor activity during inclement weather. Special winter-themed exhibitions often run during this season.",
                "booking_tips": "No advance booking typically required. Check the website for current exhibitions. Located near Helvetiaplatz, easily accessible from the Old Town."
            },
            {
                "name": "Traditional Cheese Fondue Experience",
                "type": "Gastronomy/Cultural",
                "description": "Indulge in Switzerland's iconic winter dish - cheese fondue - in one of Bern's traditional restaurants. This communal meal of melted cheese eaten with bread pieces is perfectly suited to cold winter evenings. Bern offers various styles, including the local favorite moitié-moitié (half Gruyère, half Vacherin cheese).",
                "indoor": true,
                "best_time": "Dinner (November-March)",
                "price_range": "Moderate-High",
                "seasonal_notes": "Classic winter warming dish. Restaurant interiors are often cozy and traditionally decorated during winter season.",
                "booking_tips": "Reservations recommended, especially for popular spots like Restaurant Lötschberg or Harmonie. Some restaurants offer fondue only during winter months. Special fondue trams or events sometimes run seasonally."
            },
            {
                "name": "New Year's Eve in Bern",
                "type": "Celebration/Festival",
                "description": "Experience New Year's Eve (Silvester) in Bern's beautiful Old Town. While not as large as celebrations in bigger cities, Bern offers a more intimate atmosphere with restaurants hosting special dinners, bars and clubs organizing parties, and people gathering on bridges and viewpoints to watch informal fireworks over the medieval cityscape.",
                "indoor": false,
                "best_time": "Evening/Night (December 31st)",
                "price_range": "Free (public areas)/Moderate-High (restaurants/events)",
                "seasonal_notes": "The historic setting makes for a uniquely atmospheric celebration. Weather is typically very cold.",
                "booking_tips": "Reserve restaurants or special events well in advance. The Münsterplattform (Cathedral terrace) and bridges offer good viewpoints for fireworks. Dress extremely warmly if celebrating outdoors."
            }
        ]
    }
}