{
  "sites": [
    {
      "name": "Piazza Maggiore",
      "type": "Square",
      "description": "The heart of Bologna's historic center, Piazza Maggiore is surrounded by some of the city's most important buildings including the Basilica di San Petronio, Palazzo dei Notai, Palazzo d'Accursio, and Palazzo del Podestà. This medieval square has been the city's main gathering place since the 13th century and continues to be a vibrant hub of activity.",
      "indoor": false,
      "best_time": "Evening",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round but especially lively during summer evenings when locals gather. Winter brings Christmas markets and decorations. Spring and fall offer ideal temperatures for outdoor dining and people-watching.",
      "booking_tips": "No booking required. Many cafes and restaurants line the square. Free WiFi available in the square. Guided tours of surrounding buildings available.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 44.4949,
      "longitude": 11.3426
    },
    {
      "name": "Basilica di San Petronio",
      "type": "Church",
      "description": "The world's 15th-largest church, this massive Gothic basilica dominates Piazza Maggiore. Construction began in 1390 but remains unfinished, with the facade still partially bare. The church houses the world's largest sundial, designed by Cassini in 1655, and important artworks including frescoes by Giovanni da Modena. The church is dedicated to Bologna's patron saint, Saint Petronius.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "The sundial is most visible during winter months when the sun's rays reach the floor. Summer brings more tourists but the church remains cool. Dress code strictly enforced (covered shoulders and knees).",
      "booking_tips": "No booking required for main church. Photography requires a permit. Guided tours available for the sundial and astronomical clock. Check mass times as the church closes to tourists during services.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4949,
      "longitude": 11.3426
    },
    {
      "name": "Due Torri (Two Towers)",
      "type": "Landmark",
      "description": "The iconic leaning towers of Bologna, Asinelli and Garisenda, are the city's most famous symbols. The taller Asinelli Tower (97.2m) is open to visitors, while the shorter Garisenda Tower (48m) leans more dramatically and is closed. Built between 1109-1119, they were symbols of power for the wealthy families who commissioned them.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Best visited on clear days for panoramic views. Summer mornings are ideal to avoid heat and crowds. Winter offers clearer views but can be cold at the top. May close during severe weather.",
      "booking_tips": "Advance online booking recommended. Limited daily visitors allowed. 498 steps to the top. Not suitable for those with mobility issues or fear of heights. Combined tickets available with other city attractions.",
      "ratings": {
        "cost_estimate": 5,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 44.4944,
      "longitude": 11.3475
    },
    {
      "name": "Archiginnasio Palace",
      "type": "Palace/Museum",
      "description": "The historic seat of the University of Bologna, this 16th-century palace features the stunning Anatomical Theatre, where medical students once observed dissections. The palace's walls and ceilings are covered with thousands of coats of arms of students and professors. Today it houses the Municipal Library and the Anatomical Theatre Museum.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with consistent indoor temperature. Less crowded during academic breaks. The Anatomical Theatre is particularly atmospheric in winter when fewer tourists visit.",
      "booking_tips": "Online booking recommended for the Anatomical Theatre. Photography permitted without flash. Guided tours available. Library access requires registration.",
      "ratings": {
        "cost_estimate": 3,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4947,
      "longitude": 11.3434
    },
    {
      "name": "Santo Stefano Basilica",
      "type": "Church Complex",
      "description": "Known as the 'Seven Churches' (though only four remain), this complex of interconnected religious buildings dates from the 5th century. The complex includes the Church of the Crucifix, the Church of the Holy Sepulchre, the Church of Saints Vitale and Agricola, and the Church of the Trinity. The complex was built to replicate Jerusalem's holy sites.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Open year-round with consistent indoor temperature. Special religious ceremonies during Easter and Christmas. Less crowded during weekday mornings.",
      "booking_tips": "No booking required. Guided tours available. Photography permitted without flash. Some areas may be closed during religious services.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4877,
      "longitude": 11.3482
    },
    {
      "name": "Museo Civico Archeologico",
      "type": "Museum",
      "description": "Housed in a 15th-century palace, this museum contains one of Italy's most important archaeological collections. Highlights include Etruscan artifacts from Bologna's ancient past, Egyptian antiquities, Roman finds, and prehistoric materials. The museum's collection spans from prehistoric times to the Roman era, with particular focus on Bologna's Etruscan period as Felsina.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with consistent indoor temperature. Less crowded during winter months. Special exhibitions throughout the year.",
      "booking_tips": "Online booking recommended for special exhibitions. Free entry on the first Sunday of each month. Audio guides available in multiple languages. Combined tickets available with other city museums.",
      "ratings": {
        "cost_estimate": 6,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 44.4947,
      "longitude": 11.3434
    },
    {
      "name": "Portico di San Luca",
      "type": "Portico",
      "description": "The world's longest portico, stretching 3.8 km from Porta Saragozza to the Sanctuary of the Madonna di San Luca. This covered walkway features 666 arches and was built between 1674-1793 to protect pilgrims walking to the sanctuary. The portico offers stunning views of Bologna and the surrounding hills.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Best visited in spring and fall for comfortable walking temperatures. Summer mornings are ideal to avoid heat. Winter offers clear views but can be cold. The portico provides shelter from rain.",
      "booking_tips": "No booking required. The walk takes about 1 hour each way. Shuttle bus available to the sanctuary. Wear comfortable walking shoes. The portico is wheelchair accessible.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 44.4800,
      "longitude": 11.3300
    },
    {
      "name": "Sanctuary of the Madonna di San Luca",
      "type": "Church",
      "description": "Perched on Colle della Guardia, this 18th-century church is connected to the city by the world's longest portico. The church houses a Byzantine icon of the Virgin Mary, believed to have been painted by Saint Luke. The sanctuary offers panoramic views of Bologna and the surrounding countryside.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Free",
      "seasonal_notes": "Beautiful year-round but especially atmospheric during religious festivals. Summer brings more visitors but the hilltop location provides relief from heat. Winter offers clearer views.",
      "booking_tips": "No booking required. Accessible via portico walk or shuttle bus. Photography permitted without flash. Check mass times as the church closes to tourists during services.",
      "ratings": {
        "cost_estimate": 0,
        "suggested_duration_hours": 1,
        "cultural_significance": 5
      },
      "latitude": 44.4750,
      "longitude": 11.2900
    },
    {
      "name": "Mercato di Mezzo",
      "type": "Market",
      "description": "Bologna's historic food market, located in the Quadrilatero area, features traditional food shops, delis, and restaurants. The market area has been a center of commerce since medieval times. Today it offers a mix of traditional food shops and modern eateries, perfect for experiencing Bologna's famous food culture.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round. Most shops close during afternoon siesta (1-4pm). Saturday mornings are busiest. Some shops close on Sundays. Seasonal specialties available throughout the year.",
      "booking_tips": "No booking required for browsing. Some restaurants require reservations for dinner. Guided food tours available. Cash preferred at traditional shops.",
      "ratings": {
        "cost_estimate": 20,
        "suggested_duration_hours": 1.5,
        "cultural_significance": 5
      },
      "latitude": 44.4947,
      "longitude": 11.3434
    },
    {
      "name": "Pinacoteca Nazionale",
      "type": "Museum",
      "description": "Bologna's main art gallery, housed in a former Jesuit complex, contains one of Italy's most important collections of Emilian art. The museum features works by Giotto, Raphael, Titian, and local artists including the Carracci brothers and Guido Reni. The collection spans from the 13th to the 18th century.",
      "indoor": true,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Open year-round with consistent indoor temperature. Less crowded during winter months. Special exhibitions throughout the year.",
      "booking_tips": "Online booking recommended for special exhibitions. Free entry on the first Sunday of each month. Audio guides available in multiple languages. Combined tickets available with other city museums.",
      "ratings": {
        "cost_estimate": 6,
        "suggested_duration_hours": 2,
        "cultural_significance": 5
      },
      "latitude": 44.4947,
      "longitude": 11.3434
    },
    {
      "name": "Bologna Food Tour Experience",
      "type": "Cultural Experience",
      "description": "Bologna is known as 'La Grassa' (The Fat) for its rich culinary tradition. Experience the city's food culture through its famous products including tortellini, mortadella, ragù alla bolognese, and traditional balsamic vinegar. The city's food markets, traditional shops, and historic restaurants offer authentic experiences of Emilian cuisine.",
      "indoor": false,
      "best_time": "Morning",
      "price_range": "Moderate",
      "seasonal_notes": "Available year-round with seasonal specialties. Summer brings outdoor dining opportunities. Winter features hearty traditional dishes. Some shops close during August.",
      "booking_tips": "Guided food tours available offering historical context and insider access to traditional producers. Many restaurants require reservations, especially for dinner. Pay attention to traditional opening hours.",
      "ratings": {
        "cost_estimate": 30,
        "suggested_duration_hours": 3,
        "cultural_significance": 5
      },
      "latitude": 44.4947,
      "longitude": 11.3434
    }
  ]
} 