{
    "sites": [
        {
            "name": "Vieux-Port (Old Port)",
            "type": "Harbor",
            "description": "The historic heart of Marseille since 600 BC, this bustling natural harbor is lined with restaurants, cafés, and markets. The U-shaped port is filled with fishing boats and yachts and serves as the city's social center. The area comes alive especially during markets and features the iconic stainless steel mirrored canopy by Norman Foster.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Summer evenings feature lively outdoor dining. The daily fish market happens each morning. Special events during Bastille Day (July 14) and Christmas season.",
            "booking_tips": "No booking required. Free public space accessible at all times.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 43.2951,
            "longitude": 5.3749
        },
        {
            "name": "Basilique Notre-Dame de la Garde",
            "type": "Basilica",
            "description": "This iconic 19th-century Byzantine-style basilica stands on Marseille's highest point (154m), crowned by a 11m golden Madonna statue. Known as 'La Bonne Mère' to locals, it offers unparalleled 360° views of the city, Mediterranean Sea, and surrounding islands. The interior features stunning mosaics and ex-voto offerings from sailors.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Visit early morning to avoid crowds and heat in summer. The basilica is beautifully lit at night. Special masses and increased visitors during religious holidays.",
            "booking_tips": "No booking required for general entry. Small fee for museum section. Can be reached by tourist train, bus, or a steep walk.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 5
            },
            "latitude": 43.2841,
            "longitude": 5.3714
        },
        {
            "name": "Le Panier",
            "type": "District",
            "description": "Marseille's oldest quarter and historical heart dates back to Greek settlement in 600 BC. This labyrinth of narrow streets, colorful buildings, and steep staircases is filled with artisan shops, cafés, and cultural landmarks including Centre de la Vieille Charité. Once a poor neighborhood, it's now a vibrant creative hub.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Best explored early morning before heat builds in summer. Many shops close for lunch and on Sundays. Area hosts various cultural events throughout the year.",
            "booking_tips": "No booking required for exploring. Walking tours available focusing on history and street art.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 3,
                "cultural_significance": 5
            },
            "latitude": 43.2986,
            "longitude": 5.3675
        },
        {
            "name": "MuCEM (Museum of European and Mediterranean Civilizations)",
            "type": "Museum",
            "description": "This striking modern museum, opened in 2013 when Marseille was European Capital of Culture, is dedicated to Mediterranean civilizations. The innovative building features a dark concrete lattice shell connected to the historic Fort Saint-Jean by a high footbridge. Its collections explore Mediterranean cultures through history and contemporary issues.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with rotating exhibitions. The rooftop terrace and restaurant offer exceptional views and are popular in summer. Free on first Sunday of each month.",
            "booking_tips": "Online booking recommended during peak season. Combined ticket with nearby museums offers good value.",
            "ratings": {
                "cost_estimate": 11,
                "suggested_duration_hours": 2.5,
                "cultural_significance": 5
            },
            "latitude": 43.2970,
            "longitude": 5.3620
        },
        {
            "name": "Calanques National Park",
            "type": "Natural Park",
            "description": "This spectacular national park stretches along the Mediterranean coast between Marseille and Cassis, featuring dramatic limestone cliffs, hidden coves with turquoise waters, and rugged hiking trails. The pristine beaches and breathtaking viewpoints make it one of Provence's natural wonders.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Access may be restricted in summer due to fire risks. Spring and fall offer ideal hiking conditions. Swimming best in summer months when waters are warmest.",
            "booking_tips": "No booking required for hiking. Boat tours from Vieux-Port require advance booking in peak season. Access regulations change seasonally - check before visiting.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 6,
                "cultural_significance": 4
            },
            "latitude": 43.2185,
            "longitude": 5.4315
        },
        {
            "name": "Château d'If",
            "type": "Historical Site",
            "description": "This fortress-turned-prison on a small island in Marseille's bay gained international fame as the setting for Alexandre Dumas' 'The Count of Monte Cristo'. Built in the 16th century, it offers insight into military history and prison conditions, along with spectacular views of Marseille's coastline.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Boat services run year-round but less frequently in winter and may be cancelled during strong winds. Summer brings larger crowds and longer waiting times for boats.",
            "booking_tips": "Ferry tickets can be purchased at Vieux-Port. Last return boat is typically around 5:30 PM. Check weather conditions before going.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 43.2795,
            "longitude": 5.3250
        },
        {
            "name": "La Canebière",
            "type": "Boulevard",
            "description": "Marseille's historic main street stretches from the Vieux-Port uphill through the city center. Once known as the 'Champs-Élysées of Marseille' during its 19th-century heyday, this broad avenue remains an important commercial artery lined with shops, cafés, and historic buildings reflecting the city's maritime prosperity.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Busy year-round, particularly on market days. Major celebrations take place here during festivals. Many shops close on Sundays.",
            "booking_tips": "No booking required. Free public street accessible at all times.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.2970,
            "longitude": 5.3726
        },
        {
            "name": "Centre de la Vieille Charité",
            "type": "Cultural Center",
            "description": "This stunning 17th-century baroque complex in Le Panier district originally served as an almshouse for the city's poor. Restored in the 1970s, it now houses museums (Mediterranean Archaeology Museum and Museum of African, Oceanic, and Amerindian Arts), exhibition spaces, and a small chapel with a remarkable egg-shaped dome.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round with rotating exhibitions. The courtyard provides welcome shade in summer. Reduced visitors during off-season winter months.",
            "booking_tips": "No advance booking required. Check website for current exhibitions. Combined ticket with other city museums offers savings.",
            "ratings": {
                "cost_estimate": 9,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 43.2994,
            "longitude": 5.3663
        },
        {
            "name": "Cathédrale La Major",
            "type": "Cathedral",
            "description": "This massive Byzantine-Roman cathedral is one of the largest in France. Built between 1852 and 1893 on the site of the old cathedral, it features distinctive green and white striped marble, impressive domes, and ornate mosaics. Its waterfront location makes it a prominent landmark visible from arriving ships.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Open year-round. Special services during Easter and Christmas periods. Cooler morning visits recommended in summer.",
            "booking_tips": "No booking required. Respect dress code and silence during services. Free guided tours available at specific times.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.2981,
            "longitude": 5.3643
        },
        {
            "name": "Palais Longchamp",
            "type": "Monument",
            "description": "This monumental fountain complex was built in the 19th century to celebrate the completion of the Canal de Marseille. The majestic colonnade, cascading fountains, and landscaped gardens house the Museum of Fine Arts and Natural History Museum in its two symmetrical wings, creating one of the city's most elegant public spaces.",
            "indoor": false,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "The gardens are particularly beautiful in spring. Fountains may not operate during water restrictions. Museums within require separate entry fees.",
            "booking_tips": "No booking required for the monument and gardens. Museums have separate admission with potential queues during tourist season.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 4
            },
            "latitude": 43.3044,
            "longitude": 5.3975
        },
        {
            "name": "Marseille Soap Museum (Musée du Savon de Marseille)",
            "type": "Museum",
            "description": "Dedicated to Marseille's famous olive oil soap tradition dating back to the Middle Ages, this small museum explores the manufacturing process and historical importance of this iconic product. Visitors can observe traditional soap-making techniques and purchase authentic Savon de Marseille products.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Open year-round. Workshops are particularly popular during tourist season. A good activity for rainy days.",
            "booking_tips": "Soap-making workshops require advance booking. General museum visits don't require reservation.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 43.2942,
            "longitude": 5.3697
        },
        {
            "name": "Fort Saint-Jean",
            "type": "Historical Site",
            "description": "This 17th-century fort at the entrance to the Vieux-Port was built by Louis XIV to control the city. Now integrated with MuCEM, it offers gardens, exhibitions, and panoramic views. Connected to the J4 esplanade by a high footbridge, it symbolizes the connection between historical and modern Marseille.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Gardens and walkways are freely accessible. Evening visits offer spectacular sunset views over the Mediterranean. Some indoor spaces require MuCEM tickets.",
            "booking_tips": "No booking required for outdoor areas. Exhibition spaces may require MuCEM ticket or separate booking.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.2964,
            "longitude": 5.3619
        },
        {
            "name": "Abbaye Saint-Victor",
            "type": "Abbey",
            "description": "One of Marseille's oldest religious buildings, this 5th-century abbey sits on the south bank of the Vieux-Port. Its ancient crypt contains early Christian sarcophagi and is believed to be built over Greek-era caves. The fortified church represents the city's early Christian history and hosts the annual Candlemas celebration.",
            "indoor": true,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "The crypt may close for lunch hours. February 2nd features the famous Candlemas procession with the Black Madonna. Summer offers cooler refuge from heat.",
            "booking_tips": "No booking required. Small donation requested for crypt access. Check opening hours as they vary seasonally.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 4
            },
            "latitude": 43.2913,
            "longitude": 5.3687
        },
        {
            "name": "Marché aux Poissons",
            "type": "Market",
            "description": "This traditional fish market takes place every morning at the Vieux-Port quay. Local fishermen sell their fresh catch directly from boats that have just returned to port. It offers an authentic glimpse of Marseille's continuing connection to the sea and inspiration for the city's famous bouillabaisse fish stew.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Free",
            "seasonal_notes": "Takes place daily but only until around 10-11am. Weather and fishing conditions affect availability. Sunday brings the largest variety.",
            "booking_tips": "No booking required. Arrive early (7-9am) for best selection. Free to browse, purchases in cash preferred by most vendors.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 0.5,
                "cultural_significance": 4
            },
            "latitude": 43.2950,
            "longitude": 5.3736
        },
        {
            "name": "Vallon des Auffes",
            "type": "Harbor",
            "description": "This picturesque miniature fishing port tucked under a large viaduct is one of Marseille's most charming spots. The tiny harbor with traditional fishing boats, pastel houses, and renowned seafood restaurants preserves the authentic atmosphere of old Marseille, just a short walk from the city center.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "Particularly atmospheric at sunset. Restaurants are extremely popular in summer and often require advance booking. Swimming spot used by locals in summer.",
            "booking_tips": "No booking required for visiting. Restaurants like Chez Fonfon (famous for bouillabaisse) require reservations weeks in advance during peak season.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 43.2825,
            "longitude": 5.3574
        },
        {
            "name": "Unité d'Habitation / Cité Radieuse",
            "type": "Architecture",
            "description": "This revolutionary post-war housing complex designed by Le Corbusier is a UNESCO World Heritage site and architectural pilgrimage destination. Completed in 1952, the concrete apartment building includes a shopping street, hotel rooms, and rooftop terrace with stunning views, embodying Le Corbusier's vision of vertical urban living.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "The rooftop is particularly pleasant in good weather. Tours run year-round but are more frequent in summer. The interior MAMO art center hosts rotating exhibitions.",
            "booking_tips": "Guided tours available through the tourist office require advance booking. The rooftop and certain public areas can be visited independently.",
            "ratings": {
                "cost_estimate": 8,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 4
            },
            "latitude": 43.2608,
            "longitude": 5.3968
        },
        {
            "name": "MAMO Art Center",
            "type": "Gallery",
            "description": "Located on the rooftop of Le Corbusier's Cité Radieuse, this contemporary art space was created by French designer Ora-Ïto. The former gymnasium has been transformed into an exhibition venue hosting major international artists with dramatic displays against the backdrop of Marseille's skyline and the Mediterranean Sea.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Free",
            "seasonal_notes": "Open only during exhibition periods, typically summer months. The rooftop terrace offers exceptional views of the city and sea.",
            "booking_tips": "No advance booking required. Check website for current exhibitions as the space sometimes closes between shows.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 1,
                "cultural_significance": 3
            },
            "latitude": 43.2608,
            "longitude": 5.3968
        },
        {
            "name": "Frioul Islands",
            "type": "Natural Site",
            "description": "This small archipelago just off Marseille's coast comprises four islands, with Ratonneau and Pomègues being the largest and connected by a causeway. Known for pristine beaches, clear waters, and diverse flora, these protected islands offer hiking trails, swimming spots, and views of Château d'If and Marseille's coastline.",
            "indoor": false,
            "best_time": "Morning",
            "price_range": "Moderate",
            "seasonal_notes": "Ferry service increases in summer months. Islands have minimal shade - bring sun protection. Waters are clearest in early summer before peak tourist season.",
            "booking_tips": "Ferry tickets available at Vieux-Port. Last return ferries are earlier in winter months. Limited food options - consider bringing supplies.",
            "ratings": {
                "cost_estimate": 12,
                "suggested_duration_hours": 5,
                "cultural_significance": 3
            },
            "latitude": 43.2802,
            "longitude": 5.3063
        },
        {
            "name": "Cours Julien",
            "type": "District",
            "description": "This vibrant, bohemian neighborhood centered around a pedestrian square is Marseille's hub for street art, alternative culture, and nightlife. Colorful murals cover building facades, while indie shops, record stores, cafés, and music venues create a lively atmosphere popular with students and creatives.",
            "indoor": false,
            "best_time": "Evening",
            "price_range": "Free",
            "seasonal_notes": "The district comes alive in evenings with busy restaurant terraces. Wednesday and Saturday mornings feature a flower market. Street performers frequent the area in summer.",
            "booking_tips": "No booking required for exploring. Restaurant reservations recommended for dinner, especially weekends. Street art tours available through local guides.",
            "ratings": {
                "cost_estimate": 0,
                "suggested_duration_hours": 2,
                "cultural_significance": 3
            },
            "latitude": 43.2937,
            "longitude": 5.3834
        },
        {
            "name": "Stade Vélodrome",
            "type": "Stadium",
            "description": "Home to Olympique de Marseille football club, this iconic 67,000-seat stadium is France's second-largest and reflects the city's passionate football culture. Renovated for Euro 2016 with a distinctive wave-like roof, the stadium offers tours showcasing its history, locker rooms, and the intense atmosphere that makes OM matches legendary.",
            "indoor": true,
            "best_time": "Afternoon",
            "price_range": "Moderate",
            "seasonal_notes": "Stadium tours unavailable on match days. The football season runs August to May. Summer months may feature concerts and special events.",
            "booking_tips": "Stadium tours best booked online in advance. Match tickets should be purchased well ahead for important games, which often sell out.",
            "ratings": {
                "cost_estimate": 15,
                "suggested_duration_hours": 1.5,
                "cultural_significance": 3
            },
            "latitude": 43.2697,
            "longitude": 5.3958
        },
        {
            "name": "Bouillabaisse Restaurants",
            "type": "Cultural Experience",
            "description": "Sampling authentic bouillabaisse, Marseille's famous fish stew, is an essential culinary experience. Traditionally made with local rockfish, saffron, fennel, and served with rouille sauce and croutons, this dish originated as fishermen's food but evolved into high cuisine. Several historic restaurants specialize in traditional preparations.",
            "indoor": true,
            "best_time": "Evening",
            "price_range": "Expensive",
            "seasonal_notes": "Traditional restaurants serve year-round, though fish selection varies seasonally. Many locals consider fall and winter the best seasons for bouillabaisse when certain fish are more flavorful.",
            "booking_tips": "Advance reservations essential at renowned establishments like Chez Michel, Miramar, or Chez Fonfon. Authentic bouillabaisse requires ordering for minimum 2 people and often 24-hour notice.",
            "ratings": {
                "cost_estimate": 70,
                "suggested_duration_hours": 2,
                "cultural_significance": 5
            },
            "latitude": 43.2950,
            "longitude": 5.3650
        }
    ]
}