{
    "Spring": {
        "activities": [
            {
                "name": "Mars en Baroque Festival",
                "type": "Cultural Event",
                "description": "Experience Marseille's premier baroque music festival featuring international ensembles performing in historic venues throughout the city, including concerts in churches, theaters, and the stunning Abbey of Saint-Victor.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "The festival runs throughout March, transforming Marseille's historic venues into showcase spaces for period instruments and historically informed performances.",
                "booking_tips": "Book tickets online at least two weeks in advance for popular concerts. Check for free open rehearsals and educational events included in the program."
            },
            {
                "name": "Calanques Hiking",
                "type": "Outdoor Activity",
                "description": "Explore the spectacular limestone cliffs and turquoise coves of Calanques National Park during spring when wildflowers bloom along the trails and temperatures are ideal for hiking.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring offers perfect hiking weather before summer heat and fire restrictions. The park explodes with Mediterranean wildflowers in April and May.",
                "booking_tips": "No booking required for hiking, but check the official park website for any temporary trail closures. Start early from Luminy or Cassis for the most popular routes."
            },
            {
                "name": "Marché de Noailles",
                "type": "Market",
                "description": "Visit the vibrant multicultural market along Rue du Marché des Capucins, where North African, Middle Eastern, and Mediterranean influences create Marseille's most colorful and authentic food shopping experience.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Spring brings fresh local produce like asparagus, artichokes, and the first strawberries to this bustling market in the heart of the city.",
                "booking_tips": "No booking needed. Visit Tuesday through Sunday mornings before noon for the best selection and atmosphere. Closed Mondays."
            },
            {
                "name": "Boating to Château d'If",
                "type": "Boat Tour",
                "description": "Take a boat trip to the famous island fortress made legendary by Alexandre Dumas' 'The Count of Monte Cristo,' enjoying spectacular views of Marseille's coastline along the way.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Spring offers calmer seas than winter with fewer crowds than summer. The crossing is more reliable as mistral winds are less frequent.",
                "booking_tips": "Boats depart from the Vieux-Port. Purchase round-trip tickets and check the last return time. Tours can be canceled in bad weather, so have a backup plan."
            },
            {
                "name": "Printemps de l'Art Contemporain",
                "type": "Art Festival",
                "description": "Discover Marseille's vibrant contemporary art scene during this spring festival that unites galleries, museums, and alternative spaces across the city with exhibitions, performances, and artist talks.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Free-Budget",
                "seasonal_notes": "This May festival showcases Marseille's dynamic art community with many venues offering extended hours and special events.",
                "booking_tips": "No booking required for most exhibitions. Pick up a map at the Tourist Office or MuCEM showing participating venues and special events."
            },
            {
                "name": "Cooking Workshop at La Cuisine de Gagny",
                "type": "Workshop",
                "description": "Learn to prepare Provençal spring cuisine in a hands-on cooking class focusing on local specialties like petits farcis, artichoke barigoule, and bouillabaisse using fresh market ingredients.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Spring classes highlight seasonal Mediterranean ingredients and traditional recipes that showcase Marseille's culinary heritage.",
                "booking_tips": "Classes are conducted in both French and English. Book at least two weeks in advance as groups are kept small for personalized instruction."
            },
            {
                "name": "Frioul Islands Excursion",
                "type": "Outdoor Activity",
                "description": "Explore the pristine Frioul Archipelago just off Marseille's coast, discovering secluded beaches, endemic plants, and historic fortifications on these protected islands.",
                "indoor": false,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "Spring brings nesting seabirds and flowering plants to the islands, with pleasant temperatures ideal for walking the natural trails.",
                "booking_tips": "Ferry tickets can be purchased at the Vieux-Port terminal. Bring water and supplies as services on the islands are limited, especially in pre-summer months."
            },
            {
                "name": "MUCEM Exhibition",
                "type": "Museum",
                "description": "Visit Marseille's landmark Museum of European and Mediterranean Civilizations for its spring exhibition program, housed in an iconic contemporary building connected to historic Fort Saint-Jean.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Spring features new major exhibitions, and the museum's rooftop terrace and suspended walkways offer spectacular harbor views in pleasant weather.",
                "booking_tips": "Free on the first Sunday of each month. Visit later in the afternoon on weekdays to avoid school groups. The rooftop café is an excellent spot for sunset views."
            },
            {
                "name": "Urban Walking Tour through Le Panier",
                "type": "Walking Tour",
                "description": "Discover Marseille's oldest neighborhood on a guided walk through Le Panier's labyrinthine streets, learning about its rich history from Greek settlement to contemporary artistic revival.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Budget",
                "seasonal_notes": "Spring offers comfortable walking temperatures with fewer tourists than summer months, plus many cafés and artisan shops reopen after winter closures.",
                "booking_tips": "Book through the Tourist Office for guided tours in English. Self-guided routes are available through apps like 'Marseille City Pass' with highlighted points of interest."
            }
        ]
    },
    "Summer": {
        "activities": [
            {
                "name": "Festival de Marseille",
                "type": "Cultural Event",
                "description": "Experience this major contemporary performing arts festival featuring international dance, theater, and music performances in venues throughout the city, from historic theaters to unusual public spaces.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Moderate-Expensive",
                "seasonal_notes": "Running from late June through July, the festival showcases cutting-edge performances in both conventional and unexpected locations around Marseille.",
                "booking_tips": "Book tickets online as soon as released, especially for headline performances. Some outdoor events in public spaces are free but may require registration."
            },
            {
                "name": "Beaches of the Corniche",
                "type": "Outdoor Activity",
                "description": "Enjoy Marseille's urban beaches along the Kennedy Corniche, from the small coves of Prophète to the popular Prado beaches with their views of the Frioul Islands and summer atmosphere.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "The beaches are supervised from June to September. Morning visits avoid the strongest midday sun and are less crowded than afternoons.",
                "booking_tips": "No booking required. The beaches closest to downtown (Catalans) get extremely crowded - head further south along the Corniche for more space."
            },
            {
                "name": "FIDMarseille International Film Festival",
                "type": "Film Festival",
                "description": "Discover cutting-edge international cinema at this prestigious documentary and experimental film festival screening over 150 films from around the world in venues throughout Marseille.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "The festival runs in early July, providing a cultural alternative to beach activities with air-conditioned screening venues offering refuge from summer heat.",
                "booking_tips": "Purchase festival passes for the best value if attending multiple screenings. Individual tickets available before screenings, but popular films sell out quickly."
            },
            {
                "name": "Bastille Day Celebrations",
                "type": "Festival",
                "description": "Experience France's national celebration with Marseille's spectacular July 14th fireworks display over the Vieux-Port, military parade, and festive atmosphere throughout the city.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "Marseille hosts one of France's largest Bastille Day fireworks displays, drawing massive crowds to the Old Port area.",
                "booking_tips": "No booking required for public celebrations. Reserve restaurant tables on the port well in advance for prime viewing. Arrive hours early to secure good viewing spots."
            },
            {
                "name": "Boat Tour of the Calanques",
                "type": "Boat Tour",
                "description": "Cruise along Marseille's stunning coastline to explore the Calanques from the water, viewing dramatic limestone cliffs, hidden beaches, and crystal-clear waters inaccessible by land.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Moderate",
                "seasonal_notes": "Summer is ideal for experiencing the turquoise waters of the Calanques, though boats can be crowded during peak season. Morning tours offer calmer water and better light.",
                "booking_tips": "Book several days in advance for standard tours departing from the Vieux-Port. For smaller boats and swimming stops, book specialized tours from Pointe Rouge or Cassis."
            },
            {
                "name": "Marseille Jazz des Cinq Continents",
                "type": "Music Festival",
                "description": "Enjoy world-class jazz performances during this international festival held in various venues, including the spectacular open-air stage at Palais Longchamp and intimate club settings throughout the city.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Moderate",
                "seasonal_notes": "This July festival brings together jazz traditions from around the world, with outdoor concerts taking advantage of Marseille's warm summer evenings.",
                "booking_tips": "Purchase tickets online well in advance for headline acts at major venues. Some free concerts and jam sessions take place in smaller venues and public spaces."
            },
            {
                "name": "Underwater Trail at Prado Beach",
                "type": "Water Activity",
                "description": "Explore Marseille's underwater world along the snorkeling trail at Prado Beach, following a marked route with informational buoys identifying Mediterranean marine life among artificial reefs.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Summer offers warm water temperatures ideal for snorkeling, with peak underwater visibility in early summer before heavy tourist use.",
                "booking_tips": "No booking required. Bring your own snorkeling equipment or rent from nearby shops. The trail is supervised during summer months from 10am-6pm."
            },
            {
                "name": "Vallon des Auffes Evening",
                "type": "Food & Drink",
                "description": "Dine in this picturesque miniature fishing port tucked under a viaduct, enjoying fresh seafood at famous restaurants like Chez Fonfon while watching fishermen mend nets in this authentic Marseille setting.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Summer evenings offer magical sunset views over this tiny harbor, though reservations are essential during this peak tourist season.",
                "booking_tips": "Book restaurants like Chez Fonfon or L'Épuisette weeks in advance for dinner. For a budget alternative, buy takeaway food and sit along the port walls."
            },
            {
                "name": "Open-Air Cinema at Mucem",
                "type": "Cinema",
                "description": "Watch films under the stars in the exceptional setting of Fort Saint-Jean's courtyard, with the Mediterranean Sea as backdrop during MuCEM's summer cinema program.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "The program typically runs Thursday evenings in July and August, featuring Mediterranean-themed films in original language with French subtitles.",
                "booking_tips": "Purchase tickets online as seating is limited. Bring a light jacket as evening sea breezes can be cool even in summer."
            }
        ]
    },
    "Autumn": {
        "activities": [
            {
                "name": "La Fête du Vent (Kite Festival)",
                "type": "Festival",
                "description": "Marvel at colorful kites of all shapes and sizes flying over Plage du Prado during Marseille's wind festival, featuring professional kite demonstrations, competitions, and workshops for all ages.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Free",
                "seasonal_notes": "Held in September, this festival takes advantage of Marseille's autumn winds with spectacular aerial displays over the Mediterranean.",
                "booking_tips": "No booking required. Participate in free kite-making workshops on site or bring your own kite to fly in designated areas away from the main performance zone."
            },
            {
                "name": "Bouillabaisse Tasting",
                "type": "Food & Drink",
                "description": "Experience Marseille's signature dish at a traditional restaurant, learning about the authentic preparation of this complex fisherman's stew that has become the city's culinary emblem.",
                "indoor": true,
                "best_time": "Lunch",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn is prime season for bouillabaisse as local fishermen catch the traditional rockfish varieties that form the base of the authentic recipe.",
                "booking_tips": "Reserve at certified establishments like Miramar or Chez Fonfon at least a week in advance. Many restaurants require ordering bouillabaisse 24 hours ahead."
            },
            {
                "name": "Hiking in Calanques National Park",
                "type": "Outdoor Activity",
                "description": "Explore the dramatic limestone cliffs and hidden coves of the Calanques during autumn when cooler temperatures make hiking more comfortable and summer fire restrictions are lifted.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Autumn offers ideal hiking conditions with fewer crowds than summer. Trails to Calanque de Sugiton, Morgiou, and Sormiou are accessible without summer restrictions.",
                "booking_tips": "No booking required, but check the park website for trail conditions. The GR98 long-distance trail offers spectacular multi-day hiking possibilities."
            },
            {
                "name": "ARTÓ - Marseille Art Fair",
                "type": "Art Exhibition",
                "description": "Discover contemporary Mediterranean art at this autumn fair showcasing galleries, artists, and collectors from around the region in exhibitions across various venues in Marseille.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "This October event highlights the city's growing importance in the contemporary art world with a focus on Mediterranean artists and themes.",
                "booking_tips": "Purchase passes online for access to all participating venues. Special evening vernissages (opening nights) require separate invitations or tickets."
            },
            {
                "name": "European Heritage Days",
                "type": "Cultural Event",
                "description": "Gain special access to historic buildings, monuments, and cultural sites not normally open to the public during this September weekend celebrating Marseille's architectural heritage.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Free",
                "seasonal_notes": "This pan-European event offers a unique opportunity to explore Marseille's hidden architectural treasures with special tours and explanations by experts.",
                "booking_tips": "No booking required for most sites, but popular guided tours may require advance registration. Check the city's cultural website for the complete program."
            },
            {
                "name": "Wine Tasting in Cassis",
                "type": "Food & Drink",
                "description": "Visit the vineyards of nearby Cassis to sample its distinctive white wines, recognized by their own AOC and produced on dramatic limestone terraces overlooking the Mediterranean.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Autumn is harvest season, offering the opportunity to see vineyards in full production and taste newly pressed juice before fermentation.",
                "booking_tips": "Book a half-day tour from Marseille or take the train/bus to Cassis and arrange visits directly with vineyards like Clos Sainte Magdeleine or Domaine du Bagnol."
            },
            {
                "name": "Provençal Cooking Workshop",
                "type": "Workshop",
                "description": "Learn to prepare seasonal Provençal dishes using autumn ingredients like wild mushrooms, squash, olives, and fresh seafood in a hands-on cooking class with local chefs.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Expensive",
                "seasonal_notes": "Autumn classes focus on heartier Provençal specialties like daube (beef stew), stuffed vegetables, and olive-based dishes using the new season's oil.",
                "booking_tips": "Book with cooking schools like Cooking by Eden or La Cuisine de Gagny at least two weeks in advance. Market visits are often included before cooking sessions."
            },
            {
                "name": "Les Rencontres d'Averroès",
                "type": "Cultural Event",
                "description": "Engage with leading thinkers, writers, and artists exploring Mediterranean cultures during this intellectual festival of debates, readings, concerts, and exhibitions throughout Marseille.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Budget",
                "seasonal_notes": "This November event creates a platform for cross-cultural dialogue with a different theme each year exploring Mediterranean heritage and contemporary issues.",
                "booking_tips": "Book tickets for specific debates and performances online. Many accompanying exhibitions and smaller events are free but may require registration."
            },
            {
                "name": "Marseille History Museum",
                "type": "Museum",
                "description": "Explore Marseille's 26-century history at this comprehensive museum built around archaeological remains of the ancient Greek port, showcasing artifacts from the city's founding to the present day.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Budget",
                "seasonal_notes": "Autumn brings new special exhibitions focused on specific aspects of Marseille's rich historical past, with fewer crowds than summer months.",
                "booking_tips": "No advance booking required. Combined tickets with other city museums offer good value. Free on the first Sunday of each month."
            }
        ]
    },
    "Winter": {
        "activities": [
            {
                "name": "Christmas Markets",
                "type": "Market",
                "description": "Experience Provençal holiday traditions at Marseille's Christmas markets, featuring artisan crafts, santons (nativity figurines), seasonal foods, and festive decorations along the Canebière and Vieux-Port.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "From late November through December, the markets create a festive atmosphere with lights, decorated chalets, and special events like children's workshops and choral performances.",
                "booking_tips": "No booking required. Evening visits offer the best atmosphere with illuminations. The Santon Fair at Cours d'Estienne d'Orves showcases Provence's unique nativity craft tradition."
            },
            {
                "name": "Candlemas at Abbaye Saint-Victor",
                "type": "Cultural Event",
                "description": "Witness Marseille's unique Candlemas celebration at the ancient Saint-Victor Abbey, with a procession carrying the Black Madonna and the blessing of navettes, boat-shaped cookies symbolic of the city's maritime heritage.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "This February 2nd celebration has been observed for centuries, connecting Marseille's religious traditions with its maritime identity.",
                "booking_tips": "No booking required for public ceremonies, but arrive early for the morning procession and mass to secure a spot. Visit local bakeries afterward to purchase traditional blessed navettes."
            },
            {
                "name": "MuCEM Winter Exhibition",
                "type": "Museum",
                "description": "Explore major thematic exhibitions at the Museum of European and Mediterranean Civilizations, housed in its striking contemporary building connected to the historic Fort Saint-Jean by footbridge.",
                "indoor": true,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter brings major exhibitions with smaller crowds than peak season. The museum's glass walls provide stunning views of the Mediterranean even in inclement weather.",
                "booking_tips": "Free on the first Sunday of each month. The museum's J4 building and Fort Saint-Jean have different opening hours - check the schedule when planning your visit."
            },
            {
                "name": "Opera at La Criée or Odéon",
                "type": "Performance",
                "description": "Attend a world-class opera, ballet, or classical music performance at one of Marseille's historic theaters during the winter cultural season.",
                "indoor": true,
                "best_time": "Evening",
                "price_range": "Expensive",
                "seasonal_notes": "Winter features the height of Marseille's performing arts season with international productions and collaborations with major European companies.",
                "booking_tips": "Book tickets online at least a month in advance for popular productions. Student and under-26 discounts are available for many performances."
            },
            {
                "name": "La Chandeleur Traditions",
                "type": "Cultural Event",
                "description": "Celebrate the traditional French crêpe holiday with a Marseille twist, enjoying special crepe menus at restaurants and learning about local Candlemas traditions tied to the city's maritime history.",
                "indoor": true,
                "best_time": "All Day",
                "price_range": "Budget",
                "seasonal_notes": "This February 2nd celebration coincides with the blessing at Saint-Victor Abbey and has unique Marseille traditions including special navette cookies.",
                "booking_tips": "No booking required to participate in public celebrations. Visit renowned patisseries like Four des Navettes, which has been making the traditional cookies since 1781."
            },
            {
                "name": "Winter Sales Shopping",
                "type": "Shopping",
                "description": "Take advantage of France's regulated winter sales season (soldes) with significant discounts at shops throughout Marseille, from Centre Bourse mall to boutiques in Rue Saint-Ferréol and Rue Paradis.",
                "indoor": true,
                "best_time": "Morning",
                "price_range": "Varies",
                "seasonal_notes": "The official winter sales run from early January to early February, with the best selection available in the first week and the deepest discounts in the final weeks.",
                "booking_tips": "No booking required. Shop early in the morning to avoid crowds, especially on the first weekend of sales. Major department stores like Galleries Lafayette offer tax refund services for non-EU visitors."
            },
            {
                "name": "Culinary Tour of Le Panier",
                "type": "Food & Drink",
                "description": "Explore Marseille's oldest neighborhood through its culinary traditions on a food-focused walking tour, sampling specialties like navettes, panisses, pastis, and North African-influenced dishes.",
                "indoor": false,
                "best_time": "Afternoon",
                "price_range": "Moderate",
                "seasonal_notes": "Winter tours focus on warming specialties and indoor tastings, with fewer tourists making for a more authentic experience in this historic district.",
                "booking_tips": "Book small group tours through specialized food tour companies or the tourist office. Private tours can be customized to specific interests like pastry or wine."
            },
            {
                "name": "Sunday Fish Market at Vieux-Port",
                "type": "Market",
                "description": "Experience Marseille's traditional fresh fish market where local fishermen sell their catch directly from boats along the Quai des Belges, connecting with the city's ancient maritime traditions.",
                "indoor": false,
                "best_time": "Morning",
                "price_range": "Free",
                "seasonal_notes": "Winter brings different seasonal catches than summer months. The market operates daily but is especially atmospheric on Sunday mornings.",
                "booking_tips": "No booking required. Arrive before 9am for the best selection. Even if not buying fish, the colorful scene and opportunity to see local culture makes this a must-visit experience."
            },
            {
                "name": "New Year's Eve at Vieux-Port",
                "type": "Festival",
                "description": "Join thousands of locals and visitors for Marseille's New Year's Eve celebrations centered around the Old Port, with midnight fireworks reflecting in the harbor waters, music, and festive atmosphere.",
                "indoor": false,
                "best_time": "Evening",
                "price_range": "Free",
                "seasonal_notes": "December 31st celebrations include special menus at restaurants around the port, public concerts, and the traditional midnight fireworks display.",
                "booking_tips": "Reserve restaurant tables months in advance for New Year's Eve dinner. For the public celebration, arrive early to secure viewing spots along the port perimeter."
            }
        ]
    }
}