{
    "March": {
        "reasons_to_visit": [
            {
                "reason": "Shoulder Season Value & Fewer Crowds",
                "details": "March remains low season in Turku (outside potential Easter). Enjoy lower prices and explore Turku Castle, Aboa Vetus & Ars Nova, and other museums without queues."
            },
            {
                "reason": "Increasing Daylight & Glimmers of Spring",
                "details": "Daylight hours increase significantly throughout March, bringing a more optimistic feel. Snow often starts melting, especially later in the month, though it's often messy."
            },
            {
                "reason": "Focus on Indoor Culture & Cozy Cafes",
                "details": "Ideal weather for exploring Turku's excellent indoor attractions: Turku Castle, Turku Cathedral, Aboa Vetus & Ars Nova, Turku Art Museum, Market Hall. Warm up in cozy riverside cafes."
            },
            {
                "reason": "Sauna Season Continues",
                "details": "A perfect time to embrace Finnish sauna culture. Seek out hotel saunas or local public options (if available) for a warming contrast to the cold."
            },
            {
                "reason": "Last Chance for Potential Frozen River/Sea Views",
                "details": "Early March might still offer views of the frozen Aura River or nearby sea ice (walking on it requires extreme caution & safety checks)."
            },
            {
                "reason": "Waffle Day (Vohvelipäivä)",
                "details": "Celebrate Waffle Day on March 25th by enjoying sweet or savory waffles available in many Turku cafes."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Cold, Wet, Icy & Unpredictable Weather",
                "details": "March is a transition month. Expect cold temperatures (avg highs 2-4°C/36-39°F), snow (early month), rain, sleet, and wind. Freeze-thaw cycles are peak."
            },
            {
                "reason": "Extreme Ice Hazard ('Kelirikko')",
                "details": "Melting and refreezing make sidewalks and streets dangerously icy. High-quality waterproof boots with excellent grip and/or ice cleats ('liukuesteet') are absolutely crucial."
            },
            {
                "reason": "Limited Outdoor & Archipelago Activities",
                "details": "Sea ice breaking up restricts archipelago access. Parks (like Kupittaa) can be very slushy, icy, or muddy. Outdoor activities are limited."
            },
            {
                "reason": "Requires Waterproof Winter/Shoulder Gear",
                "details": "Warm, waterproof layers are essential: thermals, fleece/wool, insulated waterproof coat, hat, gloves, scarf. Waterproof boots with superior ice grip are paramount."
            },
            {
                "reason": "Easter Holiday Closures (If Applicable)",
                "details": "Check dates! If Easter falls in late March, expect widespread closures (shops, Alko, some museums/restaurants) on Good Friday, Easter Sunday & Monday."
            },
            {
                "reason": "Slush & Mud Season ('Kurakelit')",
                "details": "Melting snow creates wet, slushy, and muddy conditions ('kurakelit'). Waterproof footwear is essential for navigating the city."
            }
        ],
        "first_half": {
            "date_range": "March 1–15",
            "weather": {
                "average_temperature": {
                    "high": "2°C (36°F)",
                    "low": "-4°C (25°F)"
                },
                "precipitation": "Still feels like late winter. Snow likely, but rain/sleet possible. Ice is a major hazard. Daylight increases noticeably.",
                "general_tips": "Full winter gear needed. Focus on waterproof boots with excellent grip; ice cleats highly recommended. Layering is key."
            },
            "tourism_level": {
                "crowds": "Low season. Museums and attractions are quiet.",
                "pricing": "Good value generally available for flights and accommodation.",
                "overall_atmosphere": "Late winter feel. Potential for sunny cold days or more snow. Emphasis on indoor activities and enjoying the increasing light. Last chance for dramatic frozen river views (from safe distance)."
            },
            "events_holidays": [
                {
                    "name": "Possible End of Outdoor Ice Rink Season (Parkin kenttä)",
                    "date": "Early/Mid March",
                    "description": "The artificial ice rink in Kupittaa Park usually closes sometime in March, weather permitting.",
                    "notes": "Check City of Turku sports services for exact closing date."
                }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Turku Castle & Cathedral",
                    "where": "Near harbour (Castle), City Centre (Cathedral)",
                    "description": "Visit Turku's main historical landmarks in quiet low season. Ideal indoor exploration for unpredictable weather.",
                    "practical_tips": "Allow several hours for Castle. Check opening times.",
                    "best_time": "Daytime",
                    "estimated_cost": "Moderate (Castle entry), Free (Cathedral entry)",
                    "weather_dependent": false
                },
                {
                    "activity": "Visit Aboa Vetus & Ars Nova",
                    "where": "City Centre, by the river",
                    "description": "Discover medieval Turku ruins underground combined with contemporary art. A fascinating and warm indoor activity.",
                    "practical_tips": "Check opening hours.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                },
                {
                    "activity": "Enjoy a Cozy Riverside Cafe",
                    "where": "Cafes along the Aura River",
                    "description": "Warm up with coffee, tea, or hot chocolate and Finnish pastries while enjoying views of the possibly icy Aura River.",
                    "practical_tips": "Perfect way to spend a cold afternoon and watch the changing light.",
                    "best_time": "Afternoon",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": false
                },
                 {
                    "activity": "Experience a Local Sauna",
                    "where": "Hotel saunas, check for public options",
                    "description": "Embrace the Finnish tradition and warm up thoroughly in a sauna.",
                    "practical_tips": "Check hotel facilities or research local public sauna options and opening times.",
                    "best_time": "Afternoon / Evening",
                    "estimated_cost": "Variable (Free in hotels, Moderate for public)",
                    "weather_dependent": false
                }
            ]
        },
        "second_half": {
            "date_range": "March 16–31",
            "weather": {
                "average_temperature": {
                    "high": "4°C (39°F)",
                    "low": "-1°C (30°F)"
                },
                "precipitation": "Messy transition ('kurakelit'). Mix of snow, sleet, rain common. Freeze-thaw cycles peak, extreme ice hazard. Daylight increases significantly.",
                "general_tips": "Waterproof boots with excellent grip are non-negotiable. Ice cleats remain essential. Waterproof outer layers critical. Prepare for wet and slushy streets."
            },
            "tourism_level": {
                "crowds": "Still generally low, but potential increase if Easter falls late March.",
                "pricing": "Shoulder season value, but check for price spikes around Easter if applicable.",
                "overall_atmosphere": "Signs of spring emerging amidst messy melt. Brighter, longer days are noticeable. Indoor focus remains key due to weather/conditions."
            },
            "events_holidays": [
                 {
                    "name": "Waffle Day (Vohvelipäivä)",
                    "date": "March 25",
                    "description": "Enjoy sweet or savory waffles at cafes around Turku.",
                    "notes": "Look for waffle specials in local cafes."
                 },
                 {
                    "name": "Easter Weekend (Pääsiäinen) (Potential - Check Dates)",
                    "date": "Varies (can fall late March)",
                    "description": "Major holiday period. Good Friday, Easter Sunday & Monday are public holidays.",
                    "notes": "Verify exact dates. Expect widespread closures (shops, Alko, banks, some museums/restaurants). Plan meals and activities ahead. Public transport follows holiday schedule."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Celebrate Waffle Day in Turku",
                    "where": "Cafes throughout Turku",
                    "description": "Find a cozy spot and enjoy waffles on March 25th, a fun local tradition.",
                    "practical_tips": "Many cafes will participate; check favorites like MBakery or Cafe Art.",
                    "best_time": "Afternoon on March 25th",
                    "estimated_cost": "Low-Moderate",
                    "weather_dependent": false
                },
                {
                    "activity": "Explore the Turku Market Hall (Kauppahalli)",
                    "where": "City Centre",
                    "description": "Wander through the historic indoor market hall, browsing local produce, meats, cheeses, and enjoying lunch or coffee at one of the stalls.",
                    "practical_tips": "Great indoor refuge. Check opening hours (Mon-Sat, closes early afternoon).",
                    "best_time": "Lunchtime",
                    "estimated_cost": "Free (to browse), Low-Moderate (food/purchases)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Visit Turku Art Museum",
                    "where": "Puolalanmäki hill",
                    "description": "Explore Finnish and international art collections inside a beautiful granite building.",
                    "practical_tips": "Check opening hours, especially around Easter if applicable. Be careful on potentially icy paths up the hill.",
                    "best_time": "During opening hours",
                    "estimated_cost": "Moderate (entry fee)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Careful Walk Along the River Aura",
                    "where": "Riverbanks",
                    "description": "If paths are somewhat clear (can be very icy/slushy!), enjoy the increasing daylight with a walk along the river, observing signs of spring or melting ice.",
                    "practical_tips": "Essential: Waterproof boots with best possible grip/ice cleats. Stick to main paths. Enjoy the brighter evenings.",
                    "best_time": "Daytime on a relatively dry/clear day",
                    "estimated_cost": "Free",
                    "weather_dependent": true
                 }
            ]
        }
    }
}