{
    "May": {
        "reasons_to_visit": [
            {
                "reason": "Vibrant Vappu (May Day) in a Student City",
                "details": "Experience Turku's particularly lively Vappu celebrations (April 30th eve & May 1st), fueled by its large student population. Witness the Lilja statue capping and enjoy picnics on Vartiovuori hill."
            },
            {
                "reason": "True Spring Arrival & Riverside Blooms",
                "details": "May transforms Turku (average highs ~16°C/61°F). Parks like Kupittaa turn lush green, flowers bloom along the Aura River banks, and daylight rapidly increases."
            },
            {
                "reason": "Riverboat Restaurants & Terraces Open",
                "details": "The iconic riverboats ('jokilaivat') open their decks, and riverside cafes set up bustling outdoor terraces ('terassit'), becoming the heart of city life."
            },
            {
                "reason": "Archipelago Awakes",
                "details": "Water bus (Föli) services and ferries to Ruissalo, Vepsä, and the wider archipelago start or increase, making island exploration feasible."
            },
            {
                "reason": "Shoulder Season Value (Post-Vappu)",
                "details": "Outside the hectic Vappu period, May provides pleasant weather for exploring the Castle, Cathedral, and museums with fewer crowds than peak summer."
            },
            {
                "reason": "Great for Cycling & Walking",
                "details": "Improving weather and very long days make May perfect for exploring Turku's relatively flat city center, riverbanks, and paths out to Ruissalo by bike or on foot."
            }
        ],
        "reasons_to_reconsider": [
            {
                "reason": "Vappu Crowds, Closures & Peak Prices",
                "details": "Vappu (Apr 30th eve & May 1st) brings huge crowds, especially students, to the city center and Vartiovuori. Accommodation prices peak; many shops/services close May 1st."
            },
            {
                "reason": "Unpredictable Spring Weather",
                "details": "May weather can be highly variable. Expect sunshine but also potential for cold spells, rain, and wind. Pack versatile layers."
            },
            {
                "reason": "May 1st (Vappu) Holiday Closures",
                "details": "May 1st is a major public holiday. Expect widespread closures (shops, Alko, banks, many museums). Public transport operates on Sunday schedules."
            },
            {
                "reason": "Ascension Day Holiday (Potential Closures)",
                "details": "Ascension Day (Helatorstai, date varies) is a public holiday often in May, creating a long weekend and causing shop closures."
            },
            {
                "reason": "Pollen Season Intensifies",
                "details": "Birch and other tree pollen levels often peak in May, potentially causing significant discomfort for allergy sufferers."
            },
            {
                "reason": "Sea Remains Cold",
                "details": "Despite warmer air, the Baltic Sea in the archipelago is still very cold for swimming."
            }
        ],
        "first_half": {
            "date_range": "May 1–15",
            "weather": {
                "average_temperature": {
                    "high": "15°C (59°F)",
                    "low": "4°C (39°F)"
                },
                "precipitation": "Variable spring conditions: sunny spells mixed with clouds and showers. Nights can remain cool. Daylight hours increasing rapidly.",
                "general_tips": "Layering is essential: T-shirts, sweaters/fleece, waterproof/windproof jacket. Comfortable shoes. Sunglasses. Allergy medication if sensitive. Plan well for Vappu crowds/closures."
            },
            "tourism_level": {
                "crowds": "Extremely high density around April 30th/May 1st due to Vappu. Moderate afterwards, gradually increasing. Shoulder season feel post-Vappu.",
                "pricing": "Peak prices for Vappu weekend (book far ahead). Shoulder/High season prices otherwise.",
                "overall_atmosphere": "Dominated by student-centric Vappu early May. Afterwards, a city bursting with spring green, lively riverbanks, and anticipation for summer."
            },
            "events_holidays": [
                {
                    "name": "Vappu Eve (Vappuaatto)",
                    "date": "April 30th Evening",
                    "description": "Student celebrations culminate with the capping of the Lilja statue near the Art Museum. Massive crowds gather on the hill and surrounding streets.",
                    "notes": "City center very crowded, especially near Art Museum Hill/Puolalanmäki. Festive, student-driven atmosphere."
                },
                {
                    "name": "Vappu / May Day (Vappupäivä)",
                    "date": "May 1",
                    "description": "Public holiday. Traditional picnic day, particularly on Vartiovuori hill. Political events also occur.",
                    "notes": "Widespread closures. Sunday transport schedule. Vartiovuori park gets very crowded for picnics."
                },
                {
                    "name": "Mother's Day (Äitienpäivä)",
                    "date": "Second Sunday in May",
                    "description": "Family celebration day. Restaurants often busy with special brunches/lunches.",
                    "notes": "Book restaurants well in advance for Mother's Day meals."
                },
                 {
                    "name": "Ascension Day (Helatorstai) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often early/mid May)",
                    "description": "Public holiday.",
                    "notes": "Check date. Widespread shop closures."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Experience Turku Vappu",
                    "where": "Art Museum Hill/Puolalanmäki (Apr 30), Vartiovuori Hill (May 1)",
                    "description": "Witness Turku's unique student traditions: the Lilja statue capping (often via crane!), the massive picnics, and the general carnival atmosphere fueled by students.",
                    "practical_tips": "Expect huge, potentially rowdy crowds near student events. Vartiovuori picnic is the main May 1st public gathering. Prepare for closures.",
                    "best_time": "April 30th evening & May 1st daytime",
                    "estimated_cost": "Free (observing), Low-Moderate (food/drinks)",
                    "weather_dependent": true
                },
                {
                    "activity": "Walk Along the Blooming Aura River",
                    "where": "Riverbanks in the city center",
                    "description": "Enjoy the spring blooms in the riverside parks and plantings as the city turns green. Admire the historic ships and opening terraces.",
                    "practical_tips": "Pleasant and easy walk on both sides of the river. Stop at cafes along the way.",
                    "best_time": "Daytime",
                    "estimated_cost": "Free (walking), Low-Moderate (cafes)",
                    "weather_dependent": false
                },
                 {
                    "activity": "Explore Turku Castle & Cathedral",
                    "where": "Castle near harbour, Cathedral in center",
                    "description": "Visit Turku's key historical sites as spring arrives, enjoying them before the main summer rush.",
                    "practical_tips": "Check opening hours, especially around May 1st. Wear comfortable shoes.",
                    "best_time": "Daytime (avoid May 1st)",
                    "estimated_cost": "Moderate (Castle entry), Free (Cathedral entry)",
                    "weather_dependent": false
                 },
                {
                    "activity": "First Riverboat Drink/Meal of the Season",
                    "where": "Restaurant boats ('jokilaivat') along Aura River",
                    "description": "Be among the first to enjoy the unique atmosphere of having drinks or food on one of the iconic restaurant boats as they open for the season.",
                    "practical_tips": "Check which boats have opened (usually happens throughout May). Can be popular on sunny days.",
                    "best_time": "Afternoon/Evening on a pleasant day",
                    "estimated_cost": "Moderate to High",
                    "weather_dependent": true
                }
            ]
        },
        "second_half": {
            "date_range": "May 16–31",
            "weather": {
                "average_temperature": {
                    "high": "17°C (63°F)",
                    "low": "7°C (45°F)"
                },
                "precipitation": "Often brings more settled and pleasant spring weather, but variability remains. Good chance of sunshine. Very long daylight hours.",
                "general_tips": "Continue layering, but lighter spring clothing becomes more feasible. Waterproof jacket still recommended. Sunscreen useful."
            },
            "tourism_level": {
                "crowds": "High season is building. Busier than early May (post-Vappu), but not yet peak July levels. Good time to visit before maximum crowds.",
                "pricing": "High season prices are standard. Book popular activities/tours.",
                "overall_atmosphere": "Beautiful late spring. City is green and vibrant. Long evenings perfect for exploring the riverfront and nearby nature."
            },
            "events_holidays": [
                 {
                    "name": "Neitsytperunafestivaali (New Potato Festival - Potential Start)",
                    "date": "Usually starts late May / early June",
                    "description": "Celebration of the first new potatoes of the season, often involving restaurants featuring special potato dishes and events at the Market Square.",
                    "notes": "Check exact dates. Highlights local produce."
                 },
                 {
                    "name": "Ascension Day (Helatorstai) (If applicable)",
                    "date": "Varies (Thursday, 40 days after Easter - often mid/late May)",
                    "description": "Public holiday.",
                    "notes": "Verify date. Widespread shop closures."
                 }
            ],
            "unique_experiences": [
                {
                    "activity": "Explore Ruissalo Island",
                    "where": "Accessible by bus (8), bike, water bus (Föli)",
                    "description": "Visit the beautiful island known for its oak forests, beaches (Saaronniemi), Botanical Garden, and historic villas as nature fully awakens.",
                    "practical_tips": "Water bus offers scenic route. Great for walking, cycling, picnics. Check Botanical Garden opening times.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (transport) to Moderate (Bot. Garden entry)",
                    "weather_dependent": true
                },
                {
                    "activity": "Day Trip to Naantali",
                    "where": "Short bus ride from Turku",
                    "description": "Visit the charming neighboring town with its picturesque wooden old town, harbor, and the Kultaranta presidential summer residence gardens (check access). Moominworld usually opens later.",
                    "practical_tips": "Take Föli bus. Easy day trip. Old town is perfect for strolling. Check Kultaranta garden access rules/times.",
                    "best_time": "Daytime",
                    "estimated_cost": "Low (bus fare) to Moderate (food/shopping)",
                    "weather_dependent": true
                },
                 {
                    "activity": "Visit Turku Market Hall (Kauppahalli)",
                    "where": "City Centre",
                    "description": "Explore the historic indoor market. Browse local delicacies, cheeses, meats, fish, and enjoy lunch or coffee at one of the atmospheric stalls.",
                    "practical_tips": "Good spot for lunch or picking up local food products. Closes early afternoon (Mon-Sat).",
                    "best_time": "Lunchtime",
                    "estimated_cost": "Free (browse), Low-Moderate (food/purchases)",
                    "weather_dependent": false
                 },
                 {
                    "activity": "Cycle the Aura River Route",
                    "where": "Paths along both sides of the Aura River",
                    "description": "Rent a bike (like Föli city bikes) and enjoy a leisurely cycle along the river, passing parks, cafes, bridges, and historical sites.",
                    "practical_tips": "Mostly flat and easy route. Extend towards the harbour or inland. City bikes are convenient.",
                    "best_time": "Daytime or early evening",
                    "estimated_cost": "Low (bike rental)",
                    "weather_dependent": true
                 }
            ]
        }
    }
}